{"name": "creating a good analytics report ", "full_name": " h1 1 Lead with the insights h4 Put your bottom line up front Lead with the best insight from your analysis h3 Summary h1 2 Find a question that s worth answering h1 3 Spend time on your visualizations h1 4 Make your notebook easy to read h1 5 Don t forget the stated criteria h1 6 Examples and Closing ", "stargazers_count": 0, "forks_count": 0, "description": "com jpmiller nfl punt analytics data https www. Defenseless players as described by NFL rules include players receiving a blindside block from a blocker whose path is toward or parallel his own end line. For example be sure to have a section on pros and cons of your approach. Then explain the details and show them how you got there. It s great to see Kagglers contributing this way to fight the advance of Covid 19. com tombresee next gen eda notebok for the recent NFL Databowl competition. com philippsinger nfl playing surface analytics the zoo https www. The last thing you probably want to do is hide it. Sometimes that s useful but not so much here Your audience consists of people looking for vital information in a limited amount of time. After fair catch of a scrimmage kick play would start 10 yards forward from the spot of catch or the succeeding spot after eforcement of penalties. A bar chart with mostly gray bars and one bar highlighted in color is a great way to focus attention. It uses a super clean layout with great use of color. Make your notebook easy to read. Find a question that s worth answering. Spend time on your visualizations. Kaggle makes it easy with the hide input option. It s really more about what ideas can be used by the host to further their goals. Along those lines please don t use default seaborn bar charts with the rainbow of colors. Here an example from Tom Bresee s Next Gen EDA https www. Too much color can be worse than no color. The sections on readable and stylish have great info. My opinions come from experience being both the person reading reports and the person making reports and the person getting told to revise and resubmit his report. In case you read no further I offer this idea as the one thing to make your report more impactful Put your bottom line up front. The figure below shows the potential reduction in concussions based on 2016 2017 data and associated assumptions. Notice how I numbered my major headers for the notebook That s one way to help keep your place as you scroll through. UPDATE Other issues have risen in visibility as things progess How did governemnts react and what has been the correlation of these reactions with the infection rate As countries restore freedom of movement after an outbreak what happens in terms of infection rates 3. Examples and Closing. Some ideas off the top of my head relevant to the US as that s where my experience is based How has media s influence on public perception changed relative to the days of newspapers and broadcast TV What will be the long term effects of the outbreak on the wealth gap in developed countries How does a nation s health care structure influence the short and long term effects of disease outbreaks Another avenue may be to research two or more distinct areas and show how they complement one another. com gaborfodor summary budapest pythons https www. They ll be reading through a stack of reports looking for something that seems useful. Another thing you might consider is to hide your code. Markdown is great for convenience and it s also flexible if you apply HTML tags. Penalize blindside blocks with forcible contact to any part of a defenseless player s body. This point is important and not natural for scientists. Here s an example of code for custom HTML to make section headers and structure that stand out. Make your code easy to read. My perception is that the grading criteria were not strictly followed in previous analytics challenges. com erikbruin recommendations to passnyc 1st place solutionI hope these ideas are helpful and add to the quality of everyone s reports. The two proposed changes are as follows Move the ball forward 10 yards after a Fair Catch. One possiblity is that within an area of interest find where the research intersects with what everyone is talking about. Here are some other things you can try. Lead with the best insight from your analysis. The art and science of visualization has become a field of study on it s own with many many things to learn. So it s best to start with your conclusion get the reader s interest and give them a frame of reference from which to hang supporting information. But you still will need to be creative to find the best topics. Sometimes it can be hard to know where to focus. com rtatman six steps to more professional data science code. That might not sound right at first but your chart should reinforce a point and it s ok to put that point front and center on the page. Color is one of the preattentive attributes that people pick up on right away. Here are some good report style notebooks from past analytics challenges IMO https www. That s not so much the case here with the sponsors giving us an extensive list and subtopics to explore. There s an explicit request to do that for this challenge. Don t forget the stated criteria. Here s the beginning of my report from the 2019 NFL Punt Analytics challenge Summary This report represents my analysis for the NFL Punt Analytics Competition. Of course this notebook represents a single point of view and you are probably best served by gathering many perspectives of what good looks like. Your audience should understand what they re looking at within a few seconds. After they ve followed along we present our conclusions. I thought it might be helpful to share some thoughts on what makes a good report for this type of thing. Prohibited contact for punt plays would include blindside blocks with forcible contact to any part of a defenseless player s body including below the neck. Normally code is what we re all about and we re asked to have readable code. Tell the reader what to think. This would apply when the receiving team elects to put the ball in play by a snap. We like to take the audience through our line of reasoning with open minds supported by data and charts with a bit of explanation. You can see there s minimal setup and then we get right to the point For the case at hand you might consider starting right away with your take on the existing research based on data of course. Use color to reinforce your message. You can use html tags and hierarchy to organize your notebook. One of the best resources I ve found is this notebook Six steps to more professional data science code https www. It is my opinion that based on the data provided changing two rules for punt plays could result in up to 8 fewer concussions per year. Once you pass that first lookover you can expect someone will dig into your code. You will need to meet the minimum bar however to be considered for selection. For now here are some things you can consider to help your visualizations reinforce your message. But some of your readers don t code and even if they do it s more important for them to first get the overall story if they re so inclined. I find it much more effective than a regular old bar chart. Lead with the insights. ", "id": "jpmiller/creating-a-good-analytics-report", "size": "7463", "language": "python", "html_url": "https://www.kaggle.com/code/jpmiller/creating-a-good-analytics-report", "git_url": "https://www.kaggle.com/code/jpmiller/creating-a-good-analytics-report", "script": "", "entities": "(('we', 'conclusions'), 'present') (('really ideas', 'goals'), 's') (('report', 'front'), 'offer') (('art', 'many many things'), 'become') (('You', 'however selection'), 'need') (('so much here audience', 'time'), 's') (('It', 'color'), 'use') (('you', 'still best topics'), 'need') (('you', 'probably it'), 'be') (('This', 'snap'), 'apply') (('It', 'year'), 'be') (('report style Here good notebooks', 'IMO https www'), 'be') (('you', 'code'), 'be') (('all we', 'readable code'), 'be') (('kick play', 'penalties'), 'start') (('You', 'notebook'), 'use') (('Prohibited contact', 'neck'), 'include') (('two proposed changes', 'Fair forward 10 yards Catch'), 'be') (('what', 'thing'), 'think') (('grading criteria', 'analytics strictly previous challenges'), 'be') (('it', 'hide input option'), 'make') (('you', 'one place'), 'notice') (('bar chart', 'great attention'), 'be') (('sections', 'great info'), 'have') (('also you', 'HTML tags'), 'be') (('I', 'data science code https Six more professional www'), 'be') (('how you', 'them'), 'explain') (('they', 'a few seconds'), 'understand') (('that', 'section headers'), 's') (('that', 'something'), 'read') (('you', 'course'), 'see') (('they', 'first overall story'), 'don') (('point', 'scientists'), 'be') (('someone', 'code'), 'expect') (('figure', '2017 data'), 'show') (('so much here sponsors', 'extensive list'), 's') (('person', 'report'), 'come') (('So it', 'supporting information'), 's') (('what', 'infection rates'), 'UPDATE') (('people', 'that'), 'be') (('Kagglers', 'Covid'), 's') (('everyone', 'what'), 'be') (('report', 'NFL Punt Analytics Competition'), 's') (('path', 'end own line'), 'include') (('it', 'page'), 'sound') (('visualizations', 'message'), 'be') (('it', 'bar much more regular old chart'), 'find') (('Too much color', 'color'), 'be') (('how they', 'one'), 'idea') (('ideas', 'reports'), 'recommendation') (('We', 'explanation'), 'like') (('you', 'good'), 'represent') ", "extra": "['disease']"}