{"name": "aptos2019 image super resolution ", "full_name": " h1 APTOS 2019 Image Super Resolution h2 What is exactly Image Super Resolution project h1 2019 Competition Image h1 2015 Competition Image h1 Install ISR h1 Conclusions ", "stargazers_count": 0, "forks_count": 0, "description": "xD libraries Firstly We are going so resize the images to Low Resolution. This project contains Keras implementations of different Residual Dense Networks for Single Image Super Resolution ISR as well as scripts to train these networks using content and adversarial loss components. Let s say 200x200 Then we apply ISR and see the results I m going to take just 2 images new and old competition and work on them import model This is to compare to the images created with ISR so we can better see differences. If you wish to contribute please see the Contribute section. Arch https idealo. com cfrancesco Zubin John github valiantone https github. io image super resolution figures butterfly. com idealo image super resolution project 3. io image super resolution figures RRDN. Also we provide scripts to facilitate training on the cloud with AWS and nvidia docker with only a few commands. com idealo image super resolution One of my first thoughts in this competition was to undertand the quality of the given images. APTOS 2019 Image Super Resolution https github. Increase their resolution with Image Super Resolution ISR https github. 2018 A multi output version of the Keras VGG19 network for deep features extraction used in the perceptual loss A custom discriminator network based on the one described in Photo Realistic Single Image Super Resolution Using a Generative Adversarial Network https arxiv. My first aim with this kernel was to improve images quality to make better prediction but after a few days I realized that I couldn t take much advantage as predictive power from this process. 04802 SRGANS Ledig et al. He and his team realized this amazing open source project that can be applied to many domains Here is the full team Francesco Cardinale github cfrancesco https github. png From their website The goal of this project is to upscale and improve the quality of low resolution images. Compare the results with the original ones What is exactly Image Super Resolution project ISR Image https idealo. Docker scripts and Google Colab notebooks are available to carry training and prediction. com datitran 2019 Competition Image 2015 Competition Image Install ISR ConclusionsWe can easily notice the differences between the processed images and the resized ones. The implemented networks include The super scaling Residual Dense Network described in Residual Dense Network for Image Super Resolution https arxiv. We welcome any kind of contribution. That s because the images resolution is already pretty high and when we process them we usually reduce it around 256x256. 6 and is distributed under the Apache 2. Start from a low resolution images 2. So that s the goal of this kernel _Improving Diabetic Retinopathy images using free and open source tools _The process will be 1. jpg _NOTE _I Discovered this project following Dat Tran https www. 2018 The super scaling Residual in Residual Dense Network described in ESRGAN Enhanced Super Resolution Generative Adversarial Networks https arxiv. For instance the outlines and veins details improved significantly What do you think Could it be useful for hospitals and labs to save in super expensive machinery I would love to discuss further in comments If you enjoyed the kernel please consider upvoting it. However I guess many laboratories can t have the same tools and most probably there are many hospitals around the world that can t afford taking those high quality images. ISR is compatible with Python 3. com in dat tran a1602320 on LinkedIn you can always learn from his posts. com valiantone Dat Tran github datitran https github. 2017 Read the full documentation at https idealo. io image super resolution. ", "id": "raimonds1993/aptos2019-image-super-resolution", "size": "3703", "language": "python", "html_url": "https://www.kaggle.com/code/raimonds1993/aptos2019-image-super-resolution", "git_url": "https://www.kaggle.com/code/raimonds1993/aptos2019-image-super-resolution", "script": "numpy matplotlib.pyplot Image ISR.models pandas RDN PIL ", "entities": "(('One', 'given images'), 'be') (('you', 'Contribute section'), 'see') (('Docker scripts', 'Google training'), 'be') (('we', '256x256'), 's') (('goal', 'resolution low images'), 'be') (('you', 'it'), 'improve') (('jpg _ NOTE I', 'Dat Tran https www'), '_') (('2018 super scaling Residual', 'ESRGAN Enhanced Super Resolution Generative Adversarial Networks https arxiv'), 'describe') (('we', 'better differences'), 'let') (('xD Firstly We', 'Low Resolution'), 'library') (('com Competition Image Install ISR 2019 Competition Image 2015 ConclusionsWe', 'processed images'), 'datitran') (('you', 'always posts'), 'com') (('process', '_ Improving Diabetic Retinopathy source tools free _'), 's') (('t', 'quality high images'), 'guess') (('com valiantone Dat Tran', 'datitran https github'), 'github') (('What', 'original ones'), 'compare') (('project', 'content'), 'contain') (('Also we', 'only a few commands'), 'provide') (('I', 'process'), 'be') (('Francesco Here full Cardinale', 'many domains'), 'realize') (('implemented networks', 'Image Super Resolution https arxiv'), 'include') (('com Zubin John', 'valiantone https github'), 'cfrancesco') ", "extra": ""}