{"name": "eda about u in ", "full_name": " h1 This EDA specializes in u in h1 TL DR h1 Import h1 Functions h1 Load CSV h1 Add features h1 Overview h1 u in End point value EDA h1 Other than the Main mode u in ends 5 0 5 4 h1 The Main mode u in ends 4 8 5 0 h1 Other than the Main mode u in ends 2 1 4 8 h1 Other than the Main mode u in ends 1 75 2 1 h1 Other than the Main mode u in ends 0 75 1 75 h1 Other than the Main mode 0 0 0 75 h1 Other than the Main mode 0 0 only h1 u in start point value EDA h1 EDA with u in starting point value of 100 h1 The Main mode h1 Main mode with 100 at the beginning h1 The starting point value is 100 and other than main mode h1 The starting point value is 0 u in EDA h1 Let s calculate the area from u in h1 Check the area of the point where u out rises ", "stargazers_count": 0, "forks_count": 0, "description": "So far only in the Main mode there are some time_steps that are severely broken. Let s divide it into this zone. The starting point value is 100 and other than main modeThere are only 23 graphs other than the main mode where u_in starts with 100 and they have the same graph shape. I was multiplying by time_step which means real time in this competition instead of time_delta. 5 seconds it starts up with the same shape and the final value is 4. Chart Plot referred to Ventilator Pressure Prediction EDA FE and models https www. 5 seconds and ends near 5 4. The next most common is u_in which starts from 100. 75 R_C is only 50_10. original 12 8 0. u_in End point value EDAApproximately 70 000 u_ins end in 5 hits. Main mode with 100 at the beginningThe main mode which starts with 100 seems to have a vibrating graph a slide like descending graph and a combination graph. DataFrame columns id breath_id R C time_step u_in u_out pressure R_C time_delta delta area for i in tqdm bid_list breath_one train train breath_id i. reset_index drop True tmp_df breath_one breath_one u_out 1. It seems that the ratio of 50_10 is high except for 4. com currypurin ventilator pressure simple eda. u_in start point value EDA EDA with u_in starting point value of 100Most seem to be the main mode but there seem to be other modes as well. This EDA specializes in u_in Note I made a mistake in calculating the area of u_in and time_delta. The Main mode u_in ends 4. If you expand it there is only one data for 5 or more. It seems that there are many graphs where 1. Further close up around 5. R_C is also only 50_10. 0 is the final value of u_in main mode. 5 is 0 and it starts from 1. Other than the Main mode u_in ends 1. The starting point value is 0 u_in EDAThis also seems to have a main mode and other modes. com marutama eda about time step and u out. head 1 df df. 1 is the main mode and there are many. This notebook is a continuation of EDA about time_step and u_out https www. The Main modeThere are 70018 main modes. The R_C distribution clearly has a decrease of 50_10 compared to the overall distribution. The R_C distribution is also biased. u_in has a main mode that accounts for 70018 75450 92. The u_in graph seems to have a vibration shape and a hilly shape. 0 only R_C is only 50_10. The u_in graph looks like a vibrating shape in much the same way. com marutama eda about lstm feature importance And finetune of Tensorflow Bi LSTM EDA about https www. TL DR About half of u_in starts at 0. The u_in graph also looks like it has returned to its vibrating shape. 5 and gradually becomes about 5 at the end. If you find it useful please upvote it as well. Let s increase bins and expand. 0 there are three peaks in the final u_in value in main mode which is between 4. com marutama finetune of tensorflow bi lstm eda about is for Modeling. Other than the Main mode u_in ends 2. Let s calculate the area from u_inspeed up for area calculation Check the area of the point where u_out risesspeed up versionThe pressure correlates with Area the sum of the products of u_in and time_step up to that point and R_C. com artgor ventilator pressure prediction eda fe and models. If you plot only 1000 pieces you can see the graph shape between 0 seconds and 1 second like a pattern. Import Functions Load CSV Add featuresPlot the u_in chart for the first 3 OverviewCombination distribution of R and CI will stack the first 1000 pieces and plotLet s expand the y axis further. 0より大きく1以下 を実現したいので この不等号の形 最大3個 個別表示 ０のみ u_in last Main mode time u_out1_timing generate empty df df pd. append tmp_df u_out1_timing speed up 高速版 uout1_df 作成. Other than the Main mode 0. Use a set operation to separate the other modes. Other than the Main mode u_in ends 0. Is the vibration shape of the u_in graph increasing again Other than the Main mode 0. All R_Cs other than the main mode are 50_10. Graphs with u_in starting at 0 excluding the main mode are unique and have a distinctly different shape from other graphs. For the R_C distribution part I referred to Ventilator Pressure simple EDA https www. Other than the Main mode u_in ends 5. It s 70018 75450 92. Let s call this graph the main mode of u_in. The u_in graph seems to have more hill shapes than vibration shapes. The importance of the features introduced in the EDA about series below EDA about LSTM Feature Importance https www. The pressure correlates with Area the sum of the products of u_in and time_step up to that point and R_C. ", "id": "marutama/eda-about-u-in", "size": "4591", "language": "python", "html_url": "https://www.kaggle.com/code/marutama/eda-about-u-in", "git_url": "https://www.kaggle.com/code/marutama/eda-about-u-in", "script": "plot_uin_stats plot_bid seaborn numpy matplotlib.pyplot tqdm.auto plot_uin_list pandas plot_double_bid plot_uin tqdm df_from_to plot_time_step ", "entities": "(('u_in', '100Most'), 'start') (('that', '70018 75450 92'), 'have') (('notebook', 'time_step'), 'be') (('pressure', 'point'), 'correlate') (('I', 'u_in'), 'specialize') (('which', '100'), 'be') (('u_in End point value', '5 hits'), 'u_ins') (('which', 'graph'), 'seem') (('R_C distribution', 'overall distribution'), 'have') (('bid_list', 'tqdm'), 'column') (('also it', 'vibrating shape'), 'look') (('5', 'gradually about end'), 'become') (('where u_out', 'point'), 'let') (('vibration shape', 'Main again mode'), 'be') (('they', 'graph same shape'), 'be') (('which', '4'), 'be') (('0 EDAThis', 'also main mode'), 'be') (('Import Functions Load CSV Add', 'y axis'), 'featuresPlot') (('u_in graph', 'vibration shapes'), 'seem') (('com marutama finetune', 'Modeling'), 'be') (('R_Cs', 'main mode'), 'be') (('which', 'instead time_delta'), 'multiply') (('Chart Plot', 'Ventilator Pressure Prediction EDA FE'), 'refer') (('Graphs', 'other graphs'), 'be') (('u_in graph', 'vibration shape'), 'seem') (('5 seconds it', 'same shape'), 'start') (('s', 'main u_in'), 'let') (('ratio', '4'), 'seem') (('that', 'So far only Main mode'), 'be') (('it', 'it'), 'upvote') (('you', '1 pattern'), 'plot') (('I', 'EDA https simple www'), 'refer') (('u_in graph', 'much same way'), 'look') (('you', 'only one 5'), 'be') ", "extra": ""}