{"name": "exploring human protein atlas cell classification ", "full_name": " h3 I am totally refered to this great kernel by Jonathan Schnabel h1 To be continued ", "stargazers_count": 0, "forks_count": 0, "description": "Conversely as shown on the following notebook cell identification of whole cells using cv2. The red channel corresponds to microtubules the blue channel to the nucleus and the yellow channel to the endoplasmid reticulum. It is the subcellular localization of this protein which is recorded in the Target column of the train. connectedComponents provides a simple and effective means to label nuclei in images. com jschnab To be continued. Adaptive thresholding methods apply a different threshold on different parts of the image let s see how well it does on our images. Even after playing with the upper and lower parameter values no satisfactory result is obtained. Description of threshold types can be found here and here. Then we will overlay the green and yellow channel as the yellow channel gives a good indication of the cell shape. com jschnab exploring the human protein atlas images by Jonathan Schnabel https www. See here for more explanations. Let s try different simple thresholding methods. Let s see how connectedComponents work after both thresholding methods. Some cells are fused to each other while they should not be. connectedComponents is not as efficient due to the less homogeneous signal in the yellow channel of the image. Binary and truncate methods work better. Each image is a 4 channel image with the protein of interest in the green channel. Let s display the different channels of the image with ID 1 since it contains several subcelullar locations for our protein of interest. According to Chen et al. At this point it s not clear if truncate thresholding is an improvement compared to binary thresholding. Nucleus images provide a means to identify each cell so image segmentation may start by identification of nuclei in images. To zero simple thresholding is not adapted at all for identifying cell boundaries based on the yellow channel. 2007 if images are segmented into single cell regions additional features that are not appropriate for whole fields can be calculated after seeded watershed segmentation. I am totally refered to this great kernel https www. ", "id": "hamditarek/exploring-human-protein-atlas-cell-classification", "size": "2186", "language": "python", "html_url": "https://www.kaggle.com/code/hamditarek/exploring-human-protein-atlas-cell-classification", "git_url": "https://www.kaggle.com/code/hamditarek/exploring-human-protein-atlas-cell-classification", "script": "collections seaborn numpy matplotlib.pyplot Image pandas PIL Counter ", "entities": "(('connectedComponents', 'images'), 'provide') (('connectedComponents', 'image'), 'be') (('satisfactory result', 'parameter Even upper values'), 'after') (('Description', 'threshold types'), 'find') (('image', 'green channel'), 'be') (('I', 'kernel https totally great www'), 'refer') (('how it', 'images'), 'apply') (('how connectedComponents', 'thresholding methods'), 'let') (('zero simple thresholding', 'yellow channel'), 'adapt') (('they', 'other'), 'fuse') (('s', 'thresholding different simple methods'), 'let') (('1 it', 'interest'), 'let') (('image segmentation', 'images'), 'provide') (('which', 'train'), 'be') (('red channel', 'endoplasmid yellow reticulum'), 'correspond') (('that', 'seeded watershed segmentation'), 'calculate') (('truncate', 'binary thresholding'), 's') (('yellow channel', 'cell shape'), 'overlay') ", "extra": ""}