{"name": "human protein atlas segmentation ", "full_name": " h1 Purpose h1 Parameters h1 Functions h1 Read Trainning Data h1 Explore Using HPA Cell Segmentation h1 Isolate Each Segment h1 Crop Cells h1 Segment All Samples ", "stargazers_count": 0, "forks_count": 0, "description": "PurposeThis notebook works out a solution for cell segminationReferences https github. com CellProfiling HPA Cell Segmentation Parameters Functions Read Trainning Data Explore Using HPA Cell SegmentationTake the first image from the samples and walk through steps to segment cells. microtubule channels protein of interest nuclei channels endoplasmic reticulum Get array of all images for given sample id Get single image that blends all RGBY into RGB get rgby images for sample blend rgby images into single array Create PIL Image if sample size is set then reduce trainning set accordingly id to use while exploring For full cells Nuclei mask Cell nuclei mask Cell mask Get unique vector of segment numbers plot original cell mask from above set all other numbers to zero in cell mask plot isolated image Get unique vector of segment numbers build figure plot original cell mask from above plot original cell mask from above set all other numbers to 255 in cell mask match shape for RGB crop across all channels plot isolated image Segment nuclie For full cells Blended image Get unique vector of segment numbers Isolate and crop cell from blended image. Isolate Each SegmentIsolate and separate each cell s mask into separate images Crop CellsUse the mask to cut cells out of the original blended image Segment All SamplesUse what was learned above and loop through all samples printing the blended image and the cell mask. ", "id": "christopherworley/human-protein-atlas-segmentation", "size": "577", "language": "python", "html_url": "https://www.kaggle.com/code/christopherworley/human-protein-atlas-segmentation", "git_url": "https://www.kaggle.com/code/christopherworley/human-protein-atlas-segmentation", "script": "display IPython.display hpacellseg.utils label_nuclei numpy matplotlib.pyplot Image pandas get_images get_blended_image PIL hpacellseg.cellsegmentator matplotlib.image label_cell ", "entities": "(('PurposeThis notebook', 'cell segminationReferences https github'), 'work') (('Blended image', 'crop blended image'), 'channel') (('CellProfiling HPA Cell Segmentation Functions', 'segment cells'), 'com') (('what', 'blended image'), 'isolate') ", "extra": ""}