{"name": "kaggle g2net noise analysis feature extraction ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "By setting high_cut_alias 400Hz all strains have impulses on every 500 samples 4Hz intervals. Feature Extraction 13a. Visual inspection for all strains to be above threshold 0. Comparing whiten data with removed Background Noise12. Comparing whiten data with removed Background Noise The middle column figure is the whiten strain before BPF_strain. The time domain whiten signal 44 before BPF_strain Is symmetrical about its center. Comparing whiten data without removing Background Noise 9a. Band Pass and Notch Filters 3. 677 secRamp up freq is the average of 4 cycles dominant freq 67. High_cut_alias prevents signal freq that is very close to Nyquist from folding back to low frequency. In the whitening function the freq resolution is 0. 0 Explore Numericals 2. Time domian plotLeft figure since BPF removed the high amplitude low freq noise the amplitude of BPF outputs are much smaller compared to unfilter original signal. with removing background noise time domain 69 spectrogram 65 and freq domain 66 plots. BPF_alias passband is between low_cut_alias 18Hz and high_cut_alias 1020Hz. Comparing Whiten data 9a Time domain plotLeft column figure compare all plotsMiddle column figure strain_x_whiten First BPF_alias then whiten. So I m confused and cannot draw any conclusion about alias bin3 9 and 10. It reaches the minimum at sample 2048 then gradually increases its strain again on the sub sequence impulses. Freq domain plot comparing x original vs strain_x_whiten vs strain_x_whitenbp 10. Whitening without removing Background Noise strain_x_whiten strain_x_whitenbp whiten_bpf x dt with background noise x original data strain_x_whiten whiten x strain_x_whitenbp BPF strain_x_whiten 9. If each sub folder is at the proximity of time prior or after the GW event it can represent a non stationary background noise. Based on 66 68 plots my guess is GW at 34Hz dominant and 1000Hz weak. The projection onto Freq domain has a freq resolution of 8Hz. I expect to see some white noise after 1. References https www. Middle and right figures are BPF. 0 Hz alias bin l1 9 72. All strains are damped. d Enable Disable whiteninge Enable Disable background noise remover. 0 Hz Whiten SpectrogramAfter whitening strains are symmetrical about the center of the time segment frame 120. Band Pass Butterworth Filter2b. By setting low_cut_alias 300Hz all strains have high freq burst pulses of 4Hz with 90 duty cycle. In both cases there is a square wave with the fundamental freq of 4Hz. Not sure the whiten signal is a weak GW or equipment noise. 5Hz and spectrogram version 49 51 that projects onto freq domain which has freq resolution of 8Hz. Whitening with Removed Background Noise strain_x_whiten_nobg strain_x_whitenbp_nobg whiten_bpf x dt remove_bg True 11. The only way is to attenuate it. Is it good or bad I can t really tell. The other runs by setting low_cut_alias to 300Hz to remove the low freq signal. DF_1 Removed Background Noise xt_gbpf BPF df_1 79 Band pass filter df_1 xt_gbpf_bg xt_gbpf df0_avg_bpf Removed background noise6. Low freq and high freq near Nyquist 1024 Hz are attenuated. Data Augmentation a Inject noise blip chirp etc fromhttps www. Maybe it will show up after whitening. After BPF_alias the signal is whiten. H1 has visible strain at 300Hz. The equalized signal is then transformed back to time domain by IFFT it. Overlaid time 57 69 freq 57 69 domain plot 71. The two additional runs all 4Hz pulses are synchronized in H1 L1 and V1. WhiteningWe can whiten the data dividing it by the noise amplitude spectrum in the fourier domain suppressing the extra noise at low frequencies and at the spectral lines to better see the weak signals in the most sensitive band. org user_guide datasets. Whitening without removing Background Noise 9. com zerafachris g2net_2nd_training_school_malta_mar_2020 blob master lectures SP_Signal_Processing_Introduction Eftim_Zdravevski signal_processing_2_preparing_GW_data. It could be that there are two noise sources at 4Hz. It looks like a damped sinusoidal wave. To get rid of remaining high frequency noise we will also bandpass the data. Same thing happens when low_cut_alias 300Hz I see a 4Hz square wave. I did two additional runs one with high_cut_alias set to 400Hz to remove the high freq signal. The resulting time series is no longer in units of strain now in units of sigmas away from the mean. Whitening with Removed Background Noise 11. Numbers seem to be very big. png hanning window Strain 1e 44This aliasing bin search is based on 2sec data projection onto freq domain and should do another search from ringdown to 2sec. GW emission peaks at this phase. Whitening function 41 I found that DC and Nyquist are non zero I brute force them to zero. There are all harmonics of square wave 4Hz. Bin50 400Hz with background noise removed dashed black the peak is reduced whereas bin80 640Hz bin85 680Hz etc are increased w. t Red line Maybe this is good for data augmentation with or without background noise removed. If the high_cut_alias 400Hz moves further inside the passband all strains look like square waves at 4Hz. org projects zooniverse gravity spy talk 762 926241b Enable Disable notch filter random select notch filterc Change BPF_alias lowcut_alias high_cut_alias BPF_strain lowcut highcut. The whiten signal after BPF_strain without removing background noise time domain proj_H1 L1 V1_bp_t data only 57 spectrogram 56 and freq domain 57 plots. In both cases there are no differences they all have high peaks below 80Hz similar characteristics in 48. This notebook is about Averaging the background noise target 0 Analyze original raw time freq domain signal Analyze the whiten signal before BPF_strain aliasing and Nyquist s DC Remove signal from background noise Analyze spectrograms with and without background noise removed. 67sec L1 has the strongest strain 2e 41. I could not draw any aliasing conclusion based on these observations. Symmetry about the center. The BPF_strain passband is low_cut_strain low_cut_alias 5 between high_cut_strain high_cut_alias 5. Searching for signal freq that is close to Nyquist found H1 1000Hz L1 952Hz V1 944Hz and by calculation corresponding aliases at H1 24Hz L1 72Hz V1 80Hz respectively. Middle column figure there are strong low freq noises because the whiten signal is before BPF_strain. This setting is a trade off between how much to attenuate the signal and allow aliasing. The signal is then whiten 41 then BPF_strain. png Below f_min 20 Hz the data are not properly calibrated. There are two bandpass filters BPF_alias and BPF_strain 2 12. My guess is GW at 32Hz dominant and 1000Hz weak. It s just for my reference. After whitening the signal is BPF_strain to remove the out of band signal again since whitening equalizes it or to narrow the band of interest. Random average time and different subfolder. 67sec to 2sec and freq below 300Hz. Simulated dataset happens all the time. Whiten Bandpass filter SpectrogramCan t really tell transient creates white noise in the region 1. The frequencies that are common to the background noise their strains were either reduced or increased. BPF highcut_alias is at 1020Hz. Peak spikes simultaneously occurred at normal modes of vibration 305Hz of the suspended mirrors If you see them it may not be GW but still can t rule out it is not a GW event even though the background noises are also at the same peaks at H1 and L1. The freq domain whiten signal before BPF_strain There are 2 versions of this one in whitening function 41 which has freq resolution of 0. Time domain plot comparing df0_avg vs df0_avg_gain 79 vs df_0_avg_bpf 79 4b. Spectrogram Feature Extraction 13b. The raw signal is scaled up and BPF_alias 42 then it is either with or without removing the average background 17. Average DF_0 Background Noise 4. 0902274858390353e 44potential aliasing bin at alias bin h1 3 24. Data augmentation Feature Extraction1. Freq domain plotFreq domain The dominant freq is 34Hz. html Whiteninghttps github. The whiten signal has impulses at 500 samples intervals which is 4Hz. These led me to believe it s a pulsar. Now you can see lots of in band freq. If brute force DC Nyquist 0 only peaks will reappear at bin128 Nyquist again. NN will focus on different freq. Time domain plot comparing x original vs strain_x_whiten vs strain_x_whitenbp 9b. df0_avg is averaged over 512 samples 512 2 60 17 mins. 67sec on the spectrogram especially freq below 300Hz. Summary This is the summary of id 098a464da9 the merger dominant freq is 34Hz the delay between L1 and V1 peaks is about 23. 407776294080362e 45bin l1 119 952. When the freq is too close to Nyquist it is difficult to prevent it from aliasing. The noise analysis is based on a spectrogram by projecting it into frequency domain and time domain. Freq domain plot comparing df0_avg vs df0_avg_gain 79 vs df_0_avg_bpf 79 5. Ringdown lasts about 16. I think I ve probed at the wrong place should have probed before whitening. To whiten the signal its PSD is obtained and transform the signal into freq domain by FFT it. png attachment 681546e5 a207 427c a337 e583817621cf. Ringdown 4 cycles time 16. Low_cut_alias 300Hz. Comparing Average DF_0 4a. IFFT with non zero Nyquist s bin will result in DC spikes in time domain signal. I ve tried to brute force hf 8 hf 8 0 and resulted in L1 V1 peaks moving to bin126. To minimize Nyquist s DC the original raw data need to remove its DC and after averaging DF_0 DC is removed by subtracting its mean value. html time domain data image. Time domain The ringdown is at time segments 200 213. Freq domain plot comparing x original vs xt_gbpf 79 vs xt_gbpf_bg 79 7. png attachment b8c4ff3f f42e 4bdc a7a3 a38f5c3469de. L1 and V1 have peaks at bin128 Nyquist. BNS_range I m not a domain expert and not sure this is done correctly. High_cut_alias 400Hz. To prove aliasing filtered out high freq signal then there shouldn t be any low freq peaks at H1 24Hz L1 72Hz V1 80Hz. Time domain 1D Feature Extraction 14. Freq domain plotFreq domain PSD plot Left figure shows the high strain at low freq above O1 smooth model GW150914. It reaches the minimum at sample 2048 then gradually increases again on subsequence pulses. Comparing Average DF_1 6a. The first pulse has the highest strain then gradually reduces on subsequence pulses. org O3 BBH range is BNS range NOTE that since mass is the source of gravity and thus also of gravitational waves systems with higher masses such as the binary black hole merger GW150914 are much louder and can be detected to much higher distances than the BNS range. 0 Hz alias bin v1 10 80. Random set BPF corner freq. First impulse has the highest strain then gradually reduces on the sub sequence impulses. The L1 is a damped sine wave symmetry about its center. Whitening is always one of the first steps in astrophysical data analysis searches parameter estimation. These are the strains that you want your NN to train on. By setting high_cut_alias 400Hz or low_cut_alias 300Hz both readings are the same. Additional runs are not shown in the plots. Scaling up the signal gives the maximum float64 precision. The freq domain signal is amplitude equalized all the weak strong amplitudes are equalized to the same level. If there exists a high peak then it s noise sources. V1 is the most heavily damped. Same observations in spectrogram projection onto time domain 4Hz are aligned. Is it good or bad i don t know only the domain expert can tell. ring down peak at 2 3434 4096 1. This increases the dynamic range of the signal especially down cast to lower precision. org GW150914data LOSC_Event_tutorial_GW150914. 14Hz prior to ringdown. Ringdown creates a transient which produces white noise. The background noise df0_avg_bpf can be averaged at various subfolders and average length. The BPF_alias serves three purposes Low_cut_alias removes the unwanted signal below 18Hz. Spectrogram Feature Extraction13b. The whiten signal has high freq bursts of 4Hz period with 90 duty cycle. Average DF_0 Background Noise df0_avg average df_0 original data df0_avg_gain average df_0 79 bits apply gain on original data df0_avg_bpf average BPF df_0 79 bits Band pass filter4. Middle and right figures at ringdown a sharp decrease in amplitude is like an impulse this will create a transient with very high frequencies. All strains are in burst mode with fundamental freq of 4Hz. 781802511588414e 45bin v1 118 944. Time domain plot comparing x original vs xt_gbpf 79 vs xt_gbpf_bg 79 6b. The noise is so high below f_min that LIGO cannot sense gravitational wave strain from astrophysical sources in that band. Freq domain The frequencies that are common to the background noise their strains were either reduced or increased. Whitening requires no prior knowledge of spectral lines etc only the data are needed. The 1D time domain signal can be used for NN or 2D spectrogram by FFT the signal segment by segment in time. Freq domain plotBlue H1 Red L1 Green V1 Black O1 smooth ModelNotice that the L1 has either a very strong vibration of the suspended mirrors spike 305Hz or from the entire data set of event GW. Band Pass Filter 2a. DF_1 Removed Background Noise For this 2 seconds instance there is no significant difference between BPF vs BPF Background. Right column figure strain_x_whitenbp First BPF_alias then whiten then BPF_strain. SummaryEach data sample npy file contains 3 time series 1 for each detector and each spans 2 sec and is sampled at 2 048 Hz. org static speclines o2 comb_list_O2V_pers0. ", "id": "cnhung/kaggle-g2net-noise-analysis-feature-extraction", "size": "14802", "language": "python", "html_url": "https://www.kaggle.com/code/cnhung/kaggle-g2net-noise-analysis-feature-extraction", "git_url": "https://www.kaggle.com/code/cnhung/kaggle-g2net-noise-analysis-feature-extraction", "script": "interp1d percentiles_all maximum_variation movingaverage butter get_filter_coefs plot_time_domain_dat iirdesign seti_asymmetry fft zpk2tf stats_calculate_all whiten_bpf seti_projection avg_data matplotlib.mlab scipy.interpolate plot_psd gen_psds numpy first_order_gradient feat_extract filtfilt iir_bandstops get_specgram whiten scipy.stats plot_spec convolve entropy matplotlib.pyplot seti_entropy seti_total_variation pandas freqz seti_moment seti_difference notch_filter_data scipy scipy.signal butter_bandpass_filter scipy.fftpack tv_2d_isotropic numerical_values signal ", "entities": "(('It', 'subsequence 2048 then gradually again pulses'), 'reach') (('strains', 'background'), 'domain') (('1024 Hz', 'Low high Nyquist'), 'freq') (('bin', 'time domain signal'), 'IFFT') (('amplitude', 'much original signal'), 'noise') (('secRamp up freq', '4 cycles dominant freq'), '677') (('I', 'observations'), 'draw') (('I', '1'), 'expect') (('I', 'bin126'), 'try') (('This', 'lower precision'), 'increase') (('Time ringdown', 'time'), 'domain') (('which', 'white noise'), 'create') (('average BPF 79 bits Band', 'filter4'), 'average') (('I', 'wrong place'), 'think') (('strains', '4Hz'), 'be') (('BPF_strain passband', 'low_cut_strain high_cut_strain 5 high_cut_alias'), 'be') (('First BPF_alias', 'column plotsMiddle figure'), 'compare') (('low_cut_alias when 300Hz I', '4Hz square wave'), 'happen') (('L1', 'event GW'), 'domain') (('that', 'back low frequency'), 'prevent') (('So I', 'alias'), 'm') (('DC only peaks', 'bin128 Nyquist'), 'reappear') (('guess', 'dominant'), 'be') (('L1', 'sine wave damped center'), 'be') (('guess', 'dominant weak'), 'be') (('data', 'most sensitive band'), 'whiten') (('Low_cut_alias', '18Hz'), 'serve') (('highest strain', 'sub sequence then gradually impulses'), 'have') (('It', 'sub sequence again impulses'), 'reach') (('they', '48'), 'be') (('strain_x_whitenbp whiten_bpf dt', 'noise original data'), 'whiten') (('strains', '4Hz intervals'), 'have') (('Additional runs', 'plots'), 'show') (('freq resolution', 'whitening function'), 'be') (('then it', 'average background'), 'scale') (('whiten signal', 'duty 90 cycle'), 'have') (('df_1 79 Band', 'filter background'), 'DF_1') (('640Hz etc', 'background Bin50 400Hz noise'), 'remove') (('highest strain', 'then gradually subsequence'), 'have') (('67sec', 'especially 300Hz'), 'freq') (('only data', 'spectral lines'), 'require') (('Red Maybe this', 'background noise'), 't') (('4Hz pulses', 'H1 L1'), 'synchronize') (('column freq whiten Middle strong low signal', 'BPF_strain'), 'figure') (('then shouldn t', 'L1 72Hz V1 80Hz'), 'filter') (('whiten signal', 'background noise time domain proj_H1 L1 V1_bp_t data'), 'plot') (('strains', 'background'), 'noise') (('this', 'domain expert'), 'bns_range') (('it', 'background non stationary noise'), 'represent') (('Scaling', 'maximum float64 precision'), 'give') (('equalized signal', 'IFFT it'), 'transform') (('bin aliasing search', '2sec'), 'png') (('Same observations', 'time domain'), 'align') (('projection', '8Hz'), 'have') (('this', 'very high frequencies'), 'be') (('strains', 'duty 90 cycle'), 'have') (('we', 'also data'), 'bandpass') (('waves thus also gravitational systems', 'BNS range'), 'be') (('Whiten Bandpass SpectrogramCan t', 'region'), 'filter') (('so high LIGO', 'band'), 'be') (('NN', 'that'), 'be') (('time domain', 'center'), 'whiten') (('Whitening', 'data analysis searches parameter astrophysical estimation'), 'be') (('time domain 1D signal', 'time'), 'use') (('again whitening', 'interest'), 'be') (('time resulting series', 'away mean'), 'be') (('figure', 'model O1 smooth GW150914'), 'left') (('400Hz moves', '4Hz'), 'look') (('PSD', 'FFT it'), 'obtain') (('DC', 'mean value'), 'need') (('Freq domain df0_avg', 'df_0_avg_bpf'), 'plot') (('delay', 'L1'), 'be') (('I', 'freq high signal'), 'do') (('GW background even noises', 'H1'), 'occur') (('column middle figure', 'whiten BPF_strain'), 'compare') (('41 which', '0'), 'whiten') (('BPF_alias passband', 'low_cut_alias 18Hz'), 'be') (('then it', 'high peak'), 's') (('non I', 'zero'), 'function') (('It', 'noise two 4Hz'), 'be') (('setting', 'aliasing'), 'be') (('it', 'it'), 'be') (('SummaryEach data sample npy file', 'spans 2 2 048 Hz'), 'contain') (('Hz Whiten whitening SpectrogramAfter strains', 'time segment frame'), '0') (('df0_avg', '512 60 17 mins'), 'average') (('which', '8Hz'), '5hz') (('time freq domain 0 Analyze original raw signal', 'DC Remove background noise Analyze background noise'), 'be') (('that', 'H1 24Hz L1 72Hz V1 80Hz'), 'find') (('Enable Disable notch notch filter random select filterc', 'BPF_alias lowcut_alias'), 'talk') (('which', 'samples 500 intervals'), 'have') (('low_cut_alias readings', 'high_cut_alias 400Hz'), 'by') (('noise analysis', 'frequency domain'), 'base') (('Time domain plot', '79 4b'), 'df0_avg_gain') (('weak strong amplitudes', 'same level'), 'be') ", "extra": ""}