{"name": "my first kaggle project ", "full_name": " h2 Checking correlations h2 Tickets and Cabins h2 Titles ", "stargazers_count": 0, "forks_count": 0, "description": "This is my first attempt on Kaggle. I don t really understand this last graph. LINE Let s extract the number part and the letter part. Checking correlations Here I check how various types of data are correlated. Then we will split out the Ticket Number and the Ticket identifier by using that last space. 23567 Letters only e. com startupsci titanic data science solutionsSee what files I have available to me. 330877 17463 2631 Numbers and letters e. Does ticket group add anything new that Pclass doesn t already add Here on I am going to follow the tutorial more closely so I can get to the end Titles data tools linear algebra data processing CSV file I O e. read_csv visualization machine learning This is the numeric columns only This is the object columns Warning the colors legend are wrong for Every 10th ticket after sorting alphabetically fix data bins based on number of digits Automatic groups Manual groups just to set a value Keep PassengerId for prediction Logistic Regression Support Vector Machines Gaussian Naive Bayes Perceptron Linear SVC Stochastic Gradient Descent Decision Tree Random Forest using random forest. Note this can only be done for features without empty values. Is it just luck due to small numbers or is there something there Tickets and Cabins The tutorial doesn t got through this but I want to try to extract what I can from the ticket and cabin information. At first gland I notice the tickets have three types Numbers e. Let s try and start by loading the data into a pandas dataframe. We will work with a copy of the dataframe to easily fix mistakes in the notebook without having to start over. I am very closely following this Python tutorial 1. In particular is there any reason that the male female ratios switched on C. ", "id": "mathjason/my-first-kaggle-project", "size": "1353", "language": "python", "html_url": "https://www.kaggle.com/code/mathjason/my-first-kaggle-project", "git_url": "https://www.kaggle.com/code/mathjason/my-first-kaggle-project", "script": "display sklearn.naive_bayes sklearn.tree Markdown KNeighborsClassifier DecisionTreeClassifier seaborn numpy LinearSVC SGDClassifier sklearn.ensemble RandomForestClassifier matplotlib.pyplot Perceptron pandas subprocess LogisticRegression check_output sklearn.neighbors SVC sklearn.linear_model GaussianNB sklearn.svm IPython.display ", "entities": "(('I', 'me'), 'solutionsSee') (('s', 'pandas dataframe'), 'let') (('t', 'really last graph'), 'don') (('tickets', 'three types'), 'notice') (('male female ratios', 'C.'), 'be') (('Then we', 'Ticket last space'), 'split') (('We', 'notebook'), 'work') (('I', 'information'), 'be') (('this', 'empty values'), 'note') (('Titles data tools', 'algebra data processing CSV file'), 'add') (('how various types', 'data'), 'check') (('I', 'Python very closely tutorial'), 'follow') (('s', 'number part'), 'let') (('numeric only This', 'random forest'), 'machine') ", "extra": ""}