{"name": "playstore analysis eda ", "full_name": " h1 Task 1 Data clean up Missing value treatment h4 a Drop records where rating is missing since rating is our target study variable h4 b Check the null values for the Android Ver column h4 i Are all 3 records having the same problem h4 ii Drop the 3rd record i e record for Life Made WIFI h4 iii Replace remaining missing values with the mode h4 c Current ver replace with most common value h1 Task 2 Data clean up correcting the data types h4 a Which all variables need to be brought to numeric types h4 b Price variable remove sign and convert to float h4 c Installs remove and sign convert to integer h4 d Convert all other identified columns to numeric h1 Task 3 Sanity checks check for the following and handle accordingly h4 a Avg rating should be between 1 and 5 as only these values are allowed on the play store h4 i Are there any such records Drop if so h4 b Reviews should not be more than installs as only those who installed can review the app h4 i Are there any such records Drop if so h1 Task 4 Identify and handle outliers h4 a Price column h4 i Make suitable plot to identify outliers in price h4 ii Do you expect apps on the play store to cost 200 Check out these cases h4 iv Limit data to records with price 30 h4 iii After dropping the useless records make the suitable plot again to identify outliers h4 b Reviews column h4 i Make suitable plot h4 ii Limit data to apps with 1 Million reviews h4 c Installs h4 i What is the 95th percentile of the installs h4 ii Drop records having a value more than the 95th percentile h1 Data analysis to answer business questions h1 Task 5 What is the distribution of ratings like use Seaborn More skewed towards higher lower values h4 a How do you explain this h1 6 What are the top Content Rating values h4 a Are there any values with very few records h4 b If yes drop those as they won t help in the analysis h1 Task 7 Effect of size on rating h4 a Make a joinplot to understand the effect of size on rating h4 b Do you see any patterns h4 c How do you explain the pattern h1 Task 8 Effect of price on rating h4 a Make a jointplot with regression line h4 b What pattern do you see h4 c How do you explain the pattern h4 d Replot the data this time with only records with price 0 h4 e Does the pattern change h4 f What is your overall inference on the effect of price on the rating h1 9 Look at all the numeric interactions together h4 a Make a pairplort with the colulmns Reviews Size Rating Price h1 Task 10 Rating vs content rating h4 a Make a bar plot displaying the rating for each content rating h4 b Which metric would you use Mean Median Some other quantile h4 c Choose the right metric and plot h1 Task 11 Content rating vs size vs rating 3 variables at a time h4 a Create 5 buckets 20 records in each based on Size h4 b By Content Rating vs Size buckets get the rating 20th percentile for each combination h4 c Make a heatmap of this h4 i Annotated h4 ii Greens color map h4 d What s your inference Are lighter apps preferred in all categories Heavier Some ", "stargazers_count": 0, "forks_count": 0, "description": "Identify and handle outliers a. By Content Rating vs. Current ver replace with most common value Task 2. Check the null values for the Android Ver column. Do you expect apps on the play store to cost 200 Check out these cases iv. Drop records having a value more than the 95th percentile Data analysis to answer business questions Task 5. How do you explain the pattern Since on increasing the Price Rating remains almost constant greater than 4. Make a bar plot displaying the rating for each content rating b. Choose the right metric and plot Task 11. Drop records where rating is missing since rating is our target study variable b. What is the 95th percentile of the installs ii. Thus we can conclude that their is positive correlation between Size and Rating. Installs remove and sign convert to integer d. What s your inference Are lighter apps preferred in all categories Heavier Some Based on analysis its not true that lighter apps are preferred in all categories. Are all 3 records having the same problem Yes all 3 records are having same problem ie all are NaN. Because apps with size 40k 60k and 80k 100k have got the highest rating in all cateegories. Because in case of Outliers median is the best measure of central tendency. So in general we can conclude that heavier apps are preferred in all categories. After dropping the useless records make the suitable plot again to identify outliers b. Convert all other identified columns to numeric Task 3. Which metric would you use Mean Median Some other quantile We must use Median in this case as we are having Outliers in Rating. What is your overall inference on the effect of price on the ratingGenerally increasing the Prices doesn t have signifcant effect on Higher Rating. Are there any values with very few records Adults only 18 and Unrated are values with very few records so we drop them. For Higher Price Rating is High and almost constant ie greater than 4 9. But this is not always true ie. Create 5 buckets 20 records in each based on Size b. Effect of size on rating a. Size buckets get the rating 20th percentile for each combination c. Greens color map d. Replace remaining missing values with the mode c. Effect of price on rating a. for higher Rating their is constant Size. Make a heatmap of this i. Limit data to records with price 30 iii. Do you see any patterns Yes patterns can be observed between Size and Rating ie. How do you explain this b. Does the pattern change Yes On limiting the record with Price 0 the overall pattern changed a slight ie their is very weakly Negative Correlation between Price and Rating. Reviews column i. Reviews should not be more than installs as only those who installed can review the app. Make suitable plot ii. Drop the 3rd record i. Therefore distribution of Rating is more Skewed towards lower values. Look at all the numeric interactions together a. What is the distribution of ratings like use Seaborn More skewed towards higher lower values a. Sanity checks check for the following and handle accordingly a. Replot the data this time with only records with price 0 e. Make a pairplort with the colulmns Reviews Size Rating Price Task 10. rating 3 variables at a time a. What pattern do you see Generally on increasing the Price Rating remains almost constant greater than 4. record for Life Made WIFI iii. What are the top Content Rating values a. There are no such records with rating less than 1 or greater than 5. Make a jointplot with regression line b. Make a joinplot to understand the effect of size on rating b. How do you explain the pattern Generally on increasing Rating Size of App also increases. Which all variables need to be brought to numeric types Reviews and installs need to be brought to numeric types. Are there any such records Drop if so. Yes there are 7 records where Review is greater than Installs. What is the implication of this on your analysis Since mode median mean the distribution of Rating is Negatively Skewed. content rating a. Data clean up correcting the data types a. Limit data to apps with 1 Million reviews c. rating should be between 1 and 5 as only these values are allowed on the play store. Make suitable plot to identify outliers in price ii. Price variable remove sign and convert to float c. Task 1 Data clean up Missing value treatment a. If yes drop those as they won t help in the analysis Task 7. Thus it can be concluded that their is very weak Positive correlation between Rating and Price. their is correlation between Size and Rating. ", "id": "mrushan3/playstore-analysis-eda", "size": "5021", "language": "python", "html_url": "https://www.kaggle.com/code/mrushan3/playstore-analysis-eda", "git_url": "https://www.kaggle.com/code/mrushan3/playstore-analysis-eda", "script": "pandas numpy matplotlib.pyplot ", "entities": "(('Current ver', 'most common value'), 'replace') (('95th percentile', 'installs ii'), 'be') (('their', 'positive Size'), 'conclude') (('heavier apps', 'categories'), 'conclude') (('their', 'Negative very weakly Price'), 'change') (('Installs', 'integer d.'), 'remove') (('their', 'Size'), 'be') (('you', 'almost 4'), 'see') (('we', 'Rating'), 'use') (('patterns', 'Size'), 'see') (('between only values', 'play store'), 'be') (('they', 'analysis'), 'drop') (('80k 100k', 'cateegories'), 'because') (('overall inference', 'Higher Rating'), 'have') (('so we', 'them'), 'be') (('distribution', 'Rating'), 'be') (('their', 'very weak Positive Rating'), 'conclude') (('Data', 'data types a.'), 'clean') (('Therefore distribution', 'more lower values'), 'be') (('who', 'app'), 'be') (('Reviews', 'numeric types'), 'need') (('Sanity checks', 'following'), 'check') (('Task 1 Data', 'value treatment Missing a.'), 'clean') (('apps', 'cases'), 'expect') (('distribution', 'higher lower values'), 'be') (('How you', 'almost 4'), 'explain') (('their', 'higher Rating'), 'be') (('How you', 'App'), 'explain') (('lighter apps', 'categories'), 'be') (('7 where Review', 'Installs'), 'be') (('rating', 'combination 20th c.'), 'get') (('ie', 'same problem'), 'be') (('joinplot', 'rating'), 'make') ", "extra": ""}