{"name": "qwk cupy vs numpy vs numba ", "full_name": " h3 cupy implementation h3 afajohn Method h3 cpmpml h3 numba relies on just in time compiler so the running time for the first execution will be slower h3 cupy uses on the fly kernel synthesis so the running time for the first execution will also be slower h3 It is amazing that numba is slightly faster than cupy despite it s on cpu Both are about 100x faster than numpy Cupy is still convenient without much code change if your baseline code is in numpy ", "stargazers_count": 0, "forks_count": 0, "description": "org In this notebook we show how simple it is to drop in replace numpy functions with cupy and deliver 100x speedup. cupy implementationCuPy is an open source matrix library accelerated with NVIDIA CUDA. It is amazing that numba is slightly faster than cupy despite it s on cpu. com afajohn quadratic weighted kappa with numpy flavor cpmpmlhttps www. Cupy is still convenient without much code change if your baseline code is in numpy. Both are about 100x faster than numpy. afajohn Method https www. com cpmpml ultra fast qwk calc method numba relies on just in time compiler so the running time for the first execution will be slower. cupy uses on the fly kernel synthesis so the running time for the first execution will also be slower. ", "id": "jiweiliu/qwk-cupy-vs-numpy-vs-numba", "size": "803", "language": "python", "html_url": "https://www.kaggle.com/code/jiweiliu/qwk-cupy-vs-numpy-vs-numba", "git_url": "https://www.kaggle.com/code/jiweiliu/qwk-cupy-vs-numpy-vs-numba", "script": "sklearn.metrics confusion_matrix numba numpy cohen_kappa_score jit matplotlib.pyplot cupy_hist_int cupy_quadKappa cupy_confusion_matrix qwk3 cupy quadKappa ", "entities": "(('baseline code', 'numpy'), 'be') (('it', 'cpu'), 'be') (('cupy implementationCuPy', 'source matrix NVIDIA open CUDA'), 'be') (('running time', 'first execution'), 'use') (('running time', 'first execution'), 'rely') (('how it', '100x speedup'), 'org') ", "extra": ""}