{"name": "sales cluster analysis ", "full_name": " h1 About the Dataset h1 Features h1 Table of Contents h1 Purpose h1 1 Data Loading and Data Cleaning h2 Inspecting Null s Values h2 Data Types h1 2 Descriptive Analysis h2 2 1 Categories h3 Platform h3 Genre h3 Publisher h2 2 2 Numbers h2 2 3 Date h1 Data analysis h1 3 Popularity Through the Years by Platform h1 4 Popularity Through the Years by Genre h1 5 Global Sales Growth h1 6 Clusters h2 6 1 Low Sales h2 6 2 Medium Sales h2 6 3 High Sales h1 Bonus h2 Whats the best selling game ever ", "stargazers_count": 0, "forks_count": 0, "description": "Let s then continue with the descriptive analysis 2. If you like it please upvote i m really close to become a notebook expert D. To graph the dataframe with plotly it is necessary that we drop the Nan s values from the Year columnFeel free to explor the chart remember to press the Autoscale button as you advance to get a more clear view of the chart. Popularity Through the Years by Platform 4. Although X360 was just in place 1 in one year 2010 it was able to make it place 2. Let s see each category 6. PurposeThe purose of the dataset is to explore it s features along with their relationships and find interesting patterns analyze them and visualize them. About the DatasetThis dataset contains a list of video games with sales greater than 100 000 copies. Features Rank Ranking of overall sales Name The games name Platform Platform of the games release i. Let s analyze Genre Until 2001 we see how the different genres fight for position 1 without dominating for years. Since 2001 the Action genre dominated the market until 2017 when role playing took its positionWhat is the absolute winner in sales No surpise that action is the winner with 1 751 in total sales. Nevertheless for the machine learning model i might be dropping the extreme values to create a more realitic and perhaps accuarate model. Some platforms that dominated an are are SNES 1983 1994 PS 1995 2000 PS2 2001 2005 Wii 2006 2009 PS3 2011 2013 PS4 2014 2017There must be something that PSX consoles are doing that always dominate the market will they keep performing the same when the PS5 is realeased We see that the PSX consoles together dominate the market but which consoles absolutly wins in terms of sales through all these years Let s find out The winner is the PS2 with a staggering total sales of 1 255. Seems like the 10 s was an excelent period to sell video games. My intention is to divide the dataset into low sales medium sales and high sales in order to inspect and build a sales profile. Whats the best selling game ever Hope you enjoy the notebook and learn something from it i can gurantee i got hook by this fun dataset. Data Loading and Data Cleaning 1. The Dataset is pretty tidy has categorical values date values and sales values. Those values will be perfect to practice s visualization skills and maybe we can find a useful machine learning modeldon t forget to upvote if you find the notebook useful i m so close to become a notebook expert so i would really REALLY appreciate it D 1. Data Loading and Data Cleaning Inspecting Null s ValuesLooks like we have a few nulls values in the dataset. Data Loading and Data Cleaning 2. Call it intuition but i guess the data from 2016 until 2020 is not complete 6. Cheers and happy coding Data Manipulation Data Viz Cluster Code to create empty data necessary to fit in the data into the plotly slide figure Plotly figure with slide Code to create empty data necessary to fit in the data into the plotly slide figure Plotly figure with slide. Descriptive Analysis 3. Date The graph and the statistics show us that the games in this dataset tend to be from year 2003 until 2010 Data analysis 3. I would appreciate some honest feedback on the comments on ways i could further improve or any thought you have about the dataset. Popularity Through the Years by PlatformA good measure of popularity is the total sales that a platform generated. Popularity Through the Years by Genre 4. Quite the contrary to my mind we would be losing some interest information like sports games in the case of nulls values in the year features or GBA games in the publisher feature. Popularity Through the Years by Platform 3. Let s take the outliers out of the analysis for this section to see if we can get a more readable distribution The graphs without the outliers show the shape of the distribution. 9 from to 2008 until today sales have been suspiciously decreasing. Popularity Through the Years by GenreSince the logic is same category vs sales we are going to use the same code as in section 3. Categories Platform Genre Publisher Publisher feature has lot s of values values. Therefore in this seciton we are going to take a look at how each platform has been gaining or loosing popularity or sales through the years. Global Sales Growth 5 Global Sales Growth 6. Let s check them outNulls values dont seem to be inconsistent data and there are not a lot of them. Cluster 0 low sales Cluster 1 high sales Cluster 2 medium saleslet s change the names in the dataset so that we donÄt getconfuse laterMost of the data is low but thats normal. It was generated by a scrape of vgchartz. Data TypesThe data types are also in order. Numberslooks like the vast majority of values lie in the lower bin the boxplots show where exactly the outliers are and the reason why the distributions don t have a shape. 5 Global Sales Growth We see in the graph how the video game sales have been increasing from 1980 until 2008 when they reached theyr peak at 678. Descriptive Analysis 2. Popularity Through the Years by Genre 5. Most of the values are indeed in the lower values and then it descends. All of the number features have a similar descending shape The box plots show how rich in outliers the data set is. We are not going to drop the ouliers since they could tell an interesting success story about some games. Let s continue with how the Genre performed through the years 4. From the chart we can see how a the platforms have been overperforming other platforms as the years pass. ClustersLet s apply k means. I don t think that dropping them would make a huge impact on the analysis. One of the advantages of plotly is that you are able to zoom in and out the graph to freely explore it and make a more readable graph 2. Year Year of the game s release Genre Genre of the game Publisher Publisher of the game NA_Sales Sales in North America in millions EU_Sales Sales in Europe in millions JP_Sales Sales in Japan in millions Other_Sales Sales in the rest of the world in millions Global_Sales Total worldwide sales. ", "id": "jaimebecerraguerrero/sales-cluster-analysis", "size": "6220", "language": "python", "html_url": "https://www.kaggle.com/code/jaimebecerraguerrero/sales-cluster-analysis", "git_url": "https://www.kaggle.com/code/jaimebecerraguerrero/sales-cluster-analysis", "script": "plotly.graph_objects DivergingNorm seaborn numpy matplotlib.pyplot sklearn.cluster make_subplots pandas KMeans plotly.io matplotlib.colors plotly.subplots plotly.express cat ", "entities": "(('i', 'fun dataset'), 's') (('Data Data Inspecting we', 'dataset'), 'Loading') (('graphs', 'distribution'), 'let') (('data set', 'how outliers'), 'have') (('years', 'other platforms'), 'see') (('Year Year', 'millions Global_Sales Total worldwide sales'), 'release') (('today sales', '2008'), '9') (('Categories Platform Genre Publisher Publisher feature', 'values s values'), 'have') (('action', 'total sales'), 'be') (('intention', 'sales profile'), 'be') (('it', '2'), 'be') (('you', 'notebook really close D.'), 'upvote') (('i', 'more realitic perhaps model'), 'drop') (('notebook so close i', 'really it'), 'be') (('how Genre', 'years'), 'let') (('Data TypesThe data types', 'also order'), 'be') (('why distributions', 'don shape'), 'lie') (('don dropping', 'analysis'), 'think') (('DatasetThis dataset', '100 greater than 000 copies'), 'contain') (('they', 'games'), 'go') (('Cheers', 'slide'), 'figure') (('when they', '678'), 'growth') (('then it', 'indeed lower values'), 'be') (('we', 'GBA publisher feature'), 'lose') (('how platform', 'years'), 'go') (('Dataset', 'values date pretty categorical values'), 'be') (('s', 'then descriptive analysis'), 'let') (('platform', 'total that'), 'be') (('that', 'data'), 'cluster') (('we', 'section'), 'be') (('values', 'inconsistent them'), 'seem') (('plotly you', 'more readable graph'), 'be') (('interesting patterns', 'them'), 'be') (('It', 'vgchartz'), 'generate') (('further you', 'dataset'), 'appreciate') (('you', 'chart'), 'be') (('i', '2020'), 'call') (('how different genres', '1 years'), 'let') (('games', 'Data analysis'), 'date') (('winner', '1 255'), 'be') ", "extra": ""}