{"name": "seeing the light v2 ", "full_name": " h2 Data exploration h2 1 Load the data h2 2 Plot intensity over time h2 3 Compute the periods h2 4 Compare the smaller regions ", "stargazers_count": 0, "forks_count": 0, "description": "Compute the periodsA fast way to get the dominant period is the Fast Fourier Transform FFT just take the frequency that gives the maximum value in the graph below This is however only approximate we cannot this easily tell if the period is really 24 hrs or say 23 hours. Getting a more exact value for the period would be nice in fact this is possible if we combine the two methods and compute autocorrelation with the fft This means that the dominant period for the whole dataset is 24. The dataset look at the day night variation of protein expression in certain neurons. We can see that there is a linear trend towards higher values late in the week. To estimate this part we use linear regression. Over time this would cause them to be completely out of phase with the day night cycle. This suggests that the period is slightly smaller around 23 hours in the center of the two bright nuclei and close to 25 hours at the periphery. The light corresponds to a certain protein whose expression varies over the day night cycle and our goal is to characterize this variation over time. The two bright ovals are the suprachiasmatic nuclei and the vertical line at the top is the third ventricle. I am not sure that this is true for several reasons 1. Take a closer look at the subregions 1. It doesn t really make much sense that light sensitive neurons in a realistic setting vary in anything else than 24 hours. The results above suggest that all regions have period close to 24 hours. We collect the linear regression in a function for later use. I ll end this notebook here. At the bottom is the optic nerve cannot be seen. Compute periods numerically 4. We also collected the autocorrelations for subregions. Autocorrelation gives a more exact answer here also showing a peak at 24 hours. I learnt a lot doing this hope you enjoyed it as well linear algebra graphs to smooth images because there are ten image frames per hour. Plot intensity over timeNow we take the mean intensity over the whole image and plot it against time. Plot how mean intensity varies over time 3. This means that we will only really need images for the analysis and not the other data arrays. We see that the overall shape is periodic but the graph also suggests a discontinuity in the data at 40 hours and 75 hours. I reshape some arrays to make them work with scikit learn. First a simple plot to show that there are exactly ten images each hour. This can be seen more clearly if we instead select time frames corresponding to daylight I would guess that these slower changes have technical reasons such as diffusion excretion of a contrast agent. We cannot really tell what happens there but for a more detailed analysis it might be a good idea to analyse time 75 separately. And let s just plot one image to see what we re working with As can be seen in the dataset description this is a section of mouse brain. We can now look at some images separated by 12 hours and see if the light intensity varies as expected This does indeed show some day night variation but it also shows how the vertical line in the middle becomes gradually more intense maybe explaining the linear trend we subtracted previously. In this notebook we will just apply a high pass filter when needed. Looking at a few of them we see that they vary greatly in amplitude but the period seems to be correct. In this notebook we have explored some basic properties. Compare the smaller regions We now divide the area into smaller squares to see what the local period is. As will be seen in the section below there is still much noise artifact in the data which would confuse our simple functions even with the filters on. ", "id": "toregil/seeing-the-light-v2", "size": "3739", "language": "python", "html_url": "https://www.kaggle.com/code/toregil/seeing-the-light-v2", "git_url": "https://www.kaggle.com/code/toregil/seeing-the-light-v2", "script": "numpy matplotlib.pyplot filtered_acorr sklearn.linear_model get_grid_periods uniform_filter # to smooth images remove_linear_trend subprocess check_output LinearRegression get_period scipy.ndimage.filters ", "entities": "(('above regions', 'period'), 'suggest') (('it', 'good time'), 'tell') (('we', 'analysis'), 'mean') (('light sensitive neurons', 'else 24 hours'), 'doesn') (('them', 'scikit learn'), 'reshape') (('you', 'image ten hour'), 'learn') (('them', 'day night cycle'), 'cause') (('this', 'mouse brain'), 'let') (('We', 'later use'), 'collect') (('goal', 'time'), 'correspond') (('we', 'linear regression'), 'use') (('local period', 'smaller squares'), 'compare') (('period', 'close to 25 periphery'), 'suggest') (('slower changes', 'contrast agent'), 'see') (('we', 'time'), 'intensity') (('dataset', 'certain neurons'), 'look') (('we', 'gradually more linear trend'), 'look') (('two bright ovals', 'suprachiasmatic vertical top'), 'be') (('optic nerve', 'bottom'), 'be') (('we', 'pass just high filter'), 'apply') (('easily period', 'really 24 23 hours'), 'be') (('this', 'several reasons'), 'be') (('Autocorrelation', '24 hours'), 'give') (('dominant period', 'whole dataset'), 'be') (('we', 'basic properties'), 'explore') (('We', 'subregions'), 'collect') (('how mean intensity', 'time'), 'plot') (('period', 'greatly amplitude'), 'see') (('We', 'late week'), 'see') (('graph', '40 hours'), 'see') (('even filters', 'simple functions'), 'be') ", "extra": ""}