{"name": "stage1 eda microscope image types clustering ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "com nhargan defining microscopy type. KMeans to split images by 3 types based on dominant HSV colors distributions Plot some examples for each cluster. It starts from this interesting thread https www. It looks we have the following breakdown fluorescent 81. read_csv Drop alpha which is not used Get image width height and count masks available. com c data science bowl 2018 discussion 47640 about image types. Functions to load images. Centroids provide dominant colors based on provided colorspace. More details here https www. It can complete this other kernel https www. com 2014 05 26 opencv python k means color clustering. Some examples of cluster 0 fluorescent images Some examples of cluster 1 histological slides Some examples of cluster 2 bright field images Plot some images with masks linear algebra data processing CSV file I O e. Load stage 1 image identifiers. grab the number of different clusters and create a histogram based on the number of pixels assigned to each cluster normalize the histogram such that it sums to one. Group A are histological slides group B are fluorescent images and group C are bright field images. We keep only RGB channels as Alpha channel is always empty. This notebook provides additional information about stage1_train dataset that should help to balance into train valid for cross validation. Run KMeans on each image. ", "id": "mpware/stage1-eda-microscope-image-types-clustering", "size": "1156", "language": "python", "html_url": "https://www.kaggle.com/code/mpware/stage1-eda-microscope-image-types-clustering", "git_url": "https://www.kaggle.com/code/mpware/stage1-eda-microscope-image-types-clustering", "script": "get_images_details display_image_masks textwrap wrap seaborn numpy matplotlib.pyplot read_image_labels sklearn.cluster sklearn.preprocessing get_domimant_colors KMeans pandas read_image plot_images image_ids_in StandardScaler plot_image_masks ", "entities": "(('examples', 'algebra data processing CSV file'), 'image') (('It', 'thread https interesting www'), 'start') (('KMeans', 'cluster'), 'plot') (('such it', 'one'), 'grab') (('It', 'kernel https other www'), 'complete') (('we', 'following breakdown fluorescent'), 'look') (('that', 'cross validation'), 'provide') (('count masks', 'image width height'), 'alpha') (('Alpha channel', 'RGB only channels'), 'keep') (('Centroids', 'provided colorspace'), 'provide') (('com', 'python color k clustering'), 'mean') ", "extra": ""}