{"name": "starter camelyon16 cancer wsi list b74d9f33 f ", "full_name": " h2 Introduction h2 Exploratory Analysis h3 Let s check 1st file input camelyon16 train tumor 002 csv h3 Let s check 2nd file input camelyon16 train tumor 003 csv h3 Let s check 3rd file input camelyon16 train tumor 004 csv h2 Conclusion ", "stargazers_count": 0, "forks_count": 0, "description": "This will create a copy of the code and environment for you to edit. Hey I m just a simple kerneling bot not a Kaggle Competitions Grandmaster There are 40 csv files in the current version of the dataset The next hidden code cells define functions for plotting data. Now you re ready to read in the data and use the plotting functions to visualize the data. csvLet s take a quick look at what the data looks like Distribution graphs histogram bar graph of sampled columns ConclusionThis concludes your starter analysis To go forward from here click the blue Fork Notebook button at the top of this kernel. csv has 2377 rows in reality but we are only loading previewing the first 1000 rows. csvLet s take a quick look at what the data looks like Distribution graphs histogram bar graph of sampled columns Let s check 3rd file. read_csv Distribution graphs histogram bar graph of column data For displaying purposes pick columns that have between 1 and 50 unique values Correlation matrix drop columns with NaN keep columns where there are more than 1 unique values Scatter and density plots keep only numerical columns Remove rows and columns that would lead to df being singular keep columns where there are more than 1 unique values reduce the number of columns for matrix inversion of kernel density plots specify None if want to read whole file specify None if want to read whole file camelyon16_train_tumor_003. input camelyon16_train_tumor_002. Depending on the data not all plots will be made. input camelyon16_train_tumor_004. Exploratory AnalysisTo begin this exploratory analysis first import libraries and define functions for plotting the data using matplotlib. Delete modify and add code as you please. Click on the Code button in the published kernel to reveal the hidden code. If you re inspired to dig deeper click the blue Fork Notebook button at the top of this kernel to begin editing. csvLet s take a quick look at what the data looks like Distribution graphs histogram bar graph of sampled columns Let s check 2nd file. csv has 1122 rows in reality but we are only loading previewing the first 1000 rows specify None if want to read whole file camelyon16_train_tumor_004. IntroductionGreetings from the Kaggle bot This is an automatically generated kernel with starter code demonstrating how to read in the data and begin exploring. Let s check 1st file. input camelyon16_train_tumor_003. Happy Kaggling plotting linear algebra accessing directory structure data processing CSV file I O e. ", "id": "kerneler/starter-camelyon16-cancer-wsi-list-b74d9f33-f", "size": "1652", "language": "python", "html_url": "https://www.kaggle.com/code/kerneler/starter-camelyon16-cancer-wsi-list-b74d9f33-f", "git_url": "https://www.kaggle.com/code/kerneler/starter-camelyon16-cancer-wsi-list-b74d9f33-f", "script": "Axes3D plotPerColumnDistribution plotScatterMatrix numpy matplotlib.pyplot plotCorrelationMatrix mpl_toolkits.mplot3d sklearn.preprocessing pandas StandardScaler ", "entities": "(('you', 'Delete code'), 'modify') (('Fork Notebook deeper blue button', 'kernel'), 'click') (('plots', 'data'), 'make') (('code next hidden cells', 'data'), 'm') (('where more than 1 unique values', 'whole file'), 'pick') (('we', 'whole file'), 'have') (('Now you', 'data'), 're') (('Exploratory AnalysisTo', 'matplotlib'), 'begin') (('This', 'how data'), 'IntroductionGreetings') (('s', '2nd file'), 'take') (('starter analysis', 'kernel'), 'take') (('we', 'only first 1000 rows'), 'have') (('s', '3rd file'), 'take') (('you', 'code'), 'create') ", "extra": ""}