{"name": "tissue detected dataset ", "full_name": " h1 Processed on level 1 image Intermediate Resolution h1 Processed on level 2 image Lowest Resolution h1 Making Dataset h1 Statistics ", "stargazers_count": 0, "forks_count": 0, "description": "Thanks Zac Dannelly for your amazing kernel. pdfWonderFul code by Zac Dannelly. As mentioned in the comments of Zac s kernel resizing images can lead to deformations which are undesired. Processed on level 1 image Intermediate Resolution Processed on level 2 image Lowest Resolution Making Dataset Statistics All imports Set up example slide and run pipeline on low resolution For timing Convert from RGB to HSV color space Compute optimal threshold values in each channel using Otsu algorithm Make mask boolean For timing Open Small Slide Get returns from detect_tissue ons mall image Get minimal bounding rectangle for all tissue contours Open Big Slide Get small boudning rect and scale Scale Rectagle to larger image Crop bigger image with getSubImage Cut out white Get returns from detect_tissue on small image Get size change Set up dictionary for plotting Add Base Slide to verbose print Add Tissue Only to verbose print Add Larger Plot cut with bounding boxes Add Bounding Boxes to verbose print Remove by row Remove by col Get intermediate slide Create mask where white is what we want black otherwise Draw filled contour in mask Extract out the object and place into output image if read with PIL RGB turns into BGR. Thanks to Nanashi for telling about SPP. Here is the SPP paper https arxiv. Please upvote his kernel. com iafoss panda 16x128x128 tiles. I removed the resize part and adjusted the code to work. I ll try to use Spatial Pyramid Pooling layer to account for different shape inputs during training. Note that I haven t used tiles. This kernel is inspired from this kernel http https www. So here I dont resize the images and save the images in the same shape as they are. Code for making dataset is taken from iafosss s kernel http https www. com dannellyz tissue detect scaling bounding boxes 4xfaster. ", "id": "virajbagal/tissue-detected-dataset", "size": "985", "language": "python", "html_url": "https://www.kaggle.com/code/virajbagal/tissue-detected-dataset", "git_url": "https://www.kaggle.com/code/virajbagal/tissue-detected-dataset", "script": "otsu_filter new_detect_and_crop getSubImage plot_figures numpy matplotlib.pyplot skimage morphology tqdm.notebook detect_tissue_external tissue_cutout pandas get_disk_size tqdm color_cut ", "entities": "(('I', 'code'), 'remove') (('which', 'deformations'), 'lead') (('I', 'training'), 'try') (('otherwise Draw', 'BGR'), 'process') (('they', 'same shape'), 'resize') (('com dannellyz tissue', 'bounding boxes scaling 4xfaster'), 'detect') (('kernel', 'kernel http https www'), 'inspire') (('Code', 'kernel http https www'), 'take') ", "extra": ""}