{"name": "tissue detect td conv png 512x512 ", "full_name": " h1 Tissue Detect PNG 512x512 Pre Process h1 Data h1 To save on commit time and processing I only process 5 images here ", "stargazers_count": 0, "forks_count": 0, "description": "com dannellyz tissue detect scaling bounding boxes 4xfaster 4x speed increase to base notebook Tissue Dection Metadata Analysis https www. com dannellyz panda preprocessing tissue detection available as well. Base Notebook https www. DataAdditionally I have made the pre processed images https www. com a 11172032 Set up example slide. jpeg attachment tissue_logo. com dannellyz tissue detect td conv png 512x512 Notebook to export images to zip file Scaling Bounding Boxes https www. jpeg Tissue Detection is a key aspect to research in the domain of computer vision applied to cancer classification. All imports For timing Get a downsample of the whole slide image to fit in memory Convert from RGB to HSV color space Compute optimal threshold values in each channel using Otsu algorithm Make mask boolean https stackoverflow. com xhlulu panda resize and save train data To save on commit time and processing I only process 5 images here. com dannellyz tissue detection bounding box metadata eda viz Exploring features from bounding boxes discovery on the slides Tissue Detect PNG 512x512 Pre ProcessThis notebook creates a pipeline for the work done in more explanatory notebook Tissue Detection and Size Optimization 70 Shrink https www. Notebooks in this collection include the following. I have additionally added some timing locaitons for performance improvement work. com xhlulu and thier notebook PANDA Resize and Save Train Data https www. I combine all of the code into one block below. com dannellyz tissue detection and size optimization 70 shrink. My main focus in this competition so far has been exploring previous work done in this domain and furthering its application towards this dataset. com dannellyz panda tissue detection size optimization 70 Tissue Detection Intro and First Application Base Dataset Generation Currently Here https www. I am following the lead of xhlulu https www. com a 28759496 Create mask where white is what we want black otherwise Draw filled contour in mask Extract out the object and place into output image For timing Open Slide Get returns from detect_tissue Get Tissue Only Slide Get minimal bounding rectangle for all tissue contours Crop with getSubImage Crop empty space Remove by row Remove by column Get size change Set up dictionary for plotting Add Base Slide to verbose print Add Tissue Only to verbose print Add Bounding Boxes to verbose print Add Space Cut Boxes to verbose print https stackoverflow. ", "id": "dannellyz/tissue-detect-td-conv-png-512x512", "size": "1791", "language": "python", "html_url": "https://www.kaggle.com/code/dannellyz/tissue-detect-td-conv-png-512x512", "git_url": "https://www.kaggle.com/code/dannellyz/tissue-detect-td-conv-png-512x512", "script": "getSubImage multiprocess morphology numpy detect_and_crop detect_tissue draw_tissue_polygons plot_figures skimage matplotlib.pyplot tqdm.notebook pandas make_images tqdm otsu_filter Pool tissue_cutout statistics get_disk_size mean ", "entities": "(('I', 'xhlulu https www'), 'follow') (('jpeg Tissue Detection', 'cancer classification'), 'be') (('I', 'only 5 images'), 'process') (('main focus', 'dataset'), 'explore') (('DataAdditionally I', 'images https pre processed www'), 'make') (('com dannellyz panda', 'tissue detection'), 'available') (('com dannellyz tissue', 'zip file Scaling Bounding Boxes https www'), 'detect') (('Notebooks', 'following'), 'include') (('I', 'performance improvement work'), 'add') (('I', 'one block'), 'combine') (('ProcessThis notebook', 'more explanatory notebook'), 'detection') (('com dannellyz tissue', 'notebook Tissue Dection Metadata Analysis https www'), 'detect') (('Crop empty Remove', 'Add Space Cut print https stackoverflow'), 'com') (('imports', 'mask https boolean stackoverflow'), 'get') ", "extra": ""}