{"name": "topic 1 exploratory data analysis with pandas ", "full_name": " h2 mlcourse ai Open Machine Learning Course h1 Topic 1 Exploratory data analysis with Pandas h2 Article outline h2 1 Demonstration of main Pandas methods h3 Sorting h3 Indexing and retrieving data h3 Applying Functions to Cells Columns and Rows h3 Grouping h3 Summary tables h3 DataFrame transformations h2 2 First attempt at predicting telecom churn h2 3 Assignments h3 Demo version h3 Bonus version h2 4 Useful resources h2 Support course creators ", "stargazers_count": 0, "forks_count": 0, "description": "With this same method we can easily see if there are any missing values. Boolean indexing with one column is also very convenient. and columns correspond to features of these instances. DataFrames are great for representing real data rows correspond to instances examples observations etc. Free use is permitted for any non commercial purpose. Let s construct another contingency table that relates Churn with both International plan and freshly created Many_service_calls. And of course pivot tables are implemented in Pandas the pivot_table method takes the following parameters values a list of variables to calculate statistics for index a list of variables to group data by aggfunc what statistics we need to calculate for groups ex. Finally one or several functions are applied to the obtained groups per selected columns. The result of such indexing is the DataFrame consisting only of rows that satisfy the P condition on the Name column. ipynb a tutorial by Max Plako within mlcourse. com open machine learning course open machine learning course topic 1 exploratory data analysis with pandas de57880f1a68 based on this notebook If you read Russian an article https habrahabr. The former is a one dimensional indexed array of some fixed data type. html Pandas cheatsheet PDF https github. ai tutorials Handle different dataset with dask and trying a little dask ML https nbviewer. org pandas docs stable index. And a lecture https youtu. Useful resources 1. Let s recap what we ve covered The share of loyal clients in the sample is 85. Then columns of interest are selected columns_to_show. org licenses by nc sa 4. First attempt at predicting telecom churn 2. org github Yorko mlcourse. com pandas dev pandas blob master doc cheatsheet Pandas_Cheat_Sheet. For categorical type object and boolean type bool features we can use the value_counts method. com watch v QKTuw4PNOsU list PLVlY_7IJCMJeRfZ68eVfEcu UcN9BbwiX Official Pandas documentation http pandas. 5 per se then possibly we are doing something wrong and it suffices to confine ourselves to a simple model with two conditions Before training complex models it is recommended to manipulate the data a bit make some plots and check simple assumptions. org is a Python library that provides extensive means for data analysis. Therefore predicting that a customer is not loyal Churn 1 in the case when the number of calls to the service center is greater than 3 and the International Plan is added and predicting Churn 0 otherwise we might expect an accuracy of 85. Lambda functions are very convenient in such scenarios. Now let s try printing out column names using columns We can use the info method to output some general information about the dataframe bool int64 float64 and object are the data types of our features. The inplace argument tells whether to change the original DataFrame. There are dozens of cool tutorials on Pandas and visual data analysis. com kashnitsky topic 1 exploratory data analysis with pandas Merging DataFrames with pandas https nbviewer. As we move on in this course recall that before the advent of machine learning the data analysis process looked something like this. The syntax is df P df Name where P is some logical condition that is checked for each element of the Name column. Let s have a look at data dimensionality feature names and feature types. If you are already familiar with these topics you can wait for the 3rd article in the series where we get into machine learning. First attempt at predicting telecom churn 3. First the groupby method divides the grouping_columns by their values. com kashnitsky a1 demo pandas and uci adult dataset where you ll be analyzing socio demographic data. Pandas http pandas. Let s have a look at the distribution of Churn 2850 users out of 3333 are loyal their Churn value is 0. Subsequently we ll talk about decision trees and figure out how to find such rules automatically based only on the input data We got these two baselines without applying machine learning and they ll serve as the starting point for our subsequent models. 0 https creativecommons. ai course repo https github. Let s use it to answer the question What are average values of numerical features for churned users How much time on average do churned users spend on the phone during daytime What is the maximum length of international calls among loyal users Churn 0 who do not have an international plan DataFrames can be indexed by column name label or row name index or by the serial number of a row. For example if we need to select all states starting with W we can do it like this The map method can be used to replace values in a column by passing a dictionary of the form old_value new_value as its argument The same thing can be done with the replace method GroupingIn general grouping data in Pandas works as follows pythondf. Next let s look at another important feature Customer service calls. Here there are none because each column contains 3333 observations the same number of rows we saw before with shape. groupby by grouping_columns columns_to_show. They become a new index in the resulting dataframe. max_rows 100 Recall that each row corresponds to one client an instance and columns are features of this instance. com ods_mlcourse details are outlined on the mlcourse. html tutorials on pandas numpy matplotlib and scikit learn Support course creatorsYou can make a monthly Patreon or one time Ko Fi donation. be dEFxoyJhm3Y on YouTube 10 minutes to pandas http pandas. If it turns out that with enormous effort we increase the share of correct answers by 0. This material is subject to the terms and conditions of the Creative Commons CC BY NC SA 4. 5 is actually quite bad for a company such a churn rate can make the company go bankrupt. Bonus versionYou can also choose a Bonus Assignments tier https www. Let s read the data using read_csv and take a look at the first 5 lines using the head method About printing DataFrames in Jupyter notebooksIn Jupyter notebooks Pandas DataFrames are printed as these pretty tables seen above while print df. In conjunction with Matplotlib and Seaborn Pandas provides a wide range of opportunities for visual analysis of tabular data. First attempt at predicting telecom churnLet s see how churn rate is related to the International plan feature. com in christinabutsko Yuanyuan Pao https www. We see that with International Plan the churn rate is much higher which is an interesting observation Perhaps large and poorly controlled expenses with international calls are very conflict prone and lead to dissatisfaction among the telecom operator s customers. com in anastasiamanokhina Sergey Isaev and Artem Trunov https www. Demonstration of main Pandas methods 1. Useful resources The same notebook as an interactive web based Kaggle Notebook https www. SortingA DataFrame can be sorted by the value of one of the variables i. We ll demonstrate the main methods in action by analyzing a dataset https bigml. sum mean maximum minimum or something else. ai main page and get a non demo version of the assignment where the history of Olympic Games is analyzed with Pandas. If we need the first or the last line of the data frame we can use the df 1 or df 1 construct Applying Functions to Cells Columns and Rows To apply functions to each column use apply The apply method can also be used to apply a function to each row. Moreover in business applications of machine learning they usually start with simple solutions and then experiment with more complex ones. Assignments Demo versionTo practice with Pandas and EDA you can complete this demo assignment https www. To do this specify axis 1. That is the proportion of correct answers accuracy of subsequent models should be no less than this number and will hopefully be significantly higher With the help of a simple forecast that can be expressed by the following formula International plan True Customer Service calls 3 Churn 1 else Churn 0 we can expect a guessing rate of 85. com in yuanyuanpao Anastasia Manokhina https www. com guipsamora pandas_exercises and Effective Pandas https github. In order to see statistics on non numerical features one has to explicitly indicate data types of interest in the include parameter. ai and YouTube channel https www. com with the same material. Let s use this to answer a question about that column alone what is the proportion of churned users in our dataframe 14. ai blob master jupyter_english tutorials dask_objects_and_little_dask_ml_tutorial_iknyazeva. html Course materials as a Kaggle Dataset https www. To get a single column you can use a DataFrame Name construction. ru company ods blog 322626 on Habr. We see that one feature is logical bool 3 features are of type object and 16 features are numeric. Now let s add a binary feature to our DataFrame Customer service calls 3. Useful resources 4. If columns_to_show is not included all non groupby clauses will be included. ai blob master jupyter_english tutorials merging_dataframes_tutorial_max_palko. 8 that we got through this very simple reasoning serves as a good starting point baseline for the further machine learning models that we will build. From the output we can see that the table contains 3333 rows and 20 columns. ai full list of tutorials is here https mlcourse. The main data structures in Pandas are implemented with Series and DataFrame classes. We can change the column type with the astype method. The loc method is used for indexing by name while iloc is used for indexing by number. 8 which is just above 85. The latter is a two dimensional data structure a table where each column contains data of the same type. Data scientists often work with data stored in table formats like. Pandas makes it very convenient to load process and analyze such tabular data using SQL like queries. com kashnitsky a1 demo pandas and uci adult dataset solution. In the first case below we say give us the values of the rows with index from 0 to 5 inclusive and columns labeled from State to Area code inclusive. ai Open Machine Learning Course Author Yury Kashnitsky https yorko. pdf GitHub repos Pandas exercises https github. Let s also make a summary table and a picture. com user francisco gallery dataset 5163ad540c0b5e5b22000383 on the churn rate of telecom operator clients. To do so we can build a contingency table using the crosstab method We can see that most of the users are loyal and do not use additional services International Plan Voice mail. With inplace True it alters the DataFrame. ai Main course site https mlcourse. For example we can sort by Total day charge use ascending False to sort in descending order We can also sort by multiple columns Indexing and retrieving dataA DataFrame can be indexed in a few different ways. We ll do this using a crosstab contingency table and also through visual analysis with Seaborn however visual analysis will be covered more thoroughly in the next article. com kashnitsky mlcourse Medium story https medium. With inplace False the drop method doesn t change the existing DataFrame and returns a new one with dropped rows or columns. This will resemble pivot tables to those familiar with Excel. Exploratory data analysis with Pandas Article outline1. By default Pandas displays 20 columns and 60 rows so if your DataFrame is bigger use the set_option function as shown in the example below pythonpd. The most naive model that always predicts a loyal customer on such data will guess right in about 85. Although it s not so obvious from the summary table it s easy to see from the above plot that the churn rate increases sharply from 4 customer service calls and above. Let s take a look at the average number of day evening and night calls by area code DataFrame transformationsLike many other things in Pandas adding columns to a DataFrame is doable in many ways. For example if we want to calculate the total number of calls for all users let s create the total_calls Series and paste it into the DataFrame It is possible to add a column more easily without creating an intermediate Series instance To delete columns or rows use the drop method passing the required indexes and the axis parameter 1 if you delete columns and nothing or 0 if you delete rows. Demonstration of main Pandas methodsWell. To calculate fractions pass normalize True to the value_counts function. And once again let s see how it relates to churn. ipynb a tutorial by Irina Knyazeva within mlcourse. org pandas docs stable 10min. The assignment is just for you to practice and goes with solution https www. com TomAugspurger effective pandas scipy lectures. You can see it as a dictionary of Series instances. In the second case we say give us the values of the first five rows in the first three columns as in a typical Python slice the maximal value is not included. Here is an example where we group the data according to the values of the Churn variable and display statistics of three columns in each group Let s do the same thing but slightly differently by passing a list of functions to agg Summary tablesSuppose we want to see how the observations in our sample are distributed in the context of two variables Churn and International plan. head is less nicely formatted. Let s apply this method to the Churn feature to convert it into int64 The describe method shows basic statistical characteristics of each numerical feature int64 and float64 types number of non missing values mean standard deviation range median 0. Demonstration of main Pandas methods 2. Translated and edited by Christina Butsko https www. 8 we are mistaken only 464 9 times. ", "id": "kashnitsky/topic-1-exploratory-data-analysis-with-pandas", "size": "15609", "language": "python", "html_url": "https://www.kaggle.com/code/kashnitsky/topic-1-exploratory-data-analysis-with-pandas", "git_url": "https://www.kaggle.com/code/kashnitsky/topic-1-exploratory-data-analysis-with-pandas", "script": "seaborn pandas numpy matplotlib.pyplot ", "entities": "(('columns', 'instances'), 'correspond') (('com kashnitsky a1', 'adult dataset solution'), 'demo') (('DataFrames', 'etc'), 'be') (('3 1 else 0 we', '85'), 'be') (('it', 'simple assumptions'), 'do') (('data main structures', 'Series classes'), 'implement') (('it', 'DataFrame'), 'alter') (('s', 'also summary table'), 'let') (('they', 'subsequent models'), 'talk') (('that', 'right about 85'), 'guess') (('logical that', 'Name column'), 'be') (('sum', 'maximum minimum'), 'mean') (('just you', 'solution https www'), 'be') (('60 DataFrame', 'pythonpd'), 'display') (('Bonus versionYou', 'Bonus Assignments tier https also www'), 'choose') (('where history', 'Pandas'), 'ai') (('iloc', 'number'), 'use') (('churn how rate', 'plan International feature'), 'see') (('Jupyter notebooks Pandas Jupyter notebooksIn DataFrames', 'pretty tables'), 'let') (('com user francisco gallery', 'telecom operator clients'), 'dataset') (('We', 'astype method'), 'change') (('Finally one functions', 'selected columns'), 'apply') (('We', 'data features'), 'let') (('SortingA DataFrame', 'variables'), 'sort') (('churn rate', 'customer service sharply 4 calls'), 's') (('you', 'rows'), 'for') (('Now s', '3'), 'let') (('Python that', 'data analysis'), 'be') (('We', 'more thoroughly next article'), 'do') (('much which', 'telecom customers'), 'see') (('material', 'NC SA'), 'be') (('that', 'International plan'), 'let') (('ai tutorials', 'dask ML https little nbviewer'), 'handle') (('maximal value', 'Python typical slice'), 'say') (('drop method doesn', 'dropped rows'), 'change') (('where column', 'same type'), 'be') (('0 otherwise we', '85'), 'predict') (('you', 'article https habrahabr'), 'com') (('one', 'include parameter'), 'have') (('Churn value', '3333'), 'let') (('You', 'Series instances'), 'see') (('table', '3333 rows'), 'see') (('Boolean indexing', 'one column'), 'be') (('most', 'International Plan Voice mail'), 'build') (('They', 'new resulting dataframe'), 'become') (('ai', 'full tutorials'), 'be') (('pdf GitHub repos Pandas', 'https github'), 'exercise') (('Official Pandas PLVlY_7IJCMJeRfZ68eVfEcu documentation', 'pandas'), 'watch') (('apply method', 'row'), 'apply') (('many other things', 'many ways'), 'let') (('we', 'same method'), 'see') (('16 features', 'type object'), 'see') (('former', 'data one dimensional indexed fixed type'), 'be') (('inplace argument', 'original DataFrame'), 'tell') (('DataFrames', 'row'), 'let') (('it', 'queries'), 'make') (('Then columns', 'interest'), 'select') (('Data scientists', 'table formats'), 'work') (('we', '0'), 'turn') (('we', 'groups ex'), 'implement') (('advent', 'this'), 'recall') (('basic statistical characteristics', 'deviation range standard median'), 'let') (('Next s', 'feature Customer service important calls'), 'let') (('they', 'then more complex ones'), 'start') (('how observations', 'two variables'), 'be') (('we', 'Area'), 'say') (('Lambda functions', 'very such scenarios'), 'be') (('This', 'familiar Excel'), 'resemble') (('com ods_mlcourse details', 'mlcourse'), 'outline') (('First attempt', 'telecom'), 'churn') (('We', 'https dataset bigml'), 'demonstrate') (('dataA DataFrame', 'a few different ways'), 'sort') (('instance columns', 'instance'), 'max_rows') (('grouping GroupingIn general data', 'pythondf'), 'do') (('alone proportion', 'dataframe'), 'let') (('company', 'actually quite company'), 'be') (('you', 'demo assignment https www'), 'practice') (('ve share', 'sample'), 'let') (('where you', 'socio demographic data'), 'demo') (('Free use', 'non commercial purpose'), 'permit') (('groupby First method', 'values'), 'divide') (('where we', 'machine learning'), 'be') (('s', 'data dimensionality feature names'), 'let') (('we', 'that'), 'serve') (('you', 'DataFrame Name construction'), 'get') (('that', 'Name column'), 'be') (('type bool boolean we', 'value_counts method'), 'use') (('Support creatorsYou', 'monthly Patreon'), 'numpy') (('we', 'before shape'), 'be') ", "extra": ""}