{"name": "a very extensive kiva exploratory analysis ", "full_name": " h1 More To Come Stay Tuned h3 Problem Statement h2 Obtaining the data h2 Statistical Overview h2 Checking for missing data h2 Data Exploration h2 Distribution of sectors h2 Distribution of Activities h2 Distribution of repayment interval h2 Borrower Gender Female V S Male h2 Sex borrower V S Repayment intervals h2 Kiva Field partner name V S Funding count h2 Top Countries with funded amount Dollar value of loan funded on Kiva org h2 Top mpi regions with amount Dollar value of loans funded in particular LocationName h2 Popular loan sector and loan activity in terms of loan amount h3 Popular loan sector in terms of loan amount h3 Popular loan activity in terms of loan amount h2 Wordcloud for Country Names h2 Now check date column h3 Yearwise distribution of count of loan availed by each country h2 Sectors and Repayment Intervals correlation h2 country and Repayment Intervals correlation h2 Correlation Matrix and Heatmap h2 Term In Months V S Repayment Interval h2 Top 13 loan uses in India h1 Summary h1 More To Come Stay Tuned ", "stargazers_count": 0, "forks_count": 0, "description": "Repayment intervals bullet had taken more loan amount throught out the years. Summary Agriculture Sector is more frequent in terms of number of loans followed by Food. Wordcloud for Country Names Now check date columnRepayment intervals bullet had taken more loan amount throught out the years. There are more Females with monthly reapyment_interval than Males. Top Countries with funded_amount Dollar value of loan funded on Kiva. The average amount is funded more by Male than Female. Appreciate every ounce of help This notebook will always be a work in progress. Kiva Field partner name V. Number of lenders contributing to loan lender_count is 8 whose count is high followed by 7 and 9. If there are any suggestions changes you would like to see in the Kernel please let me know. Problem Statement For the locations in which Kiva has active loans our objective is to pair Kiva s data with additional data sources to estimate the welfare level of borrowers in specific regions based on shared economic and demographic characteristics. Distribution of Loan Activity type Top 2 loan activity which got more number of funded are Farming and general Store Distribution of Number of months over which loan was scheduled to be paid back 14 months over which loan was scheduled to be paid back have taken higher times followed by 8 and 11. Out of these Alalay sa Kaunlaran ASKI did higher number of funding followed by SEF International and Gata Daku Multi purpose Cooperative GDMPC. org follwed by Mauritania. country and Repayment Intervals correlation In the countries Kenya had taken only weely repayment interval. The average amount is funded more by Male than Female. Distribution of sectors Distribution of Activities Distribution of repayment_interval Borrower Gender Female V. 14 months over which loan was scheduled to be paid back have taken higher times followed by 8 and 11. Lender counts Distribution is highly Skewed. Top mpi_regions with amount Dollar value of loans funded in particular LocationName Top mpi_regions who got more funding is Itasy Madagascar followed by Kaduna Nigeria Popular loan sector and loan activity in terms of loan amount Popular loan sector in terms of loan amount Entertainment sector is taking more loan followed by Wholesale. Popular loan activity in terms of loan amount The most popular activities are Technology and Landscaping Gardening in terms of loans amount followed by Communications. Repayment_intervals There are more Females with monthly reapyment_interval than Males. If you like it or it helps you you can upvote and or leave a comment. Yearwise distribution of count of loan availed by each countryIn 2017 Cote D lvoire and Benin had taken more amount of loan and in 2016 South sudan had taken. Obtaining the data kiva_loans_data kiva_mpi_locations_data loan_theme_ids_data loan_themes_by_region_data Statistical Overviewkiva_loans_data some little infoLittle description of kiva_loans_data for numerical featuresLittle description of kiva_loans_data for categorical features Checking for missing data Missing data in kiva_loans data Missing data in kiva_mpi_locations data Missing data in loan_theme_ids data Missing data in loan_themes_by_region data Data Exploration Top sectors in which more loans were given Agriculture sector is very frequent followed by Food in terms of number of loans. Correlation Matrix and Heatmap As we can see loan_amount and funded_amount are highly correlated. In 2017 Cote D lvoire and Benin had taken more amount of loan and in 2016 South sudan had taken. 20 borrowers are Male. Types of interval payments monthly irregular bullet and weekly. Philippines is most frequent countries who got more loans followed by Kenya. 80 borrower are Female and approx. e Juba Tsihombe Musoma Cerrik Kolia Parakou and Simeulue are most popular regions who are taking more loans. Out of which monthly is more frequent and weekly is less frequent. Top 2 loan activity which got more number of funded are Farming and general Store. Popular regions locations within countries in terms of loan amount Regions locations within countries i. Out of 302 Kiva Field Partners Alalay sa Kaunlaran ASKI did higher number of funding followed by SEF International and Gata Daku Multi purpose Cooperative GDMPC. MaleAs we can see Approx. Entertainment sector is taking more loan followed by Wholesale. ie wp content uploads 2018 01 Best loan advisor in Rajkot3_adtubeindia. Top use of loan in india is to buy a smokeless stove followed by to expand her tailoring business by purchasing cloth materials and a sewing machine. Cote D lvoire is More popular country who is taking more amount of loans followed by Mauritania. In world region sub Saharan Africa got more number of loans. In the countries Kenya had taken only weely repayment interval. Europe and central Asia is least frequent world region. There are more Males with irregular reapyment_interval than Females. org Top country Cote D Ivoire which is more loan funded on Kiva. Regions locations within countries i. Funding count There are total 302 Kiva Field Partner. Types of repayment intervals Types of repayment interval Monthly More frequent irregular bullet weekly less frequent Most frequent countries who got loans Most frequent countries Philippines is most frequent countries who got more loans followed by Kenya Distribution of funded anount Distribution of loan amount Distribution of world regions A we can see sub Saharan Africa got more number of loans. Sectors and Repayment Intervals correlation Agriculture Sector had higher number of monthly repayment interval followed by food sector had higher irregilar repayment interval. Phillippines had higher number of monthly repayment interval than others. The most popular activities are Technology and Landscaping Gardening in terms of loans amount followed by Communications. Top mpi_regions who got more funding is Itasy Madagascar followed by Kaduna Nigeria More To Come. Please leave any comments about further improvements to the notebook Any feedback or constructive criticism is greatly appreciated. Repayment_IntervalRepayment Interval monthly having higher frequency than others repayment intervals Top 13 loan uses in India Top use of loan in india is to buy a smokeless stove followed by to expand her tailoring business by purchasing cloth materials and a sewing machine. package for high performance easy to use data structures and data analysis fundamental package for scientific computing with Python for plotting for making plots with seaborn Supress unnecessary warnings so that presentation looks clean Print all rows and columns checking missing data in kiva_loans data missing data in kiva_mpi_locations data missing data in loan_theme_ids data missing data in loan_themes_by_region data Occurance of landmark_id in decreasing order Top categories Plot the most frequent countries Distribution of funded anount Distribution of loan amount Distribution of world regions Distribution of lender count Number of lenders contributing to loan Distribution of Loan Activity type Distribution of Number of months over which loan was scheduled to be paid back Distribution of Kiva Field Partner Names with funding count Correlation Matrix. Popular countries in terms of loan amount Cote D lvoire is More popular country who is taking more amount of loans followed by Mauritania. ", "id": "codename007/a-very-extensive-kiva-exploratory-analysis", "size": "7779", "language": "python", "html_url": "https://www.kaggle.com/code/codename007/a-very-extensive-kiva-exploratory-analysis", "git_url": "https://www.kaggle.com/code/codename007/a-very-extensive-kiva-exploratory-analysis", "script": "plotly.tools seaborn numpy matplotlib.pyplot plotly.offline plotly.graph_objs WordCloud pandas wordcloud subprocess check_output ", "entities": "(('Gata Daku Multi', 'Cooperative GDMPC'), 'do') (('notebook', 'always progress'), 'appreciate') (('me', 'Kernel'), 'be') (('org Top Cote D which', 'more Kiva'), 'country') (('most frequent who', 'Kenya'), 'be') (('loan', 'back higher times 8'), 'take') (('date columnRepayment intervals Now bullet', 'years'), 'check') (('most popular activities', 'Communications'), 'be') (('Entertainment sector', 'Wholesale'), 'take') (('Top Countries', 'Kiva'), 'fund') (('Lender', 'Distribution'), 'count') (('loan', 'back higher times 8'), 'be') (('sub Saharan Africa', 'loans'), 'get') (('monthly', 'which'), 'be') (('average amount', 'Female'), 'fund') (('Phillippines', 'others'), 'have') (('ie', 'Rajkot3_adtubeindia'), 'upload') (('we', 'loan_amount'), 'correlate') (('Kenya', 'only weely repayment interval'), 'take') (('Repayment intervals bullet', 'years'), 'take') (('her', 'cloth materials'), 'have') (('loan', 'funding count Correlation Matrix'), 'package') (('More popular who', 'Mauritania'), 'be') (('Itasy Madagascar', 'Wholesale'), 'be') (('Sectors', 'repayment higher irregilar interval'), 'have') (('more loans', 'loans'), 'obtain') (('sub Saharan Africa', 'loans'), 'type') (('most popular who', 'more loans'), 'be') (('count', 'high 7'), 'be') (('who', 'Itasy Kaduna Nigeria'), 'be') (('Summary Agriculture Sector', 'Food'), 'be') (('you', 'comment'), 'help') (('objective', 'shared economic characteristics'), 'be') (('her', 'cloth materials'), 'be') (('most popular activities', 'Communications'), 'activity') (('which', 'funded'), 'be') (('feedback criticism', 'notebook'), 'leave') (('South sudan', '2016'), 'take') ", "extra": "['gender']"}