{"name": "an lise explorat ria de dados ", "full_name": " h2 O que será tratado no curso h2 Por que fazer EDA h1 1 Importação de bibliotecas e funções gerais usadas no caderno h1 2 Carga de dados h2 Dados de exemplo h2 Carrega dados para exercício h1 3 Obtendo informações gerais sobre os dados h2 Dados exemplo h2 Verificando dados ausentes h2 Contagem de valores categóricos ou numéricos h2 Estatísticas gerais h1 4 Visualização de Dados h2 Visualização usando Matplotlib ou Seaborn h1 4 1 Visualização Básica h1 4 2 Visualização para análise de dados h2 Plotar variável X índice h4 h2 Plotar variável X variável h1 Scatter plot h4 h2 Plotagem de variáveis categóricas h4 h2 Mosaico h4 h2 Histogramas h2 Histograma comparando dados de entrada com objetivo h2 Histogramas de treinamento e teste h4 h2 BoxPlot h4 h2 Correlações h4 h2 Coordenadas paralelas h4 h2 Visão 3D dos dados h4 h2 Imagens h3 Lista de colormaps h2 Contornos 2D h2 Contornos 3D h2 Wire Frame h2 Superfície h2 Barras 3D h2 Mapas h4 h2 Salvando e recuperando imagens h2 Nuvem de palavras h2 Radar Chart h2 Rede h1 Referências ", "stargazers_count": 0, "forks_count": 0, "description": "Rápida e fácil de usar. htmlhttps matplotlib. py Autor Shaked Zychlinski Conjunto completo Conjunto resumido para treinamento de modelos Cria variáveis para treinamento de modelos 1 benigno 0 maligno Estatísticas básicas Verificar mínimos e máximos para garantir se estão dentro dos limites esperados Verificar intervalo de variação da medida Verificar possíveis outliers Verificar tipos de dados Verificar nulos Verificar nulos Para listar dados nulos Observar a duplicidade de valores Dados para plotagem Seleciona local para plot Linha colorida Títulos Limites de plotagem Seleciona local para plot Linha gray scale Limites de plotagem plt. axis tight Limites de plotagem Títulos Anotações Torna legenda visívil Grid Rotaciona labels joinplot é limitado em argumentos preferencialmente usar scatter plot há porém a vantagem de apresentar as distribuições das variáveis em análise Train the model using the training sets Make predictions using the testing set The coefficients The mean squared error ax. But we need to repeat the first value to close the circular graph What will be the angle of each axis in the plot we divide the plot number of variable Initialise the spider plot Draw one axe per variable add labels labels yet Draw ylabels Plot data Fill area Build a dataframe with 4 connections Build your graph Plot it. use_inf_as_na True Contagem de valores categóricos ou numéricos Estatísticas geraisObservação sobre medidas de forma Curtose achatamento onde 0 caracteriza a normal maior que 0 representa afunilamento e menor que 0 achatamento e Assimetria skewness onde 0 caracteriza simetria maior que 0 caracteriza maior distribuição à direira e menor que 0 caracteriza maior distribuição à esquerda EXERCÍCIOFaça as análises acima para tips. html Para ter repetibilidade nos resultados Tratar valores infinitos como np. Somente variáveis numéricas Carrega dados para exercícioData set de gorgetas com variáveis categóricasDados sobre tumores somente informações numéricas http scikit learn. 2 Visualização para análise de dados Plotar variável X índicePode trazer informações interessantes de tendência se plotarmos variável X índice mesmo que não trabalhemos com séries temporais. com shakedzy dython blob master dython _private. Use value_counts para verificar os valores de target 4 Visualização de Dados Visualização usando Matplotlib ou Seaborn Matplotlib é a biblioteca mais usada para plotagem. Produz gráficos simples rapidamente e permite a criação de gráficos sofisticados. com blog 2016 12 19 Visualizing Multidimensional Data in Python https towardsdatascience. org mpl_toolkits mplot3d tutorial. org https matplotlib. html noqa F401 unused import setup the figure and axes fake data Carrega figura https www. pie benford radius 1 size colors outer_colors wedgeprops dict width size edgecolor w Histograma dos dados Correlação entre dados Correlação entre dados Correlação entre dados Correlação entre dados color r g b y w Visão 3D dos dados Visão 3D dos dados people people. competições Kaggle ou quando montamos nossas bases é importante verificar se pertencem a mesma distribuição EXERCÍCIO HistogramasPara tips e cancer_data realizar as seguintes análises Histograma dos dados Para cancer_data plotar histograma das variáveis de entrada separando cada gráfico em dois histogramas maligno e benigno BoxPlotExcelente ferramenta para análise de distribuições e outliers EXERCÍCIO BoxplotPara tips e cancer_data realizar as seguintes análises Boxplot dos dados No caso de tips boxplot de tip agrupado por time sex e smoker Correlações EXERCÍCIO CorrelaçõesPara tips e cancer_data realizar as seguintes análises Correlações heatmap entre dados numéricos de tips e cancer_data Coordenadas paralelas EXERCÍCIO Coordenadas paralelasPara tips e cancer_data realizar as seguintes análises Para cancer_data gráfico de coordenadas paralelas class_column target Visão 3D dos dados EXERCÍCIO Visão 3DPara tips e cancer_data realizar as seguintes análises Visão 3D de tips usando total_bill size e tip tamanho da bolha proporcional à tip Imagens Lista de colormapshttps matplotlib. com library view python data science 9781491912126 Visualização https python graph gallery. html 3 Obtendo informações gerais sobre os dados Dados exemplo Verificando dados ausentesDados ausentes são representados como np. 1 Visualização BásicaO mínimo necessário para o desenho de gráficoshttps www. NaNSão dados nulos ou não preenchidosA função isnull verifica se os dados existem True ou não False Há também a função isna que é idêntica a isnullCUIDADO além de dados nulos há também dados que tendem ao infinito inf ou inf fruto por exemplo de divisão por zero. org stable modules generated sklearn. Fazer joinplot com mesmas variáveis. 1 Importação de bibliotecas e funções gerais usadas no caderno 2 Carga de dados Dados de exemploWorld happiness report http worldhappiness. No mínimo verificaremos se os dados foram embaralhados EXERCÍCIO Plotar variável X índicePara tips e cancer_data plotar a variável objetivo X índice Plotar variável X variável Scatter plot EXERCÍCIO Plotar variável X variávelPara tips plotar tip X bill. org gallery mplot3d 3d_bars. com the art of effective visualization of multi dimensional data 6c7202990c57https www. com amueller word_cloud copiado de https python graph gallery. com library view python data science 9781491912126 ch04. com amueller introduction_to_ml_with_python pip install mglearn Configuração do número de linhas e colunas a serem apresentadas em listagens Função de conversão de dados copiada de https github. Para cancer_data plotar mean radius X mean compactness ajustando tamanho e cor por target Plotagem de variáveis categóricas EXERCÍCIO Plotagem de variáveis categóricasPara tips plotar na mesma figura gráficos de barras horizontais barras verticais pizza e área para total de tips por smoker day sex e time Mosaico EXERCÍCIO MosaicoPara tips cruzar day e smoker Histogramas Histograma comparando dados de entrada com objetivo Histogramas de treinamento e testeQuando recebemos bases de treinamento e teste já prontas ex. org tutorials introductory sample_plots. com community tutorials wordcloud python https github. Usando value_counts verifique os valores presentes nas variáveis categóricasEXERCÍCIOFaça as análises acima para cancer_data. Fazer scatter com as mesmas variáveis ajustando tamanho e cor por tip. NaN IMPORTANTE para tornar figuras interativas Tamanho padrão das figuras Verificação do local para carga de dados Bibliotecas específicas do livro Introduction to Machine Learning with Python https github. html Contornos 2D Contornos 3D Wire Frame Superfície Barras 3D MapasNecessário instalar biblioteca basemapconda install basemaphttps www. com 390 basic radar chart number of variable We are going to plot the first line of the data frame. Análise exploratória de dados Exploratory data analysis EDA Eduardo Chaves Ferreira O que será tratado no cursoO curso apresenta uma introdução à análise exploratória de dados EDA constituída por visualização análise estatística de dados Por que fazer EDA 1 Ter uma melhor compreensão dos dados2 Compreendendo estabelecer padrões3 Baseado nos padrões propor hipóteses e confirmá las ou não Algumas vezes não é necessário criar modelos de mineração a simples análise exploratória é suficiente para extrair as informações que buscamos. htmlSeaborn é uma biblioteca baseada na Matplotlib com recusrsos visuais mais sofisticados principalmente para análise estatística. html EXERCÍCIO MapasPlotar todas as capitais de municípios Salvando e recuperando imagens Nuvem de palavras Radar Chart Rede ReferênciasLivros usados como referência Introduction to Machine Learning with PythonPython Data Science Handbook https www. html tutorialUsaremos ambas no curso 4. Para que sejam considerados nulos usar pandas. images 0 linspace start stop num multiplica por 1 caso contrário imagem fica invertida meshgrid cria matriz bidimensional cruzando todos os valores de x com y X repete x tantas linhas quanto a dimensão de y usa log para atenuar profundidade das curvas Ângulo de visão superior e rotação da imagem Copiado de https matplotlib. ", "id": "educfrio/an-lise-explorat-ria-de-dados", "size": "6611", "language": "python", "html_url": "https://www.kaggle.com/code/educfrio/an-lise-explorat-ria-de-dados", "git_url": "https://www.kaggle.com/code/educfrio/an-lise-explorat-ria-de-dados", "script": "pandas.plotting sklearn.utils sklearn.metrics PCA statsmodels.graphics.mosaicplot mpl_toolkits.basemap parallel_coordinates MinMaxScaler shuffle r2_score collections mean_squared_error seaborn numpy scipy.stats sklearn.decomposition fetch_lfw_people linear_model networkx sklearn.model_selection sklearn Axes3D load_breast_cancer Image matplotlib.pyplot mpl_toolkits.mplot3d stats WordCloud pandas wordcloud Axes3D  # noqa: F401 unused import Basemap convert sklearn.datasets Counter pi mosaic scipy sklearn.preprocessing datasets radar_chart math train_test_split IPython.display preprocessing ", "entities": "(('mean', 'coefficients'), 'plotagem') (('radius mean compactness', 'de variáveis categóricas de categóricasPara tips Plotagem Plotagem plotar'), 'mean') (('bibliotecas e funções Importação de gerais', 'exemploWorld happiness report http caderno 2 Carga de dados Dados de worldhappiness'), '1') (('Visualização BásicaO mínimo 1 necessário', 'de gráficoshttps o desenho www'), 'para') (('tantas linhas', 'de y usa log para atenuar das dimensão curvas'), 'stop') (('Autor Shaked Zychlinski completo Conjunto resumido modelos Cria de variáveis', 'Verificar intervalo de variação'), 'py') (('tips e cancer_data Visão 3DPara seguintes', 'tips usando total_bill size e tip tamanho da bolha Visão 3D de proporcional'), 'bases') (('F401', 'figure'), 'unused') (('para dados Bibliotecas local carga de específicas', 'Python https github'), 'para') (('nos resultados Tratar', 'valores infinitos como np'), 'repetibilidade') (('com library', 'python data science'), 'view') (('Obtendo informações gerais 3 sobre', 'dados Dados exemplo Verificando dados representados como ausentesDados são np'), 'os') (('Fazer scatter mesmas variáveis', 'tamanho e cor por tip'), 'com') (('Draw Plot data Fill yet area', 'it'), 'need') (('padrões3 Baseado nos padrões propor e confirmá las Algumas', 'análise exploratória é para informações que necessário criar modelos de simples suficiente buscamos'), 'analysis') (('sobre medidas de forma Estatísticas geraisObservação Curtose', 'para tips'), 'categóricos') (('dados foram embaralhados EXERCÍCIO Plotar X índicePara tips e cancer_data plotar', 'variável X índice Plotar variável X variável Scatter EXERCÍCIO Plotar objetivo variável'), 'os') (('não False Há', 'que é idêntica isnullCUIDADO'), 'isnull') (('html Contornos 2D Contornos 3D Wire Frame Superfície Barras', '3D biblioteca basemaphttps MapasNecessário instalar www'), 'install') (('outer_colors', 'width size dict edgecolor'), 'radius') (('We', 'data frame'), 'com') (('sofisticados', 'para análise estatística'), 'baseada') (('os valores', 'análises'), 'presentes') ", "extra": "['test']"}