{"name": "analyzing the heart disease ", "full_name": " h3 HEART DISEASE ANALYSIS h3 CONTENT h2 If you like it please upvote h3 INTRODUCTION h3 DATASET COLUMNS FEATURE EXPLAIN h3 INVESTIGATING THE DATA and EXPLORATORY DATA ANALSIS h3 One Visualization to Rule Them All h3 Age Analysis h3 Sex Gender Analysis h3 Chest Pain Type Analysis h3 Age Range Analysis h3 Thalach Analysis h3 Thal Analysis h3 Target Analysis h3 MODEL TRAINING and TESTING h1 Logistic Regression h1 K Nearest Neighbors h1 Naive Baes h1 Gradient Boosting Machine h1 Random Forest h1 Decision Tree h1 Kernelized SVM h3 References h3 Conclusion ", "stargazers_count": 0, "forks_count": 0, "description": "com kralmachine pandas tutorial for beginnerhttps www. It is integer valued from 0 no presence to 4. Now we are going to analyze both the sex and the heart health situation. Now we are uploading our data set to the data variable using the read_csv function in the pandas library. The reason for this is that the parsing process between the data is better. Because it will be more effective in future analysis. so a new feature value can be removed from these age ranges will not affect this impact will see in the future. only two values are shown. com kralmachine football results from 1872 to 2018 datavisulationhttps www. The purpose of this value is to see the integration values between our data. In particular the Cleveland database is the only one that has been used by ML researchers to this date. If you want to get detailed information about python programming you can look at my account. The value of σ is the standard deviation. I install all the libraries in the first part because the algorithms I will use later and the analysis I will make more clearly will be done. μ is the average value. In addition we will analyze for this dataset. In this section we have used our new feature values. In this way how many missing data is in the data. all rows control for null values data age show value counts for age least 10 firstly find min and max ages Draw a categorical scatterplot to show each observation Plot the total crashes Sex 1 male 0 female Percentage ratios Male State target 1 0 Female State target 1 0 Plot miles per gallon against horsepower with other semantics As seen there are 4 types of chest pain. Thalach AnalysisThe analysis of the system we discussed in the case of maximum heart rate is shown. As is known most of our data are categorized and not categorized only among certain feature values. K Nearest NeighborsNaive BaesGradient Boosting Machine Random Forest Decision Tree Kernelized SVMReferenceshttps www. The transactions we perform in this section mean an average age. But in cases where chest pain is 1 it is observed that the area is more. But when it comes to advice and usage standard scaling comes out with a big difference. INTRODUCTIONThis database contains 76 attributes but all published experiments refer to using a subset of 14 of them. determine the age ranges of patients with and without sickness and make analyzes about them now draw show on graph Target 1 0 show graph on scatter Let s see how the correlation values between them Normalization as the first process Normalize. Target AnalysisWe will analyze this feature for people who are sick or not. different values should be given as parameters to change these values. We have shown the P value. The difference in value between our data is too big. 0 status at least 1 condition slightly distressed 2 condition medium problem 3 condition too bad Show the results of a linear regression within each dataset First show 20 rows As shown in this graph this rate decreases as the heart rate is faster and in old age areas. As a result of this operation the data takes a value of 0. The reduced data can be seen on the plotting below. The aim here is to normalize the smallest value to 0 and the maximum value to 1 and all other data is a value between 0 1. Python Programming for Beginner https www. All other data is normalized according to these values. These are logistic regression support vector machine SVM k close neighborhood kNN GradientBoostingClassifier and RandomForestClassifier algorithms. Chest Pain Type AnalysisA wide range of chest pain is present in cases of heart failure. If the number is close to 1. As seen in this graph it is seen that the heart rate is less when the chest pain is low. Furthurmore I have investigated the data presented some visualization and analysed features. As seen in this section most values are generally categorized. In this section the rate of disease is seen less when the gender value is male. If you like UPVOTED I would be very happy if you do. Likewise data points with greater values on the y axis represent the customers that are less likely to spend to Fresh and Frozen categories. 1 showed a distribution of 18. Thus the p value process determines a hypothesis and a hypothesis thesis is presented between each characteristic according to this hypothesis. This technique is used to express different features in the process. Thal Analysis3 normal 6 fixed defect 7 reversable defectAccording to the analysis Thal values are observed. sigma resimTheoretically it is understood that there is no big difference between standard and normalization. 2019If you like it please upvote. This may change in some scaling operations. Of these values 0 is only 2. But before that I will investigate the explained variance ratio and resulting principal components So I will apply PCA to the data with number of components 8. What is important here is that these numbers are not close to 1. That doesn t mean much to us. com kralmachine gradient admission eda ml 0 92https www. In the above analysis the gender of people who are female is more common. There is a big change between the data obtained. Target 1 so Apparently there is a rate at Thal 2. In addition we created a combination of features between different features to make different experiments. There are many scale operations for this. Using this function count mean std min max 25 50 75. As you can see we are making a single clue of the columns that the data set contains. These are as follows. com biphili seaborn plot to visualize iris datahttps www. I will import necessary Python modules and read the data. A value of 1 is the value of patient 0. com kralmachine kernelsDATASET COLUMNS FEATURE EXPLAIN Age age in years Sex 1 male 0 female CP chest pain type TRESTBPS resting blood pressure in mm Hg on admission to the hospital CHOL serum cholestoral in mg dl FPS fasting blood sugar 120 mg dl 1 true 0 false RESTECH resting electrocardiographic results THALACH maximum heart rate achieved EXANG exercise induced angina 1 yes 0 no OLDPEAK ST depression induced by exercise relative to rest SLOPE the slope of the peak exercise ST segment CA number of major vessels 0 3 colored by flourosopy THAL 3 normal 6 fixed defect 7 reversable defect TARGET 1 or 0 INVESTIGATING THE DATA and EXPLORATORY DATA ANALSISFirst I install all the libraries that I will use in our application. If there s value in there we il do it there. In this part taking the average of all transactions is performed. Both the head and tail functions have a value of 5 by default. com kralmachine seaborn tutorial for beginnersConclusionAs a result we have explained the seaborn library in a very detailed way and created a wide variety of graphs. Because we re going to do chest pain. Z score NormalizationIn a data set the data that are distant from each other are made to scale between each other by making a specific scaling. In this way comments about the properties can be madeAge AnalysisIn this section the best analysis can be divided into the elderly middle aged young people by looking at the age ranges. This is the situation that best describes the situation. While creating these parameters the process of finding the best results was made by giving hyper parameter values. HEART DISEASE ANALYSISCONTENT INTRODUCTION DATASET COLUMNS FEATURE EXPLAIN INVESTIGATING THE DATA and EXPLORATORY DATA ANALSIS One Visualization to Rule Them All Age Analysis Sex Gender Analysis Chest Pain Type Analysis Age Range Analysis Thalach Analysis Thal Analysis Target Analysis MODEL TRAINING and TESTING Logistic Regression K Nearest Neighbors Naive Bayes Decision Tree Random Forest Gradient Boosting Machine Kernelized SVM CONCLUSION REFERENCES http last updated 05. As a result of this listing it is aimed to ensure that these properties are used in different places by performing different operations. The scale methods that we will do for this situation will increase this situation even higher. At the bottom there are the kernel values that I have already done. In order to better understand this we will make a more effective analysis in the following stages. In the analysis system which will be carried out now an analysis shall be carried out for all persons or their status in the target process. Now I can constitute a DataFrame out of my reduced data with two dimensions Logistic RegressionFirst we need parameters to use our data more effectively. We check all columns. The diagonal values we see in these correlation values are always 1. These age trestbps chol thalach. The relationship between the features found in the training data is observed. The purpose here is to see the top five of the loaded data. This results in a different number for each property. com kanncaa1 seaborn tutorial for beginnershttps www. Age Range AnalysisIn this section age range analysis values are revealed. Hyperthermatic technique was used for this condition. Another issue I am curious about in this section is the situation in which the value of the target is 1 and it is the maximum value of Thal. At the moment it seems to be imbalance value but for this situation it applies to Gender. This is the evaluation for this. In order to better understand this distribution we need to take a look at the data set. As a result of the above analyzes it can be seen that 0 cases with chest pain are less common with heart disease. 2 and 3 were found to be of the same degree. To implement this algorithm model we need to separate dependent and independent variables within our data sets. Experiments with the Cleveland database have concentrated on simply attempting to distinguish presence values 1 2 3 4 from absence value 0. All correlation values between the data are listed in the previous sections. Now draw graph Target 0 so there has been a very nice graphic display. In this section we will use the groupby function. The first algorithm is logistic regression algorithm. Now it is time to implement PCA to the data set. com kralmachine data visualization of suicide rateshttps www. If you like it I expect your support. Sex Gender AnalysisIn the above output I wish it would be good if there was an equal proportion of people. We will perform scale operations to eliminate these situations. It increases both the volume and the results are very bad. Therefore we need to use this method for SVM algorithm. But on the other hand there are problems in all cases of chest pain such as 1 2 3. X normalization işlemi resimOf course we need to remove the target property when doing this. To reduce this situation we need to use the StandardScaler function. com spscientist students performance in examshttps seaborn. com kralmachine visual analysis of world happiness in 2015 Now our data is loaded. Is there any spelling mistake sample random rows in dataset New show columns And how many rows and columns are there for all data first one is rows other is columns Now I will check null on all data and If data has null I will sum of null data s. It seems that old people have a very hard job because their values are very high. In the normalization system the largest and smallest values within a group of data are considered. But the minus value is a big problem for me but the value of the transactions are more valuable for us. This is the result of an analysis for us. One Visualization to Rule Them AllWe will perform analysis on the training data. Our aim here is to obtain the average values of Thalach according to age ranges. These pains will be analyzed according to their problems and age ranges in the analysis system. Finally machine learning algorithms are estimated. This means that we need to integrate other values into this situation. We re writing the following snippet to see the loaded data. com kralmachine python programming language for data scientistsOther kernels https www. as seen only 50 was understood to be 50 target. According to the principal components data points with greater values on the x axis represent the customers that are less likely to spend to Detergents_Paper category. resim z score X is the incoming data. Describe function is a function that allows analysis between the numerical values contained in the data set. Standard and Normalization scale will be used for our operation. The goal field refers to the presence of heart disease in the patient. In this process after determining the Class property as hypothesis the relations between all the other properties are checked. 1 will be obtained after using it. If you have any questions I am ready to answer your questions. MODEL TRAINING and TESTINGAs a result of our initial evaluations we have used a number of artificial learning algorithms. We will list all the columns for all data. We will use a wide range of tools for this part. ", "id": "kralmachine/analyzing-the-heart-disease", "size": "13442", "language": "python", "html_url": "https://www.kaggle.com/code/kralmachine/analyzing-the-heart-disease", "git_url": "https://www.kaggle.com/code/kralmachine/analyzing-the-heart-disease", "script": "sklearn.metrics cross_val_score PCA sklearn.naive_bayes sklearn.tree Imputer KNeighborsClassifier DecisionTreeClassifier r2_score seaborn numpy auc GradientBoostingClassifier sklearn.decomposition plot_feature_importances sklearn.ensemble sklearn.model_selection confusion_matrix RandomForestClassifier matplotlib.pyplot plot_roc_ pandas classification_report StandardScaler LogisticRegression accuracy_score GridSearchCV sklearn.neighbors SVC sklearn.linear_model sklearn.preprocessing GaussianNB sklearn.svm roc_curve train_test_split datetime ", "entities": "(('Now we', 'sex'), 'go') (('performance', 'examshttps'), 'seaborn') (('We', 'loaded data'), 'write') (('best results', 'parameter hyper values'), 'create') (('2', 'same degree'), 'find') (('it', 'equal people'), 'AnalysisIn') (('So I', 'components'), 'investigate') (('that', 'Detergents_Paper less category'), 'represent') (('area', 'cases'), 'observe') (('we', 'StandardScaler function'), 'need') (('Therefore we', 'SVM algorithm'), 'need') (('resimTheoretically it', 'big standard'), 'understand') (('We', 'situations'), 'perform') (('gender when value', 'disease'), 'see') (('Thal values', 'normal 6 fixed 7 analysis'), 'reversable') (('correlation values', 'previous sections'), 'list') (('values', 'first process'), 'determine') (('only that', 'date'), 'be') (('who', 'people'), 'be') (('removed', 'future'), 'affect') (('most values', 'section'), 'categorize') (('we', 'data sets'), 'implement') (('data', '0'), 'take') (('relations', 'other properties'), 'check') (('I', 'questions'), 'have') (('later I', 'more'), 'install') (('properties', 'different operations'), 'aim') (('we', 'following stages'), 'make') (('we', 'heart maximum rate'), 'show') (('here numbers', '1'), 'be') (('I', 'application'), 'kralmachine') (('reduced data', 'plotting'), 'see') (('Experiments', 'absence 1 2 3 4 value'), 'concentrate') (('parsing process', 'data'), 'be') (('we', 'groupby function'), 'use') (('published experiments', 'them'), 'contain') (('difference', 'data'), 'be') (('we', 'different experiments'), 'create') (('http', 'last 05'), 'introduction') (('This', 'scaling operations'), 'change') (('that', 'less Fresh categories'), 'represent') (('com kralmachine football', 'datavisulationhttps www'), 'result') (('purpose', 'data'), 'be') (('how many missing data', 'data'), 'be') (('Now data', '2015'), 'com') (('relationship', 'training data'), 'observe') (('we', 'situation'), 'increase') (('it', 'maximum Thal'), 'be') (('other data', '0'), 'be') (('Logistic we', 'data'), 'constitute') (('we', 'average age'), 'mean') (('very you', 'UPVOTED'), 'be') (('hypothesis thesis', 'hypothesis'), 'determine') (('Now we', 'pandas library'), 'upload') (('This', 'us'), 'be') (('We', 'data'), 'list') (('Now it', 'data set'), 'be') (('value', 'σ'), 'be') (('we', 'feature new values'), 'use') (('we', 'correlation values'), 'be') (('One Visualization', 'training data'), 'perform') (('head', 'default'), 'have') (('you', 'account'), 'look') (('pains', 'analysis system'), 'analyze') (('who', 'people'), 'analyze') (('0 cases', 'heart less disease'), 'see') (('goal field', 'patient'), 'refer') (('chest when pain', 'graph'), 'see') (('largest values', 'data'), 'consider') (('that', 'data set'), 'be') (('it', 'Gender'), 'seem') (('now analysis', 'target process'), 'carry') (('we', 'situation'), 'mean') (('I', 'null data s.'), 'be') (('X normalization resimOf course we', 'when this'), 'işlemi') (('Percentage ratios Male Sex 1 male 0 female State', 'chest 4 pain'), 'find') (('aim', 'age ranges'), 'be') (('other data', 'values'), 'normalized') (('heart rate', 'age old areas'), 'distress') (('It', '4'), 'be') (('Furthurmore I', 'visualization'), 'investigate') (('purpose', 'loaded data'), 'be') (('Hyperthermatic technique', 'condition'), 'use') (('value', 'more us'), 'be') (('that', 'best situation'), 'be') (('I', 'kernel that'), 'be') (('data', 'contains'), 'make') (('Chest Pain Type AnalysisA wide range', 'heart failure'), 'be') (('it', 'more future analysis'), 'be') (('il', 'it'), 'do') (('most', 'feature only certain values'), 'categorized') (('values', 'very hard job'), 'seem') (('we', 'dataset'), 'analyze') (('we', 'data set'), 'in') (('I', 'data'), 'import') (('result we', 'graphs'), 'tutorial') (('different values', 'values'), 'give') (('technique', 'process'), 'use') (('Standard scale', 'operation'), 'use') (('we', 'learning artificial algorithms'), 'training') (('best analysis', 'age'), 'be') (('that', 'specific scaling'), 'score') (('We', 'part'), 'use') (('when it', 'usage big difference'), 'come') ", "extra": "['biopsy of the greater curvature', 'disease', 'gender', 'patient', 'test']"}