{"name": "birdclef quick eda with w b ", "full_name": " h1 About the competition h3 Evaluation h3 About Weights and Biases h1 1 The CSV Files h2 train metadata csv h4 What s the distribution of primary labels h4 What quality of audio recording available h4 Where are the birds located h4 When was the audio uploaded h2 train soundscape labels csv h4 Most commom birds vocalization found h2 test csv h1 2 The Audio Files h4 Number of bird species h4 Number of training data h4 Number of recordings per label h3 Listen to Audio h1 3 Audio Features Preprocessing h2 Audio Normalization h2 Trim the noise h4 Let s see the effect of trimming on 5 second clips of the audio h2 Fade In and Fade Out h2 Fast Fourier Transform h2 Spectrogram h3 Linear Power Spectrogram h3 Log Power Spectrogram h3 Constant Q Note Power Spectrogram h3 Constant Q Hz Power Spectrogram h3 Tempogram with BPM markers h3 Chromagram with Pitch Classes h3 Let s look at the spectrogram for every class using W B h4 Spectral Centroid h1 WORK IN PROGRESS D ", "stargazers_count": 0, "forks_count": 0, "description": "Click on the in the clipped_vs_trimmed chart above. Again I am not sure if it s going to be useful. nocall can never appear together with other codes. About Weights and BiasesThink of W B like GitHub for machine learning models. Spectral CentroidThe spectral centroid indicates at which frequency the energy of a spectrum is centered upon or in other words It indicates where the center of mass for a sound is located. csv for each row_id time window you need to provide a space delimited list of the set of unique birds that made a call beginning or ending in that time window. common_name The bird known in common language. Plot spectrogram Note linear y axis Short time Fourier transform STFT Convert an amplitude spectrogram to Decibels scaled spectrogram. site Recording site of the soundscape data. A recorded audio may be gradually reduced to silence at its end fade out or may gradually increase from silence at the beginning fade in. Number of recordings per label Listen to AudioWe will use Weights and Biases to visualize audio waveforms and listen to bird sounds. org stable modules generated sklearn. For training a neura network it might not be an issue. Also note that some of the years are wrong ex 2104 0199 etc. Let s see the effect of trimming on 5 second clips of the audio. Log Power Spectrogram Constant Q Note Power Spectrogram Constant Q Hz Power Spectrogram Tempogram with BPM markers Chromagram with Pitch Classes Let s look at the spectrogram for every class using W B. When was the audio uploaded Most of the recordings were uploaded in the year between 2012 and 2020. You can visualize the waveform of the audio beside listening to the music with just 3 lines of code. Audio Features Preprocessing Audio Normalization Note that this constrained each signal between 0 and 1. Fade In and Fade Out http This Wikipedia page might be a good read. There are segments with two or more birds volcalization found. There s significant class imbalance. Each step is a unique pair of audio clip and it s trimmed counterpart. Most commom birds vocalization found Many segments are associated with nocall. There will be total of 397 steps where each step represents an unique label. log audio data for each label per step. Create an account on https wandb. We thus need to build a multi label classifier. type The type of bird sound. Click on the in the linear power spectrogram chart above to visualize the spectrogram per label. With a few lines of code save everything you need to debug compare and reproduce your models architecture hyperparameters model weights GPU usage and even datasets and predictions. Species crfpar and stvhum2 got only 8 audio files. While 12 labels got 500 audio files each. train_soundscape_labels. Filenames contain the file ID recording site and recording date yyyymmdd. In some audio the sound of bird is coming from far off distance. filename The name of the audio file. Input your personal API token key to login mine is added as Kaggle Secrets https www. It might be useful preprocessing step after getting 5 second clips. Pro tip 2 The audio will appear for the selected step label. The audio recordings are downsampled to 32kHz and are in ogg format https en. Play with the W B dashboard above to get more insight. Parameters Short time Fourier transform STFT Convert an amplitude spectrogram to Decibels scaled spectrogram. The CSV Files train_metadata. time The time of the day the recording was uploaded. Num species 397 Num training samples 62874 Class imbalance Yes Number of bird species Number of training data W B Run Page https wandb. Pro tip 1 Click on the in the audio samples chart above. About the competition Goal Indentify the species of the birds given raw audio in the wild. Note that there is numerical difference while computing FFT using TensorFlow and Numpy. Trim audio Log clipped and trimmed audio compute fft compute frequency get the magnitude Remember 2nd half of the fft is repeated. csv Same tabular information as train_soundscape_labels. com product feedback 114053 1. Pro tip 1 Scroll over the bar chart to look at the number of recordings per species_id. Trim the noise Note how the initial and final silent waveform is removed. Image name Load audio Compute spectrogram Short time Fourier transform STFT Convert an amplitude spectrogram to Decibels scaled spectrogram. There are approximately 80 recordings during submission that will be will be roughly 10 minutes long and in ogg audio format. Thus this might not be a good strategy to be applied on 5 second clips. Not sure if it would be a great idea to normalize the audio like this. secondary_label Extra birds sounds present in the recording. birds primary label i. Plot spectrogram Note cqt_hz y axis Plot spectrogram Note cqt_hz y axis Plot spectrogram Note cqt_hz y axis Dataframe audio filenames with rating 4 or more. The other half is simply repeated in inverse indices order. csv primary_label The primary bird sound that can be heard in the recording. Some quick observations The audio duration varies from few seconds to few minutes. Reference https www. Get random samples for each label. SpectrogramA spectrogram is a visual representation of the spectrum of frequencies of a signal as it varies with time. scientific_name The scientific name of the bird species. Note that I have only logged spectrogram for 20 labels. W B Run Page https wandb. Pro tip 3 In the recordings_per_label_table you can sort the columns in ascending or descending order by clicking on the column name. The Audio Files TL DR for train_short_audio Usage To train fine grained multi class label audio classifier. A fair share of recordings are from Europe. seconds End time of the 5 second segment for which this entry states the label. Change species_id to select different label Load unnormalized audio Normalize audio sampling rate is number of samples per second. The submissions will be evaluated based on their row wise micro averaged F1 score https scikit learn. ai ayush thakur birdclef runs 1grwh85p workspace user ayush thakur Disclaimer Since there are too many labels the specied_id y axis looks clumsy. rating The audio quality. audio_id Identifier used to reference audio recordings. author Individual s name who recorded possibly and uploaded the audio. We will visualize linear frequency power spectrogram for audio with rating 4 and more. latitude and longitude Location where the recording was done. Linear Power Spectrogram n_fft 2048 samples corresponds to a physical duration of 93 milliseconds at a sample rate of 22050 Hz. com stefankahl birdclef2021 exploring the data row_id Unique identifier of a 5 second segment of each soundscape file. Save as spectrogram Note linear y axis log audio data for each label per step. nocall references a segment without any bird vocalization. url The xenocanto. I highly recommend spending time listening to the sample audio. date The date the audio was recorded possibly and uploaded. rucwar bobfly1 etc are commonly found. There are some major regions of frequency concentration that too in high frequency region. license The license associated with that recording. Segments can have more than one bird in that case eBird codes are separated by space. csv Reference https www. com andradaolteanu birdcall recognition eda and audio fe SHP file Coordinate reference system Lat and Long need to be of type float not object Create geometry Geo Dataframe Create ID for species Add ID to geo_df PLOT display W B run page add new key label to dict get NUM_AUDIO_PER_LABEL audio filenames per label append path to that file We will use Weights and Biases to visualize audio waveforms and listen to bird sounds. Evaluation In the submission. The audio is noisy with the sound of rain insects humans talking wind blowing etc. This data will be used to train fine grained audio classifier. Plot spectrogram Note logarithmic yaxis Short time Fourier transform STFT Convert an amplitude spectrogram to Decibels scaled spectrogram. Fast Fourier Transform Note that while computing FFT the relevant information is in the first half of the array. Understanding the given data Training data train_short_audio Directory of short recordings of individual bird calls generously uploaded by users of xenocanto. display W B run page. Where are the birds located Most of the audio recordings come from North and South America. display W B run page A sample audio. In this competition 4 different sites COL Colombia COR Costa Rica SNE Sierra Nevada SSW Sapsucker Woods are included. This is the raw audio that s mentioned in the goal. org url to d What s the distribution of primary labels What quality of audio recording available Thankfully most of the audio is high quality. eBird code of the audible species of this segment. Note By trimming we are losing on the background sound but there s no control over what is lost. Each audio player s caption is the label name. The recordings are are all roughly ten minutes long and in the ogg format. We will use Weights and Biases to visualize different spectrograms. Plot spectrogram Note cqt_note y axis Short time Fourier transform STFT Convert an amplitude spectrogram to Decibels scaled spectrogram. Pro tip 2 Click on the Edit panel icon in the chart to visualize the expanded version of the bar chart. WORK IN PROGRESS D To get the latest version of W B Map libraries Audio specific imports W B login Load the file as W B artifact. com shahules bird watch complete eda fe Unique eBird codes Make bar chart Show chart Reference https www. Here s a short reddit post https www. train_soundscapes Directory of audio files that are comparable to the data that we will encounter in the test set. csv This csv can be used to build the inference pipeline. com r MachineLearning comments 4ea0m7 audio_normalizationpreprocessing_before. csv Wide range of metadata provided for the training data. If there are no bird calls in a time window use the code nocall. Testing data test_soundscapes Directory of recordings to be used for scoring. ai ayush thakur birdclef runs 2713uqst workspace user ayush thakur Note The dashboard above have 8 samples of audio for each label. ", "id": "ayuraj/birdclef-quick-eda-with-w-b", "size": "9129", "language": "python", "html_url": "https://www.kaggle.com/code/ayuraj/birdclef-quick-eda-with-w-b", "git_url": "https://www.kaggle.com/code/ayuraj/birdclef-quick-eda-with-w-b", "script": "plotly.graph_objects librosa geopandas shapely.geometry seaborn tensorflow_io numpy matplotlib.pyplot kaggle_secrets tensorflow get_path pandas UserSecretsClient Point Polygon IPython.display ", "entities": "(('what', 'background sound'), 'note') (('that', 'roughly 10 minutes ogg audio format'), 'be') (('audio recordings', 'ogg format https'), 'downsample') (('Image name Load audio Compute time Fourier Short transform', 'scaled spectrogram'), 'spectrogram') (('it', 'neura network'), 'be') (('Identifier', 'audio recordings'), 'audio_id') (('recorded audio', 'beginning fade'), 'reduce') (('where recording', 'Location'), 'latitude') (('It', 'preprocessing step 5 second clips'), 'be') (('When audio', '2012'), 'be') (('Many segments', 'nocall'), 'find') (('I', 'sample audio'), 'recommend') (('Thus this', 'good 5 second clips'), 'be') (('it', 'time'), 'be') (('I', '20 labels'), 'note') (('you', 'column name'), 'tip') (('Change species_id', 'second'), 'be') (('eBird codes', 'space'), 'have') (('recordings', 'ogg roughly ten minutes format'), 'be') (('quick audio duration', 'few minutes'), 'observation') (('fair share', 'Europe'), 'be') (('Also some', '2104'), 'note') (('We', 'bird sounds'), 'eda') (('Linear Power Spectrogram 2048 samples', '22050 Hz'), 'correspond') (('rain insects humans', 'etc'), 'be') (('secondary_label Extra birds', 'recording'), 'sound') (('it', 'this'), 'sure') (('where center', 'sound'), 'indicate') (('author who', 'possibly audio'), 'name') (('it', 'counterpart'), 'be') (('Understanding', 'xenocanto'), 'call') (('csv bird primary that', 'recording'), 'primary_label') (('too many axis', 'workspace user ayush thakur 1grwh85p Disclaimer'), 'run') (('csv', 'inference pipeline'), 'csv') (('csv Wide range', 'training data'), 'provide') (('12 labels', '500 audio files'), 'get') (('Dataframe audio', '4'), 'note') (('You', 'code'), 'visualize') (('where step', 'unique label'), 'be') (('We', 'different spectrograms'), 'use') (('Filenames', 'date yyyymmdd'), 'contain') (('window', 'code nocall'), 'be') (('eda eBird complete Unique codes', 'bar chart Show chart Reference https www'), 'watch') (('recording', 'time day'), 'time') (('2 audio', 'step selected label'), 'tip') (('personal API', 'Kaggle Secrets https www'), 'add') (('W B Audio specific imports login', 'W B artifact'), 'work') (('raw that', 'goal'), 'be') (('Click', 'label'), 'spectrogram') (('debug', 'GPU usage'), 'save') (('Fourier transform Parameters Short time STFT', 'scaled spectrogram'), 'Convert') (('relevant information', 'array'), 'Note') (('submissions', 'row wise micro'), 'evaluate') (('Most', 'North America'), 'locate') (('Pro', 'species_id'), 'tip') (('We', '4'), 'visualize') (('entry', 'label'), 'second') (('Species crfpar', 'only 8 audio files'), 'get') (('s', 'audio'), 'let') (('We', 'label thus multi classifier'), 'need') (('how initial silent waveform', 'noise Note'), 'trim') (('other half', 'indices simply inverse order'), 'repeat') (('data', 'fine grained audio classifier'), 'use') (('available Thankfully most', 'audio'), 'url') (('we', 'test set'), 'directory') (('dashboard', 'label'), 'run') (('Listen', 'bird sounds'), 'use') (('nocall', 'together other codes'), 'appear') (('half', 'fft'), 'clip') (('exploring', 'soundscape file'), 'stefankahl') (('Audio Preprocessing Audio Normalization this', '0'), 'Features') (('nocall', 'bird vocalization'), 'reference') (('Fourier transform STFT', 'scaled spectrogram'), 'spectrogram') (('call', 'time window'), 'csv') (('s', 'W B.'), 'let') (('sound', 'far distance'), 'come') ", "extra": "['test']"}