{"name": "bitfinexdataset ", "full_name": " h1 Quick look at the Bitfinex crypto currency dataset ", "stargazers_count": 0, "forks_count": 0, "description": "Quick look at the Bitfinex crypto currency datasetIn this kernel we will have a first look at the Bitfinex crypto currency dataset. com coinmonks how to get historical crypto currency data 954062d40d2d. Below we define a function to calculate the log returns. As can be seen from the above plot there seem to be some positive correlations. So finally let s have a look at correlations between currency pairs. And while we are at it lets also have a quick look at the head of the BTC USD dataset. First for the entire dataset to see it in full and then we will zoom in more and more to check the 1 minute resolution. For details about how this data was collected you can have a look at this articel https medium. One common way is to calculate the log returns of each currency pair over time. Next let s have a look on what currency pairs are in the dataset and how many pairs there are in total. Now let s load some data using our previously defined function. So to get started lets import some useful packages first. We want to look at several trading pairs later so let s define a function that loads data by pair names first. Now the question if these correlations are useful for trading or just an artifact that has no value at all is one of many questions ahead while building your trading algorithm. However if we want to compare more crypto charts we need to think of something else. Alright as we can see the timestamps have been converted to a human readable format and we have the open close high low and volume data present as well. Take a look at the head of the BTC USD data Set up the sub plots Plot the data Define the parameters for the moving mean Load currency pairs and calculate the moving mean. Now let s calculate the correlations and visualize the results in a heat map. Next we will plot the log returns for the four datasets we loaded previously. We have to fill these gaps by filling them with the last value until a change occurs. So next we plot the closing price of the BTC USD and the ETH USD dataset. Have fun Data path Get names and number of available currency pairs Print the first 50 currency pair names Load data Convert timestamp to datetime Remove duplicate indices if present As mentioned in the description bins without any change are not recorded. That is why we used two y axis in this example. We will load 10 pairs and plot their correlations in a heatmap. As we can see from the above plot it is hard to directly compare the BTC and ETH data. First the raw log returns and in a second plot the moving mean to get a better understanding of how things developed over time. ", "id": "tencars/bitfinexdataset", "size": "2129", "language": "python", "html_url": "https://www.kaggle.com/code/tencars/bitfinexdataset", "git_url": "https://www.kaggle.com/code/tencars/bitfinexdataset", "script": "sklearn seaborn numpy matplotlib.pyplot load_data pandas datasets log_return linear_model ", "entities": "(('currency pairs', 'how many total'), 'let') (('kernel we', 'Bitfinex crypto currency dataset'), 'look') (('why we', 'example'), 'be') (('So finally s', 'currency pairs'), 'let') (('we', 'something'), 'however') (('Below we', 'log returns'), 'define') (('how things', 'time'), 'return') (('we', 'four datasets'), 'plot') (('One common way', 'time'), 'be') (('We', 'heatmap'), 'load') (('Now s', 'heat map'), 'let') (('Now s', 'previously defined function'), 'let') (('So started lets', 'useful packages'), 'import') (('you', 'articel https medium'), 'have') (('change', 'last value'), 'have') (('it', 'directly BTC data'), 'be') (('that', 'pair names'), 'want') (('just that', 'trading ahead algorithm'), 'be') (('com', 'crypto currency how historical data'), 'coinmonk') (('we', 'open close high low data'), 'alright') (('full then we', 'minute 1 resolution'), 'for') (('currency pair Load data Convert Remove duplicate first 50 indices', 'change'), 'get') (('So next we', 'ETH USD dataset'), 'plot') (('lets', 'BTC USD dataset'), 'have') ", "extra": "[]"}