{"name": "breakhis images classification cnn ", "full_name": " h1 BreakHis Cancer Images Classification h2 Problem Introduction h2 Dataset Information h2 Import Python Libraries h2 GPU Confirmation h2 Loading the Dataset h3 Data Structuring h2 Analysis on Data h2 Dataset Modelling for Deep Learning h3 Visualizing Train Validation Test Splits h2 Unsampling Data h2 Making the Deep Learning Model h3 Model Configuration Parameters h2 Loading the Dataset h2 Deep Learning Model Training Using K Fold Cross Validation h2 Visualize Model Performance Loss Accuracy h2 h2 Evaluation on Test Data ", "stargazers_count": 0, "forks_count": 0, "description": "Visualizing Train Validation Test Splits Unsampling Data Making the Deep Learning Model Model Configuration Parameters Loading the DatasetWe have defined the model parameters configuration in above sections. We have successfully loaded the images preprocessed them made image argumentations and visualized the images of what they look like. Data StructuringWe will strcuture the data in csv filefor our ease and for better understanding. csv append True making plots for accuracy making plots for loss function for decoding a test image function for building a NN layers. figure sorting out training validation and testing images making splits of training validation datasets function to decode a PNG image into a tf tensor reshaping the image between 0 and 1 image argumentation for faster model training function to view sample of images making a function to calculate show model history setting the epochs saving models logs csv_logger CSVLogger cnn_model_logs. Analysis on DataThe graph sows that most of the samples in our data have malignant tumors and less have benign tumors Dataset Modelling for Deep LearningWe will model the data for our training vaidation and testing sets. In the year 2018 the total deaths due to breast cancer in women was seen to be 627 000 out of 2. We will use the K Fold Cross Validation Technique to train our model by making sure that what is the best fit for our model Visualize Model Performance Loss Accuracy Evaluation on Test DataTest Data Samples have been successfully created importing libraries linear algebra data processing CSV file I O e. It is believed that this dataset can become a benchmark for future classifications of breast cancer classification. BreakHis Cancer Images Classification https upload. jpg Problem Introduction This notebook is concerned with classifying images using the BreakHis Breast Cancer Histopathological Image Dataset. org wikipedia commons 5 50 Histopathology_of_basal like_breast_cancer. Now we define and load the dataset in our memory. GPU ConfirmationLet s make sure that we have a GPU installed. Deep Learning Model Training Using K Fold Cross ValidationThis is the step whwre we train our deep learning model. The digitialized approcches in deep learning has aided a lot in diagnosing and controlling breast cancer with power to pre identify the disease via deep learning methods. read_csv import keras experimental API for making data pipelines defining the class names loading the data renaming and structuring the columns for better data understanding view first n rows of strucrured data making a plot to see data distribution sns. We will define 2 datasets train valid. Breast cancer is a disease seen mainly in women and is seen as a major cause of death among women. The images of tissues are taken to be 700X460 pixels 3 channel RGB 8 bit depth in each format and in PNG. Dataset Information The breast cancer histopathological image dataset BreakHis contains 9109 microscopic images of breast tumor tissues collected from 82 patients regarded as malignant or benign. Invasive Ductual Carcinoma IDC in diagnosing breast cancer since its subsequent digitalization is more feasible due to advancements in slide scanning technology as well as the reduction of storage load cost in recent years. Our dataset has been restructured the way we wanted it to be. 4 name dropout2 defining model configuration parameters model_name inception_v3 model_name inception_resnet_v2 loading the train validation dataets checking the path of images Get labels concat the list of batched labels starting a new sesion for TF making model checkpoints model logs compiling the model fit the model visualize model performance making samples of test data making predictions checking predictions made by neural network see model predictions. Import Python LibrariesFirst we will import the necessary libraries for our notebook. The tissues are magnigfied at different scaling factors 40X 100X 200X 400X. In this dataset it contains 2480 malignant and 5429 benign tumors. We have defined the model configuration dataset modelling data loading and preparation. Let s perform some analysis on it tnd then we will move towards the images to perform computations on them. 1 million cases which were diagnosed. Loading the DatasetFirst we load the dara that contains multiple files one file contains the information anout all images in a csv format and there is another directory that contains the information about the images of breast cancer tissues. ", "id": "azazurrehmanbutt/breakhis-images-classification-cnn", "size": "3388", "language": "python", "html_url": "https://www.kaggle.com/code/azazurrehmanbutt/breakhis-images-classification-cnn", "git_url": "https://www.kaggle.com/code/azazurrehmanbutt/breakhis-images-classification-cnn", "script": "Flatten sklearn.metrics albumentations tensorflow.keras.metrics tensorflow.keras.optimizers tensorflow.keras.layers Precision decode_test_img tensorflow.keras.callbacks tensorflow.keras.losses Dropout tensorflow.keras.models Adam model_hist seaborn numpy BinaryCrossentropy image_reshape Input load_image Recall argumentor_function sklearn.model_selection f1_score KFold functools matplotlib.pyplot Dense tensorflow ResNet50 pandas classification_report make_nn_model partial tensorflow_hub tensorflow.keras CSVLogger view_model_predictions Model layers get_labels_from_tfdataset tensorflow.keras.applications.resnet50 argument_image view_image ", "entities": "(('data', 'data distribution sns'), 'API') (('BreakHis', 'malignant'), 'Dataset') (('then we', 'them'), 'let') (('predictions', 'model predictions'), 'parameter') (('that', 'breast cancer tissues'), 'load') (('tissues', 'different scaling factors'), 'magnigfie') (('Import Python LibrariesFirst we', 'notebook'), 'import') (('subsequent digitalization', 'recent years'), 'be') (('figure', 'epochs saving models'), 'dataset') (('2018 total deaths', '627 2'), 'see') (('we', 'learning deep model'), 'training') (('best fit', 'algebra data CSV file'), 'use') (('jpg Problem notebook', 'BreakHis Breast Cancer Histopathological Image Dataset'), 'Introduction') (('We', 'data loading'), 'define') (('dataset', 'breast cancer classification'), 'believe') (('Deep Learning Model Model Configuration Parameters', 'sections'), 'visualize') (('they', 'what'), 'load') (('Now we', 'memory'), 'define') (('Data StructuringWe', 'better understanding'), 'strcuture') (('it', '2480 malignant benign tumors'), 'contain') (('Dataset Modelling', 'training vaidation'), 'sow') (('Breast cancer', 'women'), 'be') (('digitialized approcches', 'learning deep methods'), 'aid') (('images', 'PNG'), 'take') ", "extra": "['biopsy of the greater curvature', 'disease', 'patient', 'test']"}