{"name": "breast cancer analysis ", "full_name": " h1 Data analysis of breast cancer patients h4 Table of contents h2 Gender distribution in dataset h2 Age distribution in dataset h2 Number of cases by cancer type h2 Stages of each cancer type h2 Age ranges for each cancer type h2 Marker Proteins h3 Cancer types by marker protein levels h3 Marker protein levels by cancer types h3 Marker protein level by stage for each type of cancer h3 Mapping ages to protein levels h2 Checking ER PR HER2 statuses h4 For ER status h4 For PR status h4 For HER2 status h2 Mortality h3 Number of deaths each age range h3 Mortality rate by cancer type h3 Number of deaths by stage h2 Conclusions h2 Future Analyses ", "stargazers_count": 0, "forks_count": 0, "description": "Marker ProteinsA cancer tumor often produces a specific protein in the blood that serves as a marker for the cancer. Its IQR is the largest as well from around 0. The ranges for marker proteins 1 2 and 3 for MCC are far tighter compared to the other two types of cancer. 28 in Stage I the mortality is 10. From the above box and whiskers plot we see the following The mean of Marker Protein 1 is at around 0. 0 in Stage II it is 33. For both Infiltrating Ductal and Lobular Carcinomas most patients present in the II and III stages. A more elaborate picture could be constructed by checking the protein marker levels by stage for each cancer type with the assumption being that each stage should have a different protein level. Breast cancer arises in the lining cells epithelium of the ducts 85 or lobules 15 in the glandular tissue of the breast. 79 are of the Mucinous Carcinoma type. However due to the uneven number of samples of each cancer type it is difficult to make just how lethal each type is in proportion to the number of samples. 73 and in Stage III it is 30. 79 for our dataset while the mortality of HER2 negative patients is slightly higher at 20. Also a larger number of patients from the extremes of age ranges could be taken into consideration so as to check if they present an atypical picture of breast cancer. This could be due to the fact that many patients do not present to the doctor until they are in Stage II of the disease. While the overall range for protein 1 in IDC and ILC are similar the presence of outliers on the lower end of the scale in IDC could indicate the possibility of IDC in very low levels of Protein 1. Patients 45 are nearly double the number of patients 45 having Infiltrating Ductal Carcinoma with rates jumping from around 13 to 30 for ages 45 65 before gradually declining beyond. Marker Protein 2 The values here are higher than those for Marker Protein 1. For Infiltrating Ductal Carcinoma the overall mortality is 20. The above box and whiskers plots show us the marker protein levels for each type of breast cancer. Mortality rate by cancer typeWe can see what the mortality is for each cancer type Above we can see the no. Unfortunately there does not appear to be an association between cancer stage and protein levels for any of the cancer types. 8 million women alive who were diagnosed with breast cancer in the past 5 years making it the world s most prevalent cancer. Future AnalysesIn keeping with the findings of this analysis I would like to research further on male patients having breast cancer and a greater number of patients having the rarer types of breast cancers. There are many other much rarer types including mucinous carcinoma. To get a better idea of the true proportion of each number to cases to the total number of cases we plot a bar chart with the percentage of cases So now we see that in our dataset 70. Stages of each cancer typeWe further subdivide each cancer type into its stages to get a more elaborate picture of the distribution of our dataset Since there are no samples of Stage III Mucinous Carcinoma we will add this row manually Now we can see that for Infiltrating Ductal Carcinoma and Infiltrating Lobular Carcinoma the number of Stage II patients are the greatest followed by stage III. However the HER2 status is both positive and negative which could be useful in analysis. Taking the figures of cancers types by marker proteins and protein profiles for each type of cancer we can come to the following rudimentary conclusions Very low levels of protein 1 and very high levels of protein 3 could mean the possibility of Infiltrating Ductal Carcinoma. Th above chart shows us the mortality rate by cancer type. For Infiltrating Lobular Carcinoma Stage I has a mortality rate of around 10 rising slightly to around 12 in Stage II. 5 1 of cancer patients are male. The total spread is around 1. The regression lines in the above charts make it clear that there is no real association between any of the protein markers and age. 1 but there are a few outliers on either side. MortalityMortality is a health statistic that corresponds to the total number of deaths per unit time in a population divided by the population s number. For Infiltrating Lobular Carcinoma the number of patients rises morely evenly with only 1 of patients from age 25 to 15 in ages 50 55. All percentages derived from total number of patients in the given stage of that particular cancer. Some of the overall trends to be noted are The highest levels of marker protein found in all three cancer types is marker protein 2. Number of deaths by stageIn order to get a better idea of the mortality for each cancer type we need to figure out the number of deaths in each stage. 3 million women diagnosed with breast cancer and 685 000 deaths globally. 6 with some outliers on the lower side. com amandam1 breastcancerdataset discussion 270626 __ dataset to see the correlation between different features that occur in breast cancer patients and try to find some trends or patterns between them. 09 in Stage I it is 17. In 2020 alone there were 2. Its IQR is a little greater than that of the Protein 1 Marker from 0. Marker proteins which are a special kind of protein that serve as markers for cancer have no particular association with age type or stage of cancer. In Mucinous Carcinoma it is very difficult to interpret any trends due to the smaller number of samples. For Infiltrating Ductal Carcinoma the numbers rise fairly sharply but for Infiltrating Lobular and Mucinous Carcinoma the curve is more gradual. The mean of the Marker Protein 2 is the highest hovering somewhere around 1. Since our dataset gives us the patient s status alive or dead it would be interesting to calculate the mortality by different parameters for our dataset. ER and PR receptors are all positive for every patient in the dataset. This could give us an idea of whether marker levels could be a good prognostic indicator by age. As of the end of 2020 there were 7. By comparision in HER2 positive cases there appear to be a smaller number of living patients compared to the dead. In Stage III however it jumps to around 30. Cancer types by marker protein levelsIt would be good to see what each protein level is in each type of cancer as differences in levels of different proteins could signal the type of breast cancer. Regressor models would need to be run upon atypical patients so as to maximize predictive capabilities of the model. We see from above that the rates of occurance of cancer of all types is greatest in middle ages with rates of occurance declining at both extremes of age. 1 which could be an indicator of this type of cancer should such low levels show up in reports. There are both HER2 positive and HER2 negative patients in the dataset. Its total spread is from 1. 0 and the IQR is relatively small from 0. HER2 positive breast cancers tend to grow faster and are more likely to spread and come back compared to HER2 negative breast cancers. 02 in Stage II it is 21. Very high or very low levels of proteins 1 2 and 3 could lessen the possibility of the cancer type being Mucinous Carcinoma. Data analysis of breast cancer patientsBreast cancer is the most common cancer in women around the world. The mortality rates by cancer types all hover around twenty percent. 74 of the total in the dataset. A majority of patients having breast cancer have the Infiltrating Ductal variety. For this weonce again need to transform the data before we can work with it. In addition around 0. of cases of each cancer type the patient status and the ratio of status by cancer type as well as total number of cases. The mean of Marker Protein 4 is at around 0. The mortality of HER2 positive patients is at 13. This is so that constructing the bar chart would be easier in the endFinally we start constructing our charts We see here that the greatest number of deaths occur in Stage II of each type of cancer. These protein levels can be measured via blood tests to determine the possibility of cancer. To get a better idea of the relative mortality we use the Percentage column in our dataframes Now we can make the following observations For Infiltrating Ductal Carcinoma all three stages appear to have an equal mortality rate hovering at around 20. The total spread is correspondingly the largest from around 1. By this adjusted scale we see that the actual mortality of HER2 negative patients is slightly greater than HER2 positive patients. For this we could create a scatter plot to see what results we get. HER2 Human Epidermal growth factor Receptor 2 is a protein that can play a role in the development of breast cancer. Our dataset does not name the four marker proteins nor does it give the units of measurement. In the dataset the cancer type is given under the column Histology. However in order to calculate whether mortality is truly greaer in HER2 positive patients than in HER2 negative patients we need to find the ratio of dead to alive patients in HER2 positive patients and HER2 negative patients respectively. About two thirds of breast cancers are ER and or PR positive. Table of contents Gender distribution in dataset Gender distribution in dataset Age distribution in dataset Age distribution in dataset Number of cases by cancer type Number of cases by cancer type Stages of each cancer type Stages of each cancer type Age ranges for each cancer type Age ranges for each cancer type Marker Proteins Marker Proteins Cancer types by marker protein levels Cancer types by marker protein levels Marker protein levels by cancer types Marker protein levels by cancer types Marker Protein level by stage for each type of cancer Protein marker level by stage for each type of cancer Mapping ages to protein levels Mapping ages to protein levels Checking ER PR HER2 statuses Checking ER PR HER2 statuses Mortality Mortality Number of deaths in each age range Number of deaths in each age range Mortality rate by cancer type Mortality rate by cancer type Number of deaths by stage Number of deaths by stage Random Forest Analysis for multiple factors determination of prognosis Random Forest Analysis for multiple factors in determination of prognosis Conclusions Conclusions Future Analyses Future Analyses We check out the statistical measurements of our data at a glance. 55 are of the Infiltrating Lobular Carcinoma type and only 3. Marker Protein 3 The values for Marker Protein 3 show a similar distribution to that of Marker Protein 1. 4 but there are no outliers. For Infiltrating Lobular Carcinoma the overall mortality is 17. From the table above we see that there are 224 cases of Infiltrating Ductal Carcinoma 81 cases of Infiltrating Lobular Carcinoma and only 12 cases of mucinous carcinoma. 26 of the total as opposed to 313 female cancer patients or 98. This high level is not reached in the other two types and could indicate the presence of IDC in very high Protein 3 levels. 40 or more patients having breast cancer fall in the age range of 40 65. We use the ratios we calculated to get a more balanced picture The adjusted mortality shows us that each cancer has roughly the same mortality rate around 20. In keeping with the general distribution of the data the mortality by age range is highest between ages 45 70. From the above chart we can see that deaths in all age ranges follow a normal distribution same as the overall distribution of number of cases. We can also see the attributes of our dataset Gender distribution in datasetThe first thing we do is to see how many male vs female patients we have We see from above that there are only four male cancer patients or 1. 66 of cases are of the Infiltrating Ductal Carcinoma type 25. However the reason for this high number could be because we have a large number of Stage II samples the numbers in the Alive column follow a similar pattern to the ones in the Dead column. The number of patients having Mucinous Carcinoma are the fewest in the entire dataset there are no patients having Stage III Mucinous Carcinoma in the dataset. 0 in Stage II it is 13. We could try to get the percentages for each age range but considering that we have an uneven number of patients in each range our results could be deciphered incorrectly. 00 in Stage I it is 0. 33 and in Stage III it is 0. The plots corraborate the distributions that we saw in the previous charts as well as giving us some new insights. Marker protein levels by cancer typesAlternatively we could look at the marker protein composition is in each type of cancer as a distinct profile could also alert us to the type of cancer. For Mucinous Carcinoma it is difficult to make any real observations due to the scarcity of data. With only our dataset as the training and testing model our regressor model was able to predict the survival of the patients with a mean square error of 0. The mean of Marker Protein 3 is at around 0. Nevertheless we can measure their levels relative to each other as well as other attributes in the dataset to see if any patterns jump out. There are outliers on the higher side but none on the lower side. First we filter the relevant data We see above that a greater number of patients are HER2 negative and out of them a large number are alive. Checking ER PR HER2 statuses PR Progesterone Receptor ER Estrogen Receptor may be found in breast cancer cells. Age ranges for each cancer typeWe can also look at the age ranges for each cancer type to see whether any particular type favours any age range. Mapping ages to protein levelsAnother good way to get a measure of our data is to look at the levels of marker proteins by age. For this we shall once again transform the data In the three cells below this we filter the samples by stage into different datasets. For Mucinous Carcinoma the overall mortality is 25. To see what patterns these receptors follow in patients with breast cancer we will first check the number of patients who are positive for these receptors For ER status For PR status For HER2 status The above filtering shows us that all patients in the dataset have a positive PR Progesterone Receptor and ER Estrogen Receptor status which means that analyses based on these two receptors is unlikely to be beneficial. However the levels for IDC end to dip more towards the negative going down to as far as 2. Its IQR is of a similar size to that of the Protein 3 Marker from 0. Number of deaths each age range First we can take a look at the number of deaths in each age range. Marker protein level by stage for each type of cancerIn the above analysis we have seen the protein levels by cancer type and cancer types by protein levels. The only notable difference here is in the values for IDC which go as high as 2. For this we can construct a histogram Number of cases by cancer typeThe first thing we need to do beyond looking at the initial statistics of the dataset is to calculate the number of cases by cancer type. However it appears that the mortality rate of Stage II is at least 30 higher than that of Stage I. However with the exception of a few outliers the ranges all seem the same for all three types of cancers except for MCC whose upper range is far smaller than that of the other two cancers. In this notebook I will be analysing the __ Real Breast Cancer Data https www. Infiltrating ductal carcinoma is the most common type of breast cancer followed by infiltrating lobular carcinoma. This fits with the fact that Infiltrating Ductal Carcinoma is the most common type of breast cancer in any given sample dataset it is likely that it is the most popular of all the types. 2 and its total spread is slightly larger as well from 1. Further investigation needs to be done to see whether levels are truly variable for all stages in all cancers or whether it is simply a quirk of our dataset. 67 and in Stage III it is 19. For this we need to transform the dataset to get the number of cases in each age range. At the other tail of the curve there is a decrease of 5 10 in numbers up to ages 75 80. Marker Protein 4 The values for this protein are again similar to protein 1 and 3. This could make any analysis of males vs females problematic as we would need a sample size of 4 in order to generate any significant results. Cancer cells with these receptors depend on estrogen and related hormones such as progesterone to grow. ConclusionsWe started this analysis with the intention of seeing any trends or correlation between the different attributes in breast cancer patients. Age distribution in datasetWe can also look at the age ranges in our dataset to get a feel for its distribution. After our analysis we see the following trends Male cancer patients make up a little more than 1 of all breast cancer patients in the dataset. But there are medicines specifically for HER2 positive breast cancers. Here we see the distribution patterns of protein markers for all the breast cancer types. Initially the cancerous growth is confined to the duct or lobule in situ where it generally causes no symptoms and has minimal potential for spread metastasis. Marker Protein 1 We see that for the most part the values are symmetrically spaced around the 0. ", "id": "sarwat182/breast-cancer-analysis", "size": "18206", "language": "python", "html_url": "https://www.kaggle.com/code/sarwat182/breast-cancer-analysis", "git_url": "https://www.kaggle.com/code/sarwat182/breast-cancer-analysis", "script": "pandas numpy matplotlib.pyplot ", "entities": "(('it', 'measurement'), 'name') (('we', 'cancer type'), 'construct') (('mean', '1 around 0'), 'be') (('marker levels', 'good prognostic age'), 'give') (('we', 'only 12 mucinous carcinoma'), 'see') (('it', 'data'), 'be') (('66', 'Infiltrating Ductal Carcinoma type'), 'be') (('values', 'symmetrically 0'), 'protein') (('where it', 'spread metastasis'), 'confine') (('mortality rate', 'Stage I.'), 'appear') (('ranges', 'cases'), 'see') (('ER receptors', 'dataset'), 'be') (('number', 'ages'), 'rise') (('cancer type', 'column'), 'give') (('just how type', 'samples'), 'be') (('total spread', 'correspondingly around 1'), 'be') (('we', 'HER2 positive patients'), 'need') (('ranges', 'cancer'), 'be') (('2 that', 'breast cancer'), 'be') (('Above we', 'no'), 'see') (('I', '_ _ Real Breast Cancer Data https www'), 'analyse') (('Mucinous curve', 'fairly sharply Lobular'), 'rise') (('upper range', 'other two cancers'), 'seem') (('total spread', 'slightly as well 1'), 'be') (('Age distribution', 'distribution'), 'look') (('mortality', '13'), 'be') (('Some', 'cancer three types'), 'be') (('problematic we', 'significant results'), 'make') (('however it', 'around 30'), 'jump') (('they', 'disease'), 'be') (('mean', 'Marker Protein'), 'be') (('I', 'breast cancers'), 'like') (('number', 'dataset'), 'be') (('differences', 'breast cancer'), 'be') (('such low levels', 'reports'), 'show') (('Data analysis', 'world'), 'be') (('55', 'Infiltrating Lobular Carcinoma type'), 'be') (('Cancer cells', 'such progesterone'), 'depend') (('About two thirds', 'breast cancers'), 'be') (('levelsAnother good way', 'age'), 'age') (('we', 'results'), 'create') (('We', 'how many male female patients'), 'see') (('breast 40 cancer', '40 65'), 'patient') (('mean', '4 around 0'), 'be') (('we', 'stage'), 'number') (('Marker 3 values', 'Marker Protein'), 'Protein') (('health that', 'number'), 'be') (('we', 'it'), 'need') (('typesAlternatively we', 'cancer'), 'alert') (('overall mortality', 'Mucinous Carcinoma'), 'be') (('cancer', '20'), 'use') (('that', 'them'), 'com') (('Male cancer patients', 'dataset'), 'see') (('it', 'protein markers'), 'make') (('actual mortality', 'slightly HER2 positive patients'), 'see') (('mortality', 'ages'), 'be') (('Here we', 'breast cancer types'), 'see') (('Breast cancer', 'breast'), 'arise') (('results', 'range'), 'try') (('above box', 'breast cancer'), 'show') (('cancer type', '1 possibility'), 'lessen') (('regressor model', '0'), 'be') (('world', 'past 5 years'), 'woman') (('come', 'Ductal Carcinoma'), 'mean') (('However levels', 'as 2'), 'go') (('we', 'Dead column'), 'be') (('which', 'as high 2'), 'be') (('they', 'breast cancer'), 'take') (('that', 'cancer'), 'produce') (('we', 'different datasets'), 'transform') (('IQR', '0'), 'be') (('patterns', 'dataset'), 'measure') (('First we', 'age range'), 'range') (('above analysis we', 'cancer protein levels'), 'level') (('ductal carcinoma', 'lobular carcinoma'), 'be') (('overall mortality', 'Ductal Carcinoma'), 'be') (('particular type', 'age range'), 'range') (('ConclusionsWe', 'breast cancer patients'), 'start') (('we', 'as well new insights'), 'corraborate') (('Conclusions Conclusions Future Future We', 'glance'), 'range') (('mean', '3 around 0'), 'be') (('Th', 'cancer type'), 'show') (('manually Now we', 'stage III'), 'subdivide') (('here greatest number', 'cancer'), 'be') (('Regressor models', 'model'), 'need') (('Marker 2 values', 'Marker Protein'), 'protein') (('large number', 'them'), 'filter') (('protein levels', 'cancer'), 'measure') (('So now we', 'dataset'), 'plot') (('analyses', 'two receptors'), 'check') (('it', 'simply dataset'), 'need') (('breast HER2 positive cancers', 'breast faster more back HER2 negative cancers'), 'tend') (('stage', 'protein different level'), 'construct') (('rates', 'age'), 'see') (('majority', 'Infiltrating Ductal variety'), 'have') (('overall mortality', 'Lobular Carcinoma'), 'be') (('that', 'cancer'), 'have') (('Lobular most patients', 'II stages'), 'present') (('overall range', 'Protein'), 'indicate') (('mortality rate', 'Stage II'), 'have') (('Marker 4 values', 'again protein'), 'Protein') (('high level', 'very high Protein 3 levels'), 'reach') (('Checking', 'breast cancer cells'), 'find') (('it', 'dataset'), 'be') (('it', 'most types'), 'fit') (('it', 'samples'), 'be') (('Patients', 'ages'), 'be') (('IQR', 'as well around 0'), 'be') (('mortality equal rate', 'around 20'), 'make') (('mortality', 'slightly 20'), '79') (('all', 'twenty percent'), 'hover') (('IQR', 'relatively 0'), 'be') (('we', 'age range'), 'need') (('which', 'analysis'), 'be') ", "extra": "['biopsy of the greater curvature', 'disease', 'gender', 'patient', 'test', 'metastasis']"}