{"name": "breast cancer histopathology images classification ", "full_name": " h1 Breast Cancer Histopathology Images Classification h2 Introduction h2 Challenges h2 Dataset h3 Import Libraries h3 Process Dataset h2 Define Helpers h2 Load Dataset h2 View sample images h2 Construct neural network start training h2 Evaluate neural network performance ", "stargazers_count": 0, "forks_count": 0, "description": "There are certain advantages that come with such digitalised pathology including remote diagnosis instant archival access simplified procedure of consultations with expert pathologists. Early accurate diagnosis plays an important role in choosing the right treatment plan and improving survival rate among the patients. edu build assets breast _gallery invasive lobular carcinoma. This database has been built in collaboration with the P D Laboratory Pathological Anatomy and Cytopathology Parana Brazil http www. To date it contains 2 480 benign and 5 429 malignant samples 700X460 pixels 3 channel RGB 8 bit depth in each channel PNG format. DatasetThe Breast Cancer Histopathological Image Classification BreakHis is composed of 9 109 microscopic images of breast tumor tissue collected from 82 patients using different magnifying factors 40X 100X 200X and 400X. Breast Cancer Histopathology Images Classification https pathology. A retrospective study showed that pathology review by experts changed the nodal status in 24 of patients. jpg IntroductionBreast cancer is a common cancer in women and one of the major causes of death among women around the world with 627 000 deaths among 2. Microscopic evaluation of histopathalogic stained tissue its subsequent digitalisation is now a more feasible due to the advances in slide scanning technology as well a reduction in digital storage cost in recent years. This could result in a significant reduction in the workload of pathologists. Invasive ductal carcinoma IDC is the most widespread type of breast cancer with about 80 of all diagnosed cases. ChallengesThe sensitivity of SLN assessment by pathologists however is not optimal. Import Libraries Process Dataset Define Helpers Load Dataset View sample images Construct neural network start training Evaluate neural network performance remove 600 from dataset for testing split training and validation set upsampling training dataset view first 30 prediction view wrong prediction. jpg https pathology. We believe that researchers will find this database a useful tool since it makes future benchmarking and evaluation possible. SLN assessment is tedious and time consuming. It has been shown that deep learning algorithms could identify metastases in SLN slides with 100 sensitivity whereas 40 of the slides without metastases could be identified as such. Digitalised Analysis based on Deep Learning has shown potential benefits as a potential diagnosis tool strategy. 1 million diagnosed cases in 2018. ", "id": "nasrulhakim86/breast-cancer-histopathology-images-classification", "size": "2541", "language": "python", "html_url": "https://www.kaggle.com/code/nasrulhakim86/breast-cancer-histopathology-images-classification", "git_url": "https://www.kaggle.com/code/nasrulhakim86/breast-cancer-histopathology-images-classification", "script": "sklearn.metrics albumentations build_network parse_image scikitplot augmentor tensorflow.keras.models seaborn numpy view_prediction resize_rescale view_wrong_prediction tensorflow_addons functools matplotlib.pyplot tensorflow pandas partial tensorflow_hub tensorflow.keras Model layers decode_test training_history view_image aug_fn ", "entities": "(('This', 'pathologists'), 'result') (('certain that', 'expert pathologists'), 'be') (('ductal carcinoma Invasive IDC', 'diagnosed cases'), 'be') (('40', 'metastases'), 'show') (('pathology review', 'patients'), 'show') (('jpg IntroductionBreast cancer', '2'), 'be') (('subsequent digitalisation', 'recent years'), 'be') (('Digitalised Analysis', 'diagnosis tool potential strategy'), 'show') (('database', 'Cytopathology Parana www'), 'build') (('ChallengesThe sensitivity', 'pathologists'), 'be') (('Early accurate diagnosis', 'patients'), 'play') (('benchmarking', 'useful tool'), 'believe') (('it', '5 channel 429 malignant 700X460 pixels 3 8 bit depth channel'), 'contain') (('edu', 'invasive lobular carcinoma'), 'build') (('DatasetThe Breast Cancer Histopathological Image Classification BreakHis', 'magnifying different factors'), 'compose') (('first 30 prediction', 'wrong prediction'), 'Helpers') ", "extra": "['biopsy of the greater curvature', 'patient', 'test', 'diagnosis', 'procedure']"}