{"name": "breast cancer detection idc ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "csv and displays it Class1 represents IDC and Class0 represents IDC Code Conclusion We can see that we have an unbalanced class and which is a common problem when we have medical data therefore this is one another problem that we have to deal with later. We would encode our output data which is present as Class1 and Class0 to 1 and 0. About 80 of all breast cancers are invasive ductal carcinomas. We will save it in output. The Code inspiration for undersampling is taken from a notebook https www. to plot confusion matrix For Image argumentaton rescaling X_valid rescaling X_Test downloading model for transfer learning preprocessing the input so that it could work with the downloaded model calculating bottleneck features this inshure that we hold the weights of bottom layers Bar chart to compare different models Number of positive cases Senstivity of models Number of postive cases number of negative cases dataframe to store the results Function to create a network Keras classifier to make it work with sklearn K Fold cross validation. We change pixels range from 0 255 to 0 1. Data Exploration In data exploration we will first check the name of the files. Code Conclusion We have total of 277524 image filesNext Step is that we will check whether the dimentions of all the images are same or different Code Conclusion We can see that the dimentions of images are not equal therefore we would make it all equal to work bettter with our network. In developed countries the survival rate is although high but it is an area of concern in the developing countries where the 5 year survival rates are poor. Invasive ductal carcinoma IDC is the most common form of breast cancer. Now we will split our data into training set and testing set. In India there are about one million cases every year and the five year survival of stage IV breast cancer is about 10. In the next step we will OneHot encode our data to better work with neural networks. com wp content uploads 2018 01 AI_Mammographie. Next step is we need to extract the class names in which each files belong from its file names. This is an active research field lot of research papers and articles are present online one that I like is https www. Below code reads the data from output. Doctors often do the biopsy or a scan if they detect signs of IDC. linear algebra data processing CSV file I O e. Robustness of the Model To check the robustness of the model we would perform K Fold CV on the dataset and if the validation socre on each fold does nt change much we can say that the model i robust Code Conclusion 5 Fold Cross Validations is performed and as we can see that the difference in validation score is near about 0. read_csv to check the name of the directory inside which we have our files glob is used to extract the files from a particular folder will store end 3 letters of all the file names extentions any valid image will have extention in alphabets this line checks for such alphabet extentions we extract only png files We don t need the files variable so delete it. function to view an image reads an image displays an image to plot multiple image to plot histogram of pixel values present in an image VS intensities to open and write csv files Allows the use of display for DataFrames to display image along with their labels we have to show only one image of class0 therefore this variable is to check that we have to show only one image of class1 therefore this variable to check that for subplot position to shuffle the data to hot encode the output labels to hot encode the data For performing undersampling Constructor of the class to perform undersampling resamples the dataset resamples the dataset For Plotting the distribution of classes hot encoding them create iterators for effective looping Plotting the confusion matrix for checking the accuracy of the model Import layers for the model Our model will be Sequential Flattens the matrix into a vector Compiling the model Checkpoint to save the best weights of the model. Therefore we will load only that. In 2012 it resulted in 1. Algorithm for passing a new image and predicting whether it has breast cancer or not. Therefore it is very important to detect the signs as early as possible. One of the major problems is that women often neglect the symptoms which could cause more adverse effects on them thus lowering the survival chances. Data Extraction and Visualization Code Conclusion We can see that images are very small though they are cropped images its hard for human eye to understand them without using some high costly machines. Data Processing We will first shuffle are images to remove any patterns if present and then load them. BENCHMARK MODEL A simple CNN model Now we will plot the confusion matrix Image Argumentation We will now add image argumentation to our data so that it may be set for wider range of domainWe will also rescale our image pixels from range of 0 255. used for computer vision tasks such as reading image from file changing color channels etc for plotting various graph images etc. We need to now preprocess our image file. This shows the power of automation and how it could help in the detection of breast cancer. We will go for spliting testing set into validation set. jpg Domain Background Breast Cancer is the most common type of cancer in woman worldwide accounting for 20 of all cases. Code Conclusion There are only png extentions which are present in alphabets therefore it means that we have only one image extention files with. We will now create our benchmark model. Therefore automation of detection of breast cancer using Histopathology images could reduce cost and time as well as improve the accuracy of the test. Breast Cancer Detection https blogs. adds support for opening manipulating and saving many different image file formats adds progress bar for the loops going through all the images will take up lot of memory so therefore we will check until we get three different dimentions. We can do two things either split test set further into valid set or split train se into valid set. com paultimothymooney predict idc in breast cancer histology imagesWe also need a validation set inorder to check overfitting. Now we will plot the confusion matrix Transfer Learning We will now add transfer learning from various models Now we will plot the confusion matrix Comparision is made between three algorithms with repect to false positives and false negatives. Load the saved weights from file. As considering dealing with cancer the algorithm must give less false negative at its a matter of death and life. Result We can see that tranfer learning and image argumentation both are doing a great job they both have senstivity and specificity o about 0. We will now do undersampling to treat our data for class imbalances. The cost of testing for breast cancer sets one back with 5000 which is a very big amount for poor families and also manual identification of presence and extent of breast cancer by a pathologist is critical. Now lets look at the color ranges that our images have Code Conclusion From the above image we can conclude that brighter region is more than the darken region in our image. IMPORT FILES Local Directory We explore the name of the directory inside which our datafiles are present. 01 which is very small therefore we can say that our model is robust. We have a large dataset and we will work with neural networks therefore for better debugging we will use only a part of data considering limited RAM and non GPU processor this will not cost us much as we would also be using under sampling methods and image argumentation to deal with class imbalances and moderate data. Now we have our three sets of train valid and test. 68 million new cases and 522 000 deaths. gov pmc articles PMC5453426 as they used deep learning approach to study on histology images and achieved the sensitivity of 95 which is greater than many pathologists 90. ", "id": "animeshseemendra/breast-cancer-detection-idc", "size": "5950", "language": "python", "html_url": "https://www.kaggle.com/code/animeshseemendra/breast-cancer-detection-idc", "git_url": "https://www.kaggle.com/code/animeshseemendra/breast-cancer-detection-idc", "script": "Flatten sklearn.utils sklearn.metrics glob shuffle #to shuffle the data keras.preprocessing.image cross_val_score keras.layers keras.callbacks GlobalAveragePooling2D #Import layers for the model 1 images class_output GlobalAveragePooling2D predict manipulating cv2 #used for computer vision tasks such Dropout Sequential keras.applications.vgg19 ModelCheckpoint  #Checkpoint to save the best weights of the model. RandomUnderSampler #For performing undersampling shuffle Conv2D and saving many different image file formats numpy preprocess_input #preprocessing the input so that it could work with the downloaded model plot_confusion_matrix plot_images Sequential #Our model will be Sequential PIL view_images ModelCheckpoint sklearn.model_selection confusion_matrix matplotlib.pyplot hist_plot display # Allows the use of display() for DataFrames Dense keras.utils imblearn.under_sampling pandas vis_data Image #adds support for opening tqdm glob #glob is used to extract the files from a particular folder VGG19 #downloading model for transfer learning to_categorical #to hot encode the data 0 images confusion_matrix #to plot confusion matrix preprocess_input KerasClassifier MaxPooling2D ImageDataGenerator  #For Image argumentaton create_network keras.models tqdm #adds progress bar for the loops keras.wrappers.scikit_learn train_test_split IPython.display to_categorical #to hot encode the output labels ", "entities": "(('it', 'bettter network'), 'Conclusion') (('We', 'train split valid set'), 'do') (('we', 'three different dimentions'), 'add') (('it', 'breast cancer'), 'Algorithm') (('which', '1'), 'encode') (('year survival where 5 rates', 'developing countries'), 'be') (('we', 'image extention only one files'), 'Conclusion') (('we', 'files'), 'Exploration') (('We', 'class imbalances'), 'undersample') (('Now we', 'training'), 'split') (('datafiles', 'which'), 'Directory') (('it', 'K validation'), 'feature') (('IV breast cancer', 'one year about million year five stage'), 'be') (('We', 'validation set'), 'go') (('brighter region', 'image'), 'range') (('we', 'image class imbalances'), 'have') (('Now we', 'train'), 'have') (('more adverse effects', 'survival thus chances'), 'be') (('difference', 'about 0'), 'Robustness') (('We', '255 0'), 'change') (('they', 'IDC'), 'do') (('I', 'research field research active papers'), 'be') (('We', 'image now file'), 'need') (('idc', 'overfitting'), 'predict') (('confusion matrix Comparision', 'false positives'), 'plot') (('which', 'pathologist'), 'set') (('Therefore automation', 'test'), 'reduce') (('we', 'one that'), 'represent') (('which', 'many pathologists'), 'article') (('Therefore it', 'very signs'), 'be') (('algorithm', 'death'), 'give') (('it', '0'), 'model') (('they', 'about 0'), 'result') (('Code inspiration', 'notebook https www'), 'take') (('files', 'so it'), 'use') (('ductal carcinoma Invasive IDC', 'breast most common cancer'), 'be') (('About 80', 'breast cancers'), 'be') (('files', 'file names'), 'be') (('how it', 'breast cancer'), 'show') (('first shuffle', 'then them'), 'Processing') (('very they', 'high costly machines'), 'Extraction') (('model', 'model'), 'read') (('we', 'better neural networks'), 'OneHot') (('jpg Domain Background Breast Cancer', 'cases'), 'be') ", "extra": "['biopsy', 'test']"}