{"name": "build characteristics corona patients part a ", "full_name": " h1 DS consolidation h1 datasets shape h1 Datasets columns h1 change name of columns h1 drop feature h1 drop h1 format col h1 Complete features h1 look h1 build final DS h1 orgnaze DS h1 feature h1 Garbage drop ", "stargazers_count": 0, "forks_count": 0, "description": "7 s confirmed_date colombia deceased_date colombia released_date colombia return_date date_onset_symptoms colombia date_death_or_discharge 1min 7s ECMO ecmo oxygen mask oxygen mask oxi dialysis dialysi mechanical ventilation mechan ventil 17. loc 251 age_band 30s 30s 30 dataset with clean age age_band from dirty age range and more india_data Complete contry by dataset japan Manual care from str index str from str Special id index str from Special id index str kerla philippines Went to Greenhills France UAE Korea USA For validation 614 None USA With Exposure History to a known COVID 19 case Diamond Princess Cruise Ship singapore uk 186 usa 70 unknown 36 uae tunisia Local guatemala unknown new_zealand UAE USA canada Not Reported Cruise clean Patient Number origin_severity_illness background_diseases_binary infected_by infection_place mexico. 61 s most havy section 5 0. nan if x else x mexico world hong_kong user user 38. shape Datasets columns change name of columns drop feature drop format coltimes date_onset_symptoms confirmed_datedeceased_date released_date return_datesex Complete featuressymptomsbackground_diseasesbackground_diseases_binarytretmentseverity_illnessreleased_date deceased_dateageage_bandcountryregioncityinfected_byinfection_place TODOrecovery_testsmokingorigin look build final DS orgnaze DSdel error row feature countryinfected_bysymptomscountry Garbage drop Features that have only one dataset or built with Engineered another feature with themwrite csv import all datasets Only include confirm cases Only include confirm cases Remove the cases that belonging to China Consolidation of information from canada_dead to canada_cases duplicated exsam RAM save Only include confirm cases CODIGO ISO DEL PAIS country FECHA DE DIAGNOSTICO confirmed_date FECHA DE INICIO DE SINTOMAS date_onset_symptoms FECHA RECUPERADO released_date FECHA DE MUERTE deceased_date Manual care handel on all 1. background_diseases TODO VEC if need world del notnull hospitalized tunisia france india_data colombia mexico kerla hong_kong toronto usa world concat treatment cols format severity_illness to categories if they give him category col Collects information about the severity_illness from various columns in the database deceased_date and released_date colombia deceased_date released_date Unique singapore deceased deceased mexico critical UCI colombia treatment_origin RECUPERADO hong_kong toronto usa order is matter critical before deceased unit severity_illness2 severity_illness1 Analyzes text from different columns and adds categories to severity_illness2 clean str and make a list add to severity_illness2 severity_illness categories possible by analysis of the symptom column according to the WHO classification classification by symptoms unit cols choose category by dictionary_importance clean kerla clean formt to float age from birth_year Manual care japan canada usa 20 29 Years 20 29 japan. 2 s 1min 12s Completing information from other columns take data from symptoms_origin and Final Diagnosis unite data from different cols guatemala. This notebook is part of a project Characteristics Corona patients DSthe project s target Build a clean and detailed database as detailed as possible on the characteristics of Corona patients from around the worldPurpose of the notebook Build a patient level databasefrom different information setsby cleaning the heating and connecting the arrays DS consolidationhong_kongcanadausamexicodatasets list datasets. 893 japan philippines kerla tunisia vietnam vietnam return_date colombia for col in released_date deceased_date date_onset_symptoms confirmed_date colombia col colombia col. ", "id": "shirmani/build-characteristics-corona-patients-part-a", "size": "1006", "language": "python", "html_url": "https://www.kaggle.com/code/shirmani/build-characteristics-corona-patients-part-a", "git_url": "https://www.kaggle.com/code/shirmani/build-characteristics-corona-patients-part-a", "script": "jj text_analysis collections numpy control python_expansion jengineer division_by_symptoms_WHO pandas clean clean_age orgnize_id clean_time Counter ", "entities": "(('Diamond Princess Cruise Ship singapore uae 186 70 unknown 36 Local guatemala', 'new_zealand UAE USA canada'), 'dataset') (('DS consolidationhong_kongcanadausamexicodatasets list', 'arrays'), 'be') (('kerla tunisia vietnam vietnam', 'date_onset_symptoms confirmed_date colombia col colombia col'), 'return_date') (('date_onset_symptoms colombia', '1min 7s ECMO ecmo oxygen mask oxygen mask oxi dialysis mechanical ventilation'), 'deceased_date') (('list', '20 29 Years 20 29 japan'), 'hospitalize') (('released_date FECHA DE MUERTE', '1'), 'drop') (('1min 2 Completing information', 'cols different guatemala'), 's') (('mexico world hong_kong else user', 'x'), 'nan') ", "extra": "['disease', 'onset', 'patient', 'test', 'bag', 'diagnosis']"}