{"name": "chestx ray8 eda beginner code ", "full_name": " h1 1 NIH Chest X ray Dataset h2 National Institutes of Health Chest X Ray Dataset h2 1 2 Data limitations h3 File contents h3 BBoxlist2017 csv Bounding box coordinates Note Start at x y extend horizontally w pixels and vertically h pixels h3 Dataentry2017 csv Class labels and patient data for the entire dataset h3 1 3 Class descriptions h2 1 4 Special Remarks h3 In order to use the images for a classification task I converted the metadata file Data Entry 2017 csv and converted it into a one hot vector encoding for using in classification problem here h1 2 Loading Data h2 2 1 Loading Libraries h2 2 2 Loading DataFrames h2 2 3 Removing Samples with Bad Labels h3 2 4 Preparing Images h3 2 5 Creating Data Generator h3 2 6 Look at the X rays h3 2 7 Diagnosis Distribution Normal vs Sick h3 2 8 Diagnosis Distribution h3 2 9 Age Histogram Distribution ", "stargazers_count": 0, "forks_count": 0, "description": "However clinical diagnosis of a chest X ray can be challenging and sometimes more difficult than diagnosis via chest CT imaging. csv Bounding box coordinates. gov was the largest publicly available source of chest X ray images with 4 143 images available. It is quire evident that almost half of the images didn t have any problem. 3 Class descriptionsThere are 15 classes 14 diseases and one for No findings. num_replicas_in_sync normalize images flow from directory with specified batch size and target image size bokeh packages show diag_dist build histogram data with Numpy bokeh histogram with hover tool hover tool output. Therefore they are removed. Hernia is very small 0. pdf Original README file BBoxlist2017. Just checked the patients with age greater than 100 and found out several patients samples where age is listed 140 year to even 450 years P P P Then I replaced those values with mean of the rest of the dataset which are less than 100 years old because they are simply data entry error. 8 Diagnosis DistributionNow lets have a look at the distribution of the dataset. 6 Look at the X raysNow lets have a look at the original dataset. 2 Loading DataFrames 2. NIH Chest X ray Dataset National Institutes of Health Chest X Ray DatasetChest X ray exams are one of the most frequent and cost effective medical imaging examinations available. We also use the generator to transform the values in each batch so that their mean is 0 and their standard deviation is 1. Parties who use this public dataset are encouraged to share their updated image labels and or new bounding boxes in their own studied later maybe through manual annotation File contentsImage format 112 120 total images with size 1024 x 1024 images_001. 4 Preparing ImagesWith our dataset splits ready we can now proceed with setting up our model to consume them. This will facilitate model training by standardizing the input distribution. This class also provides support for basic data augmentation such as random horizontal flipping of images. However we can have a look at the number of healthy and non healthy x rays. 5 Creating Data GeneratorBefore we create the training data generator from the keras built in library we can set several parameters. zip Contains 10 000 images images_005. 7 Diagnosis Distribution Normal vs Sick Now lets have a look at the distribution of the dataset. gov news events news releases nih clinical center provides one largest publicly available chest x ray datasets scientific community 1. It turns out some of the images are problematic as discussed in this datasets discussion thread https www. zip Contains 10 000 images images_012. There are a few things to note 1. 2 Data limitations The image labels are NLP extracted so there could be some erroneous labels but the NLP labeling accuracy is estimated to be 90. 3 Class Description 1 3 1. zip Contains 10 000 images images_007. zip Contains 10 000 images images_004. Then I had a look at the metadata checking the Patient Age has some unusually high numbers. 2 Loading DataFrames 2 2 1. 3 Removing Samples with Bad LabelsYou oboserve that in main dataset Data_Entry_2017. You can run the following cell multiple times to get more images. zip Contains 10 000 images images_006. com redwankarimsony chestxray8 dataframe I also removed some of the images from the dataframe as those images were inverted rotated or not frontal view of the chest because they carry little or no information necesary for the classification problem. zip Contains 10 000 images images_010. 1 Brief Overview 1 1 1. The generator also converts our single channel X ray images gray scale to a three channel format by repeating the values in the image across all channels. csv contains only 111863 images. Prior to the release of this dataset Openi https openi. This NIH Chest X ray Dataset is comprised of 112 120 X ray images with disease labels from 30 805 unique patients. They are inverted not frontal or somehow badly rotated. csv contains 112120 rows but in modified dataset train_df. The lack of large publicly available datasets with annotations means it is still very difficult if not impossible to achieve clinically relevant computer aided detection and diagnosis CAD in real world medical sites with chest X rays. Images can be classified as No findings or one or more disease classes Atelectasis Consolidation Infiltration Pneumothorax Edema Emphysema Fibrosis Effusion Pneumonia Pleural_thickening Cardiomegaly Nodule Mass Hernia 1. 28 only among the sick patients. zip Contains 4999 images images_002. csv Class labels and patient data for the entire datasetImage Index File nameFinding Labels Disease type Class label Follow up Patient IDPatient AgePatient GenderView Position X ray orientationOriginalImageWidthOriginalImageHeightOriginalImagePixelSpacing_xOriginalImagePixelSpacing_y 1. 9 Age Histogram DistributionLooking at the dataframe from the metadata I found something interesting. histogram I was getting unusually high range. 1 Loading Libraries 2. Wang et al https www. The input is shuffled after each epoch. com nih chest xrays data discussion 55461. NIH Chest X ray Dataset 1 1 1. You can play with the folowing parameters to see what changes. So we need to do a little bit of peprocessing here to deal with that matter and we are good to go. They are simply the x rays of healthy people marked as No Finding in the data frame. To create these labels the authors used Natural Language Processing to text mine disease classifications from the associated radiological reports. The labels are expected to be 90 accurate and suitable for weakly supervised learning. zip Contains 10 000 images images_003. For this the off the shelf ImageDataGenerator https keras. 2 Data Limitations 1 2 1. One major hurdle in creating large X ray image datasets is the lack resources for labeling so many images. 4 Special Remarks In order to use the images for a classification task I converted the metadata file Data_Entry_2017. 4 Special Remarks 1 4 2. 1 Loading Libraries 2 1 2. At first try when I wanted to draw the histogram using np. Import necessary packages Listing all the. We will want this because the pre trained model that we ll use requires three channel inputs. Very limited numbers of disease region bounding boxes See BBoxlist2017. zip Contains 10 000 images images_011. io preprocessing image class from the Keras framework which allows us to build a generator for images specified in a dataframe. The default image size is selected as 320px by 320px but it can be changed. However the hightest prevalance Infiltration has only 25 and rest of the 13 classses combines to the rest. Loading Data 2 1 2. csv Chest x ray radiology reports are not anticipated to be publicly shared. Note Start at x y extend horizontally w pixels and vertically h pixelsImage Index File nameFinding Label Disease type Class label Bbox xBbox yBbox wBbox h Dataentry2017. Here get_label function returns the concatenated version of the names of the diagnosis categories. The original radiology reports are not publicly available but you can find more details on the labeling process in this Open Access paper ChestX ray8 Hospital scale Chest X ray Database and Benchmarks on Weakly Supervised Classification and Localization of Common Thorax Diseases. csv and converted it into a one hot vector encoding for using in classification problem here https www. zip Contains 7 121 imagesREADME_ChestXray. jpg filepaths Merge the absolute path of the images to the main dataframe BATCH_SIZE 8 strategy. So the dataset has highly imbalanced positive class which will in turn create problem of negative bias while training CNN models. zip Contains 10 000 images images_009. The mean and standard deviation of the data is normalized3. We observe that among the different identified conditions Infiltration Effusion and Atelectasis have the highest dominance and Hernia has the lowest prevalance. Since it is mainly a matter of reading and understanding Keras documentation we have implemented the generator for you. zip Contains 10 000 images images_008. ", "id": "mohamed3abdelrazik/chestx-ray8-eda-beginner-code", "size": "8707", "language": "python", "html_url": "https://www.kaggle.com/code/mohamed3abdelrazik/chestx-ray8-eda-beginner-code", "git_url": "https://www.kaggle.com/code/mohamed3abdelrazik/chestx-ray8-eda-beginner-code", "script": "keras.preprocessing.image glob bokeh.transform row isdir cumsum bokeh.models.tools Category20b figure bokeh.palettes bokeh.plotting get_train_generator BuGn4 listdir show seaborn numpy os.path output_notebook column ColumnDataSource PIL bokeh.layouts bokeh.models get_label join ImageDataGenerator LinearAxis Image matplotlib.pyplot isfile os pandas plot_pie_bokeh cividis hist_hover tqdm pi HoverTool output_file Range1d math IPython.display Category20c ", "entities": "(('we', 'channel three inputs'), 'want') (('You', 'folowing parameters'), 'play') (('This', 'input distribution'), 'facilitate') (('highest dominance', 'lowest prevalance'), 'observe') (('NIH Chest X ray Dataset', '30 805 unique patients'), 'comprise') (('histogram I', 'unusually high range'), 'get') (('us', 'dataframe'), 'io') (('get_label Here function', 'diagnosis categories'), 'return') (('However clinical diagnosis', 'chest CT imaging'), 'challenge') (('I', 'metadata file'), 'Remarks') (('we', 'you'), 'implement') (('generator', 'channels'), 'convert') (('less than 100 years they', 'dataset'), 'check') (('Images', 'disease Atelectasis Consolidation Infiltration Pneumothorax Edema Emphysema Fibrosis Effusion Pneumonia Pleural_thickening Cardiomegaly Nodule Mass one Hernia'), 'classify') (('Removing 3 Samples', 'main dataset'), 'oboserve') (('it', '320px'), 'select') (('publicly you', 'Common Thorax Diseases'), 'be') (('However we', 'x healthy rays'), 'have') (('standard deviation', 'batch'), 'use') (('Infiltration', 'rest'), 'have') (('Chest X Ray DatasetChest X ray exams', 'imaging effective medical examinations'), 'be') (('they', 'classification problem'), 'dataframe') (('Now lets', 'dataset'), 'normal') (('labels', 'accurate weakly supervised learning'), 'expect') (('we', 'here matter'), 'need') (('Very limited numbers', 'BBoxlist2017'), 'see') (('They', 'data frame'), 'be') (('Class 3 descriptionsThere', '15 classes 14 findings'), 'be') (('mean deviation', 'data'), 'be') (('almost half', 'didn problem'), 'be') (('class', 'images'), 'provide') (('it', 'chest X rays'), 'mean') (('I', 'something'), 'DistributionLooking') (('Diagnosis DistributionNow 8 lets', 'dataset'), 'have') (('One major hurdle', 'lack so many images'), 'be') (('gov', '4 143 images'), 'be') (('You', 'multiple times more images'), 'run') (('which', 'CNN models'), 'imbalance') (('some', 'discussion thread https www'), 'turn') (('csv', 'modified dataset'), 'contain') (('Then I', 'unusually high numbers'), 'have') (('who', 'size'), 'encourage') (('target image size bokeh diag_dist', 'hover tool hover tool output'), 'show') (('6 Look', 'original dataset'), 'have') (('dataset we', 'them'), 'split') (('jpg filepaths', 'main dataframe'), 'merge') (('we', 'several parameters'), '5') (('when I', 'np'), 'at') (('chest one largest publicly available ray', 'scientific community'), 'release') ", "extra": "['annotation', 'disease', 'gender', 'patient', 'test', 'diagnosis', 'edema', 'pleura']"}