{"name": "coronawhy org task risk factors ", "full_name": " h2 Table of Contents h1 1 Introduction h1 2 Task Overview h1 3 Summary Page findings h2 Evidence for association of risk factor with COVID 19 h3 Heart Disease Risks overview h3 Top 20 most relevant papers when it comes to heart disease as a risk factor h3 Top 10 papers on heart risk disease as a risk factor qualified by human input h3 Age overview h3 Top 20 most relevant papers when it comes to age as a risk factor h3 Top 10 papers on age as a risk factor qualified by human input h3 Humidity overview h3 Top 20 most relevant papers when it comes to humidity as a risk factor h3 Top 10 papers on humidity as a risk factor qualified by human input h3 Pollution overview h3 Top 15 most relevant papers when it comes to pollution as a risk factor h3 Top 10 papers on pollution as a risk factor qualified by human input h3 Temperature overview h3 Top 20 most relevant papers when it comes to temperature as a risk factor h3 Top 10 papers on temperature as a risk factor qualified by human input h3 All papers on heart diseases risks validated using crowdsourced medical input h3 Population density overview h3 Top 20 most relevant papers when it comes to population density as a risk factor h3 Top 10 papers on population density as a risk factor qualified by human input h1 4 Risk factors and respective studies h2 Groups of factors in progress h3 1 Demographic Factors h3 2 Diseases h3 3 Environmental Factors h3 4 Genetic Factors h3 5 Lifestyle Factors h3 6 Socieconomic Factors h1 5 Defining Workflow h3 The Stages in Detail h3 Degree of Automation h3 Portability h1 6 Case Study Heart Disease Risk Factors h3 Part 1 Produce N grams h3 Part 2 Search for Relevant Papers h3 Part 3 Medical Input h3 Part 4 A Snapshot of Output h3 And here are some key phrases that demonstrate the effectiveness of our output h1 7 Our Notebooks h4 https www kaggle com pranjalya coronawhy risk factors analysis h1 8 Why We Did What We Did h1 9 Next goal June deadline h1 10 Daily calls h1 11 Appendix h2 Data visualization of all the outputs h2 Geopatial analysis overview h2 How to use h2 Climate Metrics h2 Demographic Metrics h3 Public health mitigation measures that could be effective for control h1 12 Credits ", "stargazers_count": 0, "forks_count": 0, "description": "Some examples that are generated are aortic valve stenosis rheumatic heart disease and congestive heart failure. That s why we ve decided to list out all the possible ones and group them. probably worth a Netflix documentary on how 900 members from all over the world managed to figure out a way to work together and produce meaningful results in a very very short timeframe. gov pmc articles PMC6603263 Heart Disease Impact of rotating levels of ACE in cardiac disease patients 4 https www. Currently we have comprehensive climate data available for visualization only in the country of Italy none of the other countries can be analyzed with this tool yet. Semantic exploration of n gram approach6. gov pmc articles PMC5103241 Air Temp Unique and Conserved Features of Genome and Proteome of SARS coronavirus an Early Split off From the Coronavirus Group 2 Lineage 1 not topic of discussion https doi. gov pmc articles PMC1764026 population density Identifying Live Bird Markets with the Potential to Act as Reservoirs of Avian Influenza A H5N1 Virus A Survey in Northern Viet Nam and Cambodia densely populated populated areas 2 https www. 1016 s0008 8749 03 00026 1 population density Early real time estimation of the basic reproduction number of emerging or reemerging infectious diseases in a community with heterogeneous contact pattern Using data from Hong Kong 2009 H1N1 Pandemic Influenza as an illustrative example densely populated 1 https www. 027 age Rhinitis Asthma and Respiratory Infections among Adults in Relation to the Home Environment in Multi Family Buildings in Sweden 65 years old 5 https www. Demographic Factors Risk Factor Search Query Number of papers of papers Age 60 underlying health conditions senior citizen OR 65 age 3 OR 65 years OR elderly 3300 10 Men women men AND women OR gender AND NOT cat OR pig 2700 8 Neonates newborn OR neonate AND children OR babies AND NOT mice OR rat 974 3 Infants infant 3600 11 Race Ethnicity race OR ethnic OR asian OR african OR hispanic OR or caucasian 6900 21 Sexual Orientation sexual orientation OR homosexual OR transgender OR heterosexual 250 1 Pregnant Women pregnant OR gestation OR trimester AND human OR man OR woman OR children OR infants OR people OR patients 2700 8 Family composition elderlies kids family composition OR household AND human OR man OR woman OR children OR people OR patients 2300 7 Day Care Attendance day care OR daycare OR child care AND center OR centre 581 2 Crowding Siblings crowding AND household OR home OR siblings AND human OR man OR woman OR children OR infants OR people OR person 1200 4 2. This is displayed as a circle in the centre of a region the size displays the relative count. Link to code https colab. 1016 s1473 3099 20 30243 7 age Burden seasonal pattern and symptomatology of acute respiratory illnesses with different viral aetiologies in children presenting at outpatient clinics in Hong Kong older age group 5 https doi. Portability The clear advantage of our current workflow is that it can be used for a plethora of applications. gov pmc articles PMC212558 Population Density Spatiotemporal diffusion of influenza A H1N1 Starting point and risk factors Population density represented a risk factor for disease intensity https www. 015 temperature Effects of school breaks on influenza like illness incidence in a temperate Chinese region an ecological study from 2008 to 2015 temperate summer winter 24 https www. gov pmc articles PMC5380673 population density Spatiotemporal diffusion of influenza A H1N1 Starting point and risk factors populous 1 https www. In this visualization Group A corresponds to the COVID case statistic type deaths recovered active. Summary Page findings Evidence for association of risk factor with COVID 19 Heart Disease Risks overview We ve identified 139 papers relevant to this risk factor across CORD 19 dataset here we are presenting top 20 by the number of keyword occurences Visualization of n grams heart n https drive. gov pmc articles PMC7104618 temperature Respiratory viruses are continuously detected in children with chronic tonsillitis throughout the year summer winter spring autumn 25 https doi. gov pmc articles PMC6306566 Heart Disease Pneumonia Pathogen Characterization Is an Independent Determinant of Hospital Readmission 13 Other independent predictors of 90 day readmission for pneumonia patients were Charlson comorbidity score includes heart disease 4 cirrhosis and chronic kidney disease. gov pmc articles PMC6518603 Heart Disease Clinical outcomes of treatment for heart failure 3 http europepmc. 1 5 October 2016 patients older than 2 https www. 1016 0042 6822 83 90548 2 Air Temp The epidemiology of hospitalized children with pneumococcal lobar pneumonia and empyema from 1997 to 2004 in Taiwan 11 seasonality https www. com uc id 16GjTMqZ1fcGSlTB1yZ_ACAQvHmipvzsU Top 20 most relevant papers when it comes to humidity as a risk factor Risk Factor Title Keyword Ngram No of keyword occurences URL humidity Association between viral seasonality and meteorological factors humidity 66 https www. com uc id 1R4iTdIj33jn7T4P1XfRfjdSbBMNpMRG2 A tool built with Carta for exploring geospatial relationships between COVID 19 prevalence by cases recovery and or fatality and geospatial properties climate and demographic factors at different geospatial resolution country region etc. 12044 Heart Disease Cardiac injury found to be correlated with increased risk for being a non survivor. The options on the left are best when only using one selection from each group Group A Age GenderGroup B COVID 19 cases Total Active Recovered and DeathsGroup C Regional Population Density of average number of people per square kilometer. This brings the volume of papers for review down to less than 100 200 instead of multiple thousands rendering the review task feasible in much shorter timeframes. gov pmc articles PMC5042924 heart risks Increase in methicillin resistant Staphylococcus aureus acquisition and change in pathogen pattern associated with outbreaks of severe acute respiratory syndrome SARS heart disease cardiac arrest heart failure 6 https www. gov pmc articles PMC3080933 pollution The impact of ambient fine particles on influenza transmission and the modification effects of temperature in China A multi city study air pollution is 1 https doi. 3 2 https doi. 14 17 October 2015 3 https www. Group B corresponds to the specific metrics being examined climatic or demographic depending on the visualization. 2 beds per 1000 yellow 0. 059 Pollution overview We ve identified 15 papers relevant to this risk factor across CORD 19 dataset here we are presenting top 15 by the number of keyword occurences Visualization of 2 grams heart n https drive. If a region had a uniform distribution of ages they would all be white dots so this example from Emilia Romagna shows a lower proportion of under 29 s and an over representation of 40 59 year olds. gov pmc articles PMC5856805 population density Rapid changes in shape and number of MHC class II expressing cells in rat airways after Mycoplasma pulmonis infection densely populated 1 https doi. org articles pmc3179261 pdf render 3 And here are some key phrases that demonstrate the effectiveness of our output Univariate analysis showed that a severe outcome was significantly more frequent for patients with comorbidity OR 3. The notebook then captures only the ICD codes that fit within the ICD code range pertaining to what the user requires bigrams trigrams of. gov pmc articles PMC5493079 Heart Disease Clinical Features Severity and Incidence of RSV Illness During 12 Consecutive Seasons in a Community Cohort of Adults 60 Years Old 14 The relative risk of a serious outcome was significantly increased in persons aged 75 years vs 60 64 years and in those with chronic obstructive pulmonary disease or congestive heart failure. com arturkiulian coronawhy org global collaboration join slack for historical context on how this community started. gov pmc articles PMC6306566 age Perception of epidemic s related anxiety in the General French Population a cross sectional study in the Rhône Alpes region over 60 years 60 years old among the elderly 4 https www. The median age of these patients was 60 years and almost 84 presented at least one pre existing risk factor for developing a severe illness diabetes cancer cardiovascular diseases chronic respiratory diseases immunosuppression. gov pmc articles PMC5652622 Old Age Infections in travellers returning to Turkey from the Arabian peninsula a retrospective cross sectional multicenter study 3 https www. 20040501 humidity A climatologic investigation of the SARS CoV outbreak in Beijing China humidity 10 https doi. As expected illness severity was directly associated with young age prematurity heart or lung disease infection with RSV group A and elevated concentrations of interleukin IL 2R IL 6 CXCL8 tumor necrosis factor TNF α interferon IFN α CCL3 CCL4 and CCL2. gov pmc articles PMC6039036 Heart Disease Another ideal study for this. After each paper undergoes a search using the N grams list the papers that have keyword mentions are filtered through as outputs of this stage. 7 of incident influenza cases may result from exposure to ambient PM2. com drive 1bWNPqS76YYEKIXBXXC_0 QnuN8y7u3g6 Part 2 Search for Relevant Papers 1. gov pmc articles PMC3293465 age The Tsinghua Lancet Commission on Healthy Cities in China unlocking the power of cities for a healthy China over 60 years 60 years old 2 https doi. National Assessment summer winter weather climate 97 https www. 3 in patients who died was significantly higher than those who recovered all p 0. The climate data for each region can be accessed by hovering the mouse over one of the colored dots inside the map view the climate summary for the selected layer will be displayed above the cursor. Visit our website https www. gov pmc articles PMC3641871 pollution Comparison of the Effects of Air Pollution on Outpatient and Inpatient Visits for Asthma A Population Based Study in Taiwan air pollution and air pollution is between air pollution of air pollution 4 https www. 591 temperature The prevalence of preterm birth and season of conception summer winter spring autumn 40 http europepmc. Further prioritization based on MD input5. gov pmc articles PMC4472707 Heart Disease Human coronavirus ocurrence in different populations of Sao Paulo A comprehensive nine year study using a pancoronavirus RT PCR assay 11 direct risk factor check https www. gov pmc articles PMC4570805 population density Trends in Tuberculosis in Taiwan 2002 2008 populous 1 https doi. it it archivio 222527 Errata In the climate visualization the humidity data is missing some data points in specific Italian regions and in the database if there is a missing data point the database records the humidity value as 999 instead of NaN. Currently our annotation process involves annotators commenting on why they made their decision. gov pmc articles PMC3261719 age ESICM LIVES 2016 part one Milan Italy. gov pmc articles PMC4431472 population density Geographic Distribution and Risk Factors of the Initial Adult Hospitalized Cases of 2009 Pandemic Influenza A H1N1 Virus Infection in Mainland China populous 1 https www. Paper 6 The incidence of acute respiratory distress syndrome 90 vs. 2019 01858 temperature Challenges in developing methods for quantifying the effects of weather and climate on water associated diseases A systematic review weather climate 39 https www. 1 heart disease 20. Sources Population by different regional levels http demo. 1 http europepmc. gov pmc articles PMC3352321 heart risks Management of the ACC AHA Stage D Patient Cardiac Transplantation heart disease heart failure 5 https doi. com uc id 12NbjOFak0C1jwWf zr_uDRop5LQoNL1n Current visualization is hosted here https www. 4 with severe illness. The advantages of such a complicated search for bigrams trigrams is that the output is something that can be traced back and is also backed by actual medical terminology. 1 with moderate and 80 9. 8 including hypertension 56. com uc id 1w6_SVtb7w6fIBWeZZCFK8aelSMlgzhO_ Top 20 most relevant papers when it comes to heart disease as a risk factor Risk Factor Title Keyword Ngram No of keyword occurences URL heart risks Trends in 30 Day Readmission Rates for Medicare and Non Medicare Patients in the Era of the Affordable Care Act heart failure 11 https doi. Sources Corona Data Scraper https coronadatascraper. 004 Top 10 papers on heart risk disease as a risk factor qualified by human input factor title number of keyword occurences note on relevancy URL Heart Disease 36th International Symposium on Intensive Care and Emergency Medicine Brussels Belgium. Many of the papers in the dataset are studies on the severity and outcome of the infection without however any systematic documentation that would be easily searchable. The number of papers that are outputted for each risk factor usually does not exceed 200 papers. Specifically looks at the prevalence of comorbidities like heart disease in flavivirus infections. Environmental Factors Risk Factor Search Query Number of papers of papers Climate climate OR tropical OR temperate OR polar OR arid OR subtropical 6900 21 Disinfection disinfection OR sterilization OR decontamination 5700 17 Latitude latitude OR degrees south OR degrees north AND human OR man OR woman OR or OR children OR or OR people OR or patient 377 1 Pollution pollution OR contamination AND human OR man OR woman OR children OR patient OR people 7100 21 Population Density population density 764 2 Relative Humidity relative humidity 735 2 Temperature temperature OR temp AND human OR man OR woman OR patient OR child OR infant OR people 11000 33 Precipitation precipitation OR rain OR snow OR sleet OR hail AND human OR man OR woman OR children OR infants OR people OR person OR patients 4100 12 Airflow and Ventilation airflow OR air flow OR ventilation AND human OR man OR woman OR children OR infants OR people OR person OR patients 3300 10 Nutrients nutrients AND human OR man OR woman OR children OR infants OR people OR person OR patients 1500 5 Salinity salinity water 4 OR salinity soil 4 OR salt content OR saltiness AND NOT phosphate 73 0 Arctic Inlet Hypoxic arctic OR inlet OR hypoxic AND human OR man OR woman OR children OR infants OR person OR people OR patients 863 3 Oxygen hyperoxia normoxia hypoxia oxygen level OR normoxia OR normoxic OR hyperoxia OR hyperoxic OR hypoxia OR hypoxic AND human OR man OR woman OR children OR infants OR person OR people OR patients 1300 4 Chlorophyll chlorophyll AND human OR man OR woman OR children OR infants OR person OR people OR patients 94 0 Water supply water supply OR water system OR water distribution OR drinking water AND human OR man OR woman OR children OR infants OR person OR people OR patients 1100 3 Sanitation facilities sanitation facility OR sanitation solution OR sanitation technique OR sanitation infrastructure OR sanitation system 93 0 Food food supply OR food quality 3 OR food contamination 3 OR food habit OR food pattern OR eating habits OR diet AND human OR man OR woman OR children OR person OR people OR patients 2300 7 Radiation radiation OR radioactive AND human OR man OR woman OR children OR infants OR person OR people OR patients 2400 7 Ultraviolet radiation ultraviolet radiation OR uv radiation OR uv index OR ultraviolet index AND human OR man OR woman OR children OR infants OR person OR people OR patients 253 1 Ionised radiation ionized radiation OR ionised radiation OR ion radiation 4 AND human OR man OR woman OR children OR infants OR person OR people OR patients 155 0 4. The process of the annotation is detailed below Each article has associated with it the risk factor as predicted by the code. 9 including prematurity or congenital disease such as heart disease or cerebral malformation. The first piece of code takes the raw sentences from the v7 dataset and outputs relevant bigrams trigrams related to risk factors of a particular subdomain in medicine. gov pmc articles PMC4973921 population density The threat of climate change to non dengue endemic countries increasing risk of dengue transmission potential using climate and non climate datasets densely populated 1 https www. This chart gives following INFORMATION of the region Number Covid Cases Region Name Number of Active Cases Number of Deaths Number of test conductedAnd ONE of the below CLIMATE conditions of that region is displayed Average Temperature Minimum Temperature Maximum Temperature Relative Humidity Pressure Demographic Metricshttps juancalvo. Along the bottom of the screen there is a date picker. gov pmc articles PMC6078760 temperature Performance of cows and summer born calves and economics in semi confined and confined beef systems summer winter 39 https doi. Next Goals June deadline task_next 10. showed significant associations with fatality 3 https www. This will be useful in Phase 2 of our pipeline. If we can take these reasonings and graft them into an NLP model the model can serve as an artificial annotator to produce our golden papers in the output stage. com uc id 1BZyRD2QhdydS_bb2zqP0VhVHF69E6jpp Visualization of 3 grams heart n https drive. com uc id 1L rlwgXSzxPyVCYOBpukwbYK3p8HWv1x Top 20 most relevant papers when it comes to population density as a risk factor Risk Factor Title Keyword Ngram No of keyword occurences URL population density Rhinitis Asthma and Respiratory Infections among Adults in Relation to the Home Environment in Multi Family Buildings in Sweden densely populated populated areas 7 https www. 013 heart risks Coronavirus and Other Respiratory Illnesses Comparing Older with Young Adults heart disease 5 https doi. 002 population density Polio Eradication Initiative PEI contribution in strengthening public health laboratories systems in the African region populous 1 https doi. gov pmc articles PMC5129628 Heart Disease Congenital heart disease was significantly higher in child pneumonia cases as opposed to the control 1 https www. gov pmc articles PMC4483178 Heart Disease evaluated heart disease as comorbidity 1 https doi. gov pmc articles PMC3804219 Heart Disease Lower airway sampling greatly increases detection of respiratory viruses in critically ill patients the COURSE study 11 study looked at tracheal aspirate vs nasopharynx swab for viral sampling. 6 and secondary infection 58 vs. Introduction This is a notebook created by a collaborative effort of CoronaWhy. gov pmc articles PMC4696714 Heart Disease The relative risk of a serious outcome was significantly increased in persons aged 75 years vs 60 64 years and in those with chronic obstructive pulmonary disease or congestive heart failure. png attachment image. gov pmc articles PMC3366999 population density Estimation of Time Dependent Reproduction Numbers for Porcine Reproductive and Respiratory Syndrome across Different Regions and Production Systems of the US densely populated populated regions 2 https www. The focus of this study is to extract and present in a meaningful and easily accessible way scientific papers that are related to risk factors associated with viral diseases through a procedure that can be automated as much as possible. gov pmc articles PMC6603263 4 6 Relationship between circulating levels of angiotensin converting enzyme 2 angiotensin 1 7 MAS axis and coronary heart disease https www. gov pmc articles PMC6306566 Old Age Perception of epidemic s related anxiety in the General French Population a cross sectional study in the Rhône Alpes region 4 https www. gov pmc articles PMC6625070 population density Mapping road network communities for guiding disease surveillance and control strategies population densities 1 https www. Defining workflow task_workflow 6. com uc id 13oaIS xpzqZ eTCqpW4qVaBbljzsIwfd Top 20 most relevant papers when it comes to age as a risk factor Risk Factor Title Keyword Ngram No of keyword occurences URL age Estimates of the severity of coronavirus disease 2019 a model based analysis 60 years and over older age group 7 https doi. An extensive list of risk factors is provided under section 4 risk_factors below and is subject of a future extension of this study. gov pmc articles PMC5652433 humidity Long Term Prediction of Emergency Department Revenue and Visitor Volume Using Autoregressive Integrated Moving Average Model humidity rainfall 26 https www. jpg We choose to go to the Moon in this decade and do the other things not because they are easy but because they are hard because that goal will serve to organize and measure the best of our energies and skills because that challenge is one that we are willing to accept one we are unwilling to postpone and one we intend to win and the others too. gov pmc articles PMC7087851 humidity Prevalence clinical outcomes and rainfall association of acute respiratory infection by human metapneumovirus in children in Bogotá Colombia rainy rainfall 11 https www. gov pmc articles PMC6353886 humidity Large scale Lassa fever outbreaks in Nigeria quantifying the association between disease reproduction number and local rainfall rainy rainfall 52 https www. 055 _______ Top 10 papers on population density as a risk factor qualified by human input factor title number of keyword occurences note on relevancy URL Population Density Spatiotemporal diffusion of influenza A H1N1 Starting point and risk factors https www. gov pmc articles PMC7088806 _______ Top 10 papers on temperature as a risk factor qualified by human input factor title number of keyword occurences note on relevancy URL Air Temp Evidence of human coronavirus HKU1 and human bocavirus in Australian children 15 https doi. 059 age Particulate air pollution on cardiovascular mortality in the tropics impact on the elderly 65 years old among the elderly 3 https www. Age and comorbidity e. The search excludes body text as this section might contain rich content and lesser focus on the primary target of the research. 9 kidney injury 43 vs. gov pmc articles PMC6999894 Population density overview We ve identified 28 papers relevant to this risk factor across CORD 19 dataset here we are presenting top 20 by the number of keyword occurences Visualization of 2 grams heart n https drive. Task Overview task_overview 3. This includes mentions of heart disease in the abstract heart disease correlating with increased infection susceptibility etc. It is also imperative that the papers also mention COVID or coronavirus related infections for best results coronavirus keywords are also currently inputted in the form of a custom array. On the left side of the map are layers that correspond to COVID 19 prevalence. gov pmc articles PMC3978084 humidity Exploration of the effects of classroom humidity levels on teachers respiratory symptoms humidity 12 http europepmc. gov pmc articles PMC4431472 pollution Characterization of respiratory infection viruses in hospitalized children from Naples province in Southern Italy air pollution and between air pollution 2 https www. gov pmc articles PMC5958661 pollution Rapid health transition in China 1990 2010 findings from the Global Burden of Disease Study 2010 household air pollution 2 https doi. gov pmc articles PMC3641965 population density Association of HLA class I with severe acute respiratory syndrome coronavirus infection densely populated populated regions 2 https www. gov pmc articles PMC7086680 All papers on heart diseases risks validated using crowdsourced medical input Risk Factor Paper Number of keyword occurences Heart Disease Risk factor of acquiring COVID19 11 https doi. Produce N gram synonyms Based on the initial input currently not one keyword but a customized array of keywords chosen by MD input this stage utilizes an assortment of linguistic medical packages to extend the initial input and search for synonymous similar N grams unigrams bigrams and trigrams in the CORD 19 database. Paper 2 However use of systemic antibiotics and the presence of underlying diseases and congenital heart disease were more frequent in patients admitted to the PICU and they also had a longer hospital length of stay Paper 4 Circulating ACE2 activity has been considered to be a marker of cardiovascular disease CVD with low levels in healthy individuals and increased levels in those with CVD such as hypertension heart failure and myocardial infarction. org articles pmc3179261 pdf render Heart Disease Chronic heart diseases had a statistically significant correlation with mortality amongst MERS patients 3 https doi. heart disease was included as a variable. org articles pmc2740810 pdf render heart risks High incidence of respiratory viruses in critically ill adult patients with respiratory failure cardiac arrest heart failure 8 https www. 1016 s1473 3099 19 30410 4 pollution Public awareness of risk factors for cancer among the Japanese general population A population based survey air pollution and 1 https www. gov pmc articles PMC3192122 4. 20031393 Heart Disease Univariate analysis showed that a severe outcome was significantly more frequent for patients with comorbidity OR 3. gov pmc articles PMC3825547 Old Age Seasonal influenza vaccine effectiveness against laboratory confirmed influenza in 2015 2016 a hospital based test negative case control study in Lithuania 4 https www. Degree of Automation Currently some parts of our workflow are automated and some parts of our workflow are not automated. and temporal resolution dates. gov pmc articles PMC5042924 age The Incidence of Respiratory Tract Infection in Adults Requiring Hospitalization for Asthma patients older than 2 https doi. gov pmc articles PMC6122785 Population Density Rhinitis Asthma and Respiratory Infections among Adults in Relation to the Home Environment in Multi Family Buildings in Sweden correlation between population density and sinusitis https www. 00009 4 pollution Seasonality ambient temperatures and hospitalizations for acute exacerbation of COPD a population based study in a metropolitan area air pollution and between air pollution 2 https www. Defining Workflow Our current workflow is a pipeline formed from a commensuration of our methodologies and strategies used to take one search keyword and from this simple output generate a few papers no more than 10 from the CORD 19 dataset that are specific and super relevant to the keyword. A risk factor is anything that increases the chance of being infected or affects the severity or the survival outcome of the infection. Matei Bals and the 12th National Infectious Diseases Conference Bucharest Romania. gov pmc articles PMC3804219 Heart Disease The bulk of death cases had comorbidity 76. gov pmc articles PMC4896250 pollution Burden of lower respiratory infections in the Eastern Mediterranean Region between 1990 and 2015 findings from the Global Burden of Disease 2015 study household air pollution 2 https www. gov pmc articles PMC5652622 age Infections in travellers returning to Turkey from the Arabian peninsula a retrospective cross sectional multicenter study 65 years old 3 https www. Paper 1 This was a prospective observational study conducted from November 2009 to July 2013 to assess acute respiratory illness in patients aged 60 years with chronic lung or heart disease or both group 1 and in healthy young adults aged 18 to 40 years group 2. 023 Heart Disease heart disease was more common in case population than control population 1 https www. gov pmc articles PMC4095497 heart risks Prevalence of comorbidities in cases of Middle East respiratory syndrome coronavirus a retrospective study congestive heart failure heart disease heart failure 9 https www. org articles pmc3179261 pdf render heart risks Severe Morbidity and Mortality Associated With Respiratory Syncytial Virus Versus Influenza Infection in Hospitalized Older Adults congestive heart failure heart failure 6 https www. io tool in order to find out what percentage of papers in the CORD 19 dataset mention each risk factor. 20043133 Heart Disease The incidence of. gov pmc articles PMC3908316 population density Human rhinoviruses The cold wars resume populous 1 https doi. gov pmc articles PMC3642395 heart risks Clinical Manifestations Laboratory Findings and Treatment Outcomes of SARS Patients congestive heart failure cardiac arrhythmia heart disease heart failure 8 https www. Input The medical subdomain heart disease. Pollution 3 No significant association was found between air pollution and the number of hospitalisations from COPD exacerbations however ambient temperature was found to have a significant association Pollution Seasonality ambient temperatures and hospitalizations for acute exacerbation of COPD a population based study in a metropolitan area 2 Irrelevance study investigates the performance of a catalyst Pollution 2 Irrelevance a book chapter as opposed to a study Pollution 2 Hypothesises an association between pollution and acute respiratory infections in children but does not measure it Pollution 2 Ambient particulate matter concentrations with aerodynamic diameter 2. com uc id 1oVKus7AlAfpuhNZOB4fMnxPk wPNeQMM green dot 0. Search for N grams in papers The search for N grams is completely automated and will work for any general set of N grams that are fed in as input. Each sentence is put through Allen Ai s python nlp package for biomedical scientific clinical data processing. gov pmc articles PMC6625070 temperature Apical barriers to airway epithelial cell gene transfer with amphotropic retroviral vectors tropic 29 https www. Therefore even though the visualization has a built in slider to accommodate date range it does not work correctly yet. com uc id 1Jy5bKcINnV1lydRoqXM4WuK6p_NRtoge Visualization of 3 grams heart n https drive. 5 with mild 503 59. Part 4 A Snapshot of OutputHere are our top 10 papers on heart risk disease as a risk factor qualified by the medical output Rank Title Paper URL Keyword Matches 1 Outcome Risk Factors during Respiratory Infections in a Paediatric Ward in Antananarivo Madagascar 2010 2012 https www. com document d 1iD4J8uBgkba9rKD6RftI34JpOc Ds2ITCNfQZ1rF _k. gov pmc articles PMC5481148 temperature Climate effect on COVID 19 spread rate an online surveillance tool climate 38 https doi. 010 Heart Disease One of the most ideal studies I ve seen so far for this. 20040501 Air Temp Modeling respiratory illnesses with change point A lesson from the SARS epidemic in Hong Kong 6 https doi. Next goal June deadline Coverage of a wider range of risk factors Automation of the paper search process Implementation of the similarity based search Improvement of outputs Presenting more data and segmentations within articles by focus of study research method and more 10. gov pmc articles PMC6306566 Heart Disease discussed ischemic heart disease comorbidity as risk factor for nonvaccination 1 https www. gov pmc articles PMC7087946 age XXIV World Allergy Congress 2015 Seoul Korea. Risk factors and respective studies risk_factors 5. Risk factors and respective studies Groups of factors in progress So it s logical to ask is there any taxonomy for risk classification Even non medical professionals should be able to reason within the multi dimensional space of different risk factors that we observe in our daily lives. gov pmc articles PMC6122785 Population Density Ascertaining the impact of public rapid transit system on spread of dengue in urban settings https doi. gov pmc articles PMC1351169 pollution Size Segregated Particle Number Concentrations and Respiratory Emergency Room Visits in Beijing China of air pollution 1 https www. Group B These allow different options to show regional counts for COVID 19 s Cumulative tested cases number of active cases number of recovered patients and number of deaths. 010 Heart Disease Common underlying medical conditions reported included hypertension 22 diabetes 14 and heart disease 8 1 https doi. It is important to note that through the proposed procedure a small subset of papers is manually reviewed the ones that are identified as most probable to be relevant to a specific risk factor. gov pmc articles PMC7019145 humidity Large scale Lassa fever outbreaks in Nigeria quantifying the association between disease reproduction number and local rainfall rainfall 39 https doi. cardiac injury 65 vs. Socieconomic Factors Risk Factor Search Query Number of papers of papers Mental hospital patients mental hospital OR mental health AND service OR institution OR support OR patient 529 2 Access to health services access AND healthcare OR healh care OR health service OR medical care OR medical service 6 300 10 Access to testing access AND testing 18 000 29 Housing status housing OR homeowner OR home owner OR homeless OR property AND renter OR rental OR owner 10 000 17 Insurance insurance OR insured OR health insurance OR medical insurance OR health coverage OR medical coverage 1 800 3 Occupation occupation OR employment OR workplace OR work place 5 600 9 Religion religion OR religious belief 386 1 Homeless homeless OR housing 9 700 16 Healthcare workers hospital staff first responders healthcare worker OR healthcare staff OR hospital worker OR hospital staff OR first responder OR first response team 3 600 6 Long term care facility residents long term AND care AND resident OR facility 3 500 6 Low income low income OR poor OR minimum wage 14 000 24 Immigration immigration OR immigrant 1 100 2 Prison staff prison staff OR correction officer 7 0 Prisoners prisoner OR inmate OR incarcerated 525 1 Level of education education level 566 1 Governamental finances and priorities government AND finance AND priorities 503 1 The risk factors identified in the corpus and the respective frequencies give us a pretty good high level picture on the volume for each group Category Total Papers per group Average Number of Papers Demographics 24 505 2451 Diseases 66 788 2154 Environmental 50 107 2505 Genetic 14 014 1752 Lifestyle 41 071 3423 Socioeconomic 76 116 4757 5. 1016 s0022 2836 03 00865 9 Air Temp Mécanismes d émergence virale et transmission interespèces l exemple des rétrovirus Foamy simiens chezl Homme en Afrique Centrale 7 in french also does not appear to be topic https doi. com picture quotes quote we choose to go to the moon in this decade and do the other things not because they john f kennedy 34 98 64. com ikiulian global hospital beds capacity for covid19and did some correlation analysis for mortality death rates https drive. 008 population density Transmission or Within Host Dynamics Driving Pulses of Zoonotic Viruses in Reservoir Host Populations population densities 1 https www. Produce N gram synonyms Input keyword s Currently this is not automated. Why We Did What We Did moon https www. Our method and results are not ideal but they allowed us to produce something that we believe is useful there are many cons to the current method but we believe that the presentation of the current results will allow us to bring awareness to the fact that answers most probably exist and we just need some more help to iterate on this. org articles pmc3883981 pdf render Heart Disease Flu season stats Among patients with severe forms there was a slight predominance of males over females 58 national data vs 51 in our population. Credits Our Task Risk team https docs. 20028191 Heart Disease Children with heart disease at risk of viral infections 2 https doi. 011 Heart Disease identified CHF as risk factor for signficant radiographic change on CXR 2 https doi. 57 Pollution 1 Ambient air pollution and household air pollution were the fourth and fifth leading risks of the age standardised DALY rate in China during 2010 Global Burden of Disease Study Temperature overview We ve identified 624 papers relevant to this risk factor across CORD 19 dataset here we are presenting top 20 by the number of keyword occurences Visualization of 2 grams heart n https drive. gov pmc articles PMC6546210 4 5 Severe Morbidity and Mortality Associated With Respiratory Syncytial Virus Versus Influenza Infection in Hospitalized Older Adults https www. com hevalo correlationanalysis 12. diabetes mellitus heart disease were consistently found to be significant independent predictors of various adverse outcomes in SARS 35. Then those list of entities are processed by sci scapys UmlsEntityLinker. com uc id 17TQxh2uoEsf8lOh3q4CcVcwLFHluGF5O Visualization of 3 grams heart n https drive. 044 humidity RNA viruses in community acquired childhood pneumonia in semi urban Nepal a cross sectional study humidity monsoon rainy rainfall 16 https www. it it archivio 6789 Elencodeicodiciedelledenominazionidelleunitterritoriali 0 Cartographic data https www. 20043133 Age overview We ve identified 77 papers relevant to this risk factor across CORD 19 dataset here we are presenting top 20 by the number of keyword occurences Visualization of 2 grams heart n https drive. 006 humidity Risk Distribution of Human Infections with Avian Influenza H7N9 and H5N1 virus in China humidity 9 https www. 008 Air Temp Investigation of the performance of TiO2 photocatalytic coatings 7 laboratory conditions for plating https doi. gov pmc articles PMC3771918 Heart Disease 6 https doi. gov pmc articles PMC7087851 temperature Seasonal variation of respiratory pathogen colonization in asymptomatic health care professionals A single center cross sectional 2 season observational study summer winter 26 https doi. gov pmc articles PMC6532533 Heart Disease patient with ischemic heart disease or HTN more likely to require hospitalization 1 https www. Case Study Heart Disease Risk Factors This subsection will analyze our entire workflow with the heart disease risk factor as an example. 029 Air Temp The 12th Edition of the Scientific Days of the National Institute for Infectious Diseases Prof. 050 Population Density A geographic analysis of population density thresholds in the influenza pandemic of 1918 19 Specifically it estimates a level of population density above which policies to socially distance redistribute or quarantine populations are likely to be more effective than they are for areas with population densities that lie below the threshold. 034 Heart Disease Heart diseases were classified as rapidly or ultimately fatal underlying diseases for SARS patients and shown to be associated with high case fatality rates 6 https www. A color spectrum is then used to mark regions depending on the value of the numerical climate metric measure. Diseases Risk Factor of Papers mentioning Cardiac Cerebrovascular Disease CVD Heart diseases Chronic heart diseases 30 Acute Myocardial Injury MI Myocardial infarction STEMI NSTEMI 2 HTN hypertension high blood pressure 4 Cardiomyopathy Heart Failure LV dysfunction RV dysfunction 30 Cardiac Arrhythmias atrial fibrillation AF A fib 2 CAD coronary artery disease NaN Diabetes Mellitus DM DM type 1 DM type 2 4 Chronic pulmonary disease chronic obstructive pulmonary disease COPD 10 Asthma 7 Chronic kidney disease CKD end stage kidney disease ESKD 1 Obesity BMI 28 kg m 5 HIV immunodeficiency immunosuppressive medication immunocompromised groups 36 Chronic liver disease liver cirrhosis cirrhosis 3 Cancer chemotherapy 19 Neurological conditions Parkinson motor neurone disease sclerosis cerebral palsy 4 3. Gender sex distribution 0. org articles pmc4873430 pdf render humidity Respiratory viral infections and effects of meteorological parameters and air pollution in adults with respiratory symptoms admitted to the emergency room humidity rainfall 12 https www. gov pmc articles PMC212558 population density The effect of travel restrictions on the spread of a moderately contagious disease densely populated populated areas 2 https www. com home NASA Langley Research Center LaRC POWER project https power. Our team at CoronaWhy is not only focused on analyzing COVID 19 but is also interested in scaling our approach on researching COVID to other medical conditions as well. com uc id 1VrvlBTHH4D7xsrNp74wtLBamMZygG8Sy Table of Contents1. 004 Top 10 papers on pollution as a risk factor qualified by human input factor title number of keyword occurences note on relevancy URL Pollution 9 Reductions in household air pollution globally were significantly associated with declines in under 5 lower respiratory infection mortality rates between 1990 and 2017 Global Burden of Disease Study Pollution 4 Irrelevance A study looking into public awareness of the risk factors for cancer Pollution 4 Associations of respiratory Emergency Room Visits ERV with NO2 concentrations and 100 1 000 nm particle number or surface area concentrations were of similar magnitude that is approximately 5 increase in respiratory ERV Particles 50 nm were not positively associated with ERV whereas particles 50 100 nm were adversely associated with respiratory ERV both being fractions of ultrafine particles in Beijing. patients were all under 5 years old. gov pmc articles PMC5973986 pollution Investigation of the performance of TiO2 photocatalytic coatings indoor air pollutants 1 https doi. gov pmc articles PMC2727531 humidity The role of absolute humidity on transmission rates of the COVID 19 outbreak humidity 14 https doi. 1016 s0002 9343 99 80164 8 heart risks Clinical and Laboratory Features of Severe Acute Respiratory Syndrome Vis À Vis Onset of Fever congestive heart failure heart failure 5 https doi. Description Our case study starts with the medical subdomain heart disease. Group CThis option only has one choice that colours the regions to display the population density measured in people per square kilometer. Genetic Factors Risk Factor Search Query Number of papers of papers Blood type A blood type 129 0 Allergy allergy OR epipen OR anaphylaxis OR allergen OR allergic OR aeroallergen AND human OR man OR woman OR children OR infants OR person OR people OR patients 3000 9 Haplotype haplotype AND man OR woman OR children OR infants OR person OR people OR patients 477 1 T cell responses immunodeficient tcell AND human OR man OR woman OR children OR infants OR person OR people OR patients 339 1 Cell homeostasis cell homeostasis 2 AND human OR man OR woman OR children OR infants OR person OR people OR patients 127 0 Cytokine cytokine AND human OR man OR woman OR children OR infants OR person OR people OR patients 6400 19 Transcription factor transcription factor AND human OR man OR woman OR children OR infants OR person OR people OR patients 2600 8 Innate host defence genes defense genes OR defence genes OR antiviral genes 3 OR host genes 2 AND human OR man OR woman OR children OR infants OR person OR people OR patients 942 3 5. com hmwang riskfactors heartdisease Part 3 Medical Input 1. ERVs concerned URIs pneumonia acute bronchitis and LRIs. Initial task exploration2. gov pmc articles PMC4686887 Top 10 papers on humidity as a risk factor qualified by human input factor title number of keyword occurences note on relevancy URL Old Age Estimates of the severity of coronavirus disease 2019 a model based analysis 7 with substantially higher ratios in older age groups 0 32 0 27 0 38 in those aged 60 years vs 6 4 5 7 7 2 in those aged 60 years https doi. 20040261 Heart Disease Leading causes of death in a region of china 1 https www. gov pmc articles PMC3667930 Heart Disease unsure on this one but addresses relationship between comorbidities like heart disease and severity of COVID. 195 temperature Global networks and global change induced tipping points climate 25 https www. 5 in China Pollution Investigation of the performance of TiO2 photocatalytic coatings 1 Indoor air pollution was found to have significant association with acute lower respiratory infections in children OR 1. 20040501 temperature Molecular detection of bovine coronavirus in a diarrhea outbreak in pasture feeding Nellore steers in southern Brazil cold weather tropical weather tropic summer winter weather 23 https www. 20043133 4 8 Characteristics of patients with COVID 19 during epidemic ongoing outbreak in Wuhan China https doi. We will fix this soon Public health mitigation measures that could be effective for controlAs a way to address this question a group of independent members of our community gathered dataset on number of hospital beds globally https www. Input A list of papers 200 that the heart disease model found to be relevant by manner of keyword search. In the center of the screen is a map that can be zoomed in out using the minus and plus buttons on the bottom left side of the screen. 013 Heart Disease Effects of hypertension diabetes and coronary heart disease on COVID 19 diseases severity a systematic review and meta analysis 11 Effect of heart disease on COVID19 severity https doi. Our systems biology approach offers a possible explanation for increase of COVID 19 severity in patients with certain comorbidities 1 https doi. Visit our main notebook https www. gov pmc articles PMC6122785 population density Seasonality ambient temperatures and hospitalizations for acute exacerbation of COPD a population based study in a metropolitan area densely populated 1 https www. gov pmc articles PMC5353286 temperature Transmission Potential of Chikungunya Virus and Control Measures The Case of Italy temperate tropic summer climate 24 https www. How we did it is another story. Introduction introduction 2. For example if the date April 12 is selected then the COVID statistics will display the accumulated cases up until April 12 and not the number of new cases recoveries deaths on April 12 only. gov pmc articles PMC3323212 Heart Disease presence of underlying diseases and congenital heart disease were more frequent in patients admitted to the PICU and they also had a longer hospital length of stay p 0. 20043133 heart risks ACR Appropriateness Criteria on Acute Respiratory Illness congestive heart failure heart failure 10 https doi. Description This piece of code takes all the n grams that were produced from the last piece of code and searches each paper for these n grams. For a more complete overview of the work done by our task geo team please visit notebook https www. Selecting a single date will populate the map with the number of COVID cases up until that date. Summary task_summary 4. Task Overview A major topic of interest among researchers is the study of the various risk factors related to COVID 19. 1016 s0929 6646 11 60076 4 population density Cross sectional survey of human bat interaction in Australia public health implications populous 1 https www. it pop2019 Italian communes to province mapping https www. 1016 s0140 6736 18 30486 0 age Comparison of Rates of Hospitalization Between Single and Dual Virus Detection in a Mexican Cohort of Children and Adults With Influenza Like Illness 60 years old 2 https www. Our Notebooks List of all notebooks codebases that we have for risk factors categories. 1016 s0140 6736 13 61097 1 pollution XXIV World Allergy Congress 2015 Seoul Korea. 022 Heart Disease 1 http europepmc. The purpose of this is to correctly distinguish any useful entity with something that has a medical connotation. Output A list of relevant papers that contain heart disease n grams and mentions of coronavirus infections. Furthermore simpler methods of ngram search wouldn t find as many bigrams given that medical terminology don t follow conventional naming and would be hard press to grab such granularity. gov pmc articles PMC7100072 Heart Disease Effect of heart disease on COVID19 severity 4 https doi. 1101 602706 humidity Weather Dependent Risk for Legionnaires Disease United States humidity rainfall 27 https www. Our Notebooks task_notebooks 8. 3 cerebrovascular disease 12. com manuelalvarez coronawhy org task geographical factors How to useAcross both climate and demographic filters are some common controls and visualization. Part 1 Produce N grams 1. gov pmc articles PMC3522360 Heart Disease Other factors associated with severe disease were chronic heart disease 1 https doi. 5 acute liver injury 71 vs. gov pmc articles PMC3641965 Population Density Association of HLA class I with severe acute respiratory syndrome coronavirus infection Areas with increased population density are more affected by SARS https www. 013 heart risks Effects of hypertension diabetes and coronary heart disease on COVID 19 diseases severity a systematic review and meta analysis heart disease 11 https doi. gov pmc articles PMC7100072 4 7 Effects of hypertension diabetes and coronary heart disease on COVID 19 diseases severity a systematic review and meta analysis https doi. Quality Assessment Medical Annotators In this stage the output papers from the previous stage undergo a manual examination to secure their place as relevant articles in the search. Note the attached PDF is from an international symposium on intensive care and emergency medicine and includes a ton of studies. gov pmc articles PMC3323212 6 4 Human coronavirus alone or in co infection with rhinovirus C is a risk factor for severe respiratory disease and admission to the pediatric intensive care unit A one year study in Southeast Brazil https www. 061 pollution Quantifying risks and interventions that have affected the burden of lower respiratory infections among children younger than 5 years an analysis for the Global Burden of Disease Study 2017 household air pollution 1 https doi. Climate Metrics http There are a variety of layers included in display group B to represent climate such as average temperature minimum temperature relative humidity etc. Select one and only 1 from each display group to populate the map with corresponding data see sections below for more details. The package processes each sentence tokenizing only parts of the sentence that represents some useful named entity NER named entity recognition. 591 age Increase in methicillin resistant Staphylococcus aureus acquisition and change in pathogen pattern associated with outbreaks of severe acute respiratory syndrome SARS patients older than 2 https www. Other statistics such as the matching n gram and the number of occurrences of n grams also are displayed in output. Also the paper must contain mentions of COVID or another coronavirus related term in order to be considered as a relevant paper. We are presenting this notebook to address What do we know about COVID 19 risk factors question. 20033175 Heart Disease Among the comorbidities DM HTN ischemic heart disease IHD congestive heart failure CHF. png The Stages in Detail 1. 125 red less than 0. gov pmc articles PMC7087946 Old Age XXIV World Allergy Congress 2015 Seoul Korea. gov pmc articles PMC6068768 Heart Disease looked at risk of adverse pregnancy outcomes in women with without pneumonia. 022 heart risks Design and implementation of needs specific critical care response teams heart disease cardiac arrest heart failure 10 https www. Is displayed with male on the left and female on the right equal would make both white though the deviation is only small on average most countries have slightly more women than men except places like China that had long term policies that affected it. Established steps for annotators to determine paper relevancy8. gov pmc articles PMC4069511 Heart Disease Trends in 30 Day Readmission Rates for Medicare and Non Medicare Patients in the Era of the Affordable Care Act 11 Study is on hospital re admission rates for those on Medicare https doi. gov pmc articles PMC4138153 Population Density Geographic Distribution and Risk Factors of the Initial Adult Hospitalized Cases of 2009 Pandemic Influenza A H1N1 Virus Infection in Mainland China discusses distribution of H1N1 cases in China mentioning the association with high density areas such as urban settings https www. 1016 s2213 2600 20 30079 5 Heart Disease major comorbid diseases for hospitalized patients treated with IABP were identified acute coronary syndrome ACS CS heart failure fetal cardiac arrhythmia acute myocarditis and valvular heart disease 1 https www. gov pmc articles PMC3192122 population density Efficacy and gastrointestinal risk of aspirin used for the treatment of pain and cold population studies 1 https doi. gov pmc articles PMC4896250 age New approach to identifying proper thresholds for a heat warning system using health risk increments above 65 years 3 https doi. 14 17 October 2015 between air pollution of air pollution 2 https www. com uc id 1Y8UrwZ9mO33ty0F5HvT5K3aKjz1XpvHz Top 20 most relevant papers when it comes to temperature as a risk factor Risk Factor Title Keyword Ngram No of keyword occurences URL temperature Climate Change and Human Health Impacts in the United States An Update on the Results of the U. 061 Air Temp Climate affects global patterns of COVID 19 early outbreak dynamics 23 climate effects https doi. com builder b1b0b61e acdc 4cc1 b47f 93c4a97b664d embedThis visualization shows various population demographic data from regional age and gender distributions to population density. The Group B data at that given date will also be displayed for climate data and not applicable to demographic data. gov pmc articles PMC4006842 pollution Particulate air pollution on cardiovascular mortality in the tropics impact on the elderly of air pollution particulate air pollution air pollutant data 4 https www. Here s a full outline of what we did1. Futher filtering out most relevant papers7. Credits task_credits 1. Also for most of these risk factors we used a thresher. Here is a high level overview of our pipeline image. gov pmc articles PMC4138153 population density Ascertaining the impact of public rapid transit system on spread of dengue in urban settings densely populated populated areas 5 https doi. gov pmc articles PMC4193739 temperature Variability and Diversity of Nasopharyngeal Microbiota in Children A Metagenomic Analysis winter spring 62 https www. 3 cardiac injury 65 vs. gov pmc articles PMC3323212 heart risks Soluble Angiotensin Converting Enzyme 2 in Human Heart Failure Relation with Myocardial Function and Clinical Outcomes heart failure 7 http europepmc. gov pmc articles PMC6471752 pollution Chapter 9 Environmental and Occupational Health water pollution 3 https doi. ICD code is International Statistical Classification of Diseases and Related Health Problems one of many standardized medical terminology bases. Read our story https medium. com c aDFxpxPP 12 recorded daily calls 11. Each display group basically populates the map with different types of data. org articles pmc2740810 pdf render Heart Disease directly discussed heart disease as risk factor for death 1 https doi. gov pmc articles PMC4896250 Humidity overview We ve identified 126 papers relevant to this risk factor across CORD 19 dataset here we are presenting top 20 by the number of keyword occurences Visualization of 2 grams heart n https drive. gov pmc articles PMC3235663 humidity Effect modification of environmental factors on influenza associated mortality a time series study in two Chinese cities humidity 24 https www. 5 was higher for cold compared with hot days. Custom keywords synonymous to the search topic are applied as inputs to the code that does this Coronavirus keywords Currently this is not automated but is pretty much a static array for COVID applications 2. 20044727 temperature The threat of climate change to non dengue endemic countries increasing risk of dengue transmission potential using climate and non climate datasets tropic summer winter climate 31 https www. gov pmc articles PMC6074457 Heart Disease Results 851 patients met study criteria 268 31. 20022467 humidity Short Term Effects of Weather on Hand Foot and Mouth Disease rainfall 13 https www. 1016 s0001 4079 19 31387 1 Air Temp Systemic Spread and Propagation of a Plant Pathogenic Virus in European Honeybees Apis mellifera 11 not a variable https www. in patients who died was significantly higher than those who recovered all p 0. 15 18 March 2016 17 Highlights of an annual emergency medicine symposium https www. gov pmc articles PMC293432 pollution Risk factors for severe acute lower respiratory infections in children a systematic review and meta analysis indoor air pollution 5 https www. gov pmc articles PMC3265445 humidity The Effects of Temperature and Relative Humidity on the Viability of the SARS Coronavirus humidity 20 https www. Lifestyle Factors Risk Factor Search Query Number of papers of papers Smoking Status smoking OR cigarette 1 900 6 Alcohol Consumption alcohol consumption OR alcohol intake OR alcohol use AND human OR man OR woman OR children OR infants OR person OR people OR patients 452 1 Drugs addiction drugs addiction OR drug addiction OR substance abuse AND human OR man OR woman OR children OR infants OR person OR people OR patients 286 0 Level of stress stress AND level OR high OR low OR increased OR decreased OR reduced 10 000 17 Type of society traditional modern individualistic community oriented traditional society OR modern society OR individualistic society OR community oriented society AND human OR man OR woman OR children OR infants OR person OR people OR patients 195 0 Starvation starvation AND human OR man OR woman OR children OR infants OR person OR people OR patients 838 1 Travelling travelling OR travels OR traveled OR travel 9 100 15 Contact with wildlife wildlife AND contact AND human OR man OR woman OR children OR infants OR person OR people OR patients 1 600 3 Hygiene hygiene OR hygienic AND human OR man OR woman OR children OR infants OR person OR people OR patients 4 600 8 Water drinking drinking water OR potable water AND human OR man OR woman OR children OR infants OR person OR people OR patients 1 400 2 Eating habits eating habits OR food habits OR diet OR nutrition AND human OR man OR woman OR children OR infants OR person OR people OR patients 5 600 9 Face touching face touching OR hands AND face AND human OR man OR woman OR children OR infants OR person OR people OR patients 5 100 9 6. This cross reference the named entity with any entity in the Unified Medical Language System UMLS which is developed by the National Institutes of Health. Date ranges will be incorporated into future functionality. gov pmc articles PMC3086881 temperature Climate affects global patterns of COVID 19 early outbreak dynamics temperate climate 23 https doi. gov WHAT IT DOES This chart displays Italy s municipal regions covid 19 information and the corresponding climate condition for a given date. The RR of influenza transmission associated with PM2. gov pmc articles PMC6546210 Heart Disease analyses comorbidity of heart condtions with viruses 4 https www. 027 Old Age Rhinitis Asthma and Respiratory Infections among Adults in Relation to the Home Environment in Multi Family Buildings in Sweden 5 https www. 022 Heart Disease direct risk factor check 2 https www. gov pmc articles PMC2874530 age The aging lung aging population 4 https www. The annotator reads the abstract of the paper If the abstract contains the keyword as a risk factor ex Population density is correlated with influences then the annotator deems the paper relevant. gov pmc articles PMC6785857 humidity Climate affects global patterns of COVID 19 early outbreak dynamics humidity 10 https doi. com ikiulian simple global countries visualizationAs well as some correlation analysis here https www. 5 would be equal distribution. Group A Age and gender sex distributions 9 age distribution brackets 0 9 20 29 30 39 30 49 50 59 60 69 70 79 80 The order goes from top left like you would read a book. 20033175 3 9 Prevalence of comorbidities in cases of Middle East respiratory syndrome coronavirus a retrospective study https www. Coming to realization that we need to prioritize and filter out factors that are underrepresented in the CORD 194. com pranjalya coronawhy risk factors analysis 8. gov pmc articles PMC5765048 heart risks Association between Serum Angiotensin converting Enzyme 2 Level with Postoperative Morbidity and Mortality after Major Pulmonary Resection in Non small Cell Lung Cancer Patients heart disease 5 https doi. gov pmc articles PMC7091907 temperature Seasonal evaluation of bioaerosols from indoor air of residential apartments within the metropolitan area in South Korea summer winter spring autumn 26 https www. 001 3 https doi. gov pmc articles PMC3046172 temperature The Incidence of Respiratory Tract Infection in Adults Requiring Hospitalization for Asthma summer winter spring autumn 48 https doi. gov pmc articles PMC6603263 heart risks ESICM LIVES 2016 part one Milan Italy. Producing final list of the best papers based on crowdsourced human medical input. 1016 s1473 3099 20 30243 7 Old Age Burden seasonal pattern and symptomatology of acute respiratory illnesses with different viral aetiologies in children presenting at outpatient clinics in Hong Kong 5 Co detection of more than one virus was overall more frequent in the younger age group than in the older age group 5. 5 was found significantly associated with influenza incidence at lag 2 3 days with RR of 1. If an entity receives a medical concept id it then is then convert into an ICD code. 003 Heart Disease Regarding symptomatology 185 cases Of the 122 cases 47 with co morbid conditions the most common were hypertension 76 cases 29 diabetes 72 cases 28 heart disease 47 cases 18 It connected with symptom risk but not mortality. Daily calls We operate under radical transparency and all of our meetings calls are recorded feel free to review the historical progress and the way we reached this stage so far https trello. logo https drive. gov pmc articles PMC6518603 3 10 Soluble Angiotensin Converting Enzyme 2 in Human Heart Failure Relation with Myocardial Function and Clinical Outcomes http europepmc. gov pmc articles PMC6471752 age Open drug discovery for the Zika virus over 60 years 3 https www. com mikehoney coronawhy org task risk factors data viz Geopatial analysis overview https drive. Group C is an option that can allow data to be grouped specifically by region in the country. gov pmc articles PMC4138153 Old Age Clinical Features Severity and Incidence of RSV Illness During 12 Consecutive Seasons in a Community Cohort of Adults 60 Years Old 5 The relative risk of a serious outcome was significantly increased in persons aged 75 years vs 60 64 years https www. 034 heart risks Myocarditis and idiopathic dilated cardiomyopathy heart failure 5 https doi. 102 Top 10 papers on age as a risk factor qualified by human input factor title number of keyword occurences note on relevancy URL Old Age Estimates of the severity of coronavirus disease 2019 a model based analysis 7 with substantially higher ratios in older age groups 0 32 0 27 0 38 in those aged 60 years vs 6 4 5 7 7 2 in those aged 60 years https doi. In the ICD code heart disease is in category I for circulatory diseases and section 5 52. Description In order to make sure that the papers the heart disease model has outputted are actually relevant to medical professionals the last stage of our pipeline uses medical annotators to read through the papers and check if the paper does indeed present heart disease as a risk factor. 509 heart risks The impact of CPR and AED training on healthcare professionals self perceived attitudes to performing resuscitation cardiac arrest 5 https www. For example if they determined that the paper is relevant they may state their reason as the phrase sentence that correlated the risk factor with infection. gov pmc articles PMC2774646 Heart Disease A systematic analysis of 25 articles surrounding the Middle East respiratory syndrome MERS found heart disease to be a clinical predictor of death associated with MERS and to hold the highest OR compared to other predictors 1 https www. Looks specifically at risk factors for MERS coronavirus illness in humans. 23 25 November 2016 3 whole journal printing https www. If no then the annotator reads the methods and results section of the paper If the methods results section contains a mention of the keyword as a risk factor then the annotator deems the paper relevant. org multi disciplinary global effort of volunteers. gov pmc articles PMC6824528 age International Society for Disease Surveillance Conference 2011 Building the Future of Public Health Surveillance Building the Future of Public Health Surveillance 65 years old 2 https www. Link to code https www. com arturkiulian im an ai researcher and here s how i fight corona 1e0aa8f3e714. com view r eyJrIjoiY2E5YjFkZjItN2Q2ZS00MGI5LWFiMWQtZmY0OWRiZTlkNDVmIiwidCI6ImRjMWYwNGY1LWMxZTUtNDQyOS1hODEyLTU3OTNiZTQ1YmY5ZCIsImMiOjEwfQ 3D 3Dlink to notebook https www. Search for N grams in papers Based on the N grams output of the previous stage this stage involves searching for the papers containing these N grams inside the Abstract Result and Method sections of each paper. com uc id 1OuZbEiwvhWZjRIm 0H7Lv2_aUlpsNyQv Visualization of 3 grams Top 15 most relevant papers when it comes to pollution as a risk factor Risk Factor Title Keyword Ngram No of keyword occurences URL pollution Air pollution and case fatality of SARS in the People s Republic of China an ecologic study air pollution and between air pollution of air pollution 9 https www. Why we did what we did task_reason 9. Simply plug in an array of cancer keywords as input and a whole new field of research is analyzed by our pipeline. gov pmc articles PMC4138153 age Clinical Features Severity and Incidence of RSV Illness During 12 Consecutive Seasons in a Community Cohort of Adults 60 Years Old 60 years old 5 https www. Output A list of n grams that correspond to heart diseases. gov pmc articles PMC4896250 Old Age New approach to identifying proper thresholds for a heat warning system using health risk increments 3 https doi. Daily calls task_calls 11. gov pmc articles PMC4363349 Heart Disease Prevalence of chronic comorbidities in dengue fever and West Nile virus A systematic review and meta analysis 12 One of the most ideal studies I ve seen so far for this. Generalised code for extraction of papers regarding following risk factors Population Density Air Temperature Humidity Pollution Age More specifically for senior ages https www. gov pmc articles PMC1570072 temperature The 1918 1919 influenza pandemic in England and Wales spatial patterns in transmissibility and mortality impact winter autumn 72 http europepmc. 14 17 October 2015 60 years old 3 https www. Appendix task_appendix 12. gov pmc articles PMC4841202 age Influenza associated Deaths in Tropical Singapore among the elderly 2 https www. gov pmc articles PMC3903276 Air Temp A study of the glycoproteins of Autographa californica nuclear polyhedrosis virus AcNPV 3 only abstract availible no mention of temp https doi. gov pmc articles PMC6797893 Heart Disease Lastly the study was conducted in a tertiary care hospital with a non homogeneous sample of patients in which two thirds of the participants had at least one known risk factor for viral pneumonia such as chronic lung disease 67 congenital heart disease 29 and neoplasia 27 so the results obtained should be taken into account in this context and not necessarily generalized to all pediatric patients with HAP. Establishing knowledge base and ultimate list of all risk factors3. Also at the current stage the paper extraction is limited to the following factors Environmental Pollution Population Density Humidity Temperature Comorbidity Heart diseases Demographics Senior age Lifestyle SmokingThe above risk factors were identified as being the most important by the medical community. gov pmc articles PMC6039036 Heart Disease A survey of UK acute clinicians knowledge of personal protective requirements for infectious diseases and chemical biological and radiological warfare agents 11 study on PPE knowledge unrelated to heart disease https www. Output A list of relevant papers that clearly state imply heart disease as a risk factor to infection. Quality Assessment Medical Annotators This part of the process is not automated but there is potential for this phase to be automated. gov pmc articles PMC6518603 heart risks Spontaneous pathology of the common marmoset Callithrix jacchus and tamarins Saguinus oedipus Saguinus mystax congestive heart failure heart disease heart failure 8 http europepmc. gov pmc articles PMC4099807 heart risks Angiotensin Peptides and Nitric Oxide in Cardiovascular Disease heart failure 6 http europepmc. Appendix Data visualization of all the outputshttps app. gov pmc articles PMC4177797 humidity Seasonal evaluation of bioaerosols from indoor air of residential apartments within the metropolitan area in South Korea humidity 11 https www. gov pmc articles PMC3265313 humidity Effect of temperature and relative humidity on ultraviolet UV254 inactivation of airborne porcine respiratory and reproductive syndrome virus humidity 17 https doi. We have an amazing team of medical students who are helping with the annotations. Paper 8 Among the comorbidities DM HTN ischemic heart disease IHD congestive heart failure CHF end stage renal disease ESRD and chronic kidney disease CKD showed significant associations with fatality from MERS CoV Paper 9 7. org articles pmc2596813 pdf render temperature Seasonal Variation of Newly Notified Pulmonary Tuberculosis Cases from 2004 to 2013 in Wuhan China tropic summer winter spring autumn climate 69 https www. gov pmc articles PMC3771918 8 2 Coronavirus and Other Respiratory Illnesses Comparing Older with Young Adults https doi. 9 including prematurity or congenital disease such as heart disease or cerebral malformation 8 https www. Here is a summary of automation currently implemented in our workflow 1. gov pmc articles PMC2874530 Old Age The aging lung 4 COPD has the highest prevalence in the elderly and deserves special consideration in regard to treatment in this fragile population https www. The useful thing about ICD code is that it presents any medical term in a hierarchical organization such that anything related to heart disease will be group together and have a common code denomination. gov pmc articles PMC3825547 age Seasonal influenza vaccine effectiveness against laboratory confirmed influenza in 2015 2016 a hospital based test negative case control study in Lithuania 65 years old 4 https www. 1016 b978 0 12 415766 8. Case Study Heart Disease Risk Factors task_heart 7. This is the power of our workflow one pipeline can fit all. 034 6 3 Clinical Manifestations Laboratory Findings and Treatment Outcomes of SARS Patients https www. 050 population density A geographic analysis of population density thresholds in the influenza pandemic of 1918 19 population densities densely populated 3 https www. From these if applicable a top 10 list of papers is crafted from the list of golden papers sorted by number of keyword occurrences in the previous model. If no then the paper is marked as not relevant In addition the annotators will comment on why they made their decision. org articles pmc3771546 pdf render heart risks Human complement receptor type 1 CR1 protein levels and genetic variants in chronic Chagas Disease heart failure 6 https www. gov pmc articles PMC3037951 humidity Decline in temperature and humidity increases the occurrence of influenza in cold climate humidity 12 https www. 14 2129 Heart Disease Network based analysis of comorbidities risk during an infection SARS and HIV case studies 12 Network based analysis of comorbidities risk during an infection SARS and HIV case studies so there is a line about for SARS Most of the deaths were attributed to complications related to sepsis ARDS and multiorgan failure which occurred commonly in the elderly for comorbidities 34. Input The n grams that were produced from the ICD codes for heart disease in the last stage of the pipeline. 1 5 October 2016 heart disease cardiac arrest heart failure 6 https www. com uc id 18NY5gF51W_v0 DOQMC0Nx2BuUEUWU9kc Visualization of 3 grams heart n https drive. At the current stage a semi automated approach is implemented using manual review of retrieved papers. org articles pmc4288966 pdf render temperature Laboratory epidemiology of respiratory viruses in a large children s hospital A STROBE compliant article summer winter spring autumn 39 https www. gov pmc articles PMC4099807 age Delays in Service for Non Emergent Patients Due to Arrival of Emergent Patients in the Emergency Department A Case Study in Hong Kong over 65 years 65 years old 2 https doi. ", "id": "arturkiulian/coronawhy-org-task-risk-factors", "size": "88001", "language": "python", "html_url": "https://www.kaggle.com/code/arturkiulian/coronawhy-org-task-risk-factors", "git_url": "https://www.kaggle.com/code/arturkiulian/coronawhy-org-task-risk-factors", "script": "IPython.display HTML ", "entities": "(('none', 'tool'), 'have') (('why we', 'them'), 's') (('This', 'CoronaWhy'), 'introduction') (('20044727 threat', 'https 31 www'), 'temperature') (('Task major topic', 'COVID'), 'Overview') (('Risk Factor Title Keyword Ngram No', 'https meteorological 66 www'), 'com') (('that', 'input'), 'search') (('PMC6068768 Heart Disease', 'pneumonia'), 'article') (('that', 'specific keyword'), 'define') (('gov pmc PMC4973921 population threat', 'https non densely populated 1 www'), 'article') (('gov pmc Heart Disease', 'https comorbidity 1 doi'), 'article') (('19 here we', 'grams heart n https 2 drive'), 'article') (('503 risk factors', 'Papers Demographics'), 'support') (('both', 'Beijing'), '004') (('National Assessment summer winter weather', 'https 97 www'), 'climate') (('one pipeline', 'all'), 'be') (('5', '1'), 'find') (('Years 60 5 relative risk', 'years https aged 75 years 60 64 www'), 'article') (('gov pmc articles', 'https 11 www'), 'humidity') (('severe outcome', 'comorbidity'), 'show') (('gov pmc Population Density Spatiotemporal diffusion', 'disease intensity https www'), 'article') (('output papers', 'search'), 'Annotators') (('parts', 'workflow'), 'be') (('extensive list', 'study'), 'provide') (('19 dataset here we', 'grams heart n https 2 drive'), 'be') (('Description', 'case subdomain heart medical disease'), 'start') (('why they', 'decision'), 'involve') (('20043133 heart', 'https 10 doi'), 'risk') (('gov pmc Tsinghua Lancet PMC3293465 Commission', 'healthy China'), 'article') (('Air Temp Climate', 'outbreak climate effects https 19 early dynamics 23 doi'), 'affect') (('population density Polio Eradication Initiative PEI contribution', 'https 1 doi'), 'populous') (('why they', 'decision'), 'mark') (('specific metrics', 'visualization'), 'correspond') (('that', 'medical connotation'), 'be') (('risk 11 direct factor', 'check https www'), 'article') (('size', 'relative count'), 'display') (('severe outcome', 'comorbidity'), 'render') (('that', 'coronavirus infections'), 'list') (('Group B data', 'demographic data'), 'display') (('phase', 'process'), 'Annotators') (('risk factor', 'usually 200 papers'), 'exceed') (('Circulating ACE2 Paper 4 activity', 'hypertension heart such failure'), 'paper') (('options', 'square kilometer'), 'be') (('Risk Factor Title Keyword Ngram No', 'Affordable Care Act heart failure'), 'com') (('gov pmc', 'https TiO2 photocatalytic coatings indoor air pollutants 1 doi'), 'article') (('Sources', 'demo'), 'http') (('color spectrum', 'numerical climate metric measure'), 'use') (('surveillance online tool', 'https 38 doi'), 'climate') (('Heart Disease', 'https CXR 2 doi'), '011') (('humidity Weather Dependent 1101 602706 Risk', 'https rainfall 27 www'), 'humidity') (('5', 'hot days'), 'be') (('This', 'infection susceptibility increased etc'), 'include') (('gov pmc humidity Decline', 'climate cold humidity'), 'article') (('top 10 list', 'previous model'), 'craft') (('Heart comorbid 2600 20 30079 5 Disease major diseases', 'coronary syndrome ACS CS heart fetal arrhythmia acute acute failure cardiac myocarditis'), '1016') (('pdf heart', 'Chagas Disease heart genetic chronic failure'), 'render') (('I', 'so far this'), '010') (('heart 5 October 2016 disease', 'arrest heart https cardiac 6 www'), 'failure') (('diabetes mellitus heart disease', 'SARS'), 'find') (('COURSE study 11 study', 'viral sampling'), 'article') (('heart disease 200 model', 'keyword search'), 'list') (('analysis meta heart', 'diseases 19 systematic review'), 'risk') (('humidity Risk 006 Distribution', 'https 9 www'), 'humidity') (('ICD code', 'Related Health terminology many standardized medical bases'), 'be') (('age Lifestyle risk SmokingThe factors', 'most medical community'), 'limit') (('climate summary', 'cursor'), 'access') (('OR Radiation OR radiation ultraviolet human OR 7 radioactive 2400 7 Ultraviolet uv radiation uv index OR ultraviolet 253 1 Ionised radiation', 'OR ionised radiation'), 'Number') (('model', 'output stage'), 'take') (('percentage', 'risk factor'), 'find') (('they', 'stay'), 'article') (('pmc2740810 pdf Heart Disease', 'https death 1 doi'), 'render') (('that', 'CORD'), 'come') (('org pdf Heart Disease Chronic heart diseases', 'MERS patients'), 'article') (('review systematic weather', 'https 39 www'), '2019') (('that', 'infection'), 'for') (('display group', 'data'), 'populate') (('gov pmc 6 4 Human coronavirus', 'year Southeast Brazil https one www'), 'article') (('section', 'research'), 'exclude') (('OR patients', '1200 2'), 'Number') (('gov pmc heart', 'Middle syndrome East respiratory coronavirus'), 'article') (('ERVs', 'URIs pneumonia acute bronchitis'), 'concerned') (('that', 'threshold'), '050') (('way', 'hospital beds https globally www'), 'fix') (('population density Seasonality ambient temperatures', 'https densely 1 www'), 'article') (('that', '19 prevalence'), 'be') (('gov pmc articles', 'https 24 www'), 'humidity') (('PMC3522360 Heart Disease Other factors', 'severe disease'), 'article') (('Co 5 detection', 'age older group'), '1016') (('influenza cases', 'ambient PM2'), 'result') (('risk 19 factors', 'question'), 'present') (('Heart Disease 12044 Cardiac injury', 'increased risk'), 'find') (('different options', 'deaths'), 'B') (('s0002', 'heart failure heart https congestive 5 doi'), '1016') (('risk 022 Heart Disease direct factor', 'https 2 www'), 'check') (('gov pmc heart', 'Callithrix tamarins Saguinus heart heart disease heart Saguinus mystax congestive failure failure'), 'article') (('gov pmc PMC5042924 heart', 'respiratory syndrome SARS heart severe acute disease'), 'article') (('strategies population', 'https 1 www'), 'article') (('that', 'stage'), 'list') (('4 Snapshot', 'Antananarivo Madagascar'), 'part') (('Established annotators', 'paper'), 'step') (('user', 'bigrams trigrams'), 'capture') (('gov pmc Population Density Geographic Distribution', 'settings https such urban www'), 'article') (('humidity Short Term 20022467 Effects', 'Mouth https 13 www'), 'rainfall') (('input', 'pipeline'), 'plug') (('gov pmc humidity Effect', 'https 17 doi'), 'article') (('gov pmc Top', '7 years https 5 7 2 aged 60 doi'), 'article') (('gov pmc Old aging lung', 'population https fragile www'), 'article') (('sentence', 'data biomedical scientific clinical processing'), 'put') (('19 dataset here we', 'grams heart n https 2 drive'), 'present') (('19 dataset here we', 'grams heart n https 2 drive'), 'article') (('data', 'country'), 'be') (('gov pmc articles', 'http 12 europepmc'), 'humidity') (('terminology don medical t', 'hard such granularity'), 'find') (('gov pmc temperature Respiratory viruses', 'winter spring year summer autumn'), 'article') (('12 number', 'April'), 'display') (('gov pmc heart', 'Clinical Outcomes heart http 7 europepmc'), 'article') (('gov pmc heart', 'Nitric Cardiovascular Disease heart failure'), 'article') (('article', 'code'), 'detail') (('paper', 'risk factor'), 'description') (('Patients', 'heart failure'), 'article') (('gov pmc Influenza', 'https elderly 2 www'), 'article') (('gov pmc', 'winter http spatial transmissibility autumn 72 europepmc'), 'article') (('Coronavirus', 'https 20 www'), 'article') (('illness severity', 'elevated interleukin'), 'associate') (('010 Heart Disease Common underlying medical conditions', 'hypertension'), 'include') (('they', 'other things'), 'quote') (('org articles', 'https 69 www'), 'climate') (('city study air multi pollution', 'China'), 'article') (('Mycoplasma pulmonis infection', 'https densely 1 doi'), 'articles') (('who', 'p'), 'be') (('that', 'risk most probable specific factor'), 'be') (('systems biology approach', 'certain comorbidities'), 'offer') (('clearly state', 'infection'), 'list') (('ICD code heart disease', 'circulatory diseases'), 'be') (('I', 'so far this'), 'article') (('_ _ _ _ _ _ _ 10 papers', 'influenza H1N1 Starting A point'), '055') (('that', 'however systematic documentation'), 'be') (('who', 'annotations'), 'have') (('stage', 'Method paper'), 'involve') (('org pdf Heart Disease Flu season', 'population'), 'article') (('gov pmc PMC5042924', 'https older than 2 doi'), 'article') (('60076 population 6646 11 4 density Cross sectional survey', 'https 1 www'), '1016') (('data missing database', '999'), 'archivio') (('how 900 members', 'very very short timeframe'), 'worth') (('Risk Factor Title Keyword Ngram No', 'Sweden'), 'com') (('performance', 'aerodynamic diameter'), 'pollution') (('that', 'square kilometer'), 'have') (('Quantifying 061 that', 'household air https 2017 pollution 1 doi'), 'pollution') (('Date ranges', 'future functionality'), 'incorporate') (('Heart Disease 013 Effects', 'severity https COVID19 doi'), 'severity') (('60 almost 84', 'cancer cardiovascular diseases chronic respiratory immunosuppression'), 'be') (('gov pmc Old Age Seasonal influenza vaccine effectiveness', 'case control https 2016 hospital based test negative Lithuania 4 www'), 'article') (('gov pmc PMC3641965 Population Density Association', 'SARS https more www'), 'article') (('paper', 'influences'), 'read') (('you', 'book'), 'bracket') (('first piece', 'medicine'), 'take') (('013 heart', 'Young Adults'), 'risk') (('102 Top 10 papers', '7 years https 5 7 2 aged 60 doi'), 'note') (('gov pmc PMC6306566 Heart Disease', 'nonvaccination https 1 www'), 'article') (('we', 'daily lives'), 'factor') (('motor neurone Parkinson disease', 'cerebral palsy'), 'disease') (('Case', 'https 24 www'), 'article') (('gov pmc population density Efficacy', 'https cold 1 doi'), 'article') (('Currently this', 'COVID pretty much static applications'), 'apply') (('com b1b0b61e b47f visualization', 'population density'), 'builder') (('paper', 'risk factor'), 'read') (('gov pmc PMC293432 pollution Risk factors', 'children'), 'article') (('Then list', 'sci scapys UmlsEntityLinker'), 'process') (('Case Study Heart Disease Risk subsection', 'example'), 'Factors') (('851 patients', 'study criteria'), 'article') (('we', 'stage'), 'call') (('gov pmc articles', '2 angiotensin'), 'enzyme') (('com hmwang riskfactors', 'Part'), 'heartdisease') (('URL age Estimates', 'age model based 60 years older group'), 'com') (('when it', 'U.'), 'com') (('Heart Disease Heart 034 diseases', 'case fatality high rates'), 'classify') (('Other statistics', 'also output'), 'display') (('heart 28 47 18 It', 'symptom risk'), 'Disease') (('attached PDF', 'studies'), 'note') (('gov pmc articles', 'Cell Lung Cancer Patients heart https Non small 5 doi'), 'risk') (('Years 60 14 relative risk', 'chronic obstructive pulmonary disease'), 'article') (('Here summary', 'currently workflow'), 'be') (('Also paper', 'relevant paper'), 'contain') (('sections', 'more details'), 'see') (('single center', 'sectional 2 season'), 'article') (('municipal regions', 'climate corresponding given date'), 'what') (('Charlson comorbidity score', 'heart 4 cirrhosis'), 'article') (('Number Covid Cases Region Name Number', 'region'), 'give') (('we', 'one'), 'choose') (('gov pmc PMC4696714 Heart relative risk', 'chronic obstructive pulmonary disease'), 'article') (('195 temperature', 'tipping points https Global global 25 www'), 'induce') (('gov pmc Heart bulk', 'comorbidity'), 'article') (('heart DM HTN ischemic IHD', 'heart failure CHF'), 'congestive') (('most probably we', 'this'), 'be') (('it', 'applications'), 'be') (('it', 'data https 0 Cartographic www'), '-PRON-') (('gov pmc', 'https COVID19 severity 4 doi'), 'article') (('Afrique Centrale', '7 french'), '1016') (('Heart Disease heart 023 disease', 'https population 1 www'), 'be') (('we', 'risk factors categories'), 'codebase') (('gov pmc papers', 'https COVID19 11 doi'), 'article') (('multiorgan which', 'comorbidities'), 'analysis') (('gov pmc heart', 'Cardiac heart disease heart failure'), 'article') (('Climate Metrics', 'minimum temperature humidity such average temperature relative etc'), 'http') (('impact', 'https 5 www'), 'risk') (('stage', 'CORD 19 database'), 'synonyms') (('that', 'survival infection'), 'be') (('gov pmc 3 Angiotensin Converting 10 Soluble Enzyme', 'Clinical europepmc'), 'article') (('gov pmc Heart Disease Congenital heart disease', 'https control 1 www'), 'article') (('How useAcross', 'climate'), 'be') (('gov pmc Old Age New approach', 'https 3 doi'), 'article') (('all white example', 'year over 40 59 olds'), 'be') (('gov pmc pollution Comparison', 'air pollution https 4 www'), 'article') (('3 only abstract', 'temp https doi'), 'article') (('This', '2 pipeline'), 'be') (('Top 10 papers', 'Intensive Care'), '004') (('Next goal', 'study research method'), 'deadline') (('we', 'thresher'), 'use') (('This', 'feasible much shorter timeframes'), 'bring') (('gov pmc role', 'outbreak https 19 14 doi'), 'article') (('climatologic investigation', 'https 10 doi'), 'humidity') (('that', 'n grams'), 'description') (('034 heart', 'heart https idiopathic dilated cardiomyopathy 5 doi'), 'risk') (('heart disease', 'other predictors'), 'article') (('air 1 Indoor pollution', 'children'), 'find') (('1 This', 'years aged 18 to 40 group'), 'paper') (('gov pmc population density Human cold wars', 'https populous 1 doi'), 'article') (('OR 838 Travelling travels', 'food OR 600 OR 5 9 Face touching hands'), 'Number') (('org pdf render Respiratory viral infections', 'emergency room humidity rainfall'), 'article') (('19 here we', 'n grams heart n https drive'), 'evidence') (('022 heart', 'heart arrest heart https disease cardiac failure 10 www'), 'risk') (('how community', 'historical context'), 'join') (('that', 'screen'), 'be') (('gov pmc humidity Climate', 'outbreak dynamics https 19 early 10 doi'), 'article') (('heart 67 congenital 29 27 so results', 'HAP'), 'article') (('heart disease', 'variable'), 'include') (('org articles pmc3179261 pdf render heart', 'heart failure heart congestive failure'), 'risk') (('Selecting', 'date'), 'populate') (('it', 'date range'), 'work') (('gov pmc', 'diseases 19 systematic review'), 'article') (('pmc2740810 heart', 'respiratory failure'), 'render') (('that', 'procedure'), 'be') (('semi automated approach', 'retrieved papers'), 'implement') (('Factors Risk Factor Search Query Genetic Number', 'defence host antiviral 3 OR 2 man'), 'type') (('team', 'other medical conditions'), 'be') (('gov pmc', 'Taiwan'), 'article') (('risk factors', 'https 1 www'), 'article') (('that', 'it'), 'make') (('humidity RNA 044 viruses', 'study humidity rainy cross sectional monsoon rainfall'), 'acquire') (('which', 'Health'), 'cross') (('population 1918 19 densities', 'https densely 3 www'), 'density') (('gov pmc articles', 'case control 2016 hospital based test negative Lithuania'), 'confirm') (('that', 'back also actual medical terminology'), 'be') (('11 Study', 'Medicare https doi'), 'article') (('i', 'ICD then then code'), 'receive') (('it', 'province mapping https www'), 'pop2019') (('such anything', 'code together common denomination'), 'be') (('n that', 'pipeline'), 'input') (('that', 'heart diseases'), 'list') (('type statistic deaths', 'COVID case'), 'correspond') (('here how i', 'corona 1e0aa8f3e714'), 'arturkiulian') (('gov pmc PMC6546210 Heart Disease', 'viruses'), 'article') (('gov pmc _ _ _ _ _ _ _ 10 papers', 'https 15 doi'), 'article') (('when it', 'air pollution https 9 www'), 'com') (('that', 'useful named entity'), 'process') (('level Here high overview', 'pipeline image'), 'be') (('hospital beds com ikiulian global capacity', 'mortality death rates https drive'), 'do') (('outbreak dynamics 19 early temperate', 'https 23 doi'), 'article') (('coronavirus keywords', 'custom array'), 'be') (('Driving', 'https 1 www'), 'density') (('19 here we', 'grams heart n https 2 drive'), '059') ", "extra": "['annotation', 'biopsy of the greater curvature', 'disease', 'gender', 'onset', 'organization', 'outcome', 'patient', 'resection', 'test', 'lung', 'lung cancer', 'necrosis', 'procedure']"}