{"name": "covid 19 ", "full_name": " h1 COVID 19 h2 Importing important library and files h1 Prepare term List h1 Defining important function for further smothening of execution h1 Importing the JSON files h1 Prepared dataset for COVID 19 h2 Defining other important functions h1 Virus Symptoms h1 Virus Transmission h1 Organs affected by Corona ", "stargazers_count": 0, "forks_count": 0, "description": "com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. read_csv Input data files are available in the. items key sort_values. Organs affected by CoronaSearching for word representing organs in human body in all articles that can be affected by coronaviru that matches at least one term in transmission. png Importing important library and files Comment There are 45 774 articles and 17 features. symptoms list of symptoms organs list of human organs old list of terms that are used to define the starting point of an age group young list of terms that are used to define the end of an age group Defining important function for further smothening of execution plot_dict plot a dictionary dict_counter set the value of a key in the dictionary day_value determine value of days report_interval populates dictionary with values for an interval virus_match to checks if any virus term is present in the text or not Importing the JSON files Prepared dataset for COVID 19 Defining other important functions Virus SymptomsSearching for word representing symptoms in all articles that have a coronaviru that matches at least one term in symptoms. Virus TransmissionSearching for word representing transmission in all articles that have a coronaviru that matches at least one term in transmission. png attachment image. For example running this by clicking run or pressing Shift Enter will list all files under the input directory Any results you write to the current directory are saved as output. sha Sourvce of article source_x Sourvce of article title pmcid populated for all PMC paper records doi populated for all BioRxiv MedRxiv paper records and most of the other records WHO Covidence populated for all CZI records and none of the other records pubmed_id populated for some of the records Microsoft Academic Paper ID populated for some of the records publish_time Prepare term List virus_ref virus related words in articles is used to filter the dataset. if sort_values True key lambda item item 1 else lists sorted filtered. This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. ", "id": "rishabb3130/covid-19", "size": "1866", "language": "python", "html_url": "https://www.kaggle.com/code/rishabb3130/covid-19", "git_url": "https://www.kaggle.com/code/rishabb3130/covid-19", "script": "merge_dict_values numval figure report_term organ_ref seaborn numpy virus_match spacy.matcher merge_matches organ_match plot_dict matplotlib.pyplot execute_matches execute_ruleset match transmission_match pandas dict_counter Matcher tqdm symptom_match merge_keys report_interval parse_body day_value match_parser symptom ", "entities": "(('read_csv Input data files', 'the'), 'be') (('you', 'output'), 'list') (('that', 'symptoms'), 'set') (('related words', 'dataset'), 'Sourvce') (('that', 'transmission'), 'organ') (('that', 'transmission'), 'TransmissionSearching') (('It', 'python docker image https kaggle github'), 'come') ", "extra": "[]"}