{"name": "covid 19 knowledge graph a network analysis ", "full_name": " h1 COVID 19 literature network analysis using knowledge graphs and graph tool h1 Table of Contents h1 0 Getting started h2 0 1 Motivation h2 0 2 Package installation h2 0 3 Import packages and data h2 0 4 Generate a network from the knowledge graph using graph tool h2 0 5 Understanding and analyzing knowledge graphs from the network science perspective h1 1 Centrality h2 1 1 Degree centrality h2 1 2 Closeness centrality h2 1 3 Betweenness centrality h2 1 4 PageRank h2 1 5 HITS h2 1 6 Other centrality measures h1 2 Clustering h2 2 1 Local clustering h2 2 2 Global clustering h1 3 Assortativity h1 4 Combining insights from several measures for more in depth analysis h1 5 Outlook h1 References ", "stargazers_count": 0, "forks_count": 0, "description": "A newly discovered human pneumovirus isolated from young children with respiratory tract disease. Authoritative sources in a hyperlinked environment. 1 Local clustering subsection local 2. Newman 2003b cite newman 2003 b The values are relatively low suggesting that while citing a paper the authors are more likely to cite a paper that has a higher number of citations than their own paper. Particularly if the data represents literature related to the research on COVID 19 such as in the present notebook network analysis allows to quickly find influential scientific contributions. However as the plot indicates there are many papers with equally high closeness centrality. Such a strongly skewed degree distribution hints at a potentially hierarchical network structure. Watts 1998 cite watts This looks intuitive the clustering is high where nodes are tightly connected. As we mentioned in Sec. Getting Started section getting started 0. 3 Import packages and dataTo create the knowledge graph we ll adopt some lines of code from this useful kernel. Therefore our network contains works that are close to each other with respect to their scientific discipline. Collective dynamics of small world networks. Exploring and analysing the literature in this way can be not only more informative but also more efficient as the reasearcher gains a high level of control to tailor the queries in a very detailed way. So take a deep breath and go get a cup of coffee. With other words how broadly are these works distributed in terms of research disciplines. 1086 228631 American journal of sociology 92 5 1170 1182. Fruchterman Thomas M. At this point we could easily proceed to revealing and analysing many properties of these particular papers. With other words if a very central or important paper is citing your paper then it give your paper a centrality bonus. 1 Motivation subsection motivation 0. 4 PageRankPageRank an algorithm developed by the founders of Google estimates the importance of a node a based on a s Katz centrality but also taking into account the centrality of nodes pointing to a. Bavelas 1950 cite bavelas To make the matters a little easier we mentioned above only the first paper from the list with highest closeness centrality. This measure is conceptually somewhat similar to the degree centrality. io or in other languages e. However as our network was constructed from the COVID 19 literature dataset its citations are very recent and all citing articles are part of the same dataset. Van den Hoogen B. The interested reader is referred to Landherr 2010 cite landherr. Human rhinoviruses the cold wars resume. We can use these values for more detailed analysis. This measure is often used in the field of citation networks. It is useful to estimate the authorities papers that are cited a lot often some influential ground breaking papers written by famous experts and hubs papers that cite many other papers for example reviews. For example consider the paper Human rhinoviruses the cold wars resume DOI http dx. 1093 oso 9780198805090. In the network each node has an integer id that uniquely identifies the node as well as a label that corresponds to the paper as given in the dataset. a paper citing the same paper twice or self loops i. Clustering back to ToC section toc Clustering or clustering coefficient is an important measure in the present context as it reveals some information on how tightly some groups of articles or publications are interconnected through citations. 3 Import packages and data subsection import 0. I hope that you discover that the combination of the powerful graph_tool library with knowledge graphs can lead to exciting insights and is worth your while. It s called global because it focuses on the entire network. 5 Understanding and analyzing knowledge graphs from the network science perspective subsection understanding 1. The installation can take a while possibly 10min. 2 Global clusteringIn simple terms the local clustering coefficient is high when the entire network forms a large tightly knit group. Nevertheless it is exciting to see that with only a few lines of code we were able to distill lots of considerably impactful papers. As the plot shows the vast majority of nodes has zero closeness centrality and a fairly small fraction of nodes has a closeness centrality close to 1. References back to ToC section toc Bavelas A. Moreover we have close_array_v at our disposal which is the array of all the closeness values of the gt_graph. 2 Closeness centralityIn simple terms nodes with highest closeness centrality are the best connected nodes within their own clusters. Thus closeness centrality can indicate the popularity of a paper within a certain group. Point 1 could also be interpreted as an indication of the prestige of a. 3 Betweenness centrality subsection betweenness 1. However this time we will plot the results as histograms. It can be computed for in degrees out degrees and total degrees. for Bayesian inference of network structure or for edge prediction among others. 2 Package installation subsection installation 0. This is given by the out degree of a. For example according to Google Scholar https scholar. 3 Betweenness centralityNodes with highest betweenness centrality act like connectors or joints. Therefore we compare it to the highest betweenness value Thus the betweenness centrality of the considered paper is higher than that of most papers in the network but by one order of magnitude lower than the highest betweenness value. In this kernel the analysis results are interpreted from the perspective of citation networks Therefore it is important to reduce the data only to citation networks OPTIONAL Display all the predicates to find out what kind of links we can analyse between the nodes for pr in set g. 2 Closeness centrality subsection closeness 1. The insights gained from the analysis below is only as complete as the data used to generate the network. org for beautiful visualizations. 1 Apply a few other plot settings Look at highest values Get one among the highest Again we can plot a neat visualization to see where the local clustering is high Get the clustering values Scale them slightly for a more insightful visualization Draw the graph First we query the index of the node that corresponds to the paper of interest Now we simply draw the betweenness value at the array index node_id And evaluate the value of this betweenness with respect to the mean of the entire betweenness array However as can be seen from the plot in Sec. de Peixoto 2014 cite peixoto Table of Contents 0. Thus the introduction of terms and discussion of results are intentionally chosen to be not too complicating to understand and at the same time as complete as possible. To examine whether this is indeed the case here it helps to visualize the network with node placement based on their distance from the most connected node as in the plot below. predicates print pr OPTIONAL For example here we can see a list of all the publishers that are included in the dataset for s p o in g. nodes that have only one connection. But for the time being we continue our analysis on the original unfiltered knowledge graph. Nature medicine 7 6 719 724. The big differnce is that HITS assigns higher ranking to authorities that are cited by high ranked hubs and vice versa. In this sense it is a bit like a smart degree centrality Kleinberg 1999 cite kleinberg. https onlinelibrary. Moreover the considered dataset is not isolated from the world but is by itself only a sample even though a very large one The analysis results mainly focus on particular properties of the network and are not necessarily mutually exclusive nor strictly inclusive. So we can conclude the above paper does a respectable job in referencing works from relatively diverse areas although this diversity could be higher. 1 Degree centrality subsection degree 1. As the global clustering coefficient assortativity is a global measure. The data used to construct the present knowledge graph can be found here https github. For example if paper i points to paper j it means that i cites j. A set of measures of centrality based on betweenness. More importantly we can scale the node sizes in relation to the betweenness. It seems that there may indeed be two communities. 2 The number of articles that a cites. 1906679 journalCode jas The journal of the acoustical society of America 22 6 725 730 Bonacich P. 1007 s12599 010 0127 3 Business Information Systems Engineering 2 6 371 385. We can see that there is indeed a strong tendency towards a hierarchical structure. Get all the triples that are maximally n_h hops away from our randomly picked paper rand_paper Generate the network based on the rdflib. The structure and function of complex networks. Furthermore review articles often have high betweenness centrality. graph_tool homepage https graph tool. For example we can plot the results in ascending order to get an intuition for their distribution. While graph_tool works with the integer node ids you can get the label from the vnames array like this label vnames str node_id Moreover a network link or edge or connection represents a citation. 5 HITS subsection hits 1. The graph tool python library. Clustering section clustering 2. Note that the in degree value does not necessarily correspond to the total number of articles citing the current paper. org packages ggraph in R and Gephi https gephi. Although it looks unusual the extensive reference list of the paper with the highest out degree has indeed 236 entries. the vast majority of nodes have a total degree of 1 while there are a few nodes that have an extremely high degree. org stable 3033543 seq 1 Sociometry 35 41. These are the reasons for the difference between the Google Scholar and our result. com GillesVandewiele COVID KG. Here the strength of a connection is represented by virtual forces inspired by springs Fruchterman 1991 cite fruchterman. Nevertheless as the network plot shows if we compare the betweenness values relatively to each other the measure is reasonably successful in identifying nodes that are close to the intersection between the two communities. Due to the data size the generated network might represent only a part of the data. Moreover there are other very interesting ways in which we can apply the graph_tool library e. However the knowledge graph contains much more information and network links can be created from other associations such as publishers authors location or even titles. A critical review of centrality measures in social networks. Journal of Clinical Virology 42 4 297 320. 2 Package installationFirst let s install all the necessary packages using conda unfortunately graph_tool cannot be installed using pip. For completeness we can have look at the total degree distribution i. de scholar cites 9551782244184053582 as_sdt 2005 sciodt 0 5 hl en the paper with the highest in degree was so far cited over 2300 times last checked on April 14 2020 while in our network it was cited only 26 times. 1137 s003614450342480 SIAM review 45 2 167 256. 1 Local clusteringThe local clustering coefficient is high when the neighbors of a node are close to forming a clique. Combining insights from several measures for more in depth analysis back to ToC section toc Often it is insightful to combine and or compare the results from multiple measures. Power and centrality A family of measures. 1991 Graph Drawing by Force Directed Placement. Thus it would be more appropriate to evaluate the value of this betweenness with respect to the median of the entire betweenness array. COVID 19 literature network analysis using knowledge graphs and graph_tool This notebook showcases how network science can be used for the analysis of COVID 19 knowledge graphs. 4 Generate a network from the knowledge graph using graph_tool subsection generate 0. We can get this information easily from the array obtained in Sec. Bonacich 1987 cite bonacich There is also a good introductory video https www. Thus instead of obtaining values for each node separately as in above measures here we get one global value that corresponds to the whole network. We also take into account the data from the CORD 19 dataset https www. This line fixes an issue with graph_tool installation on the current Kaggle kernel Import all necessary modules Import the graph data This takes a while. 1 Degree centralityDegree centrality can be broken down into two measures 1 The number of articles citing a specific article a. Mixing patterns in networks. com articles graph_tool 1164194 figshare. a network node a journal paper. This flexibility can be very useful to explore the existing works find out about existing tools or approaches that may be promising for specific procedures but not for others. Combining insights from several measures for more in depth analysis section combining 5. Please keep this in mind while interpreting this and the following data analysis. append o print o OPTIONAL Print a couple of papers that we could use as root to generate the network below for p in glist print p This function converts the imported graph data into a graph_tool network The vnames array is important It is used to get the node label which is a string from the node id which is an integer. com allen institute for ai CORD 19 research challenge. Given this information it might be interesting to find out how close are these other works to each other within their respecitive area of expertise. Centrality section centrality 1. triples None rdflib. 4 PageRank subsection pagerank 1. tidygraph https www. You will see that the meaning of the word influential is broad allowing you to perform the data analysis from many different angles. However note that currently May 2020 most COVID 19 papers are very recent and thus they are not yet cited by any other works at least its not yet included in the data set. Hopefully this kernel provided you with some insightful introductory examples of how knowledge graphs in combination with network science can shed some light into the complex world of scientific literature. The pagerank citation ranking Bringing order to the web. com articles 30918 nature 393 6684 440. Freeman 1977 cite freeman All papers in our network seem to have a low betweenness centrality. 002 that cites 236 other works as we learned in Sec. 4 Generate a network from the knowledge graph using graph_tool Finally let s define a couple of functions for good looking plots Now let s visualize our network 0. The graph below is drawn by placing the nodes proportionately to how strongly they are connected. Instead it reflects only the number of articles within the considered partition of the knowledge graph which cite the current paper. This notebook provides some examples for the tools borrowed from network science that can be applied to obtain detailed insights about the COVID 19 literature dataset. most are close to zero while a few have high values. However the median is zero. com watch v DfV pjRTlLg by Leonid Zhukov. 5 Understanding and analyzing knowledge graphs from the network science perspective A few final notes before we get our hands dirty on some network analysis The language in this notebook is intentionally chosen such that it is accessible to laymen. Such groups often create cliques where every paper cites every other paper within that group. number of citing and cited papers is more likely to cite a paper with a similar degree configuration. Here we focused on citation networks generated from the knowledge graph data set. Finally there are also other great network analysis tools for Python such as NetworkX https networkx. For instance we could very easily view a list of all articles within our dataset that cite or are cited by. Mackay I. 026126 Physical Review E 67 2 026126. 324140 Journal of the ACM JACM 46 5 604 632. Please keep in mind that there is almost always a trade off between simplicity and accuracy For an introduction to knowledge graphs please see this kernel https www. Furthermore using the knowledge graph predicates we can print a list of features associated with this paper such as publisher author or the concept it has within the COVID 19 context. This situation can be expected to drastically change in the coming months. This is a skewed distribution i. Graph If by any chance we have parallel edges i. That is a paper that has the highest in degree may or may not also have a highest or lowest PageRank centrality and vice versa. Outlook section outlook References section references 0. Hence in the current network most nodes are rather loosely connected to a few highly connected ones. 5 HITSThe Hyperlink Induced Topic Search HITS is a measure for the authority and hub centralities of the nodes. 3 the betweenness values are considerably skewed i. However we see also that there are many nodes that are so called leaves i. A cluster is a region within the network in which the nodes are more densely linked to each other than in the rest of the network. In the context of citation networks one could consider them as interdisciplinary works bridging several disciplines. com group16 covid 19 knowledge graph starter notebook and wikipedia https en. Generally the betweenness of a node v is a measure of how many shortest connectivity paths between node pairs go through v divided by the number of all shortest paths. com group16 covid 19 knowledge graph embeddings We can filter out the COVID 19 papers from the knowledge graph using the CORD 19 dataset. It seems clear that a new paper is very unlikely to have been already cited at the time of its publication. This is not very surprising because in generating our network we sampled those works from the knowledge graph that were close cited or were cited by to a particular root paper. For a sophisticated and fast network analysis we use the graph_tool module. Such connections reduce the betweenness values at the normalization. OutlookNetwork science offers a number powerful tools for data mining and data analysis. whether a paper with a certain degree configuration i. org packages tidygraph and ggraph https www. Newman 2003a cite newman 2003 a 3. 4380211102 Software Practice Experience Wiley 21 11 1129 1164. edu 8090 422 Stanford InfoLab. As always correlation causation Finally below is an example of how one can obtain information about a paper from its network node id. It s called local because it focuses on the nearest neighbors of each node. Centrality back to ToC section toc Loosely speaking centrality can be interpreted as a measure that helps identify the most influential nodes inside the network. 6 Other centrality measuresThere are numerous other centrality measures that might reveal some interesting information about the relevance of certain nodes in the knowledge graph. Assortativity back to ToC section toc This measure allows us to estimate whether there are preferential citing patterns i. The more actively the papers reference each other within this group the higher the closeness centrality of the nodes compared to the rest of the network. Luckily we can test this hypothesis by simply plotting the network in a different way. org wiki Knowledge_Graph A great introduction to networks and their properties can be found here https global. Page 1999 cite page The plot shows that the PageRank values are very low. Communication patterns in task oriented groups. Similar to the betweenness analysis above it would be useful to plot the network and compare the values in relation to each other. 0001 Oxford university press. in degree out degree. org standards RiC ontology publishedBy None if o not in all_publishers all_publishers. 1 MotivationNetwork analysis is a very powerful tool that can reveal many relevant features hidden in various large datasets. 6 Other centrality measures subsection other 2. 3 a good indication for this is given by the betweenness centrality. Low betwenness across all papers could also suggest that there is only one scientific community represented in the network. a paper citing itself remove them Create an array of the node ids or vertex ids of the network Scatter plot Network Another good looking visualization This is how we can get different info about a paper from vnames provided the data set contains that info DOI Paper reference in the knowledge graph based on the DOI Authors Creator Publisher Title Here we define a function that we will use later in this notebook Let s first have a look at the in degree distribution This shows us the node with the highest in degree Plot the distribution Now let s do the same for the out degree Plot the distribution Plot the distribution including an inset that shows the same distribution but on a log log scale An alternative way of plotting the histogram in log log scale The node with the highest degree is chosen as root The following line replaces nan values with 0 Plot the distribution Which one is among the highest Plotting in ascending order we can see that the fast majority of nodes has closeness centrality values close to zero Uncomment the line below to zoom into the last 200 data points and see that the closeness increases partially super linearly Get one among the highest Get the betweenness values Scale them for a more insightful visualization Draw the graph Get one among the highest Unomment the line below to limit th y axis values between 0. This is given by the in degree of a. Nevertheless many nodes from diferent levels seem strongly interconnected. In the context of citation networks this measure has rather the role of a sanity check. com academic product networks 9780198805090 cc be lang en Newman 2018 cite newman book In the context of this notebook it is mainly important to understand that the network nodes represent scientific publications i. 2 Global clustering subsection global 3. Assortativity section assortativity 4. ", "id": "iljara/covid-19-knowledge-graph-a-network-analysis", "size": "21600", "language": "python", "html_url": "https://www.kaggle.com/code/iljara/covid-19-knowledge-graph-a-network-analysis", "git_url": "https://www.kaggle.com/code/iljara/covid-19-knowledge-graph-a-network-analysis", "script": "plot_scatter plot_hist plot_graph numpy matplotlib.pyplot tqdm.notebook graph_tool.all create_sub_graph_gt pandas get_title tqdm as ntqdm tqdm ", "entities": "(('measure', 'degree conceptually somewhat centrality'), 'be') (('then it', 'centrality bonus'), 'give') (('Finally below how one', 'network node'), 'be') (('indeed here it', 'plot'), 'help') (('a few that', 'extremely high degree'), 'have') (('network how science', 'knowledge COVID 19 graphs'), 'COVID') (('that', 'others'), 'be') (('str network Moreover link', 'citation'), 'get') (('the', 'current paper'), 'note') (('when neighbors', 'clique'), 'be') (('how broadly works', 'research disciplines'), 'with') (('Thus betweenness centrality', 'magnitude highest betweenness value'), 'compare') (('Degree centralityDegree 1 centrality', 'article specific a.'), 'break') (('that', 'two communities'), 'show') (('one', 'several disciplines'), 'consider') (('at least its', 'data yet set'), 'note') (('journalCode 1906679 journal', 'America'), 'jas') (('analysis results', 'network'), 'isolate') (('Now we', 'Sec'), 'apply') (('org standards', 'all_publishers all_publishers'), 'ontology') (('we', 'graph_tool library e.'), 'be') (('it', 'entire network'), 'call') (('Here we', 'knowledge graph data set'), 'focus') (('Point', 'a.'), 'interpret') (('However time we', 'histograms'), 'plot') (('where paper', 'group'), 'create') (('These', 'Google Scholar'), 'be') (('proportionately how strongly they', 'below nodes'), 'draw') (('unfortunately graph_tool', 'pip'), 'let') (('Outlook section', 'References section references'), 'outlook') (('combination', 'exciting insights'), 'hope') (('situation', 'drastically coming months'), 'expect') (('we', 'set'), 'interpret') (('Luckily we', 'different way'), 'test') (('interested reader', '2010 landherr'), 'refer') (('Particularly data', 'quickly influential scientific contributions'), 'allow') (('how tightly groups', 'citations'), 'be') (('connectivity how many shortest paths', 'shortest paths'), 'be') (('degree centrality bit smart Kleinberg', '1999 kleinberg'), 'cite') (('pagerank citation', 'web'), 'rank') (('very powerful that', 'various large datasets'), 'be') (('that', 'scientific discipline'), 'contain') (('Thus introduction', 'intentionally too same time'), 'choose') (('we', 'knowledge original unfiltered graph'), 'continue') (('new paper', 'publication'), 'seem') (('Low betwenness', 'also only one scientific network'), 'suggest') (('that', 'g.'), 'print') (('it', '14 2020 network'), 'cite') (('we', 'particular papers'), 'proceed') (('s003614450342480 1137 SIAM', '45 2 167 256'), 'review') (('We', 'more detailed analysis'), 'use') (('number', 'degree similar configuration'), 'be') (('which', 'current paper'), 'reflect') (('Now s', 'network'), 'Generate') (('that', 'whole network'), 'get') (('more actively papers', 'network'), 'reference') (('measure', 'citation networks'), 'use') (('very all', 'same dataset'), 'be') (('It', 'degrees degrees'), 'compute') (('us', 'toc'), 'assortativity') (('we', 'Sec'), '002') (('We', 'indeed strong hierarchical structure'), 'see') (('nodes', 'network'), 'be') (('we', 'parallel edges'), 'Graph') (('nodes', 'best connected own clusters'), 'centralityin') (('intentionally such it', 'laymen'), 'understanding') (('that', 'literature COVID 19 dataset'), 'provide') (('how other works', 'expertise'), 'be') (('papers', 'low betweenness centrality'), 'cite') (('vast majority', 'close 1'), 'have') (('Nevertheless many nodes', 'diferent levels'), 'seem') (('this', 'betweenness centrality'), 'give') (('closeness Thus centrality', 'certain group'), 'indicate') (('most nodes', 'rather loosely a few highly connected ones'), 'connect') (('we', 'considerably impactful papers'), 'be') (('However plot', 'closeness many equally high centrality'), 'be') (('that', 'high ranked hubs'), 'be') (('little we', 'closeness highest centrality'), 'cite') (('PageRank values', '1999 page'), 'cite') (('insights', 'network'), 'be') (('toc Often it', 'multiple measures'), 'combine') (('Such connections', 'normalization'), 'reduce') (('de Peixoto', 'Contents'), 'cite') (('We', 'Sec'), 'get') (('we', 'useful kernel'), 'create') (('More importantly we', 'betweenness'), 'scale') (('it', 'other'), 'be') (('that', 'dataset'), 'view') (('that', 'root close particular paper'), 'be') (('Betweenness centrality 3 subsection', '1'), 'betweenness') (('DOI', 'example'), 'consider') (('OutlookNetwork science', 'data mining'), 'offer') (('only more more reasearcher', 'very detailed way'), 'be') (('it', 'node'), 'call') (('properties', 'networks'), 'wiki') (('which', 'gt_graph'), 'have') (('that', 'own paper'), 'cite') (('as well that', 'dataset'), 'have') (('hubs that', 'example reviews'), 'be') (('highest', 'PageRank also highest centrality'), 'be') (('Thus it', 'entire betweenness array'), 'be') (('HITSThe Topic Search 5 Hyperlink Induced HITS', 'hub nodes'), 'be') (('that', 'network'), 'centrality') (('measure', 'sanity check'), 'have') (('Here strength', '1991 fruchterman'), 'represent') (('centrality numerous other that', 'knowledge graph'), 'be') (('This', 'while'), 'fix') (('nodes', 'centrality'), 'estimate') (('it', 'COVID'), 'print') (('i which', 'node'), 'print') (('provided', 'scientific literature'), 'shed') (('reference extensive list', 'indeed 236 entries'), 'have') (('review Furthermore articles', 'often high betweenness centrality'), 'have') (('installation', 'possibly 10min'), 'take') (('generated network', 'data'), 'represent') (('you', 'many different angles'), 'see') (('that', 'rdflib'), 'get') (('we', 'degree distribution total i.'), 'look') (('network links', 'publishers authors such location'), 'contain') (('we', 'distribution'), 'plot') (('graph', '0'), 'remove') (('we', 'graph_tool module'), 'use') (('where nodes', '1998 watts'), 'cite') (('We', '19 dataset'), 'com') (('data', 'https here github'), 'use') (('network mainly nodes', 'scientific publications'), 'com') (('We', 'https CORD 19 dataset www'), 'take') (('i', 'j.'), 'for') (('diversity', 'relatively diverse areas'), 'do') (('few', 'high values'), 'be') (('Bonacich', '1987 bonacich'), 'cite') (('when entire network', 'large tightly knit group'), 'term') ", "extra": "['disease', 'test', 'procedure']"}