{"name": "covid 19 influence of exams in recall precision ", "full_name": " h1 Taskforce to help diagnose COVID19 h2 Introduction h2 Data prep h3 Import h3 EDA h2 Modelling strategy h2 Prediction of confirmed COVID19 h3 Regular blood Tests h4 Baseline Dummy classifiers h4 SVM h4 Gradient Boosting Classifier h4 Random Forest h4 AdaBoost on Decision Trees h3 Respiratory virus and bacteria Tests h4 Baseline Dummy classifiers h4 SVM h4 Gradient Boosting Classifier h4 Random Forest h4 AdaBoost on Decision Trees h3 Influenza Rapid Tests h4 Baseline Dummy classifiers h4 SVM h4 Gradient Boosting Classifier h4 Random Forest h4 AdaBoost on Decision Trees h2 Final thoughts on results h2 Acknowledgment h2 Referências ", "stargazers_count": 0, "forks_count": 0, "description": "Backtest agains H1N1 Rhinovirus and Influenza B We selected SARS CoV 2 negative patients diagnosed with H1N1 Rhinovirus and Influenza B to backtest our best performing models agains other diseases with similar symptoms. This said we have chosen to create models for each group of tests in order to prevent bias toward severe cases and data imputation. We also tested penalizing more the errors on the minority classes with Random Forest and SVM. EDAWe first analyze the frequency of each test in the dataset. Backtest against Rhinovirus 1. com ossamum exploratory data analysis and feature importance2. Training validation and test datasets Once selected the patients that underwent a group of tests we split the dataset in training 70 and test 30. Most of the dataset is missing values2. We ve found that infected patients have done slightly more non respiratory tests then COVID negative people. The tests can be splitted into two categories Red blood cells RBCs Tests on concentration and morphology of cells responsible to transport oxygen in the blood. Given the high dispersion of patients undergoing each test we also analysed the null values in the dataset. Red blood cells Hemoglobin Hematocrit Red blood cell distribution width RDW Mean corpuscular hemoglobin MCH Mean corpuscular volume MCV Mean corpuscular hemoglobin concentration White blood cells WBCs Cells responsible for immunulogic body process such as fighting a disease and stanching a wound. Backtest against Influenza B 1. The first four features usually present abnorbal values when the body passing through an immunological process. com in jairofreitas Computer Scientist from Federal University of ABC Brazil and data analytst at Itaú Unibanco Fortune 500 NYSE and B3 ITUB Christian Espinoza https www. Below we present the data. IntroductionWe analyse feature bias through severity of cases. We also treated Ausentes as 0 and any other kind of crystal as 1 on Urine Crystals because we believe that this is more intuitive for interpretation. The Gradient Boosting most important features were Leukocytes Monocytes Platelets C reactive protein mg dL and Red blood cell distribution width RDW. Notice that 22 tests were not included in the 6 major groups proposed. As exemplified by the video below by Grant Sanderson adopting strategies to quickly isolate vectors of a disease is the most effective non pharmacological strategy. The accuracy is also reported since it s more intuitive to a new entrant in data science. Figure 6 illustrate the usual infection kinectics with respect to some white blood cells. Acknowledgment Data prep ImportWe performed categorical to numerical conversion and removed tests that were not tested on infected patients. 3 of them are Regular blood test respiratory virus and bacterial tests and Influenza rapid tests. Inputation in the medical context is hard and must consider demographic characteristics like gender race etc. SVM Gradient Boosting ClassifierGradient Boosting discussion uses the table below Backtest against Influenza B Backtest against H1N1 Backtest against Rhinovirus Random Forest AdaBoost on Decision Trees The plot below is used in the discussion of AdaBoost results. Available at https slideplayer. Routine blood tests 1 why do we test for urea and electrolytes Nursing Times 110 5 19 21. com health rdw blood test5. 2013 June 25 2 123 129. Import and preparation 1. The first plot in the figure below illustrate it Figure 1 a. Billirubin enzymes electrolytes1 and gaseous analysis4. Respiratory virus and bacteria Tests 1. Testing positive or not apparently doesn t help on diagnosing coronavirus. So we investigated Figure 1 b the representativeness of patient admission unit for each medical exam. They are usually very low frequency tests. Unfortunately he didn t report the interpretation of the pattern in the data so we will do it by performing dimensionality reduction on the presence or absence of exams. Respiratory viruses test e. Our work is organized as follows 1. It has 6 groups of tests each group contains medical exams that usually occur together 3. The occurence of each group of tests and the co occurrence between them is highly dependent on the severity of the case especially admitted versus non admitted patients. Later we interpret these PCs. Figure 2 is based on Nasser Boan s kernel 2. Th AdaBoost most important features are C reactive protein Neutrophils Mean platelet volume monocytes and Red blood cell distribution width RDW. We stratified the sets by SARS Cov2 exam result and admission type unit. The interpretation of the first six principal components are 1. In contrast Gradient Boost have high accuracy on all tests the lowest performance on H1N1 with 93. Prediction of confirmed COVID19 1. Leukocytes Lymphocytes Basophils Eosinophils Neutrophils Platelets Monocytes Mean platelet volume C Reactive ProteinAll models tested greatly improved over the baseline based on F1 Scores measures. On the other hand Gradient Boosting Classifier got the best precision on the COVID cases 57 and a reasonable recall 49. The models fitted to this subset of tests barely outperformed the baseline. Gradient Boosting Classifier 1. Cell Injury Death Inflammation and Repair. One curious case was the Random Forest algorithm that reached a 65 F1 Score on test but greatly deviated from validation results 55 so we invalidated the model. Severe virus influenza A H1N1 related pneumonia and community acquired pneumonia differences in the evolution. We also showed that the blood tests are the only relevant exams found to greatly outperform a dummy baseline in predicting coranavirus. The aggregation of white points in the image illustrates the final result of PCA. Investigatint the feature importances of this random forest we ve found that 48 of the model was explained by patient age which is far from reasonable. The models fitted to it marginally outperformed the baseline. 6 groups of tests were found using Principal Components Analysis. For that we used the standart implementation of PCA from Scikit learn. php script sci_arttext pid S0103 507X2013000200010 lng en. Regular blood Tests 1. AdaBoost on Decision Trees Influenza Rapid TestsThe influenza rapid tests group is composed of 2 tests A and B Influenza rapid tests and the patient age quantile. Evaluation metrics We evaluated all of our models using F1 Score the harmonic mean of precision and recall given that the dataset is very unbalanced. We also thanks SIG Ciência de Dados Inteligência Artificial em Saúde CIDIAS for the opportunity to present our work to a medical audience. All results are compared against a dummy classifier. The accuracy of the models were tested against patients with 3 diseases which have similar symptoms to COVID 19 and the results suggested that they can differentiate SARS CoV 2 from H1N1 Rhinovirus and Influenza B. Backtest against H1N1 1. Prediction of confirmed COVID19 Regular blood TestsThis group of tests is composed of the patient age quantile and 16 common blood tests. We ve found that the AdaBoost metalearning model over Decision Trees had the best recall on the positive COVID cases 82 and a decent precision 42. We also created a group containing the influenza rapid tests these exams are not present in the PC analysis because don t co occur with others but are relatively commom in the dataset. We reordered Figure 2 rows and columns by the groups of exams. We identified some possible bias in the data that must be taking into account when modelling it specially that some tests are performed mostly on severe cases. There s a high dispersion in the quantity of patients undergoing each test. Taskforce to help diagnose COVID19Kaggle competition https www. that are not provided in the dataset. We also backtest our best models agains patients infected with H1N1 Rhinovirus and Influenza B and found that our models capture SARS CoV 2 patterns different than these flus. The question we want to answer is Are we actually detecting a SARS CoV 2 pattern or just a commom infectious process related to other diseases with similar symptoms Figure 8 presents the quantity of patients without SARS CoV 2 but diagnosed with 1 or more respiratory diseases. The unbalanaced nature of the data was explored and taken into account when evaluating the model performances. Discussion of results1. From Figure 3 we observe that after the 6th component the variance explained grows very slowly. Comparing admission units admitted patients underwent significantly more exams then elective ones. null_values_exploration logreg. Medical expertise is needed to fully interpret this data. On Figure 4 we plot the most important features of the first 6 principal components variance explained by these PCs 94. AdaBoost on Decision Trees 1. com slide 4382692 Encode the addmission columns into one Conversion from categorical to numerical Removal of exams not performed on positive cases Frequency plot Admission units over total tests performed Percentage of COVID cases over total tests performed plot lines plot cols Here we create columns to flag the group of tests performed Data split and hyperparameter search Influenza B Plot the feature importances of the forest Print the feature ranking Influenza B. On Figure 5 we plot the frequency of these exams. The result above can be helpful to fit partial models on chunks of exams available since we observed that some of them occur together. We use 5 fold cross validation on training. SVM Gradient Boosting Classifier Random ForestThe discussion on this result uses the feature importance table below. Different from him we considered wordings like not_done and Não Realizado as missing for further analysis of missing values. On the other hand AdaBoost recall is higher because it s more sensitive to elements that show up early in an infection process C reactive protein 5 and neutrophils 6. Unusual Bone marrow cells circulating in blood and segmented parts1 We found Blann article on Nursing Times 3 useful to feel comfortable deciding to allocate electrolytes on PC 3 other than 2 which is in accordance to the data. Backtest against Influenza B Backtest against H1N1 Backtest against Rhinovirus Respiratory virus and bacteria TestsThis group of tests is composed of the patient age quantile and 17 tests on common virus and bacterias that affect the respiratory system such as H1N1 and influenza. Nardocci Paula Gullo Caio Eduardo Lobo Suzana Margareth. We also were capable of spliting the dataset into 6 groups of frequently co occuring medical exams in a unsupervised manner which allowed for greater samples on training less dropping of records due to null values. net clinical archive assessment skills why do we test for urea and electrolytes 24 01 2014 4. com nazeboan null values exploration logreg 67 acc3. Available from http www. We believe though that recall is preferred over precision given the efficacy of putting infected people in isolation. Both data preparations are inspired by Ossamu s 1 EDA of this dataset. We merged PCs 3 and 4. The values are on percentage of total records of the subset of patients. Regular blood test red and white cells 3. com dataset e626783d4672f182e7870b1bbe75fae66bdfb232289da0a61f08c2ceb01cab01 dataTeam members Jairo da Silva Freitas Júnior https www. These result u We selected some patients diagnosed with other flus to backtest our models. Also we found on Figure 1 c that rarer tests are related to higher probability of the patient having coronavirus. Figure 7 Infection kinetics and white blood cells a General 6 b C Reactive Protein 5 We ve also found that the AdaBoost model have high accuracy on H1N1 80 and Rhinovirus 94 patients but low accuracy on Influenza B ones 54. Regular blood tests were found to be the most useful to detect coronavirus. The last one represents the variation in volume of the red blood cells and usually indicate other underlying conditions 4. Finally AdaBoost is our model of choice for isolation of suspicious cases since it has a very high recall. com in christianespinoz Computer Scientist from University of São Caetano do Sul Brazil and improver data analyst at Hospital Israelita Albert Einstein. We also performed an analysis on the co occurences of the aforementioned groups of tests by COVID status positive or negative and admission unit ICU etc. Red Cell Distribution Width RDW Test. For these we fit models and compare the ones that favors precision and recall through a clinical perspective. Our hypothesis is that Gradient Boosting give more importance to clearer signs of infection severity leukocytes. Baseline Dummy classifiersSince this dataset is imbalanced dummy classifiers get high accuracy but low F1 Score 0. SVM Gradient Boosting Classifier Random Forest AdaBoost on Decision Trees Final thoughts on resultsThe Gradient Boosting Classifier is the best alternative we ve got for high precision needs. Now we notice that most of the patients didn t underwent tests other then for COVID in the sample. Some models do not accept null values. intensiva Internet. Usually rarest tests are related to increased complexity of the medical facility. Available at https www. Coocurence matrix for test on COVID negative patients Coocurence matrix for test on COVID positive patients Coocurence matrix for test on UCI patients Coocurence matrix for test on semi intensive patients Coocurence matrix for test on regular ward patients Coocurence matrix for test on elective patients Modelling strategyThe exploratory analysis indicated that 1. AcknowledgmentWe would like to thanks the team from Einstein Data4u for the competition and selection of our work as relevant to the theme. The result is shown in Figure 6. Same interpretation of 3 medical expertise would help 5. Milton Ossamu Tanizaka. Influenza Rhinovirus 2. Exploratory Data Analysis and Feature Importance. ", "id": "jairofreitas/covid-19-influence-of-exams-in-recall-precision", "size": "15710", "language": "others", "html_url": "https://www.kaggle.com/code/jairofreitas/covid-19-influence-of-exams-in-recall-precision", "git_url": "https://www.kaggle.com/code/jairofreitas/covid-19-influence-of-exams-in-recall-precision", "script": "sklearn.metrics PCA tensorflow.python.keras.layers sklearn.tree AdaBoostClassifier DummyClassifier Sequential DecisionTreeClassifier tensorflow.python.keras seaborn numpy sklearn.decomposition GradientBoostingClassifier cooc_matrix sklearn.ensemble sklearn.model_selection f1_score sklearn unit_room RandomForestClassifier matplotlib.pyplot Dense pandas classification_report accuracy_score svm KerasClassifier GridSearchCV sklearn.dummy keras.wrappers.scikit_learn train_test_split IPython.display HTML ", "entities": "(('first plot', 'it'), 'illustrate') (('22 tests', '6 major groups'), 'notice') (('last one', 'usually other underlying conditions'), 'represent') (('EDAWe', 'dataset'), 'analyze') (('We', 'training'), 'use') (('it', 'very high recall'), 'be') (('occurence', 'especially non admitted patients'), 'be') (('We', 'COVID status'), 'perform') (('assessment net clinical archive why we', '24 01 2014 4'), 'skill') (('Gradient', 'most important features'), 'be') (('Figure', '2 1 respiratory diseases'), 'be') (('Medical expertise', 'fully data'), 'need') (('Usually rarest tests', 'medical facility'), 'relate') (('values', 'patients'), 'be') (('why we', 'Nursing Times'), 'test') (('Gradient Boosting', 'infection severity leukocytes'), 'be') (('they', 'H1N1 2 Rhinovirus'), 'test') (('variance', '6th component'), 'observe') (('when body', 'immunological process'), 'present') (('Modelling strategyThe exploratory analysis', '1'), 'matrix') (('We', 'SARS Cov2 exam result'), 'stratify') (('some', 'them'), 'be') (('1 rarer c tests', 'coronavirus'), 'find') (('Figure', 'Nasser 2 Boan'), 'base') (('We', 'models'), 'result') (('AdaBoost also model', 'Influenza B 80 Rhinovirus 94 low ones'), 'cell') (('influenza Severe virus A H1N1 related pneumonia', 'evolution'), 'acquire') (('We', 'medical audience'), 'thank') (('so we', 'model'), 'be') (('best we', 'precision high needs'), 'be') (('didn t underwent', 'sample'), 'notice') (('We', 'Random Forest'), 'test') (('recall', 'isolation'), 'believe') (('that', 'infection early process'), 'be') (('that', 'such H1N1'), 'backtest') (('Influenza Rapid tests TestsThe influenza rapid group', '2 tests'), 'AdaBoost') (('data preparations', 'dataset'), 'inspire') (('So we', 'medical exam'), 'investigate') (('tests', 'blood'), 'splitte') (('Gradient Boosting Classifier', 'COVID cases'), 'get') (('volume C Reactive ProteinAll Monocytes Mean platelet models', 'F1 Scores measures'), 'Platelets') (('AcknowledgmentWe', 'relevant theme'), 'like') (('interpretation', 'first six principal components'), 'be') (('that', 'medical exams'), 'have') (('adopting', 'disease'), 'be') (('which', 'data'), 'cell') (('3', 'them'), 'be') (('Gradient Boost', '93'), 'have') (('we', '30'), 'select') (('Prediction', 'age patient quantile'), 'compose') (('Influenza models', '2 patterns flus'), 'backtest') (('5 we', 'exams'), 'plot') (('Same interpretation', '5'), 'help') (('we', 'exams'), 'report') (('4 we', 'PCs'), 'plot') (('aggregation', 'PCA'), 'illustrate') (('don t co', 'relatively dataset'), 'create') (('blood Regular tests', 'most coronavirus'), 'find') (('blood also tests', 'coranavirus'), 'show') (('this', 'more interpretation'), 'treat') (('which', 'null values'), 'be') (('we', 'dataset'), 'analyse') (('we', 'missing values'), 'consider') (('SVM Gradient Classifier Random ForestThe discussion', 'feature importance table'), 'Boosting') (('unbalanaced nature', 'model when performances'), 'explore') (('which', 'patient age'), 'find') (('models', 'marginally baseline'), 'outperform') (('6 groups', 'Principal Components Analysis'), 'find') (('SARS CoV 2 negative patients', 'similar symptoms'), 'again') (('specially tests', 'mostly severe cases'), 'identify') (('that', 'clinical perspective'), 'fit') (('we', 'Scikit'), 'use') (('results', 'dummy classifier'), 'compare') (('dataset', 'precision'), 'metric') (('plot', 'AdaBoost results'), 'use') (('also it', 'data science'), 'report') (('infected patients', 'then negative people'), 'find') (('models', 'barely baseline'), 'outperform') (('Inputation', 'gender race etc'), 'be') (('patients', 'significantly more exams'), 'admit') (('group', 'Influenza B.'), 'slide') (('dummy classifiers', 'high accuracy'), 'classifierssince') (('Figure', 'blood white cells'), 'illustrate') (('IntroductionWe', 'cases'), 'analyse') (('We', 'exams'), 'reorder') (('we', 'severe cases'), 'say') (('best recall', '82'), 'find') (('that', 'infected patients'), 'perform') ", "extra": "['biopsy of the greater curvature', 'disease', 'gender', 'patient', 'test', 'lymphocyte']"}