{"name": "detecting lane lines using opencv for self driving ", "full_name": " h2 Lets import necessary libraries h2 Lets start with reading the image h2 Converting the image into grayscale h2 Smoothening image Reduce noise h2 Edge detection h2 Finding the region of interest ROI and creating Mask h2 Lane Detection Using Hough Transform To know about Hough Transform refer this h2 Optimizing further h2 Future work Lane Detection from a video h1 Please consider upvoting if you like my work Happy Kaggling ", "stargazers_count": 0, "forks_count": 0, "description": "Converting the image into grayscale. Smoothening image Reduce noise. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. I will keep on updating the notebook. Future work Lane Detection from a video. read_csv Input data files are available in the read only. To know about Hough Transform refer this https docs. Lets import necessary libraries Lets start with reading the image. 4 d9 db0 tutorial_hough_lines. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session using Gausian Blur to reduce the noise Edges can be detected by using Canny edge detector bottom of the image slightly lower than the middle y is reversed in image add more weight to longer lines bottom of the image slightly lower than the middle y is reversed in image add more weight to longer lines. html Optimizing further. Please consider upvoting if you like my work Happy Kaggling This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. Finding the region of interest ROI and creating Mask. Lane Detection Using Hough Transform. ", "id": "thrineshduvvuru/detecting-lane-lines-using-opencv-for-self-driving", "size": "558", "language": "python", "html_url": "https://www.kaggle.com/code/thrineshduvvuru/detecting-lane-lines-using-opencv-for-self-driving", "git_url": "https://www.kaggle.com/code/thrineshduvvuru/detecting-lane-lines-using-opencv-for-self-driving", "script": "regionofinterest average_slope_intercept make_points numpy matplotlib.pyplot display_lines pandas ", "entities": "(('import necessary libraries', 'image'), 'let') (('It', 'kaggle python Docker image https github'), 'consider') (('read_csv Input data files', 'read'), 'be') (('t', 'longer lines'), 'list') ", "extra": "[]"}