{"name": "dysonian seti with machine learning ", "full_name": " h2 Synopsis h2 Introduction h2 Boilerplate code h2 Data h2 Modeling strategy h2 Decorators data selection h2 Spectrophotometic distance error h2 Model variables h2 Linear modelling h2 First GBM model h2 Second GBM Model h2 Neural Network h2 Blend h2 Model error h2 Residual modeling h2 Final transformation and validation h2 Candidate selection h2 Model and H R diagrams h2 Space distribution of candidates h2 Clustering analysis h2 Output files h2 Other subsets h2 Discussion h2 Acknowledgments h2 References ", "stargazers_count": 0, "forks_count": 0, "description": "Second GBM ModelGBMs are stochastic meaning that their responses include randomness that varies from one run to the next. com solorzano multi stellar seti candidate selection part 1 IntroductionDysonian SETI is a proposed approach in the search for extraterrestrial civilizations Bradbury et al. a model response and a label for purposes of model evaluation. ReferencesBradbury et al. A Random Forest essentially produces averages of labels over some training examples which is intuitively in line with what we want to accomplish. We can apply the full transform to the entire dataset. With additional spectral features a better approximation of the absolute magnitude can be derived. csv An equal number of ordinary stars. They can be picked out as follows. That s why we include both the distance and the logarithm of the distance as variables. GR defined below is a hyperpameter of this special variable. Our responses are cross validated so they should work. Columns found in the data frame follow. The new frame will be ordered by distance. 2018 suggested that stars with Dyson Swarms would have spectrophotometric distances that exceed their parallax distances. 2018 by modeling the g magnitude of 64K stars as a function of Gaia DR2 parallax and spectrophotometric features available in RAVE DR5. Model and H R diagramsWe will now look at some visualizations of model results. We could be discarding valid candidates. That could be explored but it seems it would allow the meta model to discover brightness and color based patterns which would cause us to discard potentially valid candidates. Model errorLet s create a transform that will add an error_ column with the residuals of the blend. We will use linear regression to produce the blend model. Distance modulus errors should be equivalent to magnitude errors in terms of scaling. Linear modellingOur first regressor will be linear. Clustering could be explained as 1 a star type that exhibits clustering and can t be pinned down mathematically with the spectrophotometric features available to us or 2 a model or data artifact. However within included data there are still differences in model error that are characterizable. We will also add a couple decorator columns that are useful in visualizations the distance to the star in parsecs and the absolute magnitude abs_mag_ne of the star based on the G magnitude from Gaia DR2. Clustering analysisAnomalously dim candidates particularly those in the main sequence or below the blue ones in the 3D chart appear to cluster. Then we will build a meta model of the model s absolute residuals given that each star s measurements have errors that depend on its distance and other features. So we have over a hundred anomalously dim candidates at the 3 sigma level. A more robust clustering test is presented in a cloned kernel Dysonian SETI With ML Squared Residual Meta Model https www. Clustering is more evident among candidates that are in the main sequence or below. The extract_model_vars function takes a data frame and returns a variable matrix that is ready to be used with scikit learn style regressors with a fit function. This is consistent with the RMSE observed in work_data. The possibility of contamination or incorrect cross identification should be studied further. Earth is at 0 0 0. In preliminary analysis we found that many potential candidates appear to be below the main sequence in an H R diagram but upon further examination it was clear these are stars with high parallax error. If there s clustering of star types of interest that s somewhat of a problem. Since extinction is likely irregular in our region of space we include galactic latitude and longitude as variables. Let s compare anomalously dim candidates with bright controls. Final transformation and validationLet s put all our transform functions into a list called transform_list. Note that the 3D scatter is interactive. Both of these subsets should have a distance bias given that we control for the expected absolute residuals of the model and those residuals are distance dependent. SynopsisWe test a variant of the methodology outlined in Zackrisson et al. The abs_mag_value function below will convert a magnitude column in a data frame into an absolute magnitude. Other subsetsIn the H R diagram there are a few anomalously dim stars that are slightly below the main sequence. Additionally in preliminary analysis we found that anomalously dim candidates cluster so we are making sure that any regional error patters are taken into account by using distance longitude and latitude as variables of the residual model. Our blend is only slightly better than our best individual model. com solorzano dysonian seti with ml squared residual meta model We will now concatenate the position frames of the candidates and bright controls. The following transform function adds an anomaly_ column to a frame defined as the ratio between the model s residual and the expected absolute residual. We will also define a function that compares two frame columns e. We find statistically significant stellar clustering in the group of anomalously dim candidates. Interstellar extinction is neglected in the absolute magnitude estimate. A blend of GBMs and a Neural Network produces an RMSE of 0. We note that anomalously dim candidates particularly those in the main sequence or below it exhibit stellar clustering. Let s produce a second 3D scatter containing only the bright controls. The separation line is defined by the separation_y function below which is visually derived. There are pairs of candidates and bright controls that are very close to one another in the sky. Modeling strategyOur strategy will consist of transforming the work_data frame typically by adding columns to it at each step. Additionally model error is distance dependent. com solorzano new stellar magnitude model dysonian seti Multi Stellar SETI Candidate Selection https www. Any subsample of the cross distance frame should also have a frequency of True True rows of 25 within statistical uncertainty if there s no clustering that depends on the modeled anomaly. A blend does not have to be linear but in this case that appears to be the best choice. This should be taken into account going forward The model seems to smooth out anomalies though not entirely as it detects region dependent patterns. First GBM modelNext we will build a Gradient Boosting Machine GBM. Note that we will be modeling the G magnitude of a star as provided by Gaia DR2. The reason why galactic latitude and longitude are variables of the residual meta model is precisely to try to address observed clustering. The set of anomalously dim stars is shown in green. Theoretically the difference between the magnitude of a star and its absolute magnitude is a linear function of the logarithm of the star s distance. The reader can change the LABEL_COLUMN variable below to model say RP or BP magnitudes. Anomalously dim candidates green dots occur both in the main sequence and above it. Instead it s typically long tailed. We won t be using the RAVE spectrophotometric distance as a variable given that we expect it to leak information about magnitude. Residual modelingWe have distance based and parallax error based exclusion criteria which helps improve model performance. Neural Network BlendWe will now blend the 4 individual models we previously produced. We would like to use the Gaia DR2 parallax distance not just its logarithm as a variable of the model in order to account for interstellar extinction. The cross distance frame looks as follows. First let s look at a chart of modeled absolute magnitude vs. In this kernel we will model the magnitude of stars rather than their distance modulus. We will use a minimum parallax of 2. Primarily we will use color index features which are simply differences between magnitudes observed with different photometric filters. We will define a function that extracts the absolute residual array i. Space distribution of candidatesLet s define a function that takes a data frame and converts distance galactic longitude and latitude to x y z coordinates. Candidates in the main sequence or below are shown in blue. Clustering is in fact more pronounced if we remove latitude and longitude features. If they didn t that would be evident once we look at the test data we set aside. Decorators data selectionWe will start by limiting the data we will use to train models and obtain candidates. The transform is also able to produce output for data that was not used in training. 5 400 parsecs and a maximum parallax error of 0. There is just one function later in the analysis called separation_y that is visually derived and would need to be adjusted accordingly. A high proper motion is not unusual however for stars that are close to Earth. _SETI with Gaia The observational signatures of nearly complete Dyson spheres_. All model responses will be out of bag as we rely on k fold cross validation. The expectation is that True True rows occur 25 of the time. We will use the TreeBoost implementation from xgboost https xgboost. It seems sensible to make adjustments based on each star s expected error. Outliers are to be expected and they are not indicative that we ve found anything unnatural nor are non outliers necessarily natural. Anomalously dim candidates are selected at a cutoff of 3 sigma in the anomaly distribution and made available in the output tab of this kernel. 23 magnitudes in cross validation which is nearly a third of the error between Gaia parallax and RAVE spectrophotometric distance moduli. There is a technical reason for this. Let s set aside a test data frame we will double check only after all of the cross validated models and transformations are tested using a work data frame. Indeed this is what we find if we look at the entire cross distance frame. com solorzano dysonian seti with ml squared residual meta model New Stellar Magnitude Model https www. Edit Distance distributions can change if the random seed changes and affect this clustering analysis. DiscussionWe have produced a model of stellar magnitude as a function of Gaia DR2 parallax distance and spectrophotometric features from a number of databases. We also train a meta model of the model s absolute residuals and define anomaly as a residual divided by the expected absolute residual. AcknowledgmentsThis work has made use of data from the European Space Agency ESA mission Gaia https www. int web gaia dpac consortium. This RMSE is nearly a third of the discrepancy between Gaia parallax and RAVE spectrophotometric distance moduli. In addition to RAVE DR5 measurements the dataset includes cross identified features from Gaia DR2 APASS DR9 ALLWISE and DENIS. In order to do this we will create transform functions that take a frame and produce a new frame with altered data. Additionally in the interactive 3D scatter chart we find a group of a few stars that are close to one another and relatively close to Earth. dim candidates mainseq. hist can be very slow. The dashed orange line shows the expected null hypothesis frequency. standard margin of error. The following code tests incremental headsets of the ordered cross distance frame starting with the first 5 rows. The problem with this approach is that real world data does not have a normal distribution. These thresholds can be changed below. For this reason we will train a second GBM with slightly different hyperparameters so that the final model blend is more stable. Let s plot the results of this test. The set of bright controls is shown in orange. The variables were kept because of their slight contribution to meta model performance. We want to minimize the error but we also want a reasonable number of candidates for follow up analyses. In particular we need a function that can produce a transform from an arbitrary regression model. 23 magnitudes when we select only stars with parallax of 2. Output filesThe following files are made available in the output tab of this kernel. The next chart will be a Hertzsprung Russell H R diagram. It s valid to use the response of a model as a variable of another model so long as the response is out of bag. For these reasons we will simply use a 3 sigma threshold to select our list of anomalously dim candidates. Per the methodology previously outlined we will use this first transform function to alter our work_data frame. int gaia processed by the Gaia Data Processing and Analysis Consortium DPAC https www. _Dysonian Approach to SETI A Fruitful Middle Ground _ Journal of the British Interplanetary Society vol. In order to account for interstellar extinction irregularities galactic latitude and longitude are variables of the model. In any case we did not find evidence of significant regional error patterns. Model variablesLet s define the variables we will use to train regression models. Anomalously dim sources are sometimes giants as well but most occur in the main sequence. But we will take advantage of photometric features provided by RAVE DR5 from various other databases in addition to features found in Gaia DR2. Defining a threshold is a subjective exercise. Note that we don t use magnitude features. We additionally include a special transformation of the latitude based on the assumption that a region close to latitude zero has increased extinction. However we don t believe such a systematic explains the observed clustering. Specifically we will blend Gradient Boosting Machines GBMs and a Neural Network. We will test machine learning algorithms that are able to deal with complex nonlinearities. We will use a color index in the X axis defined as the difference between the Gaia provided BP and RP magnitudes. Let s start by checking summary statistics of each of the subsets. Let s calculate squared distances between all pairs of sources in the concatenated frame. observed absolute magnitude. We can mathematically test this conjecture. Two additional lines show the lower bound of the 95 red and 99 blue confidence intervals. One possibility is to check how the error distribution compares to a normal distribution. Further we will add two boolean columns to the cross distance frame indicating whether each of the sources in a pair are anomalously dim. _The Radial Velocity Experiment RAVE Fifth Data Release_. The rest are shown in green. We re interested in rows where both sources are anomalously dim. Spectrophotometic distance errorLet s calculate a baseline Root Mean Squared Error RMSE for reference. It should be noted that all of the above are high proper motion stars. We will compare the Rave DR5 spectrophotometric distance modulus with the Gaia DR2 parallax based distance modulus. There is a practical reason for this. Next we will define a function that obtains the variables of the absolute residual meta model. csv Anomalously dim candidates that are in the main sequence or below. With this position frame we can now produce an 3D scatter chart showing the candidates in our region of space. the regression label from a frame. We will create a new frame where each row contains a pair of sources and their squared distance. 03210Zackrisson et al. One idea is that since the model uses galactic latitude and longitude as variables it might have introduced random regional irregularities in model responses. 08351 Due to Pandas versioning issue plt. RAVE DR5 also provides metal abundance and metallicity features that seem to help. First let s get a random sample of 1000 stars from the data. We can therefore reject the null hypothesis. csv All sources that were used in training and candidate selection. A blend is a combination of multiple models so it should generally be more stable less long tailed than the individual models. com solorzano rave dr5 gaia dr2 consolidated home. Now we ll create a function that runs the whole transform sequence on a frame and apply it to the test data we had initially set aside. The bright controls are only slightly farther away by 5 in average. csv A list of anomalously bright controls. csv The list of anomalously dim candidates. It s possible to approximate the absolute magnitude of a star and therefore its probable distance given the star s color. We will split the candidates frame into two subgroups called candidates_bright and candidates_mainseq using the dashed blue line. 5 or more and parallax error of 0. Regional error that is not reflected in the parallax_error field should have been discovered by the absolute residual meta model. Let s also get an equal number of anomalously bright controls. The transform will add model responses as a new column of the frame. Follow ups Dysonian SETI with ML Squared Residual Meta Model https www. org project and made available in a Kaggle dataset https www. But there s an additional extinction component that is roughly dependent on distance. Absolute residuals are always positive. Boilerplate code DataData is obtained from the RAVE project https www. Noisy data affects model precision and also increases the likelihood that candidates will be spurious. First we need a function that extracts the variables of the blend model which are simply the responses of the individual models. Our 1000 random stars are shown in gray. We will add a dashed blue line to the H R diagram intended to separate main sequence stars from giants. Instead of performing radio searches the approach involves looking for stars that host artificial megastructures. In a Gaia only H R diagram anomalously bright sources are typically giants. This hypothesis is easily discarded by removing latitude and longitude from the set of variables. We ll also get an equally sized list of ordinary controls. We want a model that always produces positive responses. Funding for the DPAC has been provided by national institutions in particular the institutions participating in the Gaia Multilateral Agreement. In other words Dysonian stars should be dimmer than their spectral characteristics would indicate. Let s check what the mean absolute proper motion values are for stars that are at most 75 parsecs away. The regressor we will use in this case is a Random Forest. Candidate selectionIt s not obvious how candidates should be selected. Model responses are cross validated so they can be used as inputs of other models. Let s check the error_ column that the test data should now have. ", "id": "solorzano/dysonian-seti-with-machine-learning", "size": "19061", "language": "python", "html_url": "https://www.kaggle.com/code/solorzano/dysonian-seti-with-machine-learning", "git_url": "https://www.kaggle.com/code/solorzano/dysonian-seti-with-machine-learning", "script": "get_cv_model_transform sklearn.metrics get_gbm2_transform get_nn_transform sc print_evaluation get_gbm_trainer plot_pos_frame plotly.offline abs_mag_value sklearn.neural_network transform_anomaly get_blend_trainer get_blend_transform pd_concat extract_model_vars save_data mean_squared_error numpy _transform plotly.graph_objs RandomForestRegressor transform_init combined_transform scipy.stats get_abs_error_label linear_model sklearn.ensemble separation_y sklearn sklearn.model_selection KFold MLPRegressor transform_error matplotlib.pyplot get_error_trainer error extract_blend_vars pandas cm StandardScaler get_gbm_transform get_position_frame get_nn_trainer color_value matplotlib sklearn.preprocessing plt_hist xgboost get_gbm2_trainer extract_error_vars plotly.plotly ", "entities": "(('that', 'modeled anomaly'), 'have') (('that', 'main sequence'), 'be') (('sometimes as well most', 'main sequence'), 'be') (('set', 'orange'), 'show') (('possibility', 'contamination'), 'study') (('We', 'therefore null hypothesis'), 'reject') (('_ Radial Velocity Experiment', 'Fifth Data Release _'), 'RAVE') (('that', 'just one later analysis'), 'be') (('Rave', 'distance based modulus'), 'compare') (('we', 'test data'), 'create') (('that', 'parallax distances'), 'suggest') (('that', 'altered data'), 'create') (('each', 'pair'), 'add') (('we', 'analyses'), 'want') (('that', 'relatively close Earth'), 'find') (('bright that', 'sky'), 'be') (('we', 'anything'), 'be') (('We', 'candidates'), 'square') (('We', 'blend model'), 'use') (('extinction interstellar irregularities galactic latitude', 'model'), 'be') (('DiscussionWe', 'databases'), 'produce') (('It', 'therefore probable color'), 's') (('we', 'anomalously dim candidates'), 'use') (('it', 'generally more less long individual models'), 'be') (('First s', 'data'), 'let') (('that', 'training'), 'csv') (('Distance modulus errors', 'scaling'), 'be') (('we', 'magnitude features'), 'note') (('error how distribution', 'normal distribution'), 'be') (('better approximation', 'absolute magnitude'), 'derive') (('23 when we', '2'), 'magnitude') (('Defining', 'threshold'), 'be') (('test data', 'that'), 'let') (('us', 'potentially valid candidates'), 'explore') (('Specifically we', 'Gradient Boosting Machines GBMs'), 'blend') (('we', 'variables'), 'include') (('Anomalously dim candidates green dots', 'it'), 'occur') (('entirely it', 'region dependent patterns'), 'take') (('anomalously bright sources', 'Gaia'), 'be') (('where sources', 'rows'), 're') (('SynopsisWe', 'Zackrisson et al'), 'test') (('We', 'interstellar extinction'), 'like') (('We', 'giants'), 'add') (('that', 'case'), 'have') (('t', 'available us'), 'explain') (('which', 'Gaia parallax'), 'magnitude') (('We', 'mathematically conjecture'), 'test') (('that', 'model still error'), 'be') (('dataset', 'Gaia DR2 APASS DR9 ALLWISE'), 'in') (('following code', 'first 5 rows'), 'test') (('It', 'expected error'), 'seem') (('we', 'candidates'), 'start') (('Candidates', 'blue'), 'show') (('Model', 'model results'), 'look') (('seti candidate selection IntroductionDysonian stellar 1 SETI', 'civilizations Bradbury et extraterrestrial al'), 'be') (('com solorzano dysonian seti', 'model New Stellar Magnitude Model https residual meta www'), 'square') (('that', 'always positive responses'), 'want') (('hypothesis', 'variables'), 'discard') (('new frame', 'distance'), 'order') (('We', 'expected absolute residual'), 'train') (('bright controls', 'only slightly farther away 5'), 'be') (('which', 'simply individual models'), 'need') (('that', 'somewhat problem'), 's') (('we', 'Gaia DR2'), 'note') (('set', 'green'), 'show') (('reader', 'RP magnitudes'), 'change') (('we', 'now 4 individual models'), 'blend') (('it', 'stellar clustering'), 'note') (('True True rows', '25 time'), 'be') (('we', 'Gaia DR2'), 'take') (('This', 'work_data'), 'be') (('Anomalously dim candidates', 'kernel'), 'select') (('model final blend', 'slightly different hyperparameters'), 'train') (('that', 'converts z distance galactic coordinates'), 'define') (('that', 'stars'), 'let') (('that', 'frame columns two e.'), 'define') (('distance Spectrophotometic errorLet', 'Root Squared Error reference'), 'calculate') (('world real data', 'normal distribution'), 'be') (('we', 'case'), 'be') (('that', 'array absolute residual i.'), 'define') (('We', 'dashed blue line'), 'split') (('Funding', 'Gaia Multilateral Agreement'), 'provide') (('only all', 'work data frame'), 'let') (('Boilerplate code DataData', 'RAVE project https www'), 'obtain') (('we', 'regression models'), 'define') (('so long response', 'bag'), 's') (('transform', 'frame'), 'add') (('s', 'only bright controls'), 'let') (('spectral characteristics', 'other words'), 'be') (('abs_mag_value function', 'absolute magnitude'), 'convert') (('we', 'cross fold validation'), 'be') (('First s', 'modeled absolute magnitude'), 'let') (('We', 'anomalously dim candidates'), 'find') (('we', 'stars'), 'model') (('that', 'regression arbitrary model'), 'need') (('transform following function', 'residual'), 'add') (('We', 'BP'), 'use') (('that', 'main sequence'), 'csv') (('Final transformation', 'list'), 'put') (('that', 'artificial megastructures'), 'of') (('that', 'blend'), 'create') (('that', 'Gaia DR2'), 'add') (('that', 'training'), 'be') (('So we', 'sigma 3 level'), 'have') (('random seed', 'clustering analysis'), 'change') (('we', 'what'), 'produce') (('which', 'different photometric filters'), 'use') (('that', 'Earth'), 'be') (('we', 'test data'), 'be') (('Theoretically difference', 'distance'), 'be') (('Output filesThe following files', 'kernel'), 'make') (('don systematic', 'observed clustering'), 'believe') (('variables', 'model meta performance'), 'keep') (('where row', 'sources'), 'create') (('why galactic latitude', 'precisely observed clustering'), 'be') (('that', 'distance'), 'build') (('why we', 'variables'), 's') (('it', 'model responses'), 'be') (('metallicity that', 'metal also abundance'), 'provide') (('which', 'separation_y function'), 'define') (('s', 'concatenated frame'), 'let') (('We', 'ordinary controls'), 'get') (('First we', 'Gradient Boosting Machine GBM'), 'GBM') (('blend', '0'), 'produce') (('that', 'absolute residual meta model'), 'discover') (('that', 'complex nonlinearities'), 'test') (('we', 'space'), 'produce') (('that', 'next'), 'be') (('RMSE', 'Gaia parallax'), 'be') (('it', 'magnitude'), 'win') (('GR', 'below special variable'), 'be') (('that', 'fit function'), 'take') (('s', 'bright controls'), 'let') (('We', 'xgboost https xgboost'), 'use') (('Two additional lines', 'confidence 95 red 99 blue intervals'), 'show') (('we', 'error significant regional patterns'), 'find') (('which', 'model performance'), 'have') (('residuals', 'model'), 'have') (('candidates', 'also likelihood'), 'affect') (('a few anomalously dim that', 'slightly main sequence'), 'subsetsIn') (('they', 'other models'), 'be') (('all', 'above'), 'note') (('We', 'entire dataset'), 'apply') (('Modeling', 'step'), 'consist') (('blend', 'only slightly best individual model'), 'be') (('orange dashed line', 'hypothesis expected null frequency'), 'show') (('extinction additional that', 'roughly distance'), 's') (('we', 'cross distance entire frame'), 'be') (('s', 'subsets'), 'let') (('clustering more robust test', 'ML Squared Residual Meta Model https www'), 'present') (('error regional patters', 'residual model'), 'find') (('s', 'anomalously bright controls'), 'let') (('previously we', 'work_data frame'), 'outline') (('that', 'absolute residual meta model'), 'define') (('Clustering', '3D chart'), 'appear') (('region', 'extinction'), 'include') (('these', 'parallax high error'), 'find') (('Interstellar extinction', 'magnitude absolute estimate'), 'neglect') (('AcknowledgmentsThis work', 'European Space Agency ESA mission Gaia https www'), 'make') (('more we', 'latitude features'), 'be') ", "extra": "['biopsy of the greater curvature', 'test', 'bag']"}