{"name": "e commerce eda purchase classification ", "full_name": " h1 1 EDA Exploratory Data Analysis h3 Except in transactionid there are no missing values h3 All transaction events have transaction ID h3 As dates in current dataset is in unix timestamp the number of seconds since 1970 01 01 I ll convert them into readable dates h3 This dataset is recorded from 3rd May 2015 to 18th September 2015 GMT h3 When analysing the distribution of events View occupies 96 67 Add to cart 2 52 Transaction 0 81 h3 The number of unique visitors was around the half of total number in all three types of event for example total view is 2 6 million but unique visitor for the views is the half which means that on average one visitor caused 2 actions h2 Q1 How many times did a customer view an item before making purchase decision h3 date time transaction h3 In the dataframe above multiple views are mixed in for one transaction which means there are cases that a visitor checked the item multiple times I ll check both timelines one is from the first item view to transaction and other is from the last item view to transaction h3 There are some outliers such as 844 views for buying a single item and hence I will check the distribution of view counts to have a better idea about general purchase cases h3 The first row in the dataframe above indicates that Visitor id 172 had viewed the item id 10034 four times before resolving to purchase The second row is about another item the same visitor purchased and this time the visitor viewed that item five times h3 When analysing the item view numbers I found around 50 of transactions were made without more than once view a visitor checked an item added to cart and checked out About 30 of transactions were made after a buyer view an item once or twice In summary 80 of total transactions were made after less than three times item view h2 Q2 How many times does it take for one single transaction to be made h3 In case of single view transactions they generally take around 3 to 11 minutes to reach the end of buying journey view to transaction On the other hand multiple view transactions showed more dispersed time range about 9 minutes to 9 5 hours with 30 minutes as a median However when multiple view buyers checked the product for the last time before purchase they took similar short amount of time to single view buyers h2 Q3 Is there any relationship between Item Category and Transaction h3 Category ID is a subset or child of Parent Id h3 Only categoryid and available were given in the column property while the rest are hashed for confidentiality purpose I will use only categoryid and hence leave only the rows with that h3 I had assumed that the more Category ID or Parent ID an item has the more transactions it might have as the item could have exposed in multiple category pages However when I checked the distribution of data the number of items with multiple categories was not many h3 There is no general trend in the number of sales along category id h3 There is no general trend in the number of sales along parent id h3 There was no clear relationship between category and transaction sales h2 Q4 Is there any relationship between View Time and Transaction h3 choosen feature dayofweek hour previous view previous transaction h2 2 Machine Learning Classification Modeling h2 Step 01 Normalize data h2 Step 02 Train Test Split h2 Step 03 1 K Nearest Neighbors Algorithm h3 The best model is when k value is 7 with 92 of model accuracy h2 Step 03 2 Decision Tree Algorithm h2 Step 03 3 Logistic Regression Algorithm ", "stargazers_count": 0, "forks_count": 0, "description": "K Nearest Neighbors Algorithm The best model is when k value is 7 with 92 of model accuracy. I had assumed that the more Category ID or Parent ID an item has the more transactions it might have as the item could have exposed in multiple category pages. Logistic Regression Algorithm. There is no general trend in the number of sales along parent id. When analysing the distribution of events View occupies 96. 5 hours with 30 minutes as a median. There are some outliers such as 844 views for buying a single item and hence I will check the distribution of view counts to have a better idea about general purchase cases. About 30 of transactions were made after a buyer view an item once or twice. The second row is about another item the same visitor purchased and this time the visitor viewed that item five times. How many times does it take for one single transaction to be made In case of single view transactions they generally take around 3 to 11 minutes to reach the end of buying journey view to transaction. As dates in current dataset is in unix timestamp the number of seconds since 1970 01 01 I ll convert them into readable dates. When analysing the item view numbers I found around 50 of transactions were made without more than once view a visitor checked an item added to cart and checked out. There is no general trend in the number of sales along category id. There was no clear relationship between category and transaction sales. Decision Tree Algorithm Step 03 3. Is there any relationship between Item Category and Transaction Category ID is a subset or child of Parent Id. Only categoryid and available were given in the column property while the rest are hashed for confidentiality purpose. Normalize data Step 02. EDA Exploratory Data Analysis Except in transactionid there are no missing values. 6 million but unique visitor for the views is the half which means that on average one visitor caused 2 actions. I will use only categoryid and hence leave only the rows with that. I ll check both timelines one is from the first item view to transaction and other is from the last item view to transaction. However when multiple view buyers checked the product for the last time before purchase they took similar short amount of time to single view buyers. On the other hand multiple view transactions showed more dispersed time range about 9 minutes to 9. The number of unique visitors was around the half of total number in all three types of event for example total view is 2. This dataset is recorded from 3rd May 2015 to 18th September 2015 GMT. The first row in the dataframe above indicates that Visitor id 172 had viewed the item id 10034 four times before resolving to purchase. However when I checked the distribution of data the number of items with multiple categories was not many. Train Test Split Step 03 1. All transaction events have transaction ID. Machine Learning Classification Modeling Step 01. How many times did a customer view an item before making purchase decision date_time transaction In the dataframe above multiple views are mixed in for one transaction which means there are cases that a visitor checked the item multiple times. In summary 80 of total transactions were made after less than three times item view. Is there any relationship between View Time and Transaction choosen feature dayofweek hour previous view previous transaction 2. ", "id": "cielokim/e-commerce-eda-purchase-classification", "size": "3627", "language": "python", "html_url": "https://www.kaggle.com/code/cielokim/e-commerce-eda-purchase-classification", "git_url": "https://www.kaggle.com/code/cielokim/e-commerce-eda-purchase-classification", "script": "LogisticRegression DecisionTreeClassifier quan_list sklearn time_cal sklearn.model_selection metrics sklearn.tree numpy matplotlib.pyplot sklearn.neighbors sklearn.linear_model plot_confusion_matrix pandas train_test_split KNeighborsClassifier preprocessing ", "entities": "(('item', 'category multiple pages'), 'assume') (('dataset', '2015 18th September 2015 GMT'), 'record') (('buyer', 'item'), 'make') (('hence I', 'purchase general cases'), 'be') (('which', '2 actions'), 'be') (('Is', 'Transaction Category Parent Id.'), 'be') (('they', 'view single buyers'), 'take') (('transaction events', 'transaction ID'), 'have') (('one', 'transaction'), 'check') (('total view', 'example'), 'be') (('Visitor above i', '172 item'), 'indicate') (('visitor', 'cart'), 'make') (('k when value', 'model accuracy'), 'algorithm') (('same time visitor', 'item'), 'view') (('number', 'multiple categories'), 'be') (('01 01 I', 'readable dates'), 'be') (('they', 'transaction'), 'take') (('rest', 'confidentiality purpose'), 'give') (('visitor', 'item'), 'view') (('I', 'that'), 'use') ", "extra": "['test']"}