{"name": "eda supercategories attributes correctness ", "full_name": " h1 Supercategories h1 Connecting categories and attributes h1 Closer look at train data h2 1 Check Width and Height correctness h2 2 Check if there are any duplicates h1 Masking h1 Conclusions and other ideas ", "stargazers_count": 0, "forks_count": 0, "description": "Pockets and zipper are usually located nearby and they are relatively small. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. And maybe it will improve segmentation results for both subsets. 1 of total image pixels. What supercategories are varied the most Relative counts for 3 supercategories decorations garment parts upperbody are shown below In the dataset the most common wholebody cloth type is dress. Check if there are any duplicatesWe also check if there are any image masks with several accociated classes we might want to ignore them while training our segmentation model. 7 are associated only with 3 supercategories lowerbody upperbody and wholebody. This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. One of these parts might contain clipped clothes the other might contain full human body. set_titles col_name row_name you can look at these images if you want. We use supercategories to compare how mask_fraction distribution differs from supercategory to supercategory The biggest masks mask_fraction 0. Attribute s supercategory denotes that it describes some specific property I. Only masks related to 4 supercategories well 3 if we neglect 3 mask annotations related to garment parts have any associated attribute. We can split train dataset to several parts. Check Width and Height correctnessThere are no images with different width and height parameters in train. Maybe not a mistake after all MaskingFor every mask in train dataset we convert number of masks pixels to a fraction of total image pixels We named this parameter mask_fraction. It is unclear at least for me if the train dataset attributes are given for all possible images or are these attributes provided for only a small subset of images. Is there a way to filter train data somehow 4. Now we will take a closer look at train dataset and check how many categories are presented there. Masks associated with neck arms and hands closures are almost always small 0. The most common duplicated mask is marked with image categories with ids 32 and 35. That doesn t mean that there are no errors. Let s take a look at some big masks mask_fraction 0. Next we fix annotation file. Just in case we ll check all dimensions for train images and compare them with the ones provided in annotation file. How often specific attributes or attribute groups appear within category s supercategory 3. There are also images which contain only 1 apparel already clipped. Conclusions and other ideas1. read_csv Input data files are available in the. SupercategoriesSupercategories might be the key to answering following questions 1. It means that human body pictured on them if there is any is probably clipped. 7 These sample images are all clipped. There also might be pockets with zipper. Almost a half of the images have no shoes annotation. For every other supercategory we might ignore them. rotation 90 extract all available attributes and create separate table helper objects and methods. Both attributes and categories contain additional supercategory column which might be the source of insights related to our data. As you can see from previous 2 plots number of mask annotations with any attribute is relatively small. It is quite clear that for the draft segmentation model it is sufficient to use mask s category identifier and to ignore mask s attributes. Cloths from the same supercategory are similar in some sense. Do we have weakly labeled data or fully labeled data 3. For example running this by clicking run or pressing Shift Enter will list the files in the input directory Any results you write to the current directory are saved as output. They have particular clothes shown on it but there is no human on the photo. How many mask annotations have any associated attributes 2. Shoe dominates in 2nd most common supercategory legs and feet that means that it might be worth to search for shoes on the photos Connecting categories and attributes Closer look at train data 1. Train dataset contains a very diverse collection of images with a lot of small details. ", "id": "latticetower/eda-supercategories-attributes-correctness", "size": "3725", "language": "python", "html_url": "https://www.kaggle.com/code/latticetower/eda-supercategories-attributes-correctness", "git_url": "https://www.kaggle.com/code/latticetower/eda-supercategories-attributes-correctness", "script": "seaborn numpy matplotlib.pyplot Image drawPunchcard sum_mask_pixels draw_images pandas read_image_dimensions PIL get_scatter_data compute_mask_percentage buildPlot ", "entities": "(('well we', 'associated attribute'), 'mask') (('we', 'weakly data'), 'label') (('you', 'images'), 'look') (('Check', 'height train'), 'be') (('mask_fraction how distribution', 'masks biggest mask_fraction'), 'use') (('Connecting', 'train data'), 'dominate') (('s', 'masks big mask_fraction'), 'let') (('how many categories', 'train dataset'), 'take') (('we', 'them'), 'ignore') (('most common duplicated mask', 'ids'), 'mark') (('How often specific attributes', 'attribute supercategory'), 'appear') (('SupercategoriesSupercategories', 'questions'), 'be') (('We', 'parameter mask_fraction'), 'mistake') (('We', 'several parts'), 'split') (('it', 'attributes'), 'be') (('mask How many annotations', 'associated attributes'), 'have') (('supercategory it', 'property specific I.'), 'denote') (('you', 'output'), 'list') (('7', 'supercategories lowerbody only 3 upperbody'), 'associate') (('which', 'data'), 'contain') (('Cloths', 'sense'), 'be') (('human body', 'them'), 'mean') (('Almost a half', 'shoes annotation'), 'have') (('They', 'photo'), 'have') (('train dataset attributes', 'images'), 'be') (('Train dataset', 'small details'), 'contain') (('read_csv Input data files', 'the'), 'be') (('wholebody cloth most common type', 'dataset'), 'be') (('also which', 'only 1 apparel'), 'be') (('you', 'attribute'), 'be') (('maybe it', 'subsets'), 'improve') (('Masks', 'neck arms'), 'be') (('It', 'python docker image https kaggle github'), 'come') (('other', 'full human body'), 'contain') (('we', 'segmentation model'), 'check') (('we', 'annotation file'), 'check') ", "extra": "['annotation']"}