{"name": "eda on tile labels ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "read_csv loading and using our training data load data maybe lists instead of series maybe multi index is goin mad. Valid values are 0 background non tissue or unknown 1 stroma connective tissue non epithelium tissue 2 healthy benign epithelium 3 cancerous epithelium Gleason 3 4 cancerous epithelium Gleason 4 5 cancerous epithelium Gleason 5 Karolinska Regions are labelled. The label masks of Karolinska were semi autotomatically generated based on annotations by a pathologist. linear algebra data processing CSV file I O e. It uses the 12 tiles with the most tissues and creates a row per tile with image id tile index data provider gleason score background benign gleason 3 gleason 4 gleason 5 for each tile. Radboudumc Prostate glands are individually labelled. This notebook creates a CSV file labelling iafoss tiles. Valid values 0 background non tissue or unknown 1 benign tissue stroma and epithelium combined 2 cancerous tissue stroma and epithelium combined The label masks of Radboudumc were semi automatically generated by several deep learning algorithms contain noise and can be considered as weakly supervised labels. ", "id": "dararc/eda-on-tile-labels", "size": "1028", "language": "python", "html_url": "https://www.kaggle.com/code/dararc/eda-on-tile-labels", "git_url": "https://www.kaggle.com/code/dararc/eda-on-tile-labels", "script": "drop_id numpy matplotlib.pyplot pandas subprocess check_output ", "entities": "(('maybe multi index', 'maybe instead series'), 'list') (('label masks', 'pathologist'), 'generate') (('3 Karolinska 2 healthy benign epithelium 3 cancerous epithelium 4 cancerous 4 5 cancerous Gleason 5 Regions', 'stroma 0 background non unknown 1 connective non epithelium tissue'), 'be') (('notebook', 'CSV file labelling iafoss tiles'), 'create') (('tissue tissue label unknown 1 benign epithelium combined 2 cancerous masks', 'weakly supervised labels'), 'combine') (('It', 'tile index data provider gleason score i d benign 3 4 5 tile'), 'use') ", "extra": "['annotation']"}