{"name": "eda with models featureengineering bagging ", "full_name": " h1 Hepatitis Dataset h3 Importing the Libraries h3 Importing the dataset h1 EDA h2 Visualization h1 Model Training h4 Split Data h3 Logistic Regression h3 Decision Tree Classifier h3 Random Forest Classifier h3 KNN h3 Support Vector Classifier h3 Gaussian Naive Bayes h2 Compairing Training Accuracy of Different Models h2 Compairing Testing Accuracy of Different Models h2 Comparing Confusion Matrix of different Classifiers h3 Comparing Training times of different Classifiers h3 Bagging Classifier h3 Adaboost Classifier h3 Gradient Boosting Classifier h3 USING SMOTE h3 Logistic Regression h3 Decision Tree Classifier h3 Random Forest Classifier h3 KNN h3 Support Vector Classifier h3 Gaussian Naive Bayes Classifier h3 Bagging Classifier h3 Adaboost Classifier h2 Conclusion h4 In all the Cases Logistic Regression performed well and got least difference between Training and Testing Score ", "stargazers_count": 0, "forks_count": 0, "description": "Numericalso to fill null values of catagorical variable we used mode and for numerical variable we used mean or median after checking there skewness. DAT file is negative values are quoted because when speaking about the continuous attribute there is no such thing as all possible values. ASCITES no yes 14. ANTIVIRALS no yes 6. Draw a Heat Map of Data Model Training Split Data Logistic Regression Decision Tree Classifier Random Forest Classifier KNN Support Vector Classifier Gaussian Naive Bayes Compairing Training Accuracy of Different Models Compairing Testing Accuracy of Different Models Comparing Confusion Matrix of different Classifiers Comparing Training times of different Classifiers Bagging Classifier Adaboost Classifier Gradient Boosting Classifier USING SMOTE Logistic Regression Decision Tree Classifier Random Forest Classifier KNN Support Vector Classifier Gaussian Naive Bayes Classifier Bagging Classifier Adaboost Classifier Conclusion In all the Cases Logistic Regression performed well and got least difference between Training and Testing Score. Plot Pie Chart of liver_firm Column Draw Count plot to visualize count of people sufer from liver_firm in relation with Age. VARICES no yes 15. Albumin levels can go up and down slightly. Hepatitis may occur with limited or no symptoms but often leads to jaundice anorexia poor appetite and malaise. LIVER FIRM The edge of the liver is normally thin and firm. SPLEEN PALPABLE The spleen is the largest organ in the lymphatic system. SPLEEN PALPABLE no yes 12. ALK PHOSPHATE Alkaline phosphatase often shortened to alk phos is an enzyme made in liver cells and bile ducts. It is an important organ for keeping bodily fluids balanced but it is possible to live without it. VARICES The liver becomes scarred and the pressure from obstructed blood flow causes veins to expand. When liver cells are damaged AST leaks out into the bloodstream and the level of AST in the blood becomes elevated. Catagorical Columns Numerical Columnswe check skewness by skew of pandas. Here we can see the Ratio of alive and died. PROTIME The prothrombin time PT is one way of measuring how long it takes blood to form a clot and it is measured in seconds such as 13. Importing the Libraries Importing the dataset EDA Drop Column Unnamed 0 Display DatasetNow we can see the column names. PROTIME 10 20 30 40 50 60 70 80 90 20. Acute hepatitis occurs when it lasts for less than six months and chronic if it persists for longer duration. Fill Null ValuesIn this data set there are two type of variables i. Check for Null Value Count. Plot Pie Chart of Sex ColumnHere we can see the ratio of male and female Plot Pie Chart of Steroid Column Draw count plot to visualize consumption of steriod in relation with Age Plot Pie Chart of antivirals Column Draw count plot to visualize consumption of antivirals in relation with Age Plot Pie Chart of fatigue Column Draw Count plot to visualize count of people sufer from fatigue in relation with Age. Plot Pie Chart of liver_big Column Draw Count plot to visualize count of people sufer from liver_big in relation with Age. Hope you like this notebook consider Upvoting Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot Data to plot explode 1st slice Plot. MORE ABOUT ATTRIBUTES FATIGUE Fatigue is a term used to describe an overall feeling of tiredness or lack of energy. SGOT 13 100 200 300 400 500 18. Class DIE LIVE 2. ALBUMIN A low albumin level in patients with hepatitis C can be a sign of cirrhosis advanced liver disease. Draw a Scatter Plot to visualize bilirubin test values with Age and Hue Class Draw a Scatter Plot to visualize alk_phosphate test values with Age and Hue Class Draw a Scatter Plot to visualize sgot test values with Age and Hue Class Draw a Scatter Plot to visualize albumin test values with Age and Hue Class Draw a Scatter Plot to visualize protime test values with Age and Hue Class Plot Pie Chart of histology Column Draw a countplot to show count of people having positive history with Age. DATASET Abstract Data Set Characteristics MultivariateNumber of Instances 155Area LifeAttribute Characteristics Categorical Integer RealNumber of Attributes 19Date Donated 1988 11 01Associated Tasks ClassificationMissing Values YesNumber of Web Hits 237264 Attribute information 1 2 1. ALK PHOSPHATE 33 80 120 160 200 250 17. now we filled all the null values. A group of viruses known as the hepatitis viruses most commonly cause the disease but hepatitis can also be caused by toxic substances notably alcohol certain medications some industrial organic solvents and plants other infections and autoimmune diseases. It can be caused due to viral infection or when liver is exposed to harmful substances such as alcohol. High levels of bilirubin can cause jaundice yellowing of the skin and eyes darker urine and lighter colored bowel movements. Check Information Now by comparing the info and describe of data only the integer data type are visible to us. Change DataType Check Info Replace 1 2 values with 0 1 Check Null ValuesHere we can see many null values. Plot Pie Chart of spleen_palable Column Draw Count plot to visualize count of people sufer from spleen_palable in relation with Age. ASCITES Ascites is extra fluid in the space between the tissues lining the abdomen and the organs in the abdominal cavity such as the liver spleen stomach. ANOREXIA no yes 9. Very low albumin levels can cause symptoms of edema or fluid accumulation in the abdomen called ascites or in the leg called edema. The alk phos level is a common test that is usually included when liver tests are performed as a group. MALAISE no yes 8. SPIDERS Spider nevus also known as spider angioma or vascular spider is a common benign vascular anomaly that may appear as solitary or multiple lesions. lets check info of dataset. SEX male female 4. AGE 10 20 30 40 50 60 70 80 3. Check DescribeHere we can see various parameters such as Mean Standard Deviation Minimum value Maximum value Median and quartiles of the dataset. Visualization Plot Pie Chart of Class Column. BILIRUBIN Levels of bilirubin in the blood go up and down in patients with hepatitis C. HISTOLOGY no yes About the hepatitis database and BILIRUBIN problem I would like to say the following BILIRUBIN is continuous attribute the number of it s values in the ASDOHEPA. Plot Pie Chart of spiders Column Draw Count plot to visualize count of people sufer from spiders in relation with Age. FATIGUE no yes 7. MALAISE A general sense of being unwell often accompanied by fatigue diffuse pain or lack of interest in activities. ANOREXIA An eating disorder causing people to obsess about weight and what they eat. STEROID no yes 5. LIVER BIG An enlarged liver is one that s bigger than normal. It is also known as serum glutamic oxaloacetic transaminase or SGOT. Plot Pie Chart of anorexia Column Draw Count plot to visualize count of people sufer from anorexia in relation with Age. Hepatitis is of 2 types acute and chronic. SPIDERS no yes 13. LIVER BIG no yes 10. A normal PT indicates that a normal amount of blood clotting protein is available. Hepatitis DatasetWhat is Hepatitis Hepatitis is a term used to describe inflammation swelling of the liver. SGOT AST or aspartate aminotransferase is one of the two liver enzymes. Here skewness is near to symmetri so we can check both mean and median. Check Describe As we can we unable to describe all the column of our data set. Plot Pie Chart of ascites Column Draw Count plot to visualize count of people sufer from ascites in relation with Age. LIVER FIRM no yes 11. Plot Pie Chart of varices Column Draw Count plot to visualize count of people sufer from varices in relation with Age. Now there is no null values present in our data set. Plot Pie Chart of malaise Column Draw Count plot to visualize count of people sufer from malaise in relation with Age. ", "id": "kalpakchepurwar/eda-with-models-featureengineering-bagging", "size": "8842", "language": "python", "html_url": "https://www.kaggle.com/code/kalpakchepurwar/eda-with-models-featureengineering-bagging", "git_url": "https://www.kaggle.com/code/kalpakchepurwar/eda-with-models-featureengineering-bagging", "script": "sklearn.metrics DataFrame Series sklearn.naive_bayes sklearn.tree AdaBoostClassifier BaggingClassifier KNeighborsClassifier DecisionTreeClassifier SMOTE seaborn numpy GradientBoostingClassifier time sklearn.ensemble sklearn.model_selection confusion_matrix RandomForestClassifier imblearn.over_sampling matplotlib.pyplot pandas classification_report StandardScaler LogisticRegression accuracy_score sklearn.neighbors SVC sklearn.linear_model sklearn.preprocessing RandomizedSearchCV sklearn.svm GaussianNB train_test_split ", "entities": "(('we', 'there skewness'), 'use') (('Check DescribeHere we', 'value Maximum dataset'), 'see') (('Catagorical Columns Numerical Columnswe', 'pandas'), 'check') (('Fill Null data', 'two variables'), 'ValuesIn') (('when liver', 'such alcohol'), 'cause') (('Plot Pie Chart', 'Age'), 'plot') (('albumin low level', 'liver cirrhosis advanced disease'), 'ALBUMIN') (('we', 'many null values'), 'Replace') (('ASCITES Ascites', 'liver spleen such stomach'), 'be') (('ATTRIBUTES FATIGUE MORE Fatigue', 'energy'), 'be') (('It', 'serum also glutamic oxaloacetic transaminase'), 'know') (('we', 'mean'), 'be') (('Column Draw', 'Age'), 'see') (('Hepatitis DatasetWhat', 'liver'), 'be') (('Display 0 we', 'column names'), 'import') (('most commonly disease', 'other infections'), 'cause') (('Plot Pie Chart', 'Age'), 'sufer') (('ALK PHOSPHATE Alkaline phosphatase', 'liver cells'), 'shorten') (('Hepatitis', 'jaundice anorexia often poor appetite'), 'occur') (('it', 'it'), 'be') (('they', 'what'), 'ANOREXIA') (('pressure', 'blood flow obstructed causes'), 'VARICES') (('liver usually when tests', 'group'), 'be') (('Upvoting Data', 'slice explode 1st Plot'), 'hope') (('Column Draw Count plot', 'Age'), 'sufer') (('it', 'such 13'), 'PROTIME') (('normal amount', 'blood clotting protein'), 'indicate') (('BILIRUBIN Levels', 'hepatitis C.'), 'go') (('level', 'blood'), 'leak') (('Here we', 'alive'), 'see') (('vascular common benign vascular that', 'solitary lesions'), 'be') (('it', 'longer duration'), 'occur') (('Hepatitis', '2 types'), 'be') (('High levels', 'skin'), 'cause') (('we', 'data set'), 'check') (('count', 'Age'), 'draw') (('negative values', 'such possible values'), 'be') (('integer data only type', 'us'), 'check') (('following BILIRUBIN', 'ASDOHEPA'), 'HISTOLOGY') (('spleen', 'largest lymphatic system'), 'PALPABLE') (('SGOT AST', 'liver aspartate two enzymes'), 'be') (('albumin Very low levels', 'leg'), 'cause') (('edge', 'liver'), 'firm') (('Comparing', 'Training'), 'draw') ", "extra": "['biopsy of the greater curvature', 'disease', 'patient', 'test', 'abdomen', 'bag', 'edema']"}