{"name": "epv peq aula 3 classifica o ", "full_name": " h2 Escola Piloto Virtual PEQ COPPE UFRJ h2 Data Science e Machine Learning na Prática Introdução e Aplicações na Indústria de Processos h1 Videoaulas h1 O conjunto de dados MNIST h2 Importando dados h2 Separando treino validação h1 Rede MLP no scikit learn h1 O que são redes neurais h2 Percéptron h2 Treinamento das redes h3 Detalhes sobre a minimização h4 Vários algoritmos h4 Minilotes e épocas h4 Regularização h2 TensorFlow Playground h1 Rede MLP no Keras h1 Aprendizado Profundo h3 Problema 1 treinamentos excessivamente lentos h3 Problema 2 desaparecimento explosão de gradientes h4 Novas funções de ativação h4 Novas estratégias de inicialização dos pesos h4 Normalização por lote h3 Problema 3 escassez de dados para treinamento h3 Problema 4 risco de sobreajuste por conta do excesso de parâmetros h1 Redes convolucionais h2 Funcionamento da rede convolucional h1 Rede convolucional no Keras h1 Detecção de falhas em um processo de fundição h2 O processo h2 Importando os dados h2 Gerando dados com Keras h2 Modelagem h2 Análise dos resultados h1 Conclusão ", "stargazers_count": 0, "forks_count": 0, "description": "Se você executar este notebook provavelmente vai obter resultados diferentes dos apresentados aqui principalmente quanto ao número de classificações incorretas no conjunto de teste que varia de 0 a 4 em geral. org wiki Universal_approximation_theorem cujo enunciado afirma que redes com uma camada oculta conseguem aproximar qualquer função contínua redes com mais de uma camada oculta conseguem aproximar qualquer função. Poderíamos tentar corrigir a prevalência de imagens de peças defeituosas em relação às normais mas como a diferença não é tão grande isso não será feito. Uma métrica também muito usada é a F_1 https en. org wiki Transfer_learning em que modelos treinados em uma situação com muitos dados podem ser aplicados a cenários similares com menor disponibilidade de dados. io api preprocessing image imagedatagenerator class disponível no módulo keras. O objetivo é atualizar mais os parâmetros que ainda não foram muito atualizados. html Parece um bom desempenho Com um pequeno grau de sobreajuste mas nada grave. pdf propuseram uma nova inicialização conhecida como inicialização de Glorot ou de Xavier usada como default no keras https keras. ModelagemA estratégia aqui será criar múltiplas redes e juntar os vários resultados em uma única predição. O aprendizado da rede é efetuado por meio do ajuste desses pesos. O que são redes neurais Redes neurais artificiais https en. A estratégia de revisão é particularmente importante nesse processo porque mesmo baixas taxas de erro de menos de 1 podem resultar em consideráveis perdas econômicas já que o custo de um único falso positivo ou negativo pode ser alto como discutido aqui https www. Na estratégia a seguir conhecida como zero padding ou same padding adicionam se zeros às bordas do mapa de entrada de modo que o mapa de saída possua o mesmo formato da entrada. org wiki Multilayer_perceptron e convolucionais https en. A segunda parte consiste de uma camada densa totalmente conectada como as da rede MLP e é responsável por efetuar a classificação. A solução para esse problema veio de um resultado muito importante chamado de Teorema da Aproximação Universal https en. Cada elemento de um mapa de características corresponde a um neurônio. org wiki Quasi Newton_method ou meta heurísticas https en. Os múltiplos mapas de características podem ser alimentados a uma nova camada convolucional resultando em novos mapas como ilustrado Cada neurônio de um mapa de características da saída conecta se a apenas uma porção dos neurônios dos mapas da entrada. É uma estratégia para impedir a morte de neurônios ou seja quando a saída do neurônio é nula para todas as amostras de treinamento situação comum em redes com ativação ReLU. Cada neurônio individual apresenta um funcionamento bem simples. Este trabalho reviveu o interesse da comunidade científica e tecnológica nas redes neurais. Tipicamente utilizam se vários pares de camadas convolução pooling o que define a profundidade da rede. Nas redes neurais os neurônios são dispostos em camadas organizadas de acordo com a arquitetura da rede. O conjunto de dados MNISTO conjunto de dados MNIST https en. Flatten https keras. pdf foi construída para implementar o modelo img src https upload. 09820 por exemplo em que você pode conferir dicas e boas práticas para essa tarefa. Desde então várias boas práticas vêm sendo propostas para garantir que haja uma efetiva propagação dos sinais pela rede tanto as predições no sentido direto quanto os gradientes no sentido reverso dentre as quais citamos novas funções de ativação novas estratégias de inicialização dos pesos normalização por lote. org wiki Gradient_descent para a minimização do erro. De modo a fazer com que o formato seja o mesmo pode se utilizar estratégias de preenchimento padding. com activation functions explained. 2012 https arxiv. 03167 e desde então aparece com frequência nas arquiteturas das redes neurais modernas. com ravirajsinh45 real life industrial dataset of casting product. com ravirajsinh45 real life industrial dataset of casting product proveniente da companhia indiana Pilot Technocast http www. Em redes recorrentes é comum o problema inverso a explosão dos gradientes. Quando a se torna um parâmetro a ser aprendido pela rede como sugerido por HE et al. Para discussões interessantes a respeito consulte SANTUNKAR et al. Podemos encarar a função logística como uma espécie de suavização da função de Heaviside Detalhes sobre a minimização Vários algoritmosExistem várias técnicas pertencentes à família de algoritmos de gradiente descendente. Como temos certeza sobre a classe verdadeira nas amostras de treinamento na verdade os vetores verdadeiros de probabilidades mathbf y tem a forma 0 0. org wiki Enrico_Fermi em 1953 ao criticar a complexidade de um modelo em específico cunhou uma frase clássica sobre o assunto With four parameters I can fit an elephant and with five I can make him wiggle his trunk. Obs há algumas referências SMITH 2018 https arxiv. Em outras palavras é preciso escolher o valor de corte que separa cada uma das duas classes. Problema 2 desaparecimento explosão de gradientesMesmo com o grande ganho de eficiência introduzido pelas GPU s sérias dificuldades numéricas relativas ao treinamento de redes profundas persistiram. org wiki Data_augmentation que consiste em alimentar aos modelos não apenas as imagens originais e sim um conjunto potencialmente muito maior composto por imagens com pequenas variações das originais. 02 0 0 0 0 o que significa dizer que a rede prevê que 98 de certeza que o valor é 3. org wiki Precision_and_recall. Na próxima célula aplicamos a função para calcular as probabilidades relativas ao conjunto de teste Para calcular as métricas de classificação é necessário definir qual faixa de probabilidades está associada a cada classe. O elemento da diagonal principal C_ ii corresponde à quantidade de predições corretas da classe i. O objetivo é que você ganhe familiaridade com a biblioteca e autonomia para navegar na API e implementar os recursos em seus modelos. Usando o matplotlib para dar uma olhada nas imagens Como os dados são provenientes da competição Digit Recognizer https www. io api layers convolution_layers convolution2d implementa uma camada convolucional. Obs pode se ir além do gradiente descendente e utilizar outras técnicas como as de segunda ordem que utilizam informações de derivada segunda exemplos são os métodos de Newton https en. org wiki Entropia_cruzada vem da teoria da informação https pt. Serão dois estudos de caso ambos constituindo aplicações do tipo visão computacional https pt. org wiki MNIST_database é composto de 70000 imagens de dígitos escritos por funcionários do United States Census Bureau https en. org wiki Metaheuristic. A normalização por lote possibilita que se utilize maiores taxas de aprendizado diminui a sensibilidade da rede em relação à inicialização e atua como um regularizador aumentando a capacidade de generalização do modelo. A figura a seguir ilustra a aplicação do algoritmo a uma superfície partindo de três pontos distintos Um dos pontos iniciais levou a um mínimo local enquanto os outros dois chegaram ao que parece ser o mínimo global no domínio apresentado. Mas particularmente verifiquei dois pontos consistentes ao longo de todas as execuções que efetuei a precisão é mais alta que a revocação na maior parte da faixa de probabilidades de corte as probabilidades das amostras classificadas incorretamente encontram se perto de 0 5 em geral abaixo devido à revocação ser menor que precisão. O processoO conjunto de dados https www. Boa jornada ConclusãoNesta aula aprendemos o que há de mais moderno e vibrante no campo de aprendizado de máquina os modelos de redes neurais https en. No segundo gráfico temos a função ReLU a mais popular hoje em dia por dois motivos não satura no sentido positivo e é rápida de calcular. org wiki Learning_rate e constitui talvez o hiperparâmetro mais importante do modelo. Agora vamos dar uma olhada em um estudo de caso de natureza industrial. Ao longo da estrutura da rede conforme se avança nas camadas mais profundas os padrões locais simples vão sendo agregados e tornando se cada vez mais complexos. O sucesso da proposta veio da introdução dos parâmetros gamma e beta que possibilitam que as saídas y_i tenham qualquer média e variância na verdade esses valores são determinados de maneira ótima pela rede. Como veremos a seguir existem várias possibilidades para a escolha da função de ativação. No mundo acadêmico construiu se um certo consenso de que modelos com muitos parâmetros são inerentemente ruins por conta da complexidade matemática e da excessiva capacidade de adaptação resultantes. org wiki Ensemble_learning. Na segunda o passe reverso calcula se o quanto cada camada contribui para o erro da camada anterior. 01852 a função recebe o nome de PReLU Parametric ReLU. io api layers initializers glorotuniform class e ideal para funções sigmóides https en. Para criar uma rede neural no keras podemos inicializar o modelo utilizando a classe keras. São 10 neurônios na camada de saída correspondentes às 10 classes aos 10 possíveis dígitos. org wiki Artificial_neural_network em particular de aprendizado profundo https en. press v9 glorot10a glorot10a. O termo momento vem da analogia com a Física. org wiki Heaviside_step_function. Quanto maior a variância dos gradientes passados de um dado parâmetro mais o método diminui a taxa de aprendizado correspondente. São 200 neurônios na camada oculta. Após o treinamento na etapa de predição novos dados de entrada são alimentados e caso o aprendizado tenha sido efetivo saídas com baixo erro ou seja próximas das corretas serão geradas pela rede. Há margem para melhorias nos resultados e nas eficiências computacionais. De maneira geral o procedimento de criar um modelo composto por múltiplos submodelos é conhecido como ensembling https en. Com a propagação de um sinal praticamente constante ao longo da rede o gradiente na etapa de retropropagação o sinal reverso resulta praticamente nulo. pdf propuseram o revolucionário algoritmo da retropropagação do erro https en. A precisão é uma medida de exatidão das detecções e tem a ver com qualidade a revocação é uma medida de completude das detecções e tem a ver com quantidade. Um exercício interessante é predizer você mesma os dígitos de cada uma dessas imagens e calcular sua acurácia humana. Esse fato pode ser usado para montar uma estratégia de revisão dos resultados do modelo. Fazendo analogia com o modelo linear o viés é como se fosse o intercepto da reta. A maneira mais intuitiva de efetuar esse procedimento é Classe 0 p leq0 5 Classe 1 p 0 5. Para uma leitura sobre aprendizado profundo complementar a este notebook recomendo o artigo de LECUN et al. Na célula abaixo selecionamos as amostras que resultam em probabilidades distantes de 0 ou 1 o quão distantes podem ser parâmetros ajustáveis Percebe se que apenas uma pequena fração das amostras encontra se na faixa considerada suspeita no caso acima 0 2 p 0 8. io api e aprenda como utilizar os recursos explicados aqui funções de ativação inicialização de pesos normalização por lote e dropout. org wiki Logistic_function. com en us research blog turing nlg a 17 billion parameter language model by microsoft de parâmetros. O método Adam KINGMA e BA 2014 https arxiv. Para tal utilizaremos a função visualizeImageBatch Visualizando um minilote Agora vamos criar o gerador das imagens de teste definido de maneira um pouco diferente Especificamos o tamanho do lote como o tamanho total do conjunto de teste já que a predição de teste será efetuada com todos os dados de uma vez após o término do treinamento. Calculando as métricas Duas outras métricas adequadas para esse problema são a precisão P e a revocação R https en. Predições cujas probabilidades estejam muito distantes de 0 ou 1 ou seja em que o modelo não está muito confiante quanto ao pertencimento a alguma das classes podem ser encaminhadas para verificação humana. escassez de dados para treinamento 4. Outra vantagem quando a 1 a função é suave https pt. org wiki Teoria_da_informa C3 A7 C3 A3o e mede a distância entre duas distribuições de probabilidade. pdf em um trabalho muito influente identificaram os principais culpados para o fenômeno do desaparecimento dos gradientes a até então popular função de ativação logística a até então popular estratégia de inicialização dos pesos com uma distribuição gaussiana de média 0 e desvio padrão 1. Funcionamento da rede convolucional Para alimentar uma imagem à rede é necessário representá la como um tensor. Como fizemos no caso MNIST é útil verificar as proporções das classes nos diferentes conjuntos As proporções parecem consistentes entre os conjuntos. io api models sequential mas ao invés de usar a função add dessa vez forneceremos as camadas como uma lista à inicialização do modelo A classe keras. Quanto mais fundo se avança nas camadas do modelo mais os padrões vão se tornando complexos e abstratos. A regularização L_1 é análoga à L_2 no entanto usando valores absolutos no lugar dos quadrados. Por isso as redes convolucionais são tão utilizadas para processar imagens. Normalização por loteA normalização por lote https en. Esses ajustes são o mecanismo por meio do qual ocorre o processo de aprendizado em seres vivos. No terceiro gráfico temos a função Leaky ReLU que introduz uma inclinação na região negativa da ReLU. No caso abaixo o callback early_stop definido a partir da classe EarlyStopping https keras. gradientes que desaparecem ou explodem ao serem retropropagados pela rede 3. A explicação mais factível parece ser uma diminuição das influências dos pesos uns sobre os outros ao longo das várias camadas o que suaviza a função objetivo e facilita a tarefa dos métodos de minimização. edu hinton absps pdp8. Quanto mais perto de 0 está a probabilidade mais a rede acredita que a imagem pertence à classe 0 quanto mais perto de 1 mais ela acredita que a classe é a 1. Podemos proceder para a etapa de modelagem. O atributo history do objeto H possibilita que analisemos a evolução das métricas e valores da função perda para os dados de treino e validação Os resultados já são bons mesmo na primeira época e vão melhorando lenta e continuamente conforme o treinamento evolui. A estratégia de momentos https www. Seu peso é denotado por w_0 b_k e chamado de viés bias do neurônio k. com a visual explanation of gradient descent methods momentum adagrad rmsprop adam f898b102325c páginas. Para que o algoritmo da retropropagação do erro funcionasse os autores precisaram propor uma nova função de ativação varphi u frac 1 1 exp u a função de ativação logística https en. Para duas distribuições y e p a entropia cruzada é escrita como sum_ j y_ j log p_ j Nas aplicações de redes neurais para classificação as distribuições y e p são substituídas pelos vetores mathbf y o vetor verdadeiro de probabilidades de cada classe e mathbf p o vetor de probabilidades de cada classe predito pela rede. Para melhorar o resultado utilizaremos redes com múltiplas camadas que constituem o principal objeto de estudo do aprendizado profundo deep learning https pt. org wiki Softmax_function a última etapa da rede é a responsável por transformar a saída em um vetor de probabilidades um vetor de soma 1 composto por números entre 0 e 1 sigma mathbf u _i frac e u_i sum_ j 1 K e u_j Dessa maneira a entrada da rede é uma imagem de 784 pixels e a saída é um vetor de 10 elementos cada um deles descrevendo a probabilidade da imagem corresponder a um dos dígitos entre 0 e 9. Uma camada densa é aquela em que os neurônios estão conectados a todos os neurônios da camada anterior. Separando treino validaçãoPara separar treino validação usaremos a função train_test_split É útil verificar se as proporções de dígitos no treino e na validação são parecidas As proporções entre classes parecem bem balanceadas em ambos os conjuntos. Essa geração acontece em tempo real durante o treinamento a cada iteração um minilote de tensores é fornecido ao modelo para que um passo da minimização seja efetuado. org wiki Activation_function e é responsável por introduzir não linearidade nas redes. Problema 1 treinamentos excessivamente lentos RAINA et al. io api callbacks para parada antecipada. io api layers regularization_layers dropout implementa uma camada de dropout que no caso desliga 20 dos neurônios antes de fornecê los à camada de saída. Os argumentos do método flow_from_directory especificam que serão gerados minilotes contendo 32 imagens de tamanho 300x300 na escala de cinza ou seja com apenas 1 canal de cores. No treinamento das redes os pesos w das várias conexões são ajustados de modo que para uma dada entrada uma saída especificada seja gerada lembre se de que no aprendizado supervisionado tanto entrada quanto saída estão disponíveis na etapa de treinamento. A função objetivo a ser minimizada é chamada de perda loss https en. Para mais detalhes sobre algoritmos de gradiente descendente em redes neurais confira esta https ruder. O axônio https pt. Moral da história mesmo que o modelo tenha muitos parâmetros nem todos são utilizados efetivamente no aprendizado já que a regularização fará com que uma parte deles tenda a zero. Em seguida a imagem passa por uma camada convolucional. O número de filtros de dada camada é um hiperparâmetro deve ser determinado a priori. Além do mais como há agregação da informação de janelas maiores em janelas menores os campos receptivos das camadas mais profundas da rede mesmo sendo pequenos possuem informações relativas à toda a imagem original. end cases varphi u é chamada de função degrau de Heaviside https en. com c digit recognizer do Kaggle Inspecionando os dados Cada linha do DataFrame corresponde a uma imagem e cada coluna a um pixel da imagem com exceção da primeira coluna label que identifica o dígito. As redes densamente conectadas só podem aprender padrões globais ou seja padrões que envolvem todos os pontos presentes em dada amostra ou observação. Ela está disponível em sklearn. Problema 3 escassez de dados para treinamentoEste problema vem sendo aliviado principalmente por conta do cenário big data com a cada vez maior quantidade de dados sendo gerada a partir das mais diversas fontes. A entrada 0 não é uma conexão com um neurônio anterior já que fornece sempre o mesmo valor x_0 1. É possível verificar a qualquer momento a estrutura do modelo com a função summary https keras. confusion_matrix https scikit learn. O tamanho do passo que o algoritmo de minimização efetua na descida a cada iteração é chamado de taxa de aprendizado https en. org stable modules generated sklearn. Agora vamos implementar uma rede convolucional no Keras. MaxPooling2D https keras. Levar em conta essa fração do passo anterior também no cálculo do gradiente resulta na estratégia de momentos de Nesterov http mpawankumar. Esta é a estrutura de um neurônio biológico https pt. org wiki Submersible_pump cujo funcionamento é ilustrado nos seguintes vídeos Importando os dadosOs dados estão organizados em duas pastas de acordo com a estrutura casting_data test def_front ok_front train def_front ok_frontEssa estrutura é conveniente porque no momento da leitura pelo keras há o reconhecimento das classes def_front e ok_front de acordo com os nomes das pastas. Nesse processo o material metálico fundido é alimentado a um molde e durante o resfriamento solidifica se na forma desejada como ilustrado a seguir Os defeitos https en. Fica evidente o alto grau de sobreajuste o que indica margem para melhoria do desempenho. Talvez outra estratégia ou arquitetura leve a resultados mais estáveis. possuem milhares ou milhões ou mesmo bilhões https www. org wiki Convolutional_neural_network são redes esparsamente conectadas em que cada neurônio não se conecta a todos os neurônios da camada anterior. org wiki Recurrent_neural_network e b de alimentação direta https en. A entrada reflete a dimensionalidade das imagens 784 pixels. Assim como as camadas convolucionais os neurônios das camadas de pooling também possuem campos receptivos mas não há pesos e a operação efetuada não é a convolução e sim alguma operação de agregação como a média ou a escolha do valor máximo sendo essa última a mais usada img src https www. io api models model summary method Perceba a grande quantidade de parâmetros mesmo em uma rede com apenas uma camada oculta Antes de treinar o modelo é preciso compilá lo definindo a função perda o otimizador e as métricas de avaliação A função entropia cruzada https pt. O termo dentro do parênteses é a simples normalização do sinal utilizando as estatísticas do minilote. Teste várias estruturas para os ensembles número de modelos arquitetura de cada modelo individual maneira de agregar os resultados etc. io que oferece uma interface intuitiva para implementação de modelos de redes neurais com a possibilidade de utilização de diversos motores de cálculo o motor utilizado aqui será o TensorFlow https www. com playlist list PLvr45Arc0UpzsRhzq3q4_KmZcm0utwvvB. 0 representação one hot encoding. Durante seus testes é instrutivo verificar também quais modificações não ajudam ou mesmo pioram o desempenho. GLOROT e BENGIO 2010 http proceedings. com c digit recognizer Fashion MNIST https www. 2006 https www. io api layers normalization_layers batch_normalization aceita um vetor de entradas mathbf x e retorna uma saída mathbf y de mesmo comprimento cujos elementos resultam da seguinte operação y_i left frac x_i mu_B sqrt sigma_B 2 epsilon right gamma beta em que mu_B e sigma_B 2 são a média e a variância do minilote utilizado no momento gamma e beta são parâmetros a serem aprendidos pela rede epsilon é um número fixo pequeno que ajuda a evitar problemas numéricos. Nessa camada aplica se a operação de convolução Na operação de convolução um filtro também chamado de kernel em geral de dimensão 3x3 a mais comum 5x5 ou 7x7 percorre os pixels de uma imagem calculando o produto escalar a cada passo e armazenando os resultados em uma matriz chamada de mapa de características. PercéptronO percéptron https en. confusion_matrix Na matriz de confusão o elemento C_ ij corresponde à quantidade de observações da classe i que foi confundida com a classe j. org wiki MNIST_database talvez o exemplo mais famoso da área de aprendizado de máquina um conjunto de dados industrial https www. com science article abs pii S0893608098001166 via 3Dihub consiste em adicionar a cada passo da iteração uma fração do passo anterior o que pode amortecer oscilações e acelerar a descida em direções promissoras. Ou seja em um modelo de aprendizado profundo os padrões reconhecidos a partir dos dados são organizados em múltiplas camadas. A porção da camada anterior que se conecta a um neurônio é chamada de seu campo receptivo. Na próxima célula é efetuado o treino da rede Observe a necessidade de reformatação dos dados de entrada para o formato largura x altura x canais de cores. A informação é processada nas redes por meio de sinais elétricos que cada neurônio recebe e transmite através das sinapses nervosas. org wiki Convolutional_neural_network e entendemos porque este último é adequado para aplicações do tipo visão computacional https pt. Não há garantia de que o algoritmo convirja para o mínimo global. Denotando a classe negativa como sendo das amostras normais sem defeitos e a classe positiva como sendo das amostras com defeitos definimos P frac VP VP FP R frac VP VP FN em que VP é o número de verdadeiros positivos FP é o número de falsos positivos e FN é o número de falsos negativos. As características complexas dos sistemas nervosos biológicos emergem da auto organização dos neurônios em vastas e complexas redes contendo bilhões de células cada uma podendo efetuar milhares de conexões. org wiki Casting_defect podem ser de diferentes naturezas http www. Se não houvesse uma função de ativação em cada neurônio as redes só seriam capazes de aprender padrões lineares já que o termo v_k sum_ i 0 m w_ ki x_i é uma combinação linear dos sinais de entrada cujos coeficientes são os pesos. Sua maior vantagem é tornar a média das ativações mais próxima de 0 o que acelera o aprendizado por proporcionar maior flexibilidade à minimização por gradiente descendente detalhes aqui https stats. Nesta seção retomaremos o tema abordando o no contexto da visão computacional como um problema de classificação binária utilizando modelos supervisionados de redes convolucionais. É uma estrutura de aprendizado análoga a que se observa no córtex visual https en. com questions 237169. pdf rebarbas porosidades trincas defeitos na superfície dimensões ou forma incorretas etc. Treine a rede nos conjuntos MNIST e Fashion MNIST mais vezes variando alguns hiperparâmetros e observando os efeitos nos resultados. Algumas sugestões Varie as arquiteturas das redes e os demais hiperparâmetros números de filtros taxas de dropout etc. É o contrário das redes densamente conectadas como a MLP que estudamos até agora. Muito provavelmente nesse conjunto eles não refletem o ambiente de produção em que espera se a proporção de peças defeituosas seja bem menor que as normais. 01852 propuseram uma modificação na inicialização de Glorot para que funcionasse melhor com funções de ativação baseadas em retificadores lineares ReLU etc. org wikipedia commons b b9 Convolution_arithmetic_ _No_padding_strides. Em particular aqui utilizaremos a biblioteca keras https keras. org wiki Vanishing_gradient_problem impedindo a convergência do treinamento. org wiki Backpropagation. Em essência A precisão diz respeito à proporção de peças detectadas como defeituosas que está correta. Treinamento das redesPor muito tempo lutou se para encontrar um algoritmo de treinamento eficaz para redes com várias camadas. Isso não é possível quando a camada apresenta um número diferente de entradas em relação ao de neurônios mas pode se chegar próximo o suficiente dessa situação ideal por meio de estratégias inteligentes de inicialização de pesos. Detecção de falhas em um processo de fundiçãoNa aula passada estudamos o problema de detecção de falhas no contexto do controle estatístico multivariado de processos utilizando o modelo não supervisionado PCA. Utilizamos três conjuntos de dados MNIST https www. O resultado da segunda etapa é uma medida eficiente do gradiente do erro ao longo de toda a rede o que torna possível a aplicação do algoritmo do gradiente descendente https en. Lembre se de que quanto maior for a independência entre os modelos maior será a redução do erro. org wiki Testes_de_hip C3 B3teses a precisão está associada a erros do tipo I https pt. É um cenário favorável para a implementação de uma estratégia de revisão das predições resultando em um sistema de detecção que pode atingir acurácia de 100 com baixo custo adicional de HH humano hora https en. A estratégia proposta foi muito popular mas caiu em desuso na década de 2010 quando novas soluções para os problemas foram surgindo. Callbacks são objetos que efetuam ações durante o treinamento. Novas funções de ativaçãoAs funções de ativação mais usadas atualmente são da classe de retificadores lineares https en. O neurônio matemático https en. Geralmente algumas épocas são necessárias para que se atinja um erro baixo. Abaixo definimos um callback https keras. io api models sequential e ir adicionando as camadas sequencialmente com o método add Adicionamos na rede acima duas camadas além da camada de entrada que não precisa ser explicitamente adicionada ambas definidas com a classe keras. Rede convolucional no KerasComo no exemplo anterior utilizaremos a classe keras. html enquanto a regularização L_2 dá origem à regressão ridge https scikit learn. Em particular durante a etapa de retropropagação do erro era inevitável que os gradientes zerassem https en. No quarto gráfico temos a função ELU proposta por CLEVERT et al. com c digit recognizer apenas 42000 imagens estão disponíveis no conjunto as outras 28000 são reservadas para teste. Pronto Já implementamos o modelo e entendemos os detalhes matemáticos. Quando a função perda possui um termo de regularização o algoritmo tentará minimizar esse termo se possível levando o a zero. Após isso utilizamos o método flow_from_directory para criar efetivamente os objetos que gerarão os minilotes de treino e de validação. com articles nature14539. Neste notebook só serão estudadas redes de alimentação direta. Uma camada de normalização por lote https keras. io api preprocessing image para gerar os tensores de entrada do modelo a partir dos arquivos disponíveis nas pastas technocast_train_path e technocast_test_path. A revocação diz respeito à proporção de peças defeituosas que são corretamente detectadas. Na figura a seguir o mapa é calculado com um stride de 2 img src https upload. Mão na massa 3 Explore a API do Keras https keras. Se deseja se um bom compromisso entre os dois cenários descritos pode se selecionar um corte que resulte em máximo F_1. A seguir abordaremos as mais influentes e utilizadas hoje em dia. jpeg width 250 height 250 Após a empolgação inicial logo percebeu se que os percéptrons tinham muitas limitações uma delas de natureza teórica não era possível fazer com que o modelo representasse algumas funções simples. Antes de entrarmos nos detalhes do aprendizado profundo é interessante implementarmos no keras um modelo MLP semelhante ao que usamos no scikit learn. org wiki Rectifier_ neural_networks hoje mais prestigiada do que a velha logística é usada também no default do MLP do scikit learn e será explicada mais adiante. 0580 que consiste na desativação de uma certa parcela aleatória dos neurônios a cada passo do treinamento. É conveniente ter um número maior de filtros nas camadas mais profundas porque em geral há muito mais possibilidades de padrões complexos do que padrões simples lembre se de que a identificação de padrões complexos se dá por meio da combinação dos padrões simples. Um dos motivos para tal aplicação ter sido tão bem sucedida é que já havia pressão econômica para desenvolvimento de GPU s antes do uso pela comunidade científica vinda principalmente da indústria de videogames. Visualizando a curva de aprendizado Conferindo a acurácia e as matrizes de confusão O desempenho é melhor em relação à rede MLP Que tal darmos uma olhada nas imagens que a rede classificou incorretamente Percebe se que alguns dígitos foram escritos de maneira bem inusual. A motivação para usar ensembling é a mesma da aula de florestas a redução do erro de generalização. Nota se que as maiores fontes de confusão são 9 sendo classificado como 4 oito vezes 3 sendo classificado como 8 sete vezes 8 sendo classificado como 6 cinco vezes 9 sendo classificado como 7 cinco vezes. org wiki Convolution explicada a seguir. org wiki Erro_do_tipo_II. A desvantagem é que ela é mais lenta para calcular compensada às vezes pela maior velocidade de convergência do treinamento. Use a estratégia de aumento de dados https en. Para uma discussão mais profunda recomendo esta leitura https mlfromscratch. No caso específico do aprendizado de máquina a regularização é qualquer procedimento que tem como objetivo reduzir o erro de predição sem reduzir o erro do treinamento. Nesse momento é conveniente dar uma olhada em um exemplo de minilote. Percebe se que a quase totalidade das predições está próxima de 0 ou 1 o que indica grande certeza do modelo quanto às classes da maioria das imagens. A arquitetura é típica de uma rede convolucional pares consecutivos de camadas convolucionais pooling com os tamanhos dos mapas de características diminuindo e o número de filtros aumentando conforme se avança na profundidade. 11604 ou esta https blog. edu ang papers icml09 LargeScaleUnsupervisedDeepLearningGPU. Com os conceitos apresentados acima você deve ser capaz de entender a natureza da maior parte dos hiperparâmetros. Isso é útil porque não necessariamente o resultado da última época é o melhor. org wiki Erro_do_tipo_I e do tipo II https pt. Você pode tentar Para concluir é importante fazer uma ressalva quanto à natureza dos dados de teste. Pronto Já temos os objetos responsáveis por gerar nossos dados de treino validação e teste. As camadas de pooling diminuem a quantidade de parâmetros da rede atenuando o sobreajuste e o custo computacional. Abaixo apresentamos alguns exemplos junto à função logística No primeiro gráfico da função logística fica evidente como para valores de u afastados de 0 os valores de f u saturam. A regressão linear utilizando regularização L_1 é chamada de regressão lasso https scikit learn. Mão na massa 1 Adicione ao kernel o conjunto de dados Fashion MNIST https github. io optimizing gradient descent ou esta https towardsdatascience. As curvas de treino e validação estão próximas um indicativo de que não há muito sobreajuste. ca aharley vis conv e esta https poloclub. Cada iteração desse algoritmo é dividida em duas etapas Na primeira etapa chamada de passe direto calcula se a saída da rede. Outro fator que vem contribuindo para a melhoria de desempenho dos treinamentos é o surgimento de novas metodologias de minimização por gradiente descendente como a Adam https arxiv. org wiki Dilution_ neural_networks proposta por HINTON et al. html conhecido como MLP Multilayer perceptron https en. Ou seja como treinar redes com múltiplas camadas Obs para uma visualização bem interessante do teorema da aproximação universal recomendo esta leitura http neuralnetworksanddeeplearning. Essa é uma linha de pesquisa ainda pouco explorada e potencialmente muito frutífera. Algumas excelentes páginas para visualizações interativas de redes convolucionais são esta https www. Com essa combinação a cada camada a variância da saída resulta maior que da entrada fazendo os sinais crescerem positiva ou negativamente até saturarem nas extremidades da função de ativação logística. As redes neurais justamente por conta de sua organização natural em camadas são o tipo de modelo de escolha para tais aplicações. Uma iteração do algoritmo de minimização é efetuada para cada minilote ou seja os erros são calculados e os pesos são atualizados a cada minilote processado. org wiki Frank_Rosenblatt em 1957 foi uma das primeiras redes neurais propostas. io api layers core_layers dense. Isso possibilita a criação de padrões globais e mais complexos abstratos nas camadas profundas. conv2D https keras. Se deseja se evitar ao máximo o envio de peças defeituosas ao cliente ou seja diminuir o risco de falsos negativos deve se selecionar um corte que resulte em máxima revocação. com zalando research fashionmnist e Pilot Technocast https www. Importando dadosOs dados MNIST podem ser importados facilmente do scikit learn ou do keras. VideoaulasEste notebook é explicado em detalhes ao longo das seguintes videoaulas Para a playlist do curso completo clique aqui https www. Em compensação o desempenho computacional foi bem melhor. org wiki Newton 27s_method_in_optimization e Quase Newton https en. Rede MLP no scikit learnAntes de entrarmos nos belos detalhes matemáticos dos modelos de redes neurais vamos utilizar o modelo disponível no scikit learn https scikit learn. A função a seguir retorna uma rede convolucional compilada Visualizando a estrutura da rede Como de costume os tamanhos dos mapas de características diminuem e o número de filtros aumenta conforme se avança na profundidade. org wiki Aprendizagem_profunda. O algoritmo do gradiente descendente é um método de minimização de funções https en. dando origem à inicialização de He. Uma tendência recente é a utilização de taxas de aprendizado adaptativas ou seja atualizadas conforme a minimização evolui. Não fique preso ao que foi mencionado na aula pesquise sobre e utilize outras funções de ativação inicializações etc. Visualizando a estrutura do modelo São bem mais camadas do que o modelo MLP mas a quantidade de parâmetros é menor. net publication 338672883 figure fig1 AS 864764884422656 1583187423806 The comparison between Recurrent Neural Network RNN and Feed Forward Neural Network. A função softmax https en. org wiki Regularization_ mathematics. com r MachineLearning comments 67mjuw d_alternative_interpretation_of páginas. Em geral a matriz de números que constitui cada filtro de dada camada é um parâmetro da rede ou seja é ajustada junto com os pesos de modo a resultar no aprendizado ótimo. Armazenando os caminhos Usando o matplotlib para dar uma olhada em duas peças aleatórias normal e defeituosa São esses dois tipos de imagens que nossos modelos precisarão distinguir Gerando dados com Keras Aqui utilizaremos a classe ImageDataGenerator https keras. Na Internet em particular no Kaggle e principalmente para o MNIST você pode encontrar implementações das ideias citadas acima ou de outras ideias. Uma época epoch é marcada quando todos os minilotes foram processados quando todo o conjunto de dados passou pela rede. 2019 https arxiv. Mão na massa 2 Analise a API da função sklearn. Uma das estratégias é a regularização https en. São 784 pixels já que as imagens têm tamanho 28x28. Isso foi necessário porque a função de Heaviside muito utilizada até então é composta de segmentos planos não apresentando gradientes. O porquê de ela funcionar tão bem ainda é uma questão em aberto. info teaching cdt big data nesterov83. A natureza do padrão reconhecido depende da estrutura do filtro. org wiki Batch_normalization foi proposta por IOFFE e SZEGEDY 2015 https arxiv. As diferenças entre as redes neste caso surgem das aleatoriedades da i separação entre treino validação e ii inicialização dos pesos. Uma variante muito usada nas redes neurais é o gradiente descendente estocástico SGD https en. org wiki Feedforward_neural_network img src https www. Observações lambda é um hiperparâmetro que controla a intensidade da regularização. Você pode inclusive criar o seu próprio conjunto baixando imagens do Google para tentar diferenciar gatos de cachorros etc. O uso dessa ativação resulta em um comportamento análogo ao do neurônio biológico que dispara ou não um sinal de saída para os próximos neurônios a depender das intensidades dos sinais de entrada. org wiki Vis C3 A3o_computacional o conjunto de dados MNIST https en. Escola Piloto Virtual PEQ COPPE UFRJ Data Science e Machine Learning na Prática Introdução e Aplicações na Indústria de ProcessosEste notebook é referente à Aula 3 do curso que trata do problema de classificação utilizando modelos de redes neurais https en. É uma maneira de preservar as informações das bordas ao longo da rede. io api preprocessing image imagedatagenerator class para mais detalhes. Novas estratégias de inicialização dos pesosLembre se de que a maior dificuldade para o bom funcionamento de uma rede profunda é garantir a efetiva propagação dos sinais pela rede. Quais classes estão presentes Repita todo o procedimento que efetuamos acima para o conjunto MNIST separe em X e y separe em treino e validação visualize algumas amostras aplique uma rede MLP e meça o desempenho com a acurácia simples e a matriz de confusão. org wiki Dendrito são pequenas e múltiplas ramificações do corpo celular. Recomendo que você brinque um pouquinho com os diversos recursos e possibilidades oferecidas em especial antes de fazer a atividade que vem a seguir. x_m e fornece uma saída y_k. Quanto à arquitetura as duas grandes classes de redes são as redes a recorrentes https en. No entanto tais aplicações são bem menos comuns. A entropia cruzada entre mathbf y e mathbf p seria 1 cdot log 0. Os dendritos https pt. 6980 um dos mais usados atualmente estende a estratégia de momentos descrita no parágrafo anterior adicionando um segundo momento responsável por controlar a taxa de aprendizado. 00877 A função perda é definida como a média das várias entropias cruzadas das M classes para todas as amostras N do conjunto ou do minilote frac 1 N sum_ i 1 N sum_ j 1 M y_ ij log p_ ij É a função acima que a rede tenta minimizar durante o treinamento manipulando os pesos das conexões. Em outras palavras o número de épocas é a quantidade de vezes em que cada dado é processado pela rede durante o treinamento. Valores típicos vão de 10 6 a 10 4. Nos casos em que há poucos dados para um problema em específico podem ser utilizadas técnicas de transferência de aprendizado https en. com zalandoresearch fashion mnist no menu superior clique em File e depois Add or Upload Data. Já as redes convolucionais como veremos são capazes de aprender padrões locais e reconhecer esses padrões em qualquer posição de alguma outra amostra. ai ai notes initialization. Cada conexão i tem um peso associado denotado por w_ ki. org wiki Graphics_processing_unit para efetuar o treinamento das redes profundas de forma massivamente paralela o que se mostrou essencial para aplicações em larga escala. Caso deseje se gerar mapas de saída menores do que os de entrada podem ser utilizados passos largos strides. io api layers reshaping_layers flatten. Mas na verdade existem bibliotecas muito mais poderosas para utilização de redes neurais que possibilitam a criação de modelos com diferentes arquiteturas e múltiplas camadas. Repare na presença de outro callback o checkpoint instanciado da classe ModelCheckpoint https keras. A saída y_k do neurônio é expressa por y_k varphi v_k varphi left sum_ i 0 m w_ ki x_i right A função não linear varphi é chamada de função de ativação https en. Além da camada convolucional é comum adicionar às redes camadas de pooling. org wiki Convolutional_neural_network. Antes de submeter não esqueça de retreinar os modelos no conjunto de treino completo sem a separação treino validação. Além dessas há várias outras funções de ativação SELU https arxiv. A partir de agora utilizaremos a função display_score para verificar o desempenho dos modelos Utilizando a função Nas figuras acimas para melhor visualização dos erros as cores da diagonal foram zeradas e as cores de fora da diagonal foram normalizadas. Você pode implementar o aumento de dados facilmente fornecendo hiperparâmetros descrevendo as variações das imagens à classe ImageDataGenerator cheque a referência https keras. 2016 https www. Redes convolucionais Redes convolucionais https en. org wiki United_States_Census_Bureau e estudantes do ensino médio estadunidenses. Por exemplo em certa aplicação o vetor mathbf y poderia ser mathbf y 0 0 0 1 0 0 0 0 0 0 o que significa dizer que temos certeza de que o valor verdadeiro é 3. MLPClassifier https scikit learn. pdf propuseram o uso de GPU s Unidades Gráficas de Processamento https en. mil dtic tr fulltext u2 236965. São as chamadas bibliotecas de aprendizado profundo deep learning https pt. A partir de agora o céu é o limite para você Até a próxima comandos mágicos que não se comunicam com a linguagem Python e sim diretamente com o kernel do Jupyter começam com importando os principais módulos que usaremos ao longo da aula localização dos exemplos na matriz de dados selecionando os dígitos já no formato de matriz criando figura do matplotlib plotando desligando os eixos de todos os dígitos dividindo cada valor da matriz pelo número total de imagens em cada classe sumindo com a diagonal pra podermos analizar só os erros plotando a matriz plotando os valores numéricos para exibir todos os números título localização dos exemplos na matriz de dados selecionando os dígitos já no formato de matriz criando figura do matplotlib plotando desligando os eixos de todos os dígitos número de redes no ensemble listas que armazenarão os modelos e os históricos de resultados gerando conjuntos de treino validaçao diferentes a cada treinamento gerando o modelo checkpoint para salvar o melhor modelo para a rede em questão treinando a rede em questão imprimindo resultados após o término do treino da rede em questão selecionando as imagens com predições erradas probabilidades para as imagens com predições erradas transformando objetos ax y_probs_wrong e wrong_positions em containers caso nao sejam para podermos entrar no loop abaixo mesmo quando há apenas uma posição errada plotando selecionando as imagens com predições longe de 0 e 1 predições propriamente ditas gerando a janela do gráfico zerando todos os eixos antes de entrarmos no loop plotando. org wiki Multilayer_perceptron para implementar uma solução inicial utilizando a API que já nos é familiar Efetuando a predição nos dados de validação Comparando valores verdadeiros e predições Dos seis valores mostrados percebemos que o modelo tomou um 3 por um 8 deve ser um erro recorrente dada a semelhança entre os dígitos. org wiki Artificial_neuron mimetiza o funcionamento do neurônio biológico Cada neurônio k em uma rede artificial é uma unidade de processamento local que aceita m conexões por meio das entradas x_1 x_2. Em sua forma original consiste de uma camada de neurônios ou mesmo apenas um neurônio com a seguinte função de ativação varphi u begin cases 0 text se u leq 0 1 text se u 0. Incentivo que você se inscreva na competição e submeta os resultados dos vários modelos que criaremos ao longo da aula de modo a verificar os respectivos desempenhos no conjunto de teste. O mapa de características recebe esse nome porque é a estrutura responsável por reconhecer os vários padrões características relativos à imagem. Pronto Já podemos treinar. org wiki Erro_do_tipo_II como discutido mais adiante. jpg width 400 height 400 Nas redes recorrentes o sinal pode ser propagado para trás enquanto nas redes de alimentação direta o sinal só se propaga em um sentido. Tenta aí duvido acertar todas xDÉ possível melhorar ainda mais os resultados no conjunto MNIST esse será o tema do mão na massa do final da aula. org wiki Stochastic_gradient_descent em que as derivadas são estimadas a partir de porções aleatórias dos dados o que reduz problemas como mínimos locais e pontos de sela. org wiki Erro_do_tipo_I e a revocação está associada a erros do tipo II https pt. org wiki Loss_function. É incrível como essa função bem mais simples do que a logística funciona tão melhor nas redes neurais e precisou esperar tantas décadas até ter seu uso disseminado O provável motivo é a analogia que se pode fazer entre a função logística e os mecanismos de disparo do neurônio biológico analogias são legais mas não ajudam em nada os algoritmos matemáticos. Historicamente os grandes problemas foram 1. pdf em um artigo muito divertido foram os primeiros a implementar de fato o elefante com quatro parâmetros e a fazer a tromba balançar com um parâmetro adicional. org wiki Mathematical_optimization que a cada passo iteração busca o mínimo na direção de maior inclinação da função. A vantagem da dilatação em relação à estratégia de passos largos é a abrangência maior do campo receptivo de cada neurônio. Os dados serão embaralhados e a semente da aleatoriedade foi especificada como 0. Análise dos resultadosPlotando as curvas de aprendizado Carregando as melhores configurações de cada um dos modelos salvas pelo callback model_checkpoint Definindo uma função para retornar a predição do ensemble Lembre se de que a rede fornece como saída para cada imagem uma probabilidade ou seja um número entre 0 e 1. Crie ensembles nos casos em que usamos apenas um modelo MNIST e Fashion MNIST. No caso de predições equivocadas os títulos estão em vermelho. Cada porção é chamada de minilote minibatch. Do ponto de vista da teoria estatística de testes de hipóteses https pt. Repare que a entrada da primeira camada é um tensor de formato largura x altura x canais ao contrário da rede MLP em que a entrada era um vetor. org wiki Ax C3 B3nio é uma longa extensão pode ser algumas ou milhares de vezes maior do que o corpo celular em cujos terminais encontram se as sinapses https pt. org wiki Rectifier_ neural_networks. O problema é binário e às classes normal ok_front e defeituosa def_front foram atribuídos os rótulos 0 e 1 respectivamente. Incentivo você a testar suas novas habilidades com outros dados. Minilotes e épocasComo vimos nas variantes SGD do método de gradiente descendente os dados são divididos aleatoriamente em pequenas porções. Rede MLP no KerasNosso primeiro contato com as redes foi por meio do scikit learn uma abordagem conveniente pois já tínhamos familiaridade com sua interface. Separando os conjuntos X e y A divisão por 255 é uma normalização que converte os pixels da faixa 0 255 para a faixa 0 1 o que melhora o desempenho das redes neurais. org wiki Fun C3 A7 C3 A3o_suave uma conveniência numérica também útil na minimização. org wiki Neur C3 B3nio O corpo celular é o local dos componentes mais complexos da célula núcleo etc. Aprendizado Profundo GOODFELLOW et al. O uso de um ensemble de redes aumenta a acurácia geral reduzindo as amostras nessa faixa e ajuda também a trazer as médias das predições incertas para perto de 0 5 o que tende a trazer as imagens com classificações incorretas para dentro dessa faixa. com 2018 01 10 an intuitive explanation of why batch normalization really works normalization in deep learning part 1 e esta https www. Na função acima a probabilidade do ensemble é calculada como a média das probabilidades fornecidas por cada rede. br upload files defeitos em pecas fabricadas pelo processo de fundicao. Na célula abaixo as várias redes são treinadas em sequência. No caso de imagens esses padrões locais podem corresponder a bordas curvas etc. Pesquise e entenda a natureza do conjunto. Nas redes neurais uma regularização muito usada é a regularização L_2 que adiciona à função perda um termo de penalização dos pesos w na forma lambda sum_i w_i 2 Lembre se de que o treinamento consiste na minimização da função perda por meio do ajuste dos pesos w. Nas próximas células essa importância ficará ainda mais clara por meio de uma análise detalhada do conjunto de teste. Podemos enfim treinar Ufa Deu bem mais trabalho do que o modelo do scikit learn pois foi preciso definir muito mais detalhes. org wiki Artificial_neural_network são uma classe de modelos de aprendizado inspirados vagamente no funcionamento do cérebro humano. treinamentos excessivamente lentos 2. org wikipedia en 5 52 Mark_I_perceptron. Dropout https keras. Acabamos de entender a importância da probabilidade de saída da rede para o processo de classificação. 2009 https publications. com ravirajsinh45 real life industrial dataset of casting product discussion 129717. As redes recorrentes são úteis para modelar dados em que há dependência entre as observações como processos dinâmicos textos ou sequências. Uau Está garantido que em tese o uso de mais camadas nas redes neurais possibilita a resolução de uma enorme classe de problemas No entanto apesar de encorajador o teorema não diz nada sobre os procedimentos necessários para fazer isso acontecer. Para esse objetivo o ideal seria que a variância de um sinal direto ou reverso se mantivesse constante antes e depois de passar por uma camada. org wiki Regra_da_cadeia isso mesmo aquela do Cálculo 1. Ambas as estratégias envolvem amostragens aleatórias a partir de distribuições estatísticas com características específicas. io api callbacks model_checkpoint e responsável por salvar o modelo com melhor desempenho medido em relação à perda da validação. gif width 200 height 200 Outra estratégia para gerar mapas de saída menores que os da entrada é a dilatação proposta por YU e KOLTUN 2015 https arxiv. 2015 https www. A função de ativação relu https en. io guides transfer_learning. org wiki Confusion_matrix disponível em sklearn. risco de sobreajuste por conta do excesso de parâmetros. A regularização é utilizada em muitos modelos não apenas em redes neurais. Apesar da grande simplicidade a empolgação com o percéptron foi grande já que era a época do surgimento da Inteligência Artificial A máquina Mark I Perceptron https apps. RegularizaçãoUma crítica recorrente a modelos de redes neurais e a modelos de aprendizado de forma geral é a grande quantidade de parâmetros de sua estrutura matemática. Apesar de a ideia ser antiga o treinamento de redes com muitas camadas sempre se mostrou bem difícil mesmo com o advento do algoritmo da retropropagação do erro em 1986. O vídeo a seguir por exemplo fornece dicas para que se evite o problema da porosidade As peças em questão são impulsores de bombas submersíveis https en. org wiki Sinapse que por sua vez se conectam aos dendritos ou corpos celulares de outros neurônios. Observando apenas as imagens classificadas incorretamente As amostras com classificações incorretas apresentam majoritariamente predições próximas de 0 5. Nossa missão aqui será criar modelos capazes de identificar o dígito de cada imagem. com ravirajsinh45 real life industrial dataset of casting product com imagens de peças regulares e defeituosas resultantes de um processo de fundição https pt. A figura a seguir ilustra a arquitetura típica de uma rede convolucional A primeira parte da rede efetua a extração de características ou seja identifica os diversos padrões presentes na imagem. org é uma página muito interessante para ganhar sentimento em relação ao funcionamento das redes neurais. Por exemplo a seguir é ilustrada a representação da imagem de um cãozinho como um tensor tridimensional de pixels No caso o tensor resultante possui formato 15x20x3 ou seja são 15 linhas 20 colunas e 3 canais de cores. A entrada de uma camada densa deve ser um vetor portanto antes dessa camada é preciso achatar o tensor de entrada para apenas uma dimensão o que é efetuado com a classe keras. A camada convolucional pode ter vários filtros cada um dando origem a um mapa de características. Para detalhes consulte esta página https www. Para maior detalhamento do resultado podemos usar a matriz de confusão https en. Estudamos dois tipos de redes MLP https en. Do ponto de vista matemático a regularização é qualquer procedimento que adiciona informação a um problema com muitos graus de liberdade. Você pode verificar a relevância da metodologia rodando os próximos códigos deste notebook com GPU s ativadas e depois somente com CPU s e comparando os desempenhos. io api callbacks early_stopping irá monitorar a perda da validação a cada época e caso a diminuição nas últimas 5 épocas não seja maior que 10 6 o treinamento será finalizado. net publication 333593451 figure fig2 AS 765890261966848 1559613876098 Illustration of Max Pooling and Average Pooling Figure 2 above shows an example of max. org propuseram uma excelente definição de aprendizado profundo O aprendizado profundo é um tipo específico de aprendizado de máquina que alcança grande poder e flexibilidade ao representar o mundo como uma hierarquia aninhada de conceitos sendo i cada conceito definido por meio de sua relação com conceitos mais simples e ii representações mais abstratas calculadas em termos de outras menos abstratas. Um exemplo de rede com três camadas uma camada de entrada uma camada oculta e uma camada de saída A camada de entrada não efetua nenhum cálculo e é responsável apenas por distribuir os sinais de entrada para as camadas internas. Modelos de aprendizado profundo que são incontestavelmente úteis reconhecem rostos em imagens traduzem textos etc. É uma abordagem semelhante à que utilizamos na Aula 1 com modelos de florestas aleatórias. Apesar de 0 5 ser o corte mais comum podemos variar esse valor de modo a manipular as proporções entre erros do tipo I https pt. No caso de ajuste desse parâmetro é bom que a escolha seja feita com base nos dados de validação e não de teste de modo que possamos usar os dados de teste para verificação da adequação da escolha. Quando a imagem possui vários canais o mapa de características resultante do filtro é a soma dos mapas de características correspondentes a cada canal. Em particular utilizaremos uma arquitetura especialmente apropriada para aplicações de visão computacional as chamadas redes convolucionais https en. As forças entre as conexões são ajustadas de acordo com estímulos externos. Uma métrica de desempenho bastante usada em problemas de classificação é a acurácia ou seja a simples proporção de predições verdadeiras. Matematicamente a rede efetua o aprendizado desses padrões locais por meio da operação de convolução https en. Problema 4 risco de sobreajuste por conta do excesso de parâmetrosPara esse problema as velhas regularizações L_1 e L_2 podem ser boas soluções. Sequential https keras. Há material de sobra para estudo e exploração. Portanto na prática todos os resultados e conclusões deveriam ser reobtidos com dados que reflitam a operação da planta industrial que infelizmente não estão disponíveis para este estudo de caso. org wiki Sigmoid_function como a logística. Para um parâmetro w_i não resultar em zero ele precisa ser muito importante ou seja seu efeito na diminuição do erro tem de ser mais importante do que o efeito no aumento do erro causado pelo termo de regularização. png width 350 height 350 Em geral os campos receptivos de pooling têm tamanho 2x2 e stride 2 como mostrado acima. 02515 GELU https arxiv. org wiki Vis C3 A3o_computacional. 2015 https arxiv. Na figura a seguir visualizamos todas as 715 amostras do conjunto de teste junto com respectivamente a classe verdadeira e a probabilidade predita pelo modelo. No entanto os tempos mudam. No entanto utilizaremos os dados disponíveis na competição Digit Recognizer https www. com busting the myths about batch normalization esta https mlexplained. É uma ideia simples mas surpreendentemente efetiva para melhorar a capacidade de generalização das redes. No aprendizado profundo por exemplo podemos usar camadas genéricas pré treinadas e treinar apenas as últimas camadas para uma situação em específico usando poucos dados como demonstrado aqui https keras. org wiki Visual_cortex estrutura do cérebro responsável pelo processamento da informação visual. Além delas uma estratégia de regularização muito usada é a dropout https en. Podemos verificar esse balanço plotando as curvas de precisão e revocação em função da probabilidade de corte da saída do modelo A probabilidade de corte portanto pode ser um parâmetro definido de acordo com o interesse da companhia Se deseja se diminuir ao máximo o prejuízo causado pelo desperdício de peças boas ou seja diminuir o risco de falsos positivos deve se selecionar um corte que resulte em máxima precisão. Enrico Fermi https en. Isso é efetuado de trás para frente ou seja da saída para a entrada por meio da aplicação da regra da cadeia https pt. Os neurônios em um mesmo mapa de características compartilham os mesmos parâmetros pesos. Mão na massa 4 Tente aprimorar os desempenhos dos modelos deste notebook. 07122 e ilustrada na figura a seguir. org wiki Deep_learning. 1527 foram os primeiros a demonstrar a possibilidade de atenuação dos problemas 1 e 3 para treinamento de redes profundas utilizando uma metodologia de pré treinamento não supervisionado. Até que RUMERHALT et al. TensorFlow PlaygroundO TensorFlow Playground https playground. Esse segundo momento rastreia as variâncias dos gradientes de cada parâmetro ao longo dos passos anteriores. Aplique em alguns modelos MLP para os conjuntos MNIST e Fashion MNIST. org wiki F1_score a média harmônica entre precisão e revocação F_1 frac 2 1 P 1 R Na próxima célula calculamos a precisão a revocação e o F_1 de nosso modelo Existe um balanço entre precisão e revocação quando aumentamos uma a outra tende a diminuir. Podemos usar o método evaluate para avaliar rapidamente o desempenho final do modelo Analisando as matrizes de confusão utilizando nossa função display_score O desempenho é parecido com o que obtivemos com a rede MLP do scikit learn com a diferença de que parece haver menos sobreajuste. Use modelos pré treinados para introduzir parâmetros não treináveis nas primeiras camadas transferência de aprendizado. org wiki Artificial_neural_network. A figura a seguir ilustra bem o conceito de campo receptivo de um neurônio A operação de convolução faz com que o mapa de saída tenha formato menor do que o mapa de entrada. O vetor mathbf p poderia ser mathbf p 0 0 0 0. org wiki Perceptron inventado por Frank Rosenblatt https en. Perceba que o primeiro campo receptivo é maior que os demais 7x7 o que pode ser conveniente para reduzir o tamanho da imagem sem perder muita informação e como só há em geral no máximo 3 canais na terceira dimensão da entrada a operação não é muito custosa. Na função abaixo definimos um objeto de nome datagen a partir da classe ImageDataGenerator especificando que os pixels serão normalizados para a faixa 0 1 por meio da divisão por 255 e 10 dos dados serão reservados para validação. accuracy_score https scikit learn. com é composto por imagens de peças regulares e defeituosas resultantes de um processo de fundição https pt. org wiki Fundi C3 A7 C3 A3o. Isso é possível porque existem estratégias desenvolvidas justamente para lidar com essa questão. io api layers pooling_layers max_pooling2d implementa uma camada de pooling. ", "id": "afrniomelo/epv-peq-aula-3-classifica-o", "size": "65999", "language": "python", "html_url": "https://www.kaggle.com/code/afrniomelo/epv-peq-aula-3-classifica-o", "git_url": "https://www.kaggle.com/code/afrniomelo/epv-peq-aula-3-classifica-o", "script": "= {0 visualizeImageBatch ensemble_prediction seaborn numpy matplotlib.pyplot make_generators display_score tensorflow logistic pandas elu keras YouTubeVideo leaky_relu relu make_cnn IPython.display ", "entities": "(('motivação para usar', 'de redução erro generalização'), 'ensemble') (('profundo por exemplo podemos usar camadas genéricas pré treinadas e treinar últimas camadas para uma aprendizado situação', 'usando poucos dados como demonstrado aqui https keras'), 'apenas') (('problema de classificação', 'Escola Piloto PEQ UFRJ Data Science e Machine Prática Introdução e Virtual Indústria de ProcessosEste'), 'COPPE') (('ou seja', 'treinamento situação amostras de comum redes'), 'impedir') (('hiperparâmetros e efeitos nos resultados', 'nos conjuntos MNIST e Fashion MNIST variando alguns'), 'veze') (('ao alguma das classes', 'de'), 'distantes') (('quarto', 'ELU por CLEVERT et al'), 'gráfico') (('io api layers initializers', 'class e para funções sigmóides ideal https'), 'glorotuniform') (('resulta maior que da entrada os saída fazendo sinais', 'da ativação saturarem nas extremidades função de logística'), 'combinação') (('333593451 figure', 'max'), 'show') (('pré modelos treinados', 'introduzir parâmetros'), 'use') (('de aprendizado adaptativas é utilização de taxas ou', 'minimização evolui'), 'recente') (('dos entrada sinais de cujos', 'os são pesos'), 'ativação') (('ajuste', 'pesos'), 'desse') (('Repare', 'callback checkpoint instanciado da classe ModelCheckpoint https de outro o keras'), 'presença') (('proporções parecem', 'entre os conjuntos'), 'fizemos') (('Glorot para que funcionasse melhor com ativação de funções de baseadas', 'ReLU'), 'modificação') (('Outra estratégia para gerar menores os 200 height 200 mapas de saída da', 'é'), 'width') (('imagens com classificações trazer incorretas', 'dentro dessa faixa'), 'aumenta') (('abrangência maior', 'receptivo de cada neurônio'), 'relação') (('os resultados e conclusões deveriam ser reobtidos', 'não estão disponíveis para estudo de operação da planta industrial que infelizmente caso'), 'com') (('org wiki Sinapse por sua se conectam aos dendritos ou que vez corpos', 'outros de neurônios'), 'celulare') (('bom compromisso entre os dois cenários se descritos', 'selecionar corte que se resulte'), 'pode') (('relativas ao teste Para é necessário probabilidades probabilidades conjunto de métricas de definir qual faixa de está', 'cada classe'), 'para') (('de vista', 'problema com muitos graus de liberdade'), 'do') (('e diminuição nas', 'será 6 o finalizado'), 'callback') (('proporção de peças', 'defeituosas que está como correta'), 'essência') (('responsável por estrutura reconhecer', 'nome esse porque'), 'recebe') (('imagem características o mapa de resultante', 'cada canal'), 'Quando') (('ou', 'aprendizado ótimo'), 'constitui') (('diz nada sobre', 'fazer isso acontecer'), 'que') (('conexões', 'de acordo com estímulos ajustadas externos'), 'entre') (('scikit', 'ao que usamos'), 'aprendizado') (('justamente sua por conta de organização', 'o de escolha para tais tipo de modelo aplicações'), 'rede') (('e será explicada mais', 'default'), 'que') (('e chamado de viés bias', 'neurônio k.'), 'denotado') (('org wiki Convolutional_neural_network e entendemos porque último adequado para é aplicações', 'https tipo visão computacional pt'), 'este') (('Nossa missão', 'capazes de identificar'), 'aqui') (('Quanto mais fundo se avança nas camadas', 'padrões se tornando complexos e vão abstratos'), 'do') (('proporção peças defeituosas de seja', 'normais'), 'provavelmente') (('fator que vem Outro contribuindo', 'é'), 'para') (('regularização L_1 é', 'usando valores lugar dos L_2 entanto quadrados'), 'análoga') (('da', 'Digit Recognizer https www'), 'o') (('o suficiente dessa', 'de de inicialização pesos'), 'entradas') (('y', 'forma'), 'sobre') (('ou', 'keras'), 'learn') (('uma vez o dados de término', 'treinamento'), 'utilizaremo') (('modelo', 'da maioria das imagens'), 'que') (('0 encontram de 5 geral abaixo', 'ser menor que revocação precisão'), 'consistente') (('minimização por gradiente descendente detalhes', 'https stats'), 'tornar') (('mão na massa', 'da final aula'), 'Tenta') (('scikit', 'pois foi preciso definir muito mais detalhes'), 'do') (('Observações', 'da intensidade regularização'), 'lambda') (('características de mapa de da', 'conecta se'), 'múltiplos') (('Callbacks', 'objetos que efetuam ações durante'), 'são') (('de características mesmo mapa compartilham', 'neurônios'), 'Os') (('em', 'da perda validação'), 'salvar') (('Cada i', 'peso associado denotado por w _ ki'), 'conexão') (('Em', 'passa por uma camada convolucional'), 'seguida') (('exceção da', 'coluna label que identifica o dígito'), 'recognizer') (('variações das', 'classe ImageDataGenerator cheque'), 'pode') (('das corretas', 'geradas pela rede'), 'são') (('recorrentes https', 'redes'), 'Quanto') (('Por exemplo', 'vetor mathbf y poderia ser 0 0 0'), 'mathbf') (('de o problema de detecção contexto', 'não supervisionado PCA'), 'falha') (('redes', 'que há dependência observações como processos dinâmicos textos ou sequências'), 'recorrente') (('Como', 'para'), 'veremo') (('também Uma métrica muito', 'F_1 https'), 'usada') (('gradientesMesmo grande de eficiência introduzido 2 explosão de o ganho sérias', 'de redes profundas treinamento persistiram'), 'desaparecimento') (('def_front acordo os de nomes', 'das classes'), 'submersible_pump') (('Além dessas há várias', 'ativação SELU https funções de arxiv'), 'outras') (('sem o o erro de erro', 'treinamento'), 'aprendizado') (('de treino validação estão há curvas próximas indicativo de que não muito', 'sobreajuste'), 'e') (('depender das', 'dos sinais de entrada'), 'dessa') (('seguir ilustra receptivo faz com formato conceito de campo de neurônio operação de o mapa de saída tenha menor', 'mapa de o entrada'), 'figura') (('Na célula abaixo', 'sequência'), 'são') (('de ajuste parâmetro é bom caso desse que', 'feita com base modo que possamos teste para verificação da adequação escolha seja nos dados de e não de teste de dados de da'), 'os') (('tais aplicações', 'bem menos comuns'), 'são') (('Para resultado utilizaremos redes com múltiplas camadas que constituem o o principal objeto de estudo', 'learning https deep pt'), 'melhorar') (('Crie', 'que usamos apenas modelo MNIST e Fashion MNIST'), 'ensemble') (('Nas próximas células essa importância ficará ainda mais clara por uma análise meio de detalhada', 'de teste'), 'conjunto') (('algumas épocas', 'atinja erro baixo'), 'são') (('até então popular função de ativação', 'até dos pesos com uma então popular estratégia de distribuição'), 'os') (('de ativação varphi u', 'cases'), 'neurônios') (('Para esse objetivo o ideal seria', 'direto ou mantivesse constante antes e passar por uma de sinal se depois de camada'), 'que') (('Já', 'de alguma outra qualquer posição amostra'), 'esse') (('sinal estatísticas', 'é'), 'parêntese') (('uso', 'científica vinda principalmente da indústria de comunidade videogames'), 'desenvolvimento') (('100 atingir acurácia de com baixo custo adicional de HH', 'para'), 'favorável') (('duas camadas além entrada que não precisa acima da camada de ser', 'ambas definidas adicionada classe keras'), 'adicionando') (('Outra vantagem', 'suave https é pt'), 'quando') (('que criaremos ao', 'respectivos desempenhos'), 'inscreva') (('De', 'fazer com que o formato seja'), 'modo') (('o solidifica forma desejada como', 'seguir Os defeitos https'), 'o') (('edu ang', 'icml09 LargeScaleUnsupervisedDeepLearningGPU'), 'papers') (('batch 2018 01 10 intuitive why normalization', 'really normalization'), 'com') (('é atualizar objetivo mais', 'que ainda não foram muito parâmetros atualizados'), 'os') (('dos apresentados', 'classificações ao número de conjunto'), 'este') (('neurais que', 'arquiteturas e múltiplas camadas'), 'verdade') (('das primeiras', 'neurais propostas'), 'wiki') (('nenhum cálculo e apenas por é responsável distribuir', 'camadas internas'), 'saída') (('se', 'derivada segunda os métodos de Newton informações de são https'), 'gradiente') (('Minilotes vimos nas e SGD', 'divididos pequenas dados são porções'), 'método') (('Casting_defect podem de naturezas', 'www'), 'diferente') (('ativadas e depois somente', 'e comparando os desempenhos'), 'verificar') (('8 sendo classificado como 6 cinco', 'cinco classificado como 7 vezes'), 'que') (('Nos casos', 'podem utilizadas transferência de aprendizado ser técnicas de https'), 'poucos') (('aprendizado', 'padrões locais por meio da operação de convolução https'), 'efetua') (('dados os disponíveis', 'Digit Recognizer https www'), 'competição') (('ModelagemA estratégia', 'será criar múltiplas e juntar'), 'aqui') (('01852 função', 'nome de PReLU Parametric o ReLU'), 'recebe') (('camadas como uma inicialização', 'classe keras'), 'add') (('api', 'image imagedatagenerator class módulo keras'), 'disponível') (('api e aprenda como utilizar os recursos io explicados', 'funções de ativação'), 'aqui') (('dos 10 dados', 'por 0 1 meio da divisão por'), 'função') (('especialmente apropriada para aplicações de visão chamadas', 'convolucionais https'), 'em') (('Em', 'keras https particular biblioteca keras'), 'aqui') (('É conveniente ter maior de filtros nas camadas mais profundas há muito número geral mais', 'por meio da dos padrões identificação de se simples'), 'porque') (('é', 'classe keras'), 'deve') (('net publication', 'Recurrent Neural Network RNN'), 'figure') (('Algumas sugestões arquiteturas das', 'e os filtros taxas de dropout demais hiperparâmetros números de etc'), 'Varie') (('que', 'entrada podem ser utilizados passos largos de strides'), 'os') (('o número de é quantidade de vezes', 'rede durante o treinamento'), 'palavras') (('org é uma página interessante muito para', 'das redes neurais'), 'ganhar') (('mas surpreendentemente efetiva para melhorar', 'generalização das capacidade de redes'), 'simples') (('ajudam ou', 'mesmo o desempenho'), 'testes') (('algoritmo', 'minimização de funções descendente de https'), 'gradiente') (('que de uma certa parcela aleatória dos cada 0580 desativação passo', 'treinamento'), 'consiste') (('minilotes foram processados', 'dados passou pela de rede'), 'quando') (('seguir', 'uma superfície partindo de três pontos distintos'), 'algoritmo') (('o problema', 'dos explosão gradientes'), 'recorrente') (('MLP e é responsável por', 'classificação'), 'efetuar') (('Funcionamento da rede convolucional Para alimentar uma', 'rede é necessário representá la como tensor'), 'imagem') (('aprendizado se de supervisionado', 'estão saída disponíveis'), 'os') (('tamanhos de características dos mapas diminuem', 'Como de costume'), 'rede') (('Para', 'consulte esta página https www'), 'detalhe') (('de maior velocidade convergência', 'treinamento'), 'pela') (('risco sobreajuste por de conta', 'de parâmetros'), 'excesso') (('em', 'direções descida promissoras'), 'S0893608098001166') (('Pesquise e natureza', 'conjunto'), 'entenda') (('pixels da o que melhora o desempenho 255 faixa 1 das', 'neurais'), 'os') (('das', 'MLP que estudamos até agora'), 'rede') (('quando novas soluções para', 'problemas foram surgindo'), 'foi') (('dos passos', 'momento rastreia'), 'segundo') (('same padding', 'de modo que saída possua o da mapa de entrada o mapa de mesmo formato entrada'), 'estratégia') (('rede número fixo pequeno é que', 'evitar problemas numéricos'), 'normalization_layers') (('estratégias envolvem', 'distribuições estatísticas com características partir de específicas'), 'aleatórias') (('him', 'trunk'), 'wiki') (('300x300 na escala de ou', 'seja canal de apenas 1 cores'), 'método') (('i', 'e dos ii pesos'), 'aleatoriedade') (('algumas amostras aplique uma MLP e meça o desempenho', 'acurácia simples'), 'class') (('de cálculo o motor utilizado possibilidade de utilização de diversos motores aqui', 'o TensorFlow https www'), 'para') (('prejuízo pelo peças boas ou causado desperdício de seja', 'deve corte que máxima o risco de falsos positivos se precisão'), 'balanço') (('I', 'tipo'), 'c3') (('com menor', 'disponibilidade de dados'), 'wiki') (('scikit', 'de que parece haver menos diferença sobreajuste'), 'usar') (('segundo', 'dia por dois mais popular motivos'), 'gráfico') (('pdf foi', 'o modelo img src https upload'), 'construída') (('redução', 'erro'), 'quanto') (('de o algoritmo minimização', 'chamado taxa de aprendizado é de https'), 'do') (('cada classe e cada classe o vetor verdadeiro de probabilidades de mathbf p o vetor de probabilidades de predito', 'rede'), 'duas') (('É uma abordagem', 'que utilizamos'), 'semelhante') (('Poderíamos tentar', 'diferença'), 'corrigir') (('dos desliga 20 neurônios', 'camada de saída'), 'layers') (('Google', 'o seu baixando próprio imagens'), 'pode') (('seguir abordaremos', 'dia'), 'influente') (('desde aparece com frequência nas das', 'neurais modernas'), '03167') (('ridge https regressão scikit', 'html regularização'), 'origem') (('Quando', 'zero'), 'regularização') (('1527 foram', 'de atenuação'), 'os') (('715 amostras', 'junto com classe verdadeira'), 'figura') (('Aplique', 'alguns modelos'), 'MNIST') (('percéptrons', 'inicial empolgação se que'), 'percebeu') (('por 09820 exemplo', 'conferir dicas e boas práticas para essa tarefa'), 'pode') (('org wiki dígitos escritos por composto de imagens de funcionários', 'United States Census Bureau https'), 'MNIST_database') (('api', 'image imagedatagenerator class para mais detalhes'), 'io') (('da imagem', 'dos dígitos entre'), 'softmax_function') (('dos partir dados', 'múltiplas camadas'), 'seja') (('e', 'precisão P'), 'Calculando') (('o que margem para indica melhoria', 'desempenho'), 'evidente') (('solução', 'chamado de Teorema da Aproximação Universal de resultado muito importante https'), 'para') (('das probabilidades', 'por cada rede'), 'do') (('ajudam', 'nada'), 'incrível') (('Talvez outra estratégia ou arquitetura', 'resultados mais estáveis'), 'leve') (('se não todos', 'são esparsamente que cada neurônio'), 'rede') (('treino conjunto de completo', 'separação treino validação'), 'submeter') (('para montar uma de revisão dos usado estratégia resultados', 'modelo'), 'do') (('implementações das ideias', 'ou outras de ideias'), 'internet') (('pdf rebarbas porosidades', 'trincas superfície'), 'etc') (('que você objetivo é ganhe', 'API e implementar'), 'familiaridade') (('Para discussões', 'respeito consulte SANTUNKAR'), 'interessante') (('e nosso modelo F_1 de Existe', 'outra tende'), 'wiki') (('serão', 'de alimentação direta'), 'notebook') (('das métricas e valores da perda treino e Os resultados dados de já', 'evolui'), 'do') (('Mão', 'desempenhos deste dos modelos notebook'), 'massa') (('imagem', 'quanto classe mais perto de 1 mais'), 'mais') (('org wiki Sigmoid_function', 'logística'), 'como') (('cada passo iteração', 'inclinação da função'), 'que') (('É uma estrutura de aprendizado', 'que córtex visual https'), 'análoga') (('dois que nossos modelos precisarão distinguir Gerando São tipos de imagens dados', 'ImageDataGenerator https classe keras'), 'os') (('ou 15x20x3 seja', 'de 15 linhas 20 colunas e 3 canais cores'), 'exemplo') (('acurácia ou', 'predições simples proporção de verdadeiras'), 'classificação') (('estratégia de momentos de Nesterov', 'mpawankumar'), 'passo') (('usadas atualmente da classe de retificadores', 'https'), 'ativação') (('Cada', 'bem simples'), 'neurônio') (('dos propagação sinais', 'rede'), 'garantir') (('API da 2 função', 'massa'), 'sklearn') (('em', 'entrada era vetor'), 'que') (('época', 'da Inteligência Artificial máquina Mark I'), 'simplicidade') (('tentar Para concluir é importante fazer uma ressalva', 'natureza dos dados de teste'), 'pode') (('Cada', 'de minilote é chamada minibatch'), 'porção') (('diversos padrões', 'imagem'), 'ilustra') (('com', 'batch normalization esta https'), 'mlexplaine') (('desempenho dos o modelos', 'cores fora da foram de diagonal normalizadas'), 'verificar') (('seguir por exemplo fornece dicas para que se', 'peças'), 'vídeo') (('função', 'região negativa da ReLU'), 'gráfico') (('Para mais', 'sobre gradiente algoritmos de descendente'), 'detalhe') (('da minimização seja', 'é ao modelo para que um minilote de fornecido passo'), 'acontece') (('maneira mais', 'é'), 'intuitiva') (('Uma variante muito usada nas', 'estocástico SGD é gradiente descendente https'), 'rede') (('modelos de aprendizado de geral é', 'RegularizaçãoUma crítica de redes modelos neurais'), 'recorrente') (('propagação', 'reverso quais citamos novas sentido funções de ativação'), 'então') (('da recomendo esta aproximação universal leitura', 'neuralnetworksanddeeplearning'), 'seja') (('primeiro', 'da função logística evidente como para de 0 valores f u fica valores de u afastados os de saturam'), 'exemplos') (('momento', 'Física'), 'com') (('Quando', 'ser aprendido como sugerido por HE et se torna parâmetro al'), 'rede') (('Nesse', 'conveniente'), 'minilote') (('Recomendo que você pouquinho os diversos recursos e brinque possibilidades', 'seguir'), 'com') (('padrões locais podem', 'bordas curvas etc'), 'esse') (('porção da camada anterior que se conecta', 'de é chamada campo receptivo'), 'seu') (('da', 'para'), 'efetuado') (('I', 'tipo'), 'de') (('filtros cada dando', 'mapa de características'), 'origem') (('MLP', 'parâmetros é quantidade de menor'), 'do') (('neurônio é expressa por y_k varphi varphi', '_ i'), 'leave') (('Nas 400 height 400 redes', 'pode ser para nas alimentação sinal redes de direta'), 'width') (('da', 'o gradiente'), 'com') (('Tipicamente se vários', 'da rede'), 'utilizam') (('margem para melhorias nos resultados e nas', 'computacionais'), 'eficiência') (('Cada', 'características de mapa de corresponde'), 'elemento') (('Algumas', 'esta https www'), 'excelente') (('Heaviside muito utilizada função de até', 'é composta segmentos de planos'), 'foi') (('que foi i confundida', 'classe j.'), 'confusão') (('com é composto por imagens de peças', 'resultantes de fundição https e defeituosas processo de pt'), 'regulare') (('com muitas se mostrou bem mesmo o advento', '1986'), 'de') (('Pronto Já temos', 'objetos responsáveis por gerar nossos dados treino de teste'), 'os') (('de processo aprendizado', 'seres'), 'ajuste') (('zerando todos', 'quando há apenas uma posição errada plotando selecionando'), 'céu') (('dimensão máximo 3 terceira da', 'operação'), 'receptivo') (('padrões que envolvem todos os pontos', 'dada amostra ou observação'), 'aprender') (('valor máximo sendo escolha essa', 'mais usada img src https www'), 'os') (('https scikit', 'vamos utilizar o modelo disponível'), 'MLP') (('em probabilidades', 'das amostras encontra considerada se suspeita'), 'distante') (('end cases', 'degrau de Heaviside u é chamada de função https'), 'varphi') (('sendo quantidade de dados gerada', 'das mais diversas partir fontes'), 'do') (('i', 'com conceitos mais e ii representações mais abstratas de outras menos termos abstratas'), 'excelente') (('videoaulas Para', 'https www'), 'notebook') (('ela funcionar tão porquê de bem', 'ainda é uma aberto'), 'questão') (('um erro recorrente', 'semelhança entre'), 'utilizando') (('grande quantidade rede com apenas uma camada de o é preciso compilá Perceba de em Antes lo', 'de métricas avaliação'), 'io') (('outras', 'de corte que separa cada uma das duas classes'), 'palavras') (('org wiki United_States_Census_Bureau e estudantes', 'médio ensino estadunidenses'), 'do') (('aumento', 'termo de regularização'), 'resultar') (('org wiki Learning_rate e constitui talvez hiperparâmetro mais o importante', 'modelo'), 'do') (('o que', 'objetivo e dos métodos de facilita tarefa minimização'), 'diminuição') (('contexto da visão computacional como problema de classificação', 'utilizando modelos supervisionados redes de convolucionais'), 'retomaremo') (('os neurônios', 'todos'), 'densa') (('Vários algoritmosExistem várias minimização técnicas', 'gradiente família de algoritmos de descendente'), 'encarar') (('capacidade de generalização', 'modelo'), 'lote') (('Podemos proceder', 'de etapa modelagem'), 'para') (('características complexas dos sistemas nervosos biológicos', 'vastas e complexas redes contendo bilhões de células cada uma podendo efetuar milhares de conexões'), 'emergem') (('já que custo um único falso ou de negativo', 'pode ser alto como discutido https www'), 'o') (('são inerentemente', 'por conta da complexidade matemática e da adaptação excessiva capacidade de resultantes'), 'ruins') (('VP VP FP R', 'que'), 'frac') (('terminais', 'sinapses https se pt'), 'wiki') (('sobreajuste por Problema 4 risco de conta', 'velhas regularizações L_1 e L_2 podem ser boas soluções'), 'excesso') (('Incentivo', 'testar suas novas habilidades com outros dados'), 'você') (('natureza', 'filtro'), 'padrão') (('ou seja', 'são calculados e erros pesos são atualizados'), 'algoritmo') (('org wiki e é responsável', 'nas não redes'), 'activation_function') (('dos dados de entrada', 'largura canais de o formato altura cores'), 'efetuado') (('com que uma parte', 'zero'), 'o') (('Pronto Já implementamos o modelo e entendemos', 'detalhes matemáticos'), 'os') (('É uma informações das bordas maneira de ao', 'da rede'), 'preservar') (('org pequenas e múltiplas Dendrito são ramificações', 'corpo'), 'wiki') (('Para maior detalhamento', 'confusão matriz de https'), 'resultado') (('cada passo e produto armazenando', 'o'), 'se') (('regularização muito', 'dropout https'), 'usada') (('Cada', 'artificial é uma unidade que aceita m conexões por meio de local das'), 'mimetiza') (('treinamento eficaz algoritmo de para', 'com várias camadas'), 'lutou') (('convergência', 'treinamento'), 'impedindo') (('fornece saída para cada uma probabilidade como ou', 'número entre'), 'resultadosPlotando') (('são determinados maneira de ótima', 'rede'), 'veio') (('derivadas', 'de porções aleatórias dos dados o que problemas como mínimos locais'), 'reduz') (('MLP tal darmos uma olhada nas imagens Que que', 'rede'), 'relação') (('rede keras podemos', 'classe keras'), 'neural') (('estratégia momentos de parágrafo', 'estende'), '6980') (('org wiki', 'erro'), 'para') (('api', 'dos arquivos disponíveis partir nas'), 'modelo') (('Serão dois caso ambos constituindo estudos de aplicações', 'https tipo visão computacional pt'), 'do') (('conveniente pois já tínhamos', 'com sua interface'), 'MLP') (('ver com', 'ver com quantidade'), 'exatidão') (('corretamente', 'detectadas'), 'respeito') (('muitos não em', 'neurais'), 'regularização') (('Mão', 'Keras https keras'), 'Explore') (('da função perda por meio', 'dos pesos w.'), 'regularização') (('Nas', 'acordo arquitetura da de rede'), 'rede') (('isso mesmo aquela', 'Cálculo'), 'do') (('pdf o revolucionário algoritmo da retropropagação', 'erro https'), 'propuseram') (('deve hiperparâmetro ser', 'priori'), 'determinado') (('org wiki Graphics_processing_unit para das', 'forma massivamente profundas de paralela'), 'efetuar') (('imagem', 'toda'), 'os') (('proporções entre classes', 'bem balanceadas'), 'separar') (('Modelos de aprendizado profundo que são incontestavelmente úteis reconhecem rostos', 'textos etc'), 'imagen') (('bom pequeno', 'sobreajuste mas nada de grave'), 'desempenho') (('artigo muito divertido foram', 'com quatro implementar de o elefante parâmetros'), 'pdf') (('Fazendo analogia', 'o modelo da o é como se intercepto reta'), 'com') (('br upload', 'pecas fabricadas pelo processo de fundicao'), 'file') (('org wiki Visual_cortex estrutura', 'responsável pelo'), 'cérebro') (('erros', 'tipo II https pt'), 'associada') (('do algoritmo', 'descendente https'), 'gradiente') (('Quanto dos passados dado parâmetro o', 'de taxa aprendizado correspondente'), 'maior') (('Uma normalização camada de por', 'https keras'), 'lote') (('uma camada oculta conseguem aproximar qualquer função contínua redes', 'de uma camada oculta conseguem aproximar qualquer mais função'), 'wiki') (('primeira etapa passe direto calcula chamada de se', 'em etapas'), 'algoritmo') (('das', '784 pixels'), 'reflete') (('rede tenta minimizar durante', 'manipulando'), '00877') (('Uma das', 'regularização https'), 'estratégias') (('padrões locais', 'vão sendo agregados e cada vez mais tornando se complexos'), 'simples') (('modelo', 'função summary https keras'), 'verificar') (('Isso é possível porque existem estratégias', 'justamente para lidar com essa questão'), 'desenvolvidas') ", "extra": "['test']"}