{"name": "estimation of the price of selling diesel cars ", "full_name": " h1 Estimation of the price of selling diesel cars with 3 models EDA h2 Acknowledgements h4 This kernel uses such good kernels h2 Table of Contents h2 1 Import libraries h2 2 Download datasets h2 3 EDA Visualization h2 4 FE building the feature importance diagrams h3 4 3 LGBM h3 4 3 XGB h3 4 3 Logistic Regression h3 4 1 Linear Regression h2 5 Comparison of the all feature importance diagrams h2 6 Preparing to modeling h2 7 Tuning models and test for all features h3 7 1 LGBM h3 7 2 XGB h3 7 3 Decision Tree Regressor h2 8 Models comparison h2 9 Prediction ", "stargazers_count": 0, "forks_count": 0, "description": "Preparing to modeling 6 7. 3 Decision Tree Regressor Back to Table of Contents 0. com vbmokin feature importance xgb lgbm logreg linreg https www. com vbmokin used cars fe eda with 3d Linear Regression Thanks to https www. com vbmokin used cars price prediction by 15 models Thanks to https www. com vbmokin used cars price prediction by 15 models split training set to validation set Thanks to https www. com vbmokin automatic selection from 20 classifier models Determination categorical features Encoding categorical features Thanks to https www. com vbmokin used cars price prediction by 15 models Clone data for FE Thanks to https www. Comparison of the all feature importance diagrams 5 6. FE building the feature importance diagrams 4 LGBM 4. 3 Linear Regression 4. com vbmokin used cars fe eda with 3d the level of importance of features is not associated with the sign Thanks to https www. 2 XGB Back to Table of Contents 0. com vbmokin feature importance xgb lgbm logreg linreg Create total column with different weights Plot the feature importances Thanks to https www. com dnzcihan house sales prediction and eda. com darkcore house sales visualization Create paint_color Frame Thanks to https www. com vbmokin used cars price prediction by 15 models Calculation of accuracy of model акщь Sklearn by different metrics Thanks to https www. com vbmokin used cars price prediction by 15 models Plot Thanks to https www. Download datasets 2 3. 2 Logistic Regression 4. 3 XGB Back to Table of Contents 0. Comparison of the all feature importance diagrams Back to Table of Contents 0. com vbmokin used cars price prediction by 15 models https www. com vbmokin used cars fe eda with 3d maximum depth of a tree SGD will use this percentage of data L2 regularization term 1 more conservative Thanks to https www. com vbmokin used cars fe eda with 3d Standardization for regression model Thanks to https www. 3 Logistic Regression Back to Table of Contents 0. com masumrumi a detailed regression guide with house pricing customizing the QQ_plot. com vbmokin used cars price prediction by 15 models Synthesis test0 from train0 Thanks to https www. com darkcore house sales visualization Create Fuel Frame Thanks to https www. com vbmokin used cars fe eda with 3d split training set to validation set Thanks to https www. com darkcore house sales visualization Create Manufacturer Frame Thanks to https www. EDA Visualization 3 4. Import libraries 1 2. Models comparison Back to Table of Contents 0. com darkcore house sales visualization Thanks to https www. 1 preprocessing models model tuning Thanks to https www. com vbmokin feature importance xgb lgbm logreg linreg Thanks to https www. Tuning models and test for all features Back to Table of Contents 0. com darkcore house sales visualization Table of Contents1. Preparing to modeling Back to Table of Contents 0. 3 LGBM Back to Table of Contents 0. Prediction Back to Table of Contents 0. Thanks to https www. com darkcore house sales visualization Create transmission Frame Thanks to https www. com vbmokin used cars price prediction by 15 models Synthesis valid as test for selection models Thanks to https www. com vbmokin used cars price prediction by 15 models Calculation of accuracy of boosting model by different metrics Thanks to https www. com vbmokin used cars price prediction by 15 models Decision Tree Regression Thanks to https www. com vbmokin used cars price prediction by 15 models Plot LGB Regression model for basic train XGB Regression model for basic train Decision Tree Regression for basic train Thanks to https www. com an easy introduction to 3d plotting with matplotlib 801561999725 Thanks to https www. com dzvlfi craiglist eda dzulfiqar ridha create correlation with heatmap convert correlation to numpy array to mask the repetitive value for each pair Thanks to https towardsdatascience. com darkcore house sales visualization Create Cylinders Frame Thanks to https www. com vbmokin used cars price prediction by 15 models Relative error between predicted y_pred and measured y_meas values RMSE between predicted y_pred and measured y_meas values Thanks to https www. com vbmokin used cars fe eda with 3d abnormals filter Thanks to https www. com vbmokin used cars fe eda with 3d Thanks to https www. Prediction 9 1. com vbmokin used cars price prediction by 15 models For boosting model Synthesis valid as test for selection models For models from Sklearn Thanks to https www. Tuning models and test for all features 7 LGBM 7. com vbmokin used cars fe eda with 3d abnormals filter https www. Estimation of the price of selling diesel cars with 3 models EDA Acknowledgements This kernel uses such good kernels https www. Download datasets Back to Table of Contents 0. Models comparison 8 9. 1 LGBM Back to Table of Contents 0. EDA Visualization Back to Table of Contents 0. com darkcore house sales visualization Create Condition Frame Thanks to https www. com darkcore house sales visualization Create drive Frame Thanks to https www. 1 Linear Regression Back to Table of Contents 0. Import libraries Back to Table of Contents 0. 2 Decision Tree Regressor 7. com nanomathias feature engineering importance testing MinMax scale all importances Create mean column Plot the feature importances Thanks to https www. com vbmokin used cars fe eda with 3d Logistic Regression Thanks to https www. FE building the feature importance diagrams Back to Table of Contents 0. com darkcore house sales visualization Clone data for FE Thanks to https www. com darkcore house sales visualization Create type Frame Thanks to https www. ", "id": "lopukhov/estimation-of-the-price-of-selling-diesel-cars", "size": "2491", "language": "python", "html_url": "https://www.kaggle.com/code/lopukhov/estimation-of-the-price-of-selling-diesel-cars", "git_url": "https://www.kaggle.com/code/lopukhov/estimation-of-the-price-of-selling-diesel-cars", "script": "sklearn.metrics Trials cross_val_score acc_model acc_rmse matplotlib.gridspec matplotlib.style SGDRegressor ExtraTreesRegressor sklearn.tree lightgbm plotly.offline DecisionTreeRegressor tpe acc_d cross_val_predict as cvp pandas_profiling SVR sklearn.neural_network plotly.graph_objects VotingRegressor r2_score iplot seaborn numpy mean_squared_error AdaBoostRegressor RandomForestRegressor mpl_toolkits hyperopt GradientBoostingRegressor fmin cross_val_predict sklearn.ensemble sklearn.model_selection sklearn metrics LabelEncoder acc_boosting_model space_eval MLPRegressor matplotlib.pyplot RidgeCV stats pandas StandardScaler LogisticRegression plotting_3_chart scipy STATUS_OK init_notebook_mode GridSearchCV BaggingRegressor mean_absolute_error sklearn.linear_model sklearn.preprocessing StratifiedKFold sklearn.svm LinearSVR xgboost train_test_split hp LinearRegression mplot3d preprocessing ", "entities": "(('com vbmokin', 'Decision Tree https Thanks www'), 'use') (('FE', 'feature importance'), 'diagram') (('Import', 'Contents'), 'librarie') (('com vbmokin', 'abnormals filter https 3d www'), 'use') (('Download', 'Contents'), 'dataset') (('com vbmokin', 'https Thanks www'), 'use') (('feature', 'https www'), 'scale') (('com vbmokin', 'https 1 more conservative Thanks www'), 'use') (('Comparison', 'feature importance'), 'diagram') (('com vbmokin', 'models https 15 www'), 'use') (('Comparison', 'Contents'), 'diagram') (('com craiglist eda dzulfiqar dzvlfi ridha', 'https Thanks towardsdatascience'), 'create') (('com vbmokin', 'https www'), 'use') (('com vbmokin', 'Plot https www'), 'use') (('com vbmokin automatic selection', 'https Thanks www'), 'feature') (('com vbmokin feature importance xgb lgbm logreg linreg', 'feature https www'), 'column') (('level', 'https www'), 'use') (('EDA kernel', 'kernels https such good www'), 'estimation') ", "extra": "['test']"}