{"name": "explore job postings ", "full_name": " h1 Data Science for Good City of Los Angeles h1 Data Science for Good City of Los Angeles h1 Problem Statement h1 How to Participate h1 Grading Rubric h1 Prizes and Eligibility ", "stargazers_count": 0, "forks_count": 0, "description": "jpg Photo by Sasha Stories https unsplash. Problem StatementThe content tone and format of job bulletins can influence the quality of the applicant pool. The possible elements contained within each job bulletin are described in Kaggle_data_dictionary. Make Your Submission Follow the submission instructions 2. com photos 5c1kq_XmPEY on Unsplash Data Science for Good City of Los Angeles Help the City of Los Angeles to structure and analyze its job descriptions The City of Los Angeles faces a big hiring challenge 1 3 of its 50 000 workers are eligible to retire by July of 2020. If competitors extract additional data elements they should provide an updated data dictionary which builds on the one provided but includes at a minimum greater detail about allowable values additionally identified variables data types and explanatory notes as appropriate. com c data science for good city of los angeles rules 2 https www. Prizes 1st place 5 000 2nd place 4 000 3rd place 3 000 4th place 1 500 5th place 1 500 Kaggle Swag Prizes Kaggle Swag Prizes will be awarded to authors of public kernels that make original insights and recommendations on any topic including topics that are not otherwise covered in the competition description. The contest launches on May 8th with final kernels due by June 21st. Overly specific job requirements may discourage diversity. Accept the Rules Accept the competition rules 1. Good luck and happy Kaggling 1 https www. com bbailey data science for good city of la starter kernel or below you can find some functions for previewing the data files. Data Science for Good City of Los AngelesYou can find the official starter kernel with helpful code snippets in this link https www. com bbailey data science for good city of la starter kernel Import python packages Define helper function for plotting word clouds adapted from https www. Those prizes include the winner s choice of Kaggle No Free Hunch t shirt Kaggle tier t shirt Kaggle coffee mug Kaggle water bottleSee the following kernel for more detail https www. Performances will be scored on Accuracy 5 points Documentation 5 points Recommendation 5 points Accuracy 5 points Did the user convert the folder of job postings into a structured CSV Job class structures will be evaluated on how accurately each prepared field matches manually structured fields for a randomized set of classes. Documentation 5 points Does the user follow good coding practices Useful comments Description of coding language used modules used Are the modules open sourced prefer open sourced modules Documentation of script automation. WIth your help Los Angeles will overcome a wave of retirements and fill those jobs with a strong and diverse workforce. The Los Angeles Mayor s Office wants to reimagine the city s job bulletins by using text analysis to identify needed improvements. com benhamner most common forum topic words Preview the data folder Reorganize the data folder Preview a PDF file Parse a PDF file Make a Word Cloud Preview a Text File Clean Up The Notebook. The goal is to convert a folder full of plain text job postings into a structured CSV file and then to use this data to 1 identify language that can negatively bias the pool of applicants 2 improve the diversity and quality of the applicant pool and or 3 make it easier to determine which promotions are available to employees in each job class. The city has partnered with Kaggle to create a competition to improve the job bulletins that will fill all those open positions. csv Sample job class export template. Fully automated scripts are preferred Does the user document their methodology Is there documentation about how the solution was evaluated Is there documentation about the pros and cons of their solution Recommendation 5 points Did the authors use the structured data to make an original insight Did the authors identify and communicate details about something that they discovered in the data Did the authors make an actionable recommendation to the City of LA Did the authors make effective use of data visualizations to communicate their recommendations to the City of LA Do the recommendations give helpful solutions to one or more of the following issues 1 identify language that can bias the pool of applicants 2 improve the diversity and quality of the applicant pool and or 3 increase the discoverability of promotional pathways Prizes and Eligibility Main Prizes The Los Angeles Mayor s Office of Budget and Innovation will award 15 000 in total prizes to 5 winning authors who submit public kernels that tackle the objective effectively. How to Participate1. com benhamner most common forum topic words Define helper function for plotting word bar graphs adapted from https www. com c data science for good city of los angeles overview submission instructions Grading Rubric The bulk of the grade will be determined by the contents of your kernel notebook including 1 the creation of a single structured CSV file and data dictionary that contains all of the information from the job postings and 2 the quality of the insights and data driven recommendations that you make to the City of LA. ", "id": "paultimothymooney/explore-job-postings", "size": "5176", "language": "python", "html_url": "https://www.kaggle.com/code/paultimothymooney/explore-job-postings", "git_url": "https://www.kaggle.com/code/paultimothymooney/explore-job-postings", "script": "Image as Img stopwords wand.image collections numpy shutil tika PIL copytree Image matplotlib.pyplot os WordCloud pandas wordcloud Counter parser walk nltk.corpus ignore_patterns wordCloudFunction wordBarGraphFunction STOPWORDS ", "entities": "(('that', 'competition otherwise description'), 'place') (('Los Angeles Office', 'needed improvements'), 'want') (('competition', '1'), 'accept') (('Los Angeles', 'strong workforce'), 'overcome') (('modules', 'script automation'), 'point') (('contest', 'June due 21st'), 'launch') (('possible elements', 'Kaggle_data_dictionary'), 'describe') (('Submission', 'submission instructions'), 'make') (('that', 'open positions'), 'partner') (('that', 'objective'), 'be') (('which', 'variables data additionally types'), 'provide') (('1 3', '2020'), 'photo') (('com bbailey data science', 'data files'), 'find') (('Text File', 'Notebook'), 'benhamner') (('how accurately prepared field', 'classes'), 'score') (('Problem StatementThe content tone', 'applicant pool'), 'influence') (('Data Science', 'link https www'), 'find') (('you', 'LA'), 'science') (('job Overly specific requirements', 'diversity'), 'discourage') (('promotions', 'job class'), 'be') (('Kaggle tier t shirt Kaggle coffee mug Kaggle water', 'detail https more www'), 'include') (('com c data science', 'https 2 www'), 'rule') ", "extra": "['test']"}