{"name": "exploring new year s resolutions ", "full_name": " h1 Exploring New Year s Resolutions h3 In search of ideas and patterns amidst collective intelligence h2 What are the most common resolution categories h2 What are the most common resolution topics h2 What does the Top 30 Most Retweeted consist of h2 How are these tweets distributed across the US h4 This is a work in progress let me know if you have any suggestions ", "stargazers_count": 0, "forks_count": 0, "description": "From a pandemic to wars and many other tragedies it is a relief to renew hope and move into a hopefully better next year. What are the most common resolution categories What are the most common resolution topics What does the Top 30 Most Retweeted consist of Note that this represents popularity and might not be what we are looking for but at least we may have a good laugh. To that end let s use the collective knowledge to craft better resolutions and explore those of people just like you and I. com media B6M4kOtIUAEv8t7 format jpg name small https pbs. com media B6TAw2LCQAA fml format jpg name small How are these tweets distributed across the US This is a work in progress let me know if you have any suggestions. Some of these are genuinely funny https pbs. Exploring New Year s Resolutions In search of ideas and patterns amidst collective intelligence The last few years have not being easy on mankind. Future work Topic Modeling Wordclouds Bigrams and Trigrams Time series of tweets. Pursuing the right things and structuring them as goals neatly can have a profound impact on the year that is to come. ", "id": "andrewmvd/exploring-new-year-s-resolutions", "size": "1182", "language": "python", "html_url": "https://www.kaggle.com/code/andrewmvd/exploring-new-year-s-resolutions", "git_url": "https://www.kaggle.com/code/andrewmvd/exploring-new-year-s-resolutions", "script": "plotly.graph_objects plotly.express pandas numpy ", "entities": "(('that', 'year'), 'have') (('last few years', 'mankind'), 'explore') (('s', 'just you'), 'let') (('com B6M4kOtIUAEv8t7', 'https small pbs'), 'medium') (('at least we', 'good laugh'), 'be') (('many other it', 'hopefully better'), 'be') (('Some', 'these'), 'be') (('you', 'suggestions'), 'medium') ", "extra": "[]"}