{"name": "genedered pronoun resolution eda ", "full_name": " h1 Gendered Pronoun Resolution h1 Objective h1 Evaluation h1 Data h2 Columns h2 Labels h2 Text h2 Pronoun and Gender h2 Pronoun position h2 Entity Pronoun gap ", "stargazers_count": 0, "forks_count": 0, "description": "EvaluationSubmissions are evaluated using the multi class logarithmic loss. LabelsObservations There are no cases where both A and B are correct sanity check There are 490 cases where neither A nor B are the true labels There are 3964 cases 1985 cases of B and 1979 cases of A where either A or B are true labels TextObservations Text length ranges from 69 to 1347 characters Most of the texts lie in 300 to 500 characterLet s check the both extremes of the text based on text lengthsObservations text words range from 12 to 223 Most words lie between 50 and 100Let s see one example of the both extremesObservations it follows a roughly linear relationship between text words and text lengths. The source text is taken from Wikipedia articles. this like is same as the slanted line from the previous plot. the slight and small group of points in a slanted line are the points where pronoun is at the start of the sentence and entities come later. Since here the entities are at the start there can never be any case where the gap will be positive. Files are also available on the GAP Dataset Github Repo https github. DataUnlike many Kaggle challenges this competition does not provide an explicit labeled training set. Note that the labels for the test set are available on this page. tsv the test set data for stage 1 Columns ID Unique identifier for an example Matches to Id in output file format Text Text containing the ambiguous pronoun and two candidate names about a paragraph in length Pronoun The target pronoun text Pronoun Offset The character offset of Pronoun in Text A The first name candidate text A offset The character offset of name A in Text A coref Whether A corefers with the pronoun TRUE or FALSE B The second name candidate B offset The character offset of name B in Text B coref Whether B corefers with the pronoun TRUE or FALSE URL The URL of the source Wikipedia page for the exampleObservations In the original Google AI Language s GAP dataset there are 8 908 coreference labeled pairs 4000 pairs in test and development each and 908 pairs in validation set Through Github we are shared the half of that 2000 pairs in test and development each and 454 pairs in validation set All the 3 tables have all the 11 columns which includes the correct labels as wellWe ll combine all of them together to do the exploratory analysis. 9 cases are there where the pronoun is in the initial 1 3rd of the data this plot shows that in most of the cases first the entity person is introduced in a sentence and then the pronoun is usedNext we ll explore the gap between the person and the pronoun Entity Pronoun gapObservations The gap between the entity and pronoun ranges from 502 to 291 mean is at 57 shows that entity appears before pronoun which we also previously positive gap tells us about the cases where the pronoun is used before the entity is mentionedObservations False means the cases where pronoun comes after entity 81 True means the cases where the entity comes after pronoun 19 Observations the horizontal like at pronoun_label_gap 0 tells us that the entity and pronoun offsets can never be same which makes sense the vertical points at Pronoun offset 0 tells us about the points where pronoun comes at the start of the sentence and entities comes later in the sentense anything above hirozontal line of 0 are cases where pronoun comes before entities 19 data anything below hirozontal line of 0 are cases where entities comes before pronouns 81 data the slanted line shows that the entities are at the start of the sentence since max gap possible for cases where entity comes before pronoun can be pronoun offset entites can t come before the sentence even starts label_pronoun_gap Pronoun offset Observations this plot is very similar to the previous plot where we plotted label_pronoun_gap vs Pronoun offset horizontal line at label_pronoun_gap 0 means entity offset and pronoun offset can never be the same anything above hirozontal line of 0 are cases where pronoun comes before entities 19 data anything below hirozontal line of 0 are cases where entities comes before pronouns 81 data the vertical line at label_offset 0 shows that the entities are at the start of sentence and the pronouns later in the sentence. The submitted probabilities are not required to sum to one because they are rescaled prior to being scored each row is divided by the row sum. Each pronoun has been labeled with whether it refers to A B or NEITHER. In order to avoid the extremes of the log function predicted probabilities are replaced with max min p 1 10 15 10 15. You are provided with the pronoun and two candidate names to which the pronoun could refer. databset seems to be carefully created as I ve never seen this plot this neat by first looking at it I was surprisingly reminded of the milky way galaxy Pronoun and GenderObservations we have a 50 50 split in the genders as the competition details said but this wont be true with the 2nd stage test data in male pronouns we have he his him with his being the highest in the frequency 1193 in female pronouns we have she her hers with her being the highest in frequency 1315 Observations hers is not present in the train or validation set Pronoun positionObservations half of the area where there are no points is because pronoun offset can t get higher then the text length itself this is also a sanity check of our data textlen Pronoun offset there are many texts where the selected pronoun is towards the end this relationship is explored nextObservations this ratio will never go below 1 as the pronoun offset cannot be greater than text length from the plot it s apparent that majority of the pronouns are in the 2nd half of the text this majority is 96 of the data only 43 cases 0. Stage two s final evaluation will use a new dataset following the same format. com google research datasets gap coreference. This line is similar to the vertical points at Pronoun offset 0 in the previous plot. However your final score and ranking will be determined in stage 2 against a withheld private test set. For each pronoun you must submit a set of predicted probabilities one for each class. To encourage gender fair modeling the ratio of masculine to feminine examples in the official test data will not be known ahead of time. The formula is then log loss frac 1 N sum_ i 1 N sum_ j 1 My_ ij log p_ ij where N is the number of samples in the test set M is 3 log is the natural logarithm y_ ij is 1 if observation i belongs to class j and 0 otherwise and p_ ij is the predicted probability that observation i belongs to class j. Gendered Pronoun Resolution ObjectiveIn this two stage competition Kagglers are challenged to build pronoun resolution systems that perform equally well regardless of pronoun gender. You must create an algorithm capable of deciding whether the pronoun refers to name A name B or neither. In this competition you must identify the target of a pronoun within a text passage. ", "id": "tminima/genedered-pronoun-resolution-eda", "size": "7478", "language": "python", "html_url": "https://www.kaggle.com/code/tminima/genedered-pronoun-resolution-eda", "git_url": "https://www.kaggle.com/code/tminima/genedered-pronoun-resolution-eda", "script": "numpy matplotlib.pyplot InteractiveShell pathlib pandas IPython.core.interactiveshell Path ", "entities": "(('probabilities', 'max'), 'predict') (('majority', '96 data'), 'seem') (('line', 'previous plot'), 'offset') (('where pronoun', 'sentence'), 'be') (('it', 'text words'), 'be') (('where gap', 'start'), 'be') (('com google research', 'gap coreference'), 'dataset') (('this', 'previous plot'), 'be') (('you', 'class'), 'submit') (('source text', 'Wikipedia articles'), 'take') (('capable pronoun', 'name B'), 'create') (('competition', 'training explicit labeled set'), 'challenge') (('which', 'together exploratory analysis'), 'set') (('you', 'text passage'), 'identify') (('pronoun', 'candidate two which'), 'provide') (('However final score', 'test 2 withheld private set'), 'determine') (('that', 'pronoun equally well regardless gender'), 'ObjectiveIn') (('predicted i', 'j.'), 'be') (('Files', 'GAP Dataset Github Repo https also github'), 'be') (('0 entities', 'later sentence'), 'be') (('two final evaluation', 'same format'), 'use') (('labels', 'page'), 'note') (('EvaluationSubmissions', 'multi class logarithmic loss'), 'evaluate') (('they', 'row sum'), 'require') (('it', 'B'), 'label') ", "extra": "['gender', 'test']"}