{"name": "getting started simple eda ", "full_name": " h2 Explaining some confusing aspects of the data h3 The label column in train image data h3 How should the submission file look like h2 Let s look at the data h1 IMAGE DATA h3 Let s see the boxes h1 STUDY DATA h2 Boxes ", "stargazers_count": 0, "forks_count": 0, "description": "Columns boxes and label in train_image are somewhat redundant boxes contains location and size of the boxes label contains location xmin ymin xmax ymax of the boxes and confidence which for the training data is always 1 So we don t need boxes column we can just use the info from label column. In these cases patients were imaged more than once on the same date time same StudyInstanceUID. But there are also some images from other categories with no boxes. html Let s see the boxes. 75 How should the submission file look like For images it is consistent with the label column a for image with no boxes id_image none 1 0 0 1 1 b for image with boxes id_image opacity And for studies id_study 0 0 1 1 Example from the Kaggle Evaluation tab Id PredictionString2b95d54e4be65_study negative 1 0 0 1 12b95d54e4be66_study typical 1 0 0 1 12b95d54e4be67_study indeterminate 1 0 0 1 1 atypical 1 0 0 1 12b95d54e4be68_image none 1 0 0 1 12b95d54e4be69_image opacity 0. 7 10 10 20 20 Also if I understand correctly every study in train and test data is assigned to exactly one class the classes are mutually exclusive and it s best if you predict that class. In some cases however there are studies with more than 1 image. In some cases there is motion artifact so the tech re took the image. csv file aren t multilabeled. 5 100 100 200 200 opacity 0. Here is an explanation from Competition Host Most of the studies only have 1 image. io pydicom stable index. take first example and get path to it get the pixel information into a numpy array this can help with increasing the contrast now on image with equalize_hist the studies in train_study_level. We ll let you know when this process is completed. We are addressing this issue currently regarding the duplicates and test set. com c siim covid19 detection discussion 240250 1322940 BoxesAll of the images marked as Negative for Pneumonia don t have any boxes. Let s look at the data IMAGE DATAThis is how you can get to an image The image files are in DICOM. In other cases there are coverage image penetration or other technique issues presumably resulting in the technologist needing to retake radiographs. Explaining some confusing aspects of the dataEvery image in train_image data is assigned to one study in train_study data StudyInstanceUID column. 7 0 0 1 1 indeterminate 0. This format is often used in the medical images since it contains information about the patient to avoid mismatching the patients data. But one study can contain multiple images more info in the STUDY DATA section. The label column in train_image datalabel column has a structure a for image with no boxes none 1 0 0 1 1 b for image with boxes opacity 1 if there is more than one box there are multiple labels like this in a row for example opacity 1 789. In other cases different image processing is applied the images look almost identical but there is subtle change in contrast. But if you are not sure about your prediction you can also try multilabel classification for example 2b95d54e4be65_study negative 0. DICOM format can be handled using pydicom package see more https pydicom. STUDY DATAFor most of the studies 5822 out of 6334 there is only 1 image but for some there are more up to 9 images. ", "id": "aleksandramowio/getting-started-simple-eda", "size": "3403", "language": "python", "html_url": "https://www.kaggle.com/code/aleksandramowio/getting-started-simple-eda", "git_url": "https://www.kaggle.com/code/aleksandramowio/getting-started-simple-eda", "script": "walk listdir seaborn numpy matplotlib.pyplot skimage exposure os pandas ", "entities": "(('images', 'almost subtle contrast'), 'apply') (('label column', 'opacity'), 'have') (('artifact tech', 'image'), 'be') (('patients', 'date more same time'), 'image') (('it', 'patients data'), 'use') (('you', 'example'), 'try') (('Explaining', 'train_study data StudyInstanceUID column'), 'assign') (('we', 'label column'), 'be') (('it', '1 Kaggle Evaluation 0 0 1 tab'), '75') (('We', 'currently duplicates'), 'address') (('Competition Host Most', 'only 1 image'), 'have') (('com c detection covid19 240250 1322940 BoxesAll', 'boxes'), 'siim') (('one study', 'STUDY DATA section'), 'contain') (('this', 'train_study_level'), 'take') (('DICOM format', 'https more pydicom'), 'handle') (('image files', 'DICOM'), 'be') (('you', 'class'), '7') ", "extra": "['patient', 'test']"}