{"name": "getting started with titanic ", "full_name": " h1 Part 1 Get started h2 Join the competition h2 The challenge h2 The data h3 1 train csv h3 2 test csv h3 3 gender submission csv h2 Your first submission h1 Part 2 Your coding environment h2 The Notebook h2 Your first lines of code h2 Load the data h1 Part 3 Improve your score h2 Explore a pattern h2 Your first machine learning model h1 Part 4 Keep learning h2 Check out the Intermediate Machine Learning course to learn about more advanced techniques ", "stargazers_count": 0, "forks_count": 0, "description": "com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. Then click on the Submit to Competition button to submit your results. com learn intro to machine learning discussion to chat with other learners. com c titanic as an example. Your first machine learning modelWe ll build a random forest model https www. In this tutorial you ll explore a full workflow that you can use to get started from the very beginning with creating a submission to any Kaggle competition. Make sure that your notebook outputs the same message above Your submission was successfully saved before moving on. png You can edit the name by clicking on it. This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. csv _ Part 3 Improve your scoreRemember our goal we want to find patterns in train. csv does not have a Survived column this information is hidden from you and how well you do at predicting these hidden values will determine how highly you score in the competition 3 gender_submission. This pulls up a list of versions on the right of the screen. At the end of the tutorial we suggest resources to continue your learning. Copy the code below into a new code cell. This will generate a pop up window. png There are three files in the data 1 train. So we ll start simple. read_csv Input data files are available in the. to the right of the most recent version and select Open in Viewer. Your hypotheses regarding survival will probably be different which will lead to a different submission file. But just like this file your submission should have a PassengerId column containing the IDs of each passenger from test. For instance the first passenger listed in train. Load the dataThe second code cell in your notebook now appears below the three lines of output with the file locations. _The code above shows only the first 5 rows of each table but all of the data is there all 891 rows of train. You must accept the competition rules in order to participate. com learn intro to machine learning course you learned how to make a submission to a Kaggle competition. Next we ll walk you through how to outperform this initial submission Part 2 Your coding environmentIn this section you ll train your own machine learning model to improve your predictions. You can use Kaggle Notebooks to getting up and running with writing code quickly and without having to install anything on your computer. _ Then either hit the play button which appears to the left of the blue line or hit Shift Enter on your keyboard. If the code runs successfully three lines of output are returned. Then Click on the blue Submit Predictions button in the top right corner of the competition page. After it has finished running click on the number to the right of the Save Version button. Join the competition The first thing to do is to join the competition Open a new window with the competition page https www. This generates a window in the bottom left corner of the notebook. Before moving on make sure that your code returns the output above. We ll use the Titanic competition https www. Once you ve done this all of the column names along with a brief description of what they contain are listed to the right of the screen under the Columns heading. csv file is provided as an example that shows how you should structure your predictions. com dansbecker random forests. The code that you ve just written is in the Python programming language. Upload the file you just downloaded. For example running this by clicking run or pressing Shift Enter will list all files under the input directory Any results you write to the current directory are saved as output. Don t forget to click on the play button or hit Shift Enter As before make sure that you see the output above in your notebook before continuing. Click on the Output tab on the right of the screen. Ensure that the Save and Run All option is selected and then click on the blue Save button. Then click on the blue Make Submission button. csvUsing the patterns you find in train. These rules govern how many submissions you can make per day the maximum team size and other competition specific details. Since gender seems to be such a strong indicator of survival the submission file in gender_submission. Part 1 Get startedIn this section you ll learn more about the competition and make your first submission. It uses a Python module called pandas abbreviated as pd to load the table from the train. _If you are interested in deep learning we also offer free GPU and TPU access _ Begin by clicking on the Notebooks tab on the competition page. _If your cursor is in the right place you ll notice a blue vertical line to the left of the gray box. png Your first lines of codeWhen you start a new notebook it has two gray boxes for storing code. Then click on I Understand and Accept to indicate that you will abide by the competition rules. Once all of the code runs successfully all of the data in train. It s very important that you see this output in your notebook before proceeding with the tutorial _If your code does not produce this output_ double check that your code is identical to the two lines above. png Once your file is successfully submitted you should receive a message saying that you ve moved up the leaderboard. csv and 3 gender_submission. png The first code cell already has some code in it. if it s a 0 the passenger died. png Next click on Create. _If you see a Submit Predictions button instead of a Join Competition button you have already joined the competition and don t need to do so again. png This takes you to the rules acceptance page. Once you re ready click on the blue Save Version button in the top right corner of your notebook. Then click on New Notebook. At this point you should have at least three code cells in your notebook. csv you have to predict whether the other 418 passengers on board in test. The code above calculates the percentage of female passengers in train. com learn intro to machine learning course to generate even better predictions Check out the Intermediate Machine Learning https www. Begin by clicking on the download link to the right of the name of the file. Then run the code below in another code cell The code above calculates the percentage of male passengers in train. To run this code put your cursor in the code cell. This model is constructed of several trees there are three trees in the picture below but we ll construct 100 that will individually consider each passenger s data and vote on whether the individual survived. The NotebookThe first thing to do is to create a Kaggle Notebook where you ll store all of your code. And make sure your cursor is in the code cell before hitting Shift Enter. Copy this code into your notebook and run it in a new code cell. This shows us where the competition data is stored so that we can load the files into the notebook. csv file before generating predictions for the passengers in test. Then once you re done either click on the blue play button or hit Shift Enter. In a few seconds your submission will be scored and you ll receive a spot on the leaderboard. The challengeThe competition is simple we want you to use the Titanic passenger data name age price of ticket etc to try to predict who will survive and who will die. _ Scroll down to Step 1 Upload submission file. The code also saves these new predictions in a CSV file my_submission. csv under the Data Sources column to examine its contents. png You can view all of the data in the same window. a Survived column that you will create with a 1 for the rows where you think the passenger survived and a 0 where you predict that the passenger died. com learn intermediate machine learning course to learn about more advanced techniques Have questions or comments Visit the course discussion forum https www. From this you can see that almost 75 of the women on board survived whereas only 19 of the men lived to tell about it. Change it to something more descriptive like Getting Started with Titanic. Your first submissionAs a benchmark you ll download the gender_submission. To investigate this data click on the name of the file under the Data Sources column on the left of the screen. Below you can see the same code that you just ran along with the output that you should see in your notebook. png The code cell below looks for patterns in four different columns Pclass Sex SibSp and Parch of the data. But some of the work was already completed for you since you were provided a notebook with partially completed code. Explore a patternRemember that the sample submission file in gender_submission. Click on the ellipsis. In the final exercise of the Intro to Machine Learning https www. He was 22 years old when he died on the Titanic. In the top left corner you can see the name of your notebook something like kernel2daed3cd79. Then scroll down to find the list of files. _This button now appears where the Join Competition button was. We refer to these gray boxes as code cells. csv is loaded in the notebook. The dataTo take a look at the competition data click on the Data tab at the top of the competition page. If you re not already familiar with Python and pandas the code shouldn t make sense to you but don t worry The point of this tutorial is to quickly make your first submission to the competition. Then the random forest model makes a democratic decision the outcome with the most votes wins https i. csvThe gender_submission. It predicts that all female passengers survived and all male passengers died. csv contains the details of a subset of the passengers on board 891 passengers to be exact where each passenger gets a different row in the table. png Copy the code below into the third code cell of your notebook to load the contents of the test. Great work Part 4 Keep learning Can you use what you learned about random forests in the Intro to Machine Learning https www. _Don t change the default settings so Python should appear under Select language and you should have Notebook selected under Select type. csv is not a bad first guess and it makes sense that it performed reasonably well But at the end of the day this gender based submission bases its predictions on only a single column. png This downloads the file to your computer. As you can imagine by considering multiple columns we can discover more complex patterns that can potentially yield better informed predictions. It constructs the trees in the random forest model based on patterns in the train. Your code should return the output above which corresponds to the first five rows of the table in train. png Type the two lines of code below into your second code cell. Again don t worry if this code doesn t make sense to you For now we ll focus on how to generate and submit predictions. csv file into the notebook. To do this we needed to plug in the location of the file which we saw was kaggle input titanic train. csv that help us predict whether the passengers in test. csv file and submit it to the competition. png Your notebook will take a few seconds to load. Is this a reasonable first guess We ll check if this pattern holds true in the data in train. Since it is quite difficult to consider several columns at once or it would take a long time to consider all possible patterns in many different columns simultaneously we ll use machine learning to automate this for us. png The values in the second column Survived can be used to determine whether each passenger survived or not if it s a 1 the passenger survived. com c titanic and click on the Join Competition button if you haven t already. csv and all 418 rows of test. It might initially feel overwhelming to look for patterns when there s so much data to sort through. csv assumes that all female passengers survived and all male passengers died. ", "id": "alexisbcook/getting-started-with-titanic", "size": "13300", "language": "python", "html_url": "https://www.kaggle.com/code/alexisbcook/getting-started-with-titanic", "git_url": "https://www.kaggle.com/code/alexisbcook/getting-started-with-titanic", "script": "sklearn.ensemble pandas numpy RandomForestClassifier ", "entities": "(('passenger', 'rows'), 'column') (('gender', 'submission gender_submission'), 'seem') (('This', 'notebook'), 'generate') (('submission', 'test'), 'have') (('individual', 'individually data'), 'be') (('you', 'output'), 'list') (('you', 'team maximum size'), 'govern') (('benchmark you', 'gender_submission'), 'download') (('code', 'train'), 'run') (('It', 'train'), 'use') (('double code', 'two lines'), 's') (('you', 'kernel2daed3cd79'), 'see') (('you', 'gray box'), '_') (('a passenger', 'second column'), 'png') (('it', 'Save Version button'), 'finish') (('It', 'python docker image https kaggle github'), 'come') (('dataTo', 'competition page'), 'take') (('we', 'competition page'), '_') (('who', 'etc'), 'be') (('which', 'keyboard'), 'hit') (('only 19', 'it'), 'see') (('you', 'competition rules'), 'click') (('code', 'CSV file'), 'save') (('it', 'code'), 'png') (('you', 'Kaggle competition'), 'explore') (('you', 'notebook'), 're') (('notebook', 'load'), 'png') (('png', 'test'), 'Copy') (('where you', 'code'), 'be') (('It', 'train'), 'construct') (('you', 'Machine Learning https www'), 'work') (('simultaneously we', 'us'), 'be') (('you', 'notebook'), 'have') (('you', 'leaderboard'), 'png') (('Then you', 'Shift Enter'), 'do') (('option', 'Save then blue button'), 'ensure') (('Join Competition instead you', 'don need'), '_') (('Notebook', 'Select type'), 'change') (('based submission', 'only single column'), 'be') (('you', 'test'), 'have') (('which', 'train'), 'return') (('png', 'code below second cell'), 'Type') (('all', '891 train'), '_') (('code', 'output'), 'make') (('It', 'initially patterns'), 'feel') (('successfully three lines', 'output'), 'return') (('first machine', 'forest model https random www'), 'build') (('This', 'screen'), 'pull') (('We', 'code cells'), 'refer') (('we', 'file'), 'need') (('Load', 'file locations'), 'appear') (('com', 'Intermediate Machine Learning https www'), 'learn') (('Once all', 'train'), 'run') (('cursor', 'Shift Enter'), 'make') (('probably which', 'submission different file'), 'be') (('learning course you', 'Kaggle competition'), 'learn') (('outcome', 'https i.'), 'make') (('Part 2 coding environmentIn section you', 'predictions'), 'walk') (('you', 'Python programming just language'), 'be') (('output', 'notebook'), 'forget') (('22 years when he', 'Titanic'), 'be') (('don t point', 'competition'), 'make') (('code cell', 'Pclass Sex data'), 'png') (('png You', 'same window'), 'view') (('png You', 'it'), 'edit') (('how highly you', '3 gender_submission'), 'have') (('they', 'Columns heading'), 'list') (('us', 'test'), 'csv') (('same message', 'submission'), 'make') (('how you', 'predictions'), 'provide') (('where passenger', 'table'), 'contain') (('com', 'other learners'), 'learn') (('You', 'order'), 'accept') (('we', 'how predictions'), 'worry') (('you', 'partially completed code'), 'complete') (('you', 'first submission'), 'get') (('you', 'leaderboard'), 'score') (('that', 'potentially better informed predictions'), 'discover') (('we', 'learning'), 'suggest') (('first thing', 'competition page https www'), 'join') (('more advanced techniques', 'course discussion forum https www'), 'learn') (('code first cell', 'it'), 'png') (('You', 'computer'), 'use') (('you', 't'), 'titanic') (('read_csv Input data files', 'the'), 'be') (('This', 'computer'), 'png') (('we', 'notebook'), 'show') (('This', 'rules acceptance page'), 'png') (('you', 'notebook'), 'see') (('pattern', 'train'), 'be') (('We', 'competition https Titanic www'), 'use') (('code', 'train'), 'calculate') (('we', 'train'), 'improve') ", "extra": "['gender', 'outcome', 'test']"}