{"name": "herbarium 2021 pytorch starter weights biases ", "full_name": " h2 Disclaimer h1 Table of Content h1 Packages and Basic Setup h1 Label Encoder h1 Dataset DataLoader and K Fold h2 Image Augmentation h2 StratifiedKFold h1 The Model u200d h2 Transfer Learning h2 Resnet18 h1 Training h1 Resources ", "stargazers_count": 0, "forks_count": 0, "description": "Training Training Packages and Basic SetupIn the following hidden code cell we Import the required libraries Main ones being torch https pytorch. com stratified k fold what it is how to use it cf3d107d3ea2 Weights and Biases Getting Started https wandb. If the transform bool is set to True we apply the transforms. Tensor StratifiedKFoldStratified kfold cross validation is an extension of regular kfold cross validation but specifically for classification problems where rather than the splits being completely random the ratio between the target classes is the same in each fold as it is in the full dataset. Think of an Artifact as of a folder of data to which we can add individual files and then upload to the cloud as a part of our W B project which also supports automatic versioning of datasets and models. Label Encoder label encoder 3. Each element of our dataset returns Image Encoded Label Image Augmentation Applying Standard Image Augmentation Techniques such as Resize Normalize and conversion to torch. Resources Logging Tutorial Series by Corey Schafer Video 1 Python Tutorial Logging Basics Logging to Files Setting Levels and Formatting https youtu. com yasufuminakama herbarium 2020 pytorch resnet18 train Table of Content1. Artifacts also track the training pipelines as DAGs. DisclaimerThis kernel is heavily inspired from yasufuminakama https www. be jxmzY9soFXg Stratified K Fold What It Is How to Use It https towardsdatascience. Here s an example of a artifacts graph. gif The Model Transfer LearningThe main aim of transfer learning TL is to implement a model quickly i. be Y7rjzfpWSo8 Import Statements To set Random Seed for Reproducibility For Image Processing For Reading in the JSON file The Main Machine Learning Framework To set Random Seed for Reproducibility For Event Logging For LabelEncoder and Metrics For creating a pretrained model For Numerical Processing For creating DataFrames For Image Augmentations For Creating ProgressBar For the Label Encoder For Converting to torch. All Dataset objects in pytorch represent a map from keys to data samples. You can store different versions of your datasets and models in the cloud as Artifacts. Dataset DataLoader and K Fold data 4. Resnet18A residual network or ResNet for short is a DNN that helps to build deeper neural networks by utilizing skip connections or shortcuts to jump over some layers. Dataset DataLoader and K FoldThe following code cell aims to convert the Herbarium dataset into a torch torch. org torchvision https pytorch. html and sklearn https scikit learn. org stable modules generated sklearn. Training looping over our data iterator and feed the inputs to the network and optimize. The Herbarium 2021 Half Earth Challenge is to identify vascular plant specimens provided by the New York Botanical Garden NY Bishop Museum BPBM Naturalis Biodiversity Center NL Queensland Herbarium BRI and Auckland War Memorial Museum AK. html Print the device configuration Set Random Seed to ensure reproducibility Create a Logger https docs. We choose to use StratifiedKFold because we have some class imbalance in our Dataset. Logger Instance Logging Into Weights and Biases Basic Parameters for the Model Create a Instance of LabelEncoder Fits the label encoder instance To Transform labels to normalized encoding Only allows transforms for train and valid Data Transformations for Training set Data Transformations for Validation set For Debugging Create a seperate train_labels variable Create StratifiedKFold Instance Creating Splits Exporting to CSV save it as model artifact on W B Creating Train and Valid sets Create Training Dataset Create Validation Dataset Creating a instance of a Resnet18 pretrained Model Add a Adaptive Average Pooling Layer Add a Fully connected Layer with N_CLASSES as the output dimension moves the model to the device Creating Optimizers and Schedulers Loss Function Sets the model in training mode Sets gradients of all model parameters to zero Move Image and Labels to device Forward Pass Calculate Loss Log our Training Loss to W B Backpropagation Update Average Loss Set Model in Eval mode Move Image and Labels to device To perform inference without Gradient Calculation Calculate Loss Log our Validation Loss to W B Update Average Validation Loss Updates Learning Rate wrt to the Average Validation Loss Calculate F1 Score Log our F1 Score to W B Prints Stats Update Best Score. We create a subclass which overwrites the __getitem__ and __len__ method for it to work well with the torch. It takes a lot of time to generate folds that s we use Weights and Biases Artifacts to store our folds. In the __getitem__ method we use df. org 3 library logging. preprocessing in order to encode target labels with value between 0 and n_classes 1. This helps solve the problem of vanishing gradients. There are different versions of ResNet including ResNet 18 ResNet 34 ResNet 50 and so on. instead of creating a DNN dense neural network from scratch the model will transfer the features it has learned from the different dataset that has performed the same task. ai site getting started Compete More Effectively on Kaggle using Weights and Biases https youtu. Tensor For Cross Validation Device Configuration Setting RandomSeed for Reproducibility Creating a logger Specify the format Create a StreamHandler Instance Create a FileHandler Instance Create a logging. 5M images representing nearly 65 000 species from the Americas and Oceania that have been aligned to a standardized plant list LCVP v1. com yasufuminakama s kernel from last year s competition Herbarium 2020 PyTorch Resnet18 train https www. values to get the file_name and then use cv2 to read the image. Packages and Basic Setup packages 2. The Model Model 5. The Herbarium 2021 Half Earth Challenge dataset includes more than 2. The numbers denote layers although the architecture is the same. This transaction is also known as knowledge transfer. be ARI4Cz awo Video 2 Python Tutorial Logging Advanced Loggers Handlers and Formatters https youtu. png In the end we just add a Adaptive Pooling Layer and a Fully Connected Layer with output dimensions equal to the number of classes. html for Event LoggingAs we can see the DataFrame contains the following columns file_name str Contains the Relative Path to the Images height int The Height of the Image width int The Width of the Image id int The Image ID license int Either 0 1 or 2 category_id int Our Target Variable determining the species corresponding to the Image Label EncoderWe use the LabelEncoder https scikit learn. ", "id": "sauravmaheshkar/herbarium-2021-pytorch-starter-weights-biases", "size": "5397", "language": "python", "html_url": "https://www.kaggle.com/code/sauravmaheshkar/herbarium-2021-pytorch-starter-weights-biases", "git_url": "https://www.kaggle.com/code/sauravmaheshkar/herbarium-2021-pytorch-starter-weights-biases", "script": "init_logger __init__ albumentations.pytorch get_transforms UserSecretsClient numpy __getitem__ tqdm # For Creating ProgressBar TrainDataset(torch.utils.data.Dataset) preprocessing # For the 🏷 Label Encoder sklearn sklearn.model_selection pandas __len__ StratifiedKFold # For Cross Validation tqdm seed_torch ToTensorV2 # For Converting to torch.Tensor kaggle_secrets ", "entities": "(('we', 'Dataset'), 'choose') (('Artifacts', 'DAGs'), 'track') (('_ _ _ len _ _ it', 'well torch'), 'create') (('Half Earth Challenge Herbarium 2021 dataset', 'more than 2'), 'include') (('it', 'full dataset'), 'be') (('Model Transfer LearningThe main aim', 'model'), 'gif') (('It', 'https towardsdatascience'), 'fold') (('that', 'same task'), 'transfer') (('architecture', 'layers'), 'denote') (('we', 'folds'), 'take') (('that', 'plant standardized list'), 'image') (('This', 'vanishing gradients'), 'help') (('Dataset objects', 'data samples'), 'represent') (('transaction', 'knowledge also transfer'), 'know') (('it', 'https wandb'), 'stratify') (('DisclaimerThis kernel', 'yasufuminakama https heavily www'), 'inspire') (('we', 'transforms'), 'apply') (('Dataset DataLoader', 'torch torch'), 'aim') (('Set', 'Logger https docs'), 'Print') (('You', 'Artifacts'), 'store') (('Learning Rate', 'Stats Update Best Score'), 'log') (('which', 'datasets'), 'think') (('element', 'torch'), 'Image') (('Main ones', 'required libraries'), 'training') (('Tensor', 'logging'), 'specify') (('Half Earth Herbarium 2021 Challenge', 'New York Botanical Garden NY Bishop Museum BPBM Naturalis Biodiversity Center NL Queensland Herbarium BRI'), 'be') (('we', 'classes'), 'png') (('determining', 'LabelEncoder https scikit'), 'html') (('that', 'layers'), 'be') ", "extra": "[]"}