{"name": "hubmap final methodology submission ", "full_name": " h1 Introduction h2 About our team deeplive exe h2 Thanks to the organisers h1 Part 1 Data challenges h2 Data quality variation h2 Non Sclerotic Sclerotic and Fibrous Crescent Glomeruli h2 Missing annotation and AI guided labeling h1 Part 2 Solution Overview h2 Augmentations Data h3 Image sizes h3 Sampling strategy h3 Augmentation strategy h2 External data h2 Model architecture h2 Training setup h1 Part 3 Results h2 Performance assessment h2 Limitations h2 Confidence estimation h1 Part 4 Other applications and images h2 Histological slides of any kind h2 Other imaging domains Line field confocal optical coherence tomography LC OCT h3 Segmenting 2D LC OCTs h3 Towards 3D segmentation of LC OCT images h1 Conclusions ", "stargazers_count": 0, "forks_count": 0, "description": "gov 30353716 is a new non invasive medical imagingtechnology that allows to explore the skin in vivo. Segmenting 2D LC OCTsWe adapted our pipeline to the task of keratinocytes nuclei KCs segmentation. As an example we report performances on 2f6ecfcdf see Fig 6 The dice score is 0. Augmentation strategyTo address the aforementioned data quality issues we use aggressive data augmentation whichincludes Brightness and Contrast changes RGB Shifting Hue Saturation and Value shifting Color Jittering Artificial blurring Motion blur Gaussian blur and Defocus blur CutMix and MixUp in some experiments applied with 50 probabilityIn addition we leverage invariance in the data we randomly flip rotate shift and scale the tiles. Also since our approach uses two classes our model can also be used to provide a score for scleroticglomeruli. This pipeline also works with en face LC OCT images we trained a second model for this other task see Fig 12 and 13. Using averaging of the predictions on the two axes en coupe and en face we are able to retrieve the 3D structure of cells see Fig 14. Kidney glomeruli ROIs dataset from zenodo https zenodo. Towards 3D segmentation of LC OCT imagesAs mentioned above LC OCT allows to view 3D stacks enabling a higher level of information than histology. This approach is built on understanding the challenges behind the data It takes in consideration the link between healthy glomeruli and unhealthy ones Sclerotic Fibrous Crescent etc. Onecomponent of this overarching goal is to identify medically relevant functional tissue units FTUs withinwhole slide microscopy images of human tissues. To thisextent we put emphasis on glomeruli level metrics. 940 in 3 hours of training using a relativelycheap setup. In fact once thesegmentations are generated see Fig 10 and 11 one can generate quantitative metrics on top of them. However this jump was due to label ambiguity in the external data the publicly available labels https www. Training setupFor the training setup we adopt practices acquired from previous competitions that we know workwell The cross entropy loss is used as a loss function it is simple but efficient. 2 weight for the unhealthy class. As aresult it is hard to robustly assess their performance which in our opinion is a big issue for medicalimaging tasks. We performed a hand annotation of the provided data to create masks for unhealthyglomeruli. Models are trained for at least 10000 iterations using the largest batch size that fits on a 2080Ti with half precision. Moreover the ability ofthe model to detect unhealthy glomeruli may be helpful for practical use cases. However the level of injury is on a continuous scale and there is a number of annotated glomerulithat have defects. Then the human can verify cases of disagreement between him andthe AI annotation to correct possible errors. Our model predicts two glomeruli classes healthy unhealthy we use a 0. It is designed to be robust to noise as we used aggressive augmentations. The size of the WSI range between 21651x10498 pixels and 49799 x 32359 pixels. 03144 Bottleneck Transformer central block 4 https arxiv. We also presented a framework to assess the model performance using glomeruli level prediction. Specifically such quality issuescan be found both in train and test datasets and the built models therefore should be robust tounexpected image changes. 11605 to expand the receptive field of the modelHowever since the problem considered in this competition is rather related to making a decision onwhether or not to include a particular glomerulus in the produced mask than to create of a highlyaccurate segmentation the choice of the decoder architecture is not critical since the encoder takescare about most of the decision task. More importantly such mistakes can affect medical diagnostic and therefore human lives. com datasets k7nvtgn2x6 3 the same way. These images were annotated with pseudo labels generate by our model. The problem differs a lot from the task ofsegmenting glomeruli more cells smaller cells but our pipeline adapts well to it. by predicting both into two different classes. Furthermore our model is able to provide a confidence score estimation which could help practicians in their decision making. We also hope that a lot of people will benefit from the effort the hosts the Kaggle team the participants and us put into the competition. org not included into train test data and 5 images from public test set of this challenge. Sampling strategyTo speed up the convergence we used sampling strategies that automatically select interesting tilesbased on the tissue annotation or having visible glomeruli in them. Part 2 Solution OverviewFor simplicity we do not include the training code in the notebook. Among the few mistakes it is sometimes hard fornon expert to tell whether the model is wrong or if the label is missing such as the b2dc8411c example see Fig 7. exe Theo Viel theoviel is one of the three French Kaggle Competitions Grandmaster andcurrently ranks 17. However the model we used does not directly output a confidence score since we usesemantic segmentation instead of instance segmentation. com leahscherschel dataset details by organizers ofthis challenge. ResNeXt50 in our experiments. To illustrate this we present results on the task ofsegmenting nucleus cells in LC OCT images. com c hubmap kidney segmentation discussion 228993 that globally sclerotic glomeruli were excluded from the annotation. Part 1 Data challengesIn this section we highlight the key challenges provided by the competition data to build a practicallyusable model. In all cases the model continues giving meaningful predictions missing only oneglomerulus in the aa05346ff. 2 publicly available kidney PAS stained microscopy images from the HubMAP portal https portal. Meanwhile the drasticdifference between the cross validation CV score of the model of 0. Below we provide an overview of the main data challenges arising in this taskas well as a brief solution description and a list of external data used to build our models. We observed a firstleaderboard jump on April 13 when our models started predicting fibrous crescent glomeruli. Overall we are able to reach a leaderboard score of 0. In addition we manually labeled unhealthy glomeruli in the images from the test set. Thanks to the organisersWe would start by thanking the organizers and the Kaggle team for hosting this competition. 08790 did not provide better performance in the considered task. However this allowed us to be detect annotation mistakes more consistently. Since keratinocytes are 3D as well it makes sense to use our predictions at a 3D level. In our experiments we saw that even the naivest decodersachieve good performance although they are slower to converge. 9610 There are 160 glomeruli 3 glomeruli are missed There are 6 false positive Detection score 160 160 3 6 94. We noticed that surprisingly image resolution does not really play a noticeable role. To mitigate the impact of unhealthy glomeruli detection on the model performance we have built a 2 class model performing detection of both healthy and unhealthy glomeruli. He currently works as a Computer Vision Researcher at DAMAE Medical where heuses his modeling skills to improve the understanding of healthy and pathological skin. To make sure that the information about the areas not covered by the abovesampling is also learnt we only enforce the chosen strategy 90 of the time. For instance assessing the number size and shape of the keratinocytes will definitely help diagnose diseased skin. Our model architecture is relatively simple and the pipeline can be easily transferred to other very different segmentation tasks such as keratinocytes segmentation in LC OCTs. Each of these methods outperformedrandom sampling. 7 However this metric is not robust to annotation noise. Several examples ofaugmented images are illustrated below Fig 4. 7 were often caused by hard cases. Part 3 ResultsThe validation scheme we used is a 5 fold split per image. Performance assessmentIn fact the dice score is not ideal to assess how well our models are working. The Lovász loss 5 https arxiv. This framework enables a speed up of the tedious histology reviewing work which is highly beneficial as we believe that the time of experts is very valuable. We incorporate several external datasets in our pipeline and manually annotated them using 2 classes of glomeruli to ensure that our model is able to generalize well on new cases. As an illustration we plot model predictions on parts of the aa05346ff and afa5e8098 images from test and train datasets respectively which include regions affected byluminosity contrast and blur issues. Part 4 Other applications and images Histological slides of any kindThe method used by our team is suitable for any type of histological slide. aswell as a different time passed after glomeruli degradation and similarity of degraded glomeruli withother nephron components makes detection of unhealthy glomeruli extremely challenging. About our team deeplive. It is not clear what should be a fraction of fibrous tissue to stop considering a glomerulus to be healthy. In all cases the tiles weredynamically selected during training from preloaded downsized images into RAM. As a proxy for this score we use themaximum pixel prediction over the glomeruli see Fig 8. Overall a high confidence score indicates that the prediction is almost certainly correct. Moreover the model is able to predict masks for glomeruli in the darkregion of afa5e8098 even if the ground truth masks were intentionally excluded during annotationbecause of the insufficient image quality see Fig 1. Keratinocytes contain a lotof information about the skin some diseases and cancers affect keratinocytes. To achieve this objective we trained our models with an extensive imageaugmentation including MixUp 1 https arxiv. The skip connectionsbetween the encoder and the decoder allow effective use of features from the intermediate convolutionallayers of the decoder without a need for the information to go the full way through the entire model. One example of an FTU which is in the focus of this competition is the glomerulus found in the outerlayer of kidney tissue. They slightly outperformed networks fromResNet family e. One more layerof complexity meanwhile is added by the fact that not all glomeruli are healthy. In2019 he has received his PhD degree from the University of Virginia USA in Applied Physics. 001 during the first 500 iterations and then decreased linearly to 0. In fact only the dataaugmentation strategy is specific to histology. In fact the image level dice is too coarse to entirely capture the challenge of the problem. External dataFor building our model in addition to the provided train data we utilized kidney histopathological imagesfrom several additional sources. The modelemploys the information that an unhealthy glomerulus is also a glomerulus. The original annotation consists of two classes similar to ones we used for DATASET_A. Segmenting themmanually is a long and tedious task and with automated segmentation we hope to accelerate thescreening of patients and automatically provide the dermatologist with useful insights. Leah Scherschel one ofthe competition hosts pointed out https www. 5x larger tiles and then take the center crop. The annotations were missing a number of glomeruli mostly at image edges so we manually added them. Other imaging domains Line field confocal optical coherence tomography LC OCT With minor changes our pipeline can be used with completely different images. We primary worked on optimization of our validationdice score we assume this metric will correlate the best with the private leaderboard. org about is aiming to create an open global atlas of the humanbody at the cellular level to accelerate understanding of the relationships between cell and tissueorganization their functions and human health. 09412 which helps distinguishing glomeruli from the background inregions affected by image artefacts. com c hubmap kidney segmentation discussion 208972 for DATASET_A include both healthy and unhealthy glomeruli as a single class so we decided to focuson optimizing the performance on the other test images excluding d488c759a starting from April 30 as show in Fig 5. Still from the images above we can identify a few choke points of our models Glomeruli predictions sometimes do not look round but have complex shapes see images 2 and 4 in Fig 7 Predictions have some artefacts The model struggles with glomeruli with a large empty space in them Despite our model being good at differentiating sclerotic from non sclerotic glomeruli it still predicts some sclerotic ones as we mentioned earlier the level of injury is on a continuous scale and sometimes it may be difficult to distinguish the cases We believe post processing can be the key to remove some of the flaws of the model but could notdevelop a reliable strategy that consistently improves our validation score. Webelieve that leveraging Artificial Intelligence in medical imaging will play a key role in improving theoverall understanding of the human body. HuBMAP will create the next generation of molecularanalysis technologies and computational tools enabling the generation of foundational 3D tissue mapsand construction of an atlas of the function and relationships among cells in the human body. Then we switched to 512x512 tiles size at resolution 4 to ensure that sufficientglomeruli surrounding is included into the input. Model architectureFor glomeruli segmentation we chose a U Net like network architecture 2 https arxiv. Another drastic example is annotation of FC glomeruli in d488c759a image from the test set andabsence of such annotation in other provided images. Once these FTUs are detected information on size shape variability in number and location within the tissue samples can be used to help in building aspatially accurate and semantically explicit model of the human body as pointed out https www. Non Sclerotic Sclerotic and Fibrous Crescent GlomeruliOne of the challenges of glomeruli detection is the significant variation of tissue peculiarities from onepatient to another which is deteriorated by the various tissue processing methods used. Overall to improve model performances we spent a lot of time visualizing predictions since hand craftedmetrics were not reliable enough. In addition our final models were trained for tile sizeof 512x512 extracted at resolution 2 and 768x768 extracted at resolution 3. The objective of this challenge is thesegmentation of regions with glomeruli in human kidney tissue images across different tissuepreparation pipelines. ConclusionsWe have presented our approach to the HuBMAP Hacking the Kidney Competition. IntroductionThe Human Biomolecular Atlas Program HuBMAP https hubmapconsortium. It is straightforward to adaptit to any semantic segmentation task provided there is data available. Given the large variety ofglomeruli defects and insufficient expertise in the field we decided to course grain all the unhealthy glomeruli into asingle class. 63 for healthy andunhealthy glomeruli respectively indicates that the task of detection of glomeruli with defects issignificantly more complicated than the one considered in this challenge. We tried removing false positive using low confidence predictions but it did not work consistentlyenough. It consists of 31 whole slide images that provides a significant variability and ensures better generalization. Data quality variationBecause of the nature of the data it is very likely that images have artefacts. However since rotating scaling and shifting an image introduces side effects at edges we performaugmentation on 1. Thus the model could become familiar with artefacts precent in the test set. Beyond that Maxim has an extensive experience in more than 15 computer vision relatedprojects ranging from cancer grade assessment based on biopsies and pneumothoraxsegmentation to deepfake detection satellite image segmentation and few shot learning. Initial experiments were performed for tilesof size 256x256 extracted from images downsized by 4 times resolution 4 which enabled fast trainingand rapid prototyping. com Optimox HubMap Augmentations Data Image sizesWe worked with several image resolutions and tile sizes a tile is a cropped image from the original image used for training and inference for the model. We noticed that this was a good estimation of howconfident the model was and that low scores 0. We manually labeled this dataset with 2 class masks healthy detected in this challenge and unhealthy glomeruli using QuPath program. We hope that our work will help to understand the relationships between glomeruli and the health of an individual. His Kaggle achievements gave him a lot of experience in Computer Visionand NLP. This score can be used to assess the evolution of the disease helping the practician todifferentiate between an healthy and an unhealthy patient. The learning rate is linearly increased up to 0. Finally we applied the developed method for segmentation of nucleus cells in Line field ConfocalOptical Coherence Tomography LC OCT images and provide the main conclusions of our work. Indeed PAS kidney images are quite hard to acquire and a lot of variability can be observed. The overall idea behind it is that we wantthe models to generalize well to unseen images. Then achieving decentperformances is only a matter of tunning the hyperparameters. Some of our models do not actually use this data. One of the possible solutions is using a deep learning model working together with a human on asample analysis and annotation. In our pipeline we use the commonly used EfficientNet encoders. Confidence estimationAs mentioned above glomeruli detection made more sense to use for assessment of modelperformance. Specifically we used this strategy to correct severalmistakes in the provided annotation of train data as illustrated in Fig 3. In our predictions we characterize glomeruli usingconnected components of the mask. Glomeruli perform filtration of waste products out of blood and are representedby three dimensional blocks of cells centered around a capillary such that each cell in this block iswithin diffusion distance from any other cell in the same block. Furthermore the pipeline also workswith multiclass problems since we built the additional unhealthy glomeruli class. If a practicianwere to manually verify all glomeruli he she would know that these ones are not worth spending a lotof time on. We considered several options to improve the decoder Feature Pyramid Networks FPN skip connections 3 https arxiv. Those missed masks negatively impact training and unfortunately the modelevaluation. The images are black and white which changes fromthe histology but it allows to retrieve almost the same information with the advantage of being non invasive and allowing for 3D acquisitions see Figure 9. Because one ofthe images in the public dataset d488c759a has a number of Fibrous Crescent glomeruli annotated we quickly realized that this image made leaderboard unreliable and not representative. By leveraging true positive false positive and false negative rates at glomeruli level we are able to understand the weaknesses of the model. Sebastien Fischman Optimo is a 30 year old French Computer Vision Researcher atDAMAE Medical. So during training the model is less affected by the noise resulted byincluding excluding a particular instance to the healthy glomeruli class annotated originally. Variety of glomerulidefects including Fibrous Crescent FC Epithelial Crescent Glomerulosclerosis Necrosis etc. DATASET_A from data. LimitationsOne of the challenges of this competition is label noise it is really difficult to evaluate models. com datasets k7nvtgn2x6 3 with some of them being similar to annotated instances in the provided train data. The code will be cleaned documented and made publicly available on GitHub https github. For example Figure 3 below indicates several glomeruli missed during annotation but recognizedby the model. In addition we hand labeled the external data from data. In this competition participants are not asked to detect unhealthy glomeruli. Smaller models are trained for longer especially if MixUp CutMix augmentations are used. Segmentation labelsare quite noisy and we believe it is more important to detect glomeruli than segment them. The figure Fig 2 below indicates several examples of unhealthy glomeruli from data. Maxim Shugaev Iafoss is a Computer Vision Researcher at Intelligent Automation Inc. Before working with medical images he had several Machine Learningexperiences on very different topics ranging from Auto Machine Learning stock marketpredictions using sentiment analysis based on Tweets add retargeting and user segmentations. Then the challenge is on the few 10 glomeruli with low scores which can be visuallychecked. Missing annotation and AI guided labelingOne of the difficulties with hand annotation of data is that a human despite having the ability tocorrectly treat difficult cases sometimes may not pay enough attention and miss several instances. This architecture consists ofan encoder creating a representation of extracted features at different levels and a decoder whichcombines the features and generates a prediction as a segmentation mask. The uncertainty of including a particularglomerulus in the mask predicted by the model rather than detection of glomeruli healthy unhealthy is the major factor degrading the model performance. com datasets k7nvtgn2x6 3. Furthermore it achieves competitive performances on the leaderboard even though label noise makes it difficult to tell whether the results will translate well to the private leaderboard. LC OCT https pubmed. Next wediscuss the main results and the limitations of the proposed approach including confidence estimation. ", "id": "theoviel/hubmap-final-methodology-submission", "size": "22979", "language": "python", "html_url": "https://www.kaggle.com/code/theoviel/hubmap-final-methodology-submission", "git_url": "https://www.kaggle.com/code/theoviel/hubmap-final-methodology-submission", "script": "pyplot pyplot as plt plot_image matplotlib ", "entities": "(('we', 'Fig'), 'see') (('results', 'well private leaderboard'), 'achieve') (('Sclerotic Fibrous unhealthy Crescent', 'healthy glomeruli'), 'build') (('pipeline', 'well it'), 'differ') (('We', 'Feature Pyramid FPN skip https 3 arxiv'), 'consider') (('Figure', 'model'), 'indicate') (('6 false positive Detection', '6 160 3 94'), '9610') (('we', 'unseen well images'), 'be') (('label', 'Fig'), 'be') (('figure', 'data'), 'indicate') (('also we', '90 time'), 'make') (('face we', 'Fig'), 'be') (('30353716 new non invasive medical that', 'vivo'), 'be') (('so we', 'manually them'), 'add') (('leaderboard', 'Fibrous Crescent glomeruli'), 'have') (('Fig', 'them'), 'see') (('tile', 'model'), 'work') (('we', 'healthy glomeruli'), 'build') (('Then achieving', 'only hyperparameters'), 'be') (('that', 'them'), 'speed') (('they', 'even naivest decodersachieve good performance'), 'see') (('We', 'QuPath unhealthy program'), 'label') (('model', 'use practical cases'), 'be') (('we', 'Fig'), 'work') (('we', 'test set'), 'label') (('we', 'useful insights'), 'be') (('what', 'glomerulus'), 'be') (('very images', 'artefacts'), 'variationbecause') (('ConclusionsWe', 'HuBMAP Kidney Hacking Competition'), 'present') (('image surprisingly resolution', 'really noticeable role'), 'notice') (('model', 'good howconfident'), 'notice') (('uncertainty', 'model healthy unhealthy major performance'), 'be') (('we', 'instance usesemantic instead segmentation'), 'output') (('detection', 'unhealthy glomeruli'), 'make') (('model', 'scleroticglomeruli'), 'use') (('respectively which', 'byluminosity contrast issues'), 'plot') (('which', 'decision making'), 'be') (('assessing', 'definitely diseased skin'), 'help') (('which', 'kidney tissue'), 'be') (('it', 'segment them'), 'labelsare') (('we', '5 image'), 'be') (('However level', 'defects'), 'be') (('images', 'model'), 'annotate') (('Each', 'methods'), 'sampling') (('drastic example', 'other provided images'), 'be') (('we', 'glomeruli additional unhealthy class'), 'workswith') (('org', 'functions'), 'aim') (('we', 'several additional sources'), 'dataFor') (('More importantly such mistakes', 'medical diagnostic'), 'affect') (('label it', 'really models'), 'be') (('which', 'low scores'), 'be') (('we', 'asingle class'), 'decide') (('HuBMAP', 'human body'), 'create') (('dataaugmentation only strategy', 'histology'), 'be') (('it', 'Figure'), 'be') (('we', '1'), 'introduce') (('we', 'https MixUp 1 arxiv'), 'train') (('we', 'DATASET_A.'), 'consist') (('images', 'Fig'), 'ofaugmente') (('ground truth even masks', 'Fig'), 'be') (('MixUp CutMix especially augmentations', 'longer'), 'train') (('However jump', 'external data'), 'be') (('It', 'segmentation semantic task'), 'be') (('Confidence', 'modelperformance'), 'mention') (('Maxim Shugaev Iafoss', 'Computer Vision Intelligent Automation Inc.'), 'be') (('we', 'EfficientNet commonly used encoders'), 'use') (('leveraging', 'human body'), 'webelieve') (('we', 'mask'), 'characterize') (('he', 'Applied Physics'), 'in2019') (('Model architectureFor glomeruli we', 'network https architecture 2 arxiv'), 'segmentation') (('ability', 'several instances'), 'be') (('Then human', 'possible errors'), 'verify') (('which', 'tissue processing various methods'), 'be') (('13 when models', 'crescent fibrous glomeruli'), 'observe') (('Maxim', 'detection satellite image segmentation'), 'beyond') (('which', 'big medicalimaging tasks'), 'be') (('512x512', '2 resolution'), 'train') (('glomeruli', 'meanwhile fact'), 'add') (('that', 'better generalization'), 'consist') (('we', 'LC OCT images'), 'present') (('Some', 'actually data'), 'use') (('it', 'loss function'), 'setupFor') (('relatively pipeline', 'LC OCTs'), 'be') (('model', 'well new cases'), 'incorporate') (('time', 'experts'), 'enable') (('participants', 'competition'), 'hope') (('he', 'user retargeting segmentations'), 'have') (('ones', 'lotof time'), 'know') (('Thus model', 'test set'), 'become') (('unhealthy glomerulus', 'information'), 'modelemploy') (('we', 'model'), 'be') (('org', 'challenge'), 'include') (('We', 'unhealthyglomeruli'), 'perform') (('as well it', '3D level'), 'make') (('it', 'confidence low predictions'), 'try') (('Part 4 Other applications', 'histological slide'), 'be') (('hand craftedmetrics', 'visualizing predictions'), 'improve') (('com c hubmap kidney segmentation 228993 globally sclerotic glomeruli', 'annotation'), 'discussion') (('built models', 'train datasets'), 'find') (('information', 'full way entire model'), 'connectionsbetween') (('score', 'healthy'), 'use') (('competition participants', 'unhealthy glomeruli'), 'ask') (('63', 'challenge'), 'indicate') (('4 sufficientglomeruli', 'input'), 'switch') (('4 which', 'fast trainingand rapid prototyping'), 'perform') (('hand', 'data'), 'label') (('3 some', 'train provided data'), 'dataset') (('diseases', 'keratinocytes'), 'contain') (('such cell', 'same block'), 'perform') (('model', 'aa05346ff'), 'continue') (('Kaggle achievements', 'Computer Visionand NLP'), 'give') (('we', 'glomeruli level metrics'), 'put') (('that', 'half precision'), 'train') (('Specifically we', 'Fig'), 'use') (('healthy we', '0'), 'predict') (('dice 6 score', '2f6ecfcdf'), 'report') (('which', 'image artefacts'), '09412') (('that', 'validation consistently score'), 'identify') (('learning rate', 'linearly up 0'), 'increase') (('Data 1 challengesIn we', 'practicallyusable model'), 'part') (('Thanks', 'Kaggle competition'), 'start') (('we', 'aggressive augmentations'), 'design') (('pipeline', 'completely different images'), 'domain') (('we', 'tiles'), 'address') (('2D LC Segmenting OCTsWe', 'keratinocytes nuclei KCs segmentation'), 'adapt') (('5x larger tiles', 'then center crop'), 'take') (('code', 'GitHub https publicly github'), 'clean') (('metric', 'private leaderboard'), 'assume') (('Finally we', 'work'), 'apply') (('Theo Viel exe theoviel', 'andcurrently 17'), 'be') (('image level dice', 'problem'), 'be') (('work', 'individual'), 'hope') (('We', 'glomeruli level prediction'), 'present') (('One', 'asample analysis'), 'use') (('missed masks', 'negatively training'), 'impact') (('Overall we', '0'), 'be') (('Leah competition one hosts', 'https www'), 'Scherschel') (('so we', 'Fig'), 'include') (('He', 'healthy skin'), 'work') (('architecture', 'segmentation mask'), 'consist') (('Below we', 'models'), 'provide') (('They', 'family fromResNet e.'), 'outperform') (('Part 2 OverviewFor simplicity we', 'notebook'), 'solution') (('objective', 'tissuepreparation different pipelines'), 'be') (('quite lot', 'variability'), 'be') (('encoder', 'decision task'), '11605') (('08790', 'considered task'), 'provide') (('FTUs withinwhole', 'human tissues'), 'be') (('kidney 2 publicly available PAS', 'HubMAP portal https portal'), 'stain') (('information', 'https www'), 'use') (('However metric', 'annotation noise'), '7') ", "extra": "['annotation', 'biopsy of the greater curvature', 'disease', 'organization', 'patient', 'test', 'necrosis']"}