{"name": "indoor navigation complete data understanding ", "full_name": " h1 Indoor Location and Navigation h1 1 Introduction h3 Libraries h3 W Bのセットアップ h1 2 Data Understanding h2 データ読み込み h1 2 KaggleでのGitHub repoの使い方 h4 この素晴らしいトリックを教えてくれたLauraに感謝します h2 Sites h2 いくつのフロアがある h2 Waypoint h2 磁力の強さ h4 mu tesla 1 104 G 磁気誘導の派生単位 h2 WiFi h2 IBeacon Bluetooth h4 dBm decibel milliwatts 絶対的なパワーの指標として使用され 数値が0に近いほど 信号強度が優れていることを意味する h1 3 Understanding the Competition Metric h3 説明 h3 RAPIDS function h1 4 Baseline Model h2 I Light GBM h4 Code Below h3 Training h3 Submission LGBM h2 II XGBoost Faster with RAPIDS h3 Training h3 Submission h1 5 Save W B Submissions and Logs h1 モデルの組み合わせ h1 Specs on how I prepped trained h3 on my local machine ", "stargazers_count": 0, "forks_count": 0, "description": "com location competition indoor location competition 20 パッケージをKaggle環境にコピーします cp r path. com devinanzelmo による this dataset https www. net lightgbm beginner Schema of the Training loop Code Below Training Attention 5番目 のデータフレームでは 大きなエラーが発生しました 平均4個から18個に増えました このケースは モデルがアンダーフィッティングしていると思われるので 考慮しなければなりません 10番目 13番目 21番目のデータフレームも同様に大きなMPEを持っています Submission LGBM II. モデルの組み合わせ Specs on how I prepped trained on my local machine Z8 G4 Workstation 2 CPUs 96GB Memory NVIDIA Quadro RTX 8000 RAPIDS version 0. 75 version 1 Logs from my training 下の行のコメントを外して 自分で投稿してください make_submission xgb_predictions sample_subm name xgb_base. com shin_ishiguro items 8f39aac45acc8363a42e 4. Indoor Location and Navigation 1. Save W B Submissions and Logs We can save the predictions and logs to W B. ai it s free menu Add ons Secrets Add a new Secret label wandb key value wandb API key Install wandb プロジェクトの パーソナル キー を入力してください 私の場合は機密なので 秘密にしておきます We re all set 2. json geojson_map. 17 CPU libraries パターンに一致するすべてのパス名を見つける OpenCV 画像の読み書き リサイズ 反転などの加工 データ可視化 中でmatplotlibを使ってる データ可視化 画像処理 参考 https note. me python pillow basic 画像処理 参考 https qiita. txt 形式で 多くの情報が含まれています たった1つの. input indoor location navigation metadata 5a0546857ecc773753327266 B1 xxxxx. com allunia に感謝します Steps このリンクからrepoをダウンロードする https github. xxx というようなディレクトリ構成 width_meter height_meterを準備する map_info height 204. abs fhat f return intermediate. KaggleでのGitHub repoの使い方 Goal このコンペには GitHub repo https github. csv ファイルで与えられた timestamp で predict the floor と waypoint locations を予測することです Note on data quality 学習用ファイルの中には 最後の改行文字がない行があり 次の行に進んでしまうことがあります この問題をどのように処理するかは ユーザー次第です この問題は テストデータでは見られません データ読み込み Note 提示されたデータは. csv My submission END of EXPERIMENT Submissions Logs Read in data Sample Submission. png floor_info. txt ファイル つまり1つのパス に 126k行以上の情報がありました 1つのファイルごとに情報は異なるので すべてを構造化しようとすると面倒なことになります 2. shape 0 説明上記の式は 以下の数学関数のPython版に過ぎません 競技会で提供されたものです RAPIDS function RAPIDS データサイエンスのための様々な処理を一貫してGPUで行うためのプラットフォームです 参考 https qiita. com location competition indoor location competition 20 が用意されています io_f ファイルの read_data_file 関数を使って情報を読み込めばいいのです こちら側での追加の苦労はありません コピーペーストでコードが乱雑になることもありません この素晴らしいトリックを教えてくれた Laura https www. com supersaiakujin items fc54116df9ca6958a68d プログレスバー __init__ のような特殊なクラスを生成 垂直の場合 水平の場合 wandbにログイン 新規プロジェクトの初期化 ファイル数を確認 実験的にW Bの data understanding にログを残す W Bのサイト参照 参考 https wandb. 53342955266643 width 270. com devinanzelmo indoor navigation and location wifi features からのものです I. Baseline Model Note 前処理されたデータは Devin Anzelmo https www. Understanding the Competition Metric Note 多くのノートブックでは 同じ comp_metric 関数を使用して Evaluation metric を計算していますが 以下のように この変数とその意味を理解するのに少し時間がかかりました そのため 私のように コンペの説明書に書かれている情報を早々に読み飛ばしてしまった人のために 少しだけ情報を共有することにしました def comp_metric xhat yhat fhat x y f intermediate np. Data Understanding train site と floor で構成された学習用パスファイル 各パスファイルには 1つのフロアの1つのパスのデータが含まれる test テスト用のパスファイルで site と floor で構成されています 各パスファイルには 1つのフロアの1つのパスのデータが含まれていますが waypoint x y データ は含まれていません metadata フロアメタデータフォルダ サイトとフロアごとに整理されており フロアごとに以下を含む floor_image. Introduction Goal リアルタイムセンサーによるスマートフォン の室内位置の予測. power xhat x 2 np. ai をご覧ください Training Submission 5. power yhat y 2 15 np. 34143433711995 こんなデータ Title Finally let s plot GitHub functions 磁力の値を取得する ヒートマップの可視化 GitHub Libraries Get WiFi data 無線LANが検出されない位置をフィルタリングする The heatmap The GitHub function Getting the iBeacon data The heatmap END of EXPERIMENT Import Libraries Data Paths for train test files 新しい実験の初期化 LGBM Read in data index_col 指定した列をインデックスとして利用 frac 抽出する行 列の割合を指定できる 1だと100 最後の列を消す which is site_path_timestamp トレーニングとバリデーションデータのサンプルアウト Data Validation Train features targets 75 を練習用 Valid features targets ２５ をテスト用 Model Training n_estimators ツリー 木 の数 num_leaves 最大ツリーリーフ数 モデル検証 予測 Save logs Log MPE of this experiment モデルテストの予測 独自のモデルを作成する場合は 以下の行をコメントアウトしてください Logs from my training 独自のモデルを作成する場合は 以下の行をコメントアウトしてください My submission END of EXPERIMENT Libraries Adjust floor function Initialize new experiment XGB Read in data Erase last column which is site_path_timestamp Sample out training and validation data Data Validation Train features targets Valid features targets Parameters max_depth 決定木の深さの最大値 max_leaves 葉の最大値 u3000tree_method 木構造アルゴリズム grow_policy ツリーに新しいノードを追加する方法 Model Training Model Validation Predictions Save logs Log MPE of this experiment Model Test Predictions 独自のモデルを作成する場合は 以下の行をコメントを外してください xgb_predictions train_xgb train_perc 0. ai honda indoor location kaggle runs 36e88gwf workspace user honda 1ファイルをのぞいてみる リポジトリからカスタム関数をインポート 1つのランダムなファイルで読む 各変数の情報にアクセスできます acce TYPE_ACCELEROMETER 加速度計 acacce_uncalice TYPE_ACCELEROMETER_UNCALIBRATED 加速度計 補正前 ahrs TYPE_ROTATION_VECTOR 回転ベクトル gyro TYPE_GYROSCOPE ジャイロスコープ 物体の角度 姿勢 や角速度あるいは角加速度を検出する計測器ないし装置 ibeacn TYPE_BEACON ビーコン Bluetooth low energyのブロードキャスト通信を利用したiOSの近接通知機能 magn TYPE_MAGNETIC_FIELD 磁力計 magn_uncali TYPE_MAGNETIC_FIELD_UNCALIBRATED 磁力計 補正前 waypoint TYPE_WAYPOINT 歩いた場所 wifi TYPE_WIFI wifi カスタムの行と列の数を作成 1行につき3つまで表示できるようにする 各階のプロットイメージ W Bの data understanding に 実験的にログ出力する 1つの例を見てみよう site 5cd56b64e2acfd2d33b59246 フロア番号のみを抽出 フロアごとに数を表示 W Bの data understanding に実験的にログ出力する GitHub functions サンプルの読み込み タイムスタンプとx y座標の値を返す タイムスタンプの削除 必要なのは座標のみ 例題に沿ったfloor_planを用意する. Light GBM 決定木アルゴリズムに基づいた勾配ブースティング Gradient Boosting の機械学習フレームワーク 参考 https www. importして好きなように使うよし 今から楽しもう Sites site はエンコードされており データが抽出された 建物 を表しています いくつのフロアがある Note この変数は 予測が必要なターゲット変数の1つであるため 非常に重要です W Bのダッシュボードではこのように表示されます Waypoint Note この変数は非常に重要で 我々が予測しなければならないもう一つのターゲット変数です Waypoint 下の図は 1人の人間が1つのサイトの5階を通過する際の 経路 つまり軌跡を示しています かなり歩いて往復しています また この軌跡の 開始点 と 終了点 を見ることができます 磁力の強さ Magnetic Strength 建物内のどの地点も 固有の磁力 を受けています 床や壁 あるいは部屋の周囲にある物体は 3次元空間と 磁気の大きさ の4次元地図を作成します この空間内の任意の点における磁気の大きさは その点におけるx y zの磁気ベクトルを読み取ることで測定できる Note 携帯電話は ユーザーが移動すると 携帯電話が回転すると 磁界の変動を検出します 下の例では waypointの最初の方では磁場が強く 床の左側では磁場が弱くなっています mu tesla 1 104 G 磁気誘導の派生単位 WiFi WiFi Access Points 敷地内のフロアには WiFiアクセスポイントが非常に多く存在します そのため エリアによって信号やその強さが大きく異なります Note 下の例では ルート上にこのようなアクセスポイントがたくさんあることがわかります IBeacon Bluetooth IBeacon ビーコンは モバイルアプリケーションと連動して ユーザーがビーコンから一定の距離に近づいたときにプッシュ通知を行うなど ルールに基づいて特定のメッセージやアクションを起こします Note 下の例の経路には多くのビーコンが設置されていますが iBeaconが全く設置されていない部分も多くあります この部分の精度は低くなる可能性があります dBm decibel milliwatts 絶対的なパワーの指標として使用され 数値が0に近いほど 信号強度が優れていることを意味する 3. XGBoost Faster with RAPIDS Note 今回は GPU上の RAPIDS ライブラリとXGBoostを組み合わせたものをベースモデルの一つとして使用します このオープンソースのライブラリ群についての詳細は こちら https rapids. また 今回のコンペで利用できる GitHub Repository を使って カスタム関数を ノートにコピーペーストせずに 呼び出す方法も学びます Libraries W Bのセットアップ アカウントの作成 https wandb. json Goal このコンペの課題は 与えられたsite pathファイルに対して sample_submission. ", "id": "hondykuma/indoor-navigation-complete-data-understanding", "size": "4761", "language": "python", "html_url": "https://www.kaggle.com/code/hondykuma/indoor-navigation-complete-data-understanding", "git_url": "https://www.kaggle.com/code/hondykuma/indoor-navigation-complete-data-understanding", "script": "show_values_on_bars dataclass  # __init__() のような特殊なクラスを生成 extract_ibeacon_rssi visualize_heatmap extract_magnetic_strength lightgbm adjust_floor UserSecretsClient dataclasses floor extract_wifi_count make_submission extract_wifi_rssi train_xgb tqdm           # プログレスバー _show_on_single_plot seaborn numpy abs plotly.graph_objs sqrt main PIL skimage.color visualize_f abs as abs_g ceil power as power_g io_f Image matplotlib.pyplot skimage io          # 画像処理(参考：https://qiita.com/supersaiakujin/items/fc54116df9ca6958a68d) visualize_trajectory power abs as absolute pandas calibrate_magnetic_wifi_ibeacon_to_position mean_position_error rgb2xyz mean_position_error_gpu tqdm read_data_file cupy rgba2rgb sqrt as sqrt_g ImageOps # 画像処理(参考：https://note.nkmk.me/python-pillow-basic/) show_site_png train_lgbm math kaggle_secrets ", "entities": "(('説明上記の式は 以下の数学関数のPython版に過ぎません 競技会で提供されたものです shape 0 RAPIDS', 'RAPIDS 参考 https データサイエンスのための様々な処理を一貫してGPUで行うためのプラットフォームです qiita'), 'function') (('max_leaves 葉の最大値 grow_policy Model Training Model Validation 木構造アルゴリズム ツリーに新しいノードを追加する方法 Predictions', 'experiment'), 'let') (('画像の読み書き リサイズ データ可視化 中でmatplotlibを使ってる パターンに一致するすべてのパス名を見つける OpenCV データ可視化', '参考 https note'), '画像処理') (('We', 'all 2'), 'ai') (('python', '画像処理 参考 https basic qiita'), '-PRON-') (('Introduction Goal', 'の室内位置の予測'), 'リアルタイムセンサーによるスマートフォン') (('GBM 決定木アルゴリズムに基づいた勾配ブースティング Gradient Light Boosting', 'https 参考 www'), 'の機械学習フレームワーク') (('Note iBeaconが全く設置されていない部分も多くあります この部分の精度は低くなる可能性があります dBm decibel milliwatts 絶対的なパワーの指標として使用され', '信号強度が優れていることを意味する'), 'を表しています') (('com allunia Steps', 'https github'), 'に感謝します') (('自分で投稿してください make_submission 下の行のコメントを外して xgb_predictions', 'sample_subm xgb_base'), 'version') (('Save W B We', 'W B.'), 'Submissions') (('GitHub functions', 'タイムスタンプとx y座標の値を返す タイムスタンプの削除 必要なのは座標のみ'), 'run') (('GPU上の RAPIDS', 'このオープンソースのライブラリ群についての詳細は こちら https rapids'), 'fast') (('y データ metadata フロアメタデータフォルダ サイトとフロアごとに整理されており', 'floor_image'), '各パスファイルには') (('G4 GB Memory NVIDIA Workstation 2 CPUs 96 Quadro', 'machine local Z8'), 'モデルの組み合わせ') (('data understanding', 'W Bのサイト参照 参考 https wandb'), 'item') ", "extra": "['test']"}