{"name": "kaggle ml ds survey analysis ", "full_name": " h1 Import libraries h1 Gender Distribution h1 Highest level of formal education h1 Years of Experience of Writing Code u200d h1 Job Titles u200d h1 Programming language used on a regular basis u200d h1 Recommended Programming language for an aspiring data scientist u200d h1 Integrated development environments IDE h1 Hosted notebook products h1 Computing platform h1 Specialized Hardware h1 Job Title vs Programming Language u200d h1 Job Title vs Specialized Hardware ", "stargazers_count": 0, "forks_count": 0, "description": "ai ruchi798 kaggle survey workspace user ruchi798 To get the API key an account is to be created on the website https wandb. png Import libraries I will be integrating W B for visualizations and logging artifacts Kaggle ML DS Survey W B Dashboard https wandb. merge map_data how outer left_on Q3 right_on Country df df. log_artifact artifact run. add_file dataset_lat_long. Artifact dataset_lat_long type dataset artifact. png map_data feature_generation df map_data map_data. drop Country axis 1 df. finish Function to plot wandb bar chart Function to create a dataframe of value counts color function for the wordcloud. Next use secrets to use API Keys more securely How many features do we have in store Gender Distribution Highest level of formal education Years of Experience of Writing Code Job Titles Programming language used on a regular basis Recommended Programming language for an aspiring data scientist Integrated development environments IDE Hosted notebook products Computing platform Specialized Hardware Job Title vs Programming Language Job Title vs Specialized Hardware This is what my project https wandb. to_csv dataset_lat_long. csv run wandb. ai ruchi798 kaggle survey workspace user ruchi798 looks like on the W B dashboard https i. init project kaggle survey name dataset_lat_long anonymous allow artifact wandb. ", "id": "ruchi798/kaggle-ml-ds-survey-analysis", "size": "1202", "language": "python", "html_url": "https://www.kaggle.com/code/ruchi798/kaggle-ml-ds-survey-analysis", "git_url": "https://www.kaggle.com/code/ruchi798/kaggle-ml-ds-survey-analysis", "script": "palettable.scientific.sequential count_values feature_generation UserSecretsClient matplotlib.ticker HeatMap Choropleth visualize_relation seaborn numpy geopy.geocoders color_wc Marker MarkerCluster FuncFormatter folium.plugins Hawaii_5 Circle Nominatim matplotlib.pyplot folium WordCloud pandas wordcloud Tableau_20 Acton_14 plot_donut Bamako_12 get_count plot_bar plot_wb_bar map_df palettable.tableau kaggle_secrets STOPWORDS ", "entities": "(('init project kaggle survey anonymous', 'artifact wandb'), 'name') (('ruchi798 kaggle survey workspace user ai ruchi798', 'W B dashboard https i.'), 'look') (('finish', 'wordcloud'), 'count') (('account', 'website https wandb'), 'user') (('png Import I', 'visualizations'), 'library') (('project https wandb', 'Job Specialized Hardware'), 'use') (('Country', 'how Q3'), 'merge') ", "extra": "['gender']"}