{"name": "kiva exploration by a kiva lender and python newb ", "full_name": " h1 1 Introduction and My Personal Experience h2 1 1 Approach Data and Visual h2 1 2 Unexplored Themes h1 2 Data Prep h2 2 1 Data Prep Create Base Superset h2 2 2 Data Prep Create New Fields h2 2 3 Data Prep Update Fields h2 2 4 Data Prep Bad Seeming Data h2 2 5 Data Prep Completed Data h1 3 Distributions and Contributions h2 3 1 Distribution of Loan Amount h2 3 2 Distribution of Funded Amount h2 3 3 Average Kiva Member Contribution h1 4 Top Sectors and Activities h2 4 1 Top Sectors h2 4 2 Absolute Top 30 Overall Activities by Sector h2 4 3 Funding Speed by World Region by Sector h2 4 4 Funding Speed by Group Type by Sector h1 5 Loan Count by Gender and Group h1 6 What s Trending Kiva h1 7 Loan Theme Types h1 8 Exploring Currency h2 8 1 Currency Usage h2 8 2 Mean Loan by Currency for Top 20 Currencies h2 8 3 What s going on in Lebanon h2 8 4 Lebanese Field Partners h1 9 Bullet Loans for Agriculture h2 9 1 El Salvador Investigation by Activity h2 9 2 El Salvador Loan Count Over Time h2 9 3 El Salvador Animal Loans h2 10 Is the Philippines Really the Country with the Most Kiva Activity ", "stargazers_count": 0, "forks_count": 0, "description": "jpg Warning Newb alert dirty python incoming 1. However are they the countries with the most lending activity going on The Philippines is pretty big Ecuador rather small in comparison. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. reorder it a bit more to my liking Youtube left join required some data missing loan themes 671205 671199 6 missing try cleaning this up a bit useful but dupey weird on this table we can in theory aggregate to these anyway for our loans we ll do this in multiple lines to make it more readable 54 total Initialize the matplotlib figure https sashat. also making a display string as well. 5 Completed Data data_complete 3. It is ordered in descending order of MPI National which may not be the best proxy for food security but it s what we ve got to roll with. I tried to lop off everything that appeared repeated and unusable. Then using mpi_region not fully populated and per dataset notes I assume is set by some kind of geo proximity join it to the mpi data. However partner 199 for this loan from loan_themes_by_region. Kiva field partner lenders do charge a local market interest rate. However it gets the job done. relation to education attainment in areas of the world where girls have less rights or the cultural expectation to stay at home while their husband works regardless of their education attainment3. I have done a fair amount of group loans as I am of the mind they may both be lower risk and may help with the borrower achieving local success with the power of the group to help them through any stumbling points. Is the Philippines Really the Country with the Most Kiva Activity These are the top 15 countries by loan count. 3 Funding Speed by World Region by Sector speed_wr 4. Visiting the loan URL https www. For a long time I only lent to women. The initial version of this graph was stacked incorrectly and only showed Lebanon thus the research into it next below. org lend ID very cool Why not make that a field too. 3 What s going on in Lebanon curr_leb 8. Al Majmoua does most of their lending in USD and was very little until the deflation period started. 2 Mean Loan by Currency for Top 20 Currencies curr_avg 8. What s Trending Kiva trend 7. Wow I didn t expect that at all. 3 What s going on in Lebanon I plotted some monthly data and also found a graph of inflation for the Lebanese Pound LBP they were actually experiencing deflation between the end of 2014 and mid year 2016. 4 Funding Speed by Group Type by SectorThis is the same idea although now looking at borrower gender demographics. As a lender I felt these were lower risk loans as I believed the community would help eachother both to execute what the loan was for successfully as well as if trouble even help eachother in paying it back. if a country is only in USD the loan is all the single USD color. that s what I used to do on prosper. I also found some things in the data I couldn t quite resolve. I was expecting this to be pretty common and the average contribution to be very close to 25 throughout. NOTE The highest is General which has both forkiva set as yes and no however it isn t particularly interesting and skews the chart. 4 Lebanese Field PartnersDigging deeper into the data it looks like Lebanon has only two field partners. relation to educational attainment in areas of the world boys are more subject to violence Girls in the Middle East do better than boys in school by a greater margin than almost anywhere else in the world a case study in motivation mixed messages and the condition of boys everywhere. Introduction and My Personal Experience intro 1. The kiva link is here https www. It is probably not the most elegant nor efficient python ever written. This seems to account for the decline in USD and rise in LBP. 2 El Salvador Loan Count Over Time sal2 9. Countries with many loans in red have a large opportunity to make an impact as well loans are already being made through field partners just not of the bullet type. Setting some dates with the code below. com wp content uploads 2018 03 kiva. Was this a real loan I figured it would be news if it was so I google it indeed it was a real loan. 1 Approach Data and Visual I m willing to bet my approach is not the best in regards to best practices in working with data probably in part due to memory usage. Rather than count our specific subset of loans it seems it may be more useful for us to simply use the number column from the loan_themes_by_region data which contains the total number of loans the partner has made for that theme. To try and keep the graph slightly less busy than plotting all of the data only the amount disbursed in the top 20 currencies by amount are shown. 3 Distributions and Contributions 3. Exploring Currency curr 8. Perhaps organizing or joining a group could help if obtaining funding is a problem. In fact this also brings up the interesting point that kiva provided us with the real loan ids so we can indeed go check out the actual loan page for any of these loans at the URL https www. Did it tell us anything interesting Only one thing that the vast majority of countries disburse loans in a single currency even if it s not their own. else I think this is bad data. Generally the approach is to lend 25 on each loan and mitigate risk over many different loans and this chart to look very similar as a result. 2 Absolute Top 30 Overall Activities by SectorHere we also see Agriculture Retail and Food strongly represented in the top activities for loans. Introduction and My Personal Experience Kiva is a non profit micro funding loan capitalization website. org human freedom index 2. 2 Create New Fields data_createnew 2. It is likely this is similarly related to fluctuations in the purchasing power and stability of their own currencies as well. 2 Unexplored Themes unexplored 2. The output was too skewed so I ended up graphing the log version of it. Try going to the URLs to check them out 2. We can see the vast amount of Palestine s loan counts are here as well. I coupled it with an absolute count of loans as well. Perhaps this is attributable to a boost from religious lenders 3. Loan Count by Gender and Group group 6. 1 Currency Usage curr_usg 8. Cambodia has the Cambodien Riel KHR however foreign cards disberse USD in ATMs and 90 of the country uses US Dollars with the local currency generally used for change or anything worth less than a dollar. Countries generally consume more beef as they get wealthier although I didn t notice a major upswing on GDP or anything from a quick google. 8 of my loans were to the Philippines I worked there a few weeks in 2003 and have worked from there in January 2016 17 18 ditching the Chicago winter. We only have 6 MPI regions for Pakistan. Thus in the code I have chosen to omit it. The absolute chart shows us pretty similar information to what we already knew from above about hot sectors. Ibdaa Microfinance only deals in LBP and appears to be on quite the roller coaster in regards to lending to Kiva borrowers. 60 of the bar would be in USD color and 40 of the bar in PHP color. There s only a few field partners and the majority of loans really comes from one so that didn t appear to make a meaningful difference. Seaborn produces a lot of pretty color plots but I will only be leveraging color when it has meaning so as to avoid confusion. does not line up well. Some of the use column descriptions on these are weird but going out to the URL they appear to all be real loans. Top Sectors and Activities tsa 4. 1 Create Base Superset data_createset 2. With the charts now properly stacking we can see a few other countries with a fair amount of currency use that is not their own. We can see individuals in Sub Saharan Africa take the longest to fund although we can also see that is because they are in competition with a large amount of people. 8 Exploring Currency 8. Inflation however means the borrower is paying back their loan with cheaper currency in that the currency now has less purchasing power. me 2017 01 11 list of 20 simple distinct colors avg_loan_cur average loan times ratio of disbursed currency of total currency get top x many used currencies make countries by sector set to display adjust by population get total loans per population restrict output to at least s many loans per million don t know how to keep this so i m just going to make it again. 3 Funding Speed by World Region by SectorI tried to calculate a funding speed here how quickly loans were funded by world region and sector. What s going on here It seems like the best best is to join from kiva loans to kiva themes then kiva themes to theme regions leveraging on country and region. The Kiva data seems to be more accurate in regards to location with them attempting to choose the best representation of MPI I attempted to tie in the richer MPI data and make more use out of the original atomic Kiva data by running some functions against it to create some new columns. Mali and Nigeria were specifically mentioned in the Kiva article and here we can see the vast majority of their loans are bullet loans but there s also some other countries and field partners doing a great job with this too 5. Arab States Health funds extremely fast. We are going to do a per capita adjustment. Of my own 997 loans it appears I ve put 50 in to 3 of them and 25 into the rest. Let s add the hashtags with their own columns as well. surely we close in on 25 per kiva user contribution as we move down to smaller loans right A bit of my hack python later and. org about impact labs financingagriculture there is a drive towards extending bullet type loans in the Agriculture sector as a solution proposed to the uncertainty of farming life whether raising crops or rearing animals. relation with weaker or stronger property rights perhaps some metrics could be leveraged from Cato s Human Freedom Index https www. This means the currency was actually gaining purchasing power. The Central African CFA Franc XAF is pegged to the Euro at 1 Euro 655. 1 Distribution of Loan AmountLet s take a look at how requested loan amounts are distributed. However it appears that people put in 50 much more often than I do myself 4 Top Sectors and Activities 4. Let s take a look at the average amount lent. Perhaps the bump we are seeing is a result of this although not fully categorized properly by the field partner Unfortunately we don t see much of a rising trend vs. 1 Data Prep Create Base Superset Let s take a look at the data in the sets we ve got to work with. Time to go fishing I feel like this is as good as this available set is going to get. 2 Mean Loan by Currency for Top 20 CurrenciesThis is a bit of a tricky one. Developing countries sometimes end up with monetary systems pegged to more stable countries or straight out use the money of those countries as a result of lack of trust or poor management of their state currency. The West African CFA Franc XOF is pegged the same way. 2 Unexplored Themes potentially available to explore with additional data 1. I ve included a loan count for currencies that are used in 2 or more countries. 6 What s Trending Kiva Let s take a look at the most popular hashtags. 1 Currency UsageLet s take a look at countries used in multiple countries. This part takes a while to chooch through kinda the most expensive single step even though it s not particularly insightful. Great we didn t lose everything and should have a nice set of MPI data now. There are 54 records like this. Loan Theme Types themes 8. 3 El Salvador Animal LoansWhat if we just look at the activities Livestock Cattle Poultry Pigs Interestingly enough it appears Livestock has been on a big non seasonal decline meanwhile cattle has gone up perhaps Kiva borrowers are switching stocks noting some kind of overall trend Whereas livestock can produce commodities meat milk eggs fur etc. However I m looking to make my life easier here and the dataset all fits so we re going to roll with it. We see a lot of similar rates although Arab States overall seem to fund quickly. We can see that some of the kiva categories are doing pretty well. Let s combine this into a set of useful superset geographic poverty data. relation to loan reporting and and interest with regards to religion Buddhism it doesn t seem expected to have some of the kiva reporting strings as part of lending Islam interest is not charged in Sharia complaint finance although perhaps it kind of is it s a bit confusing https en. cattle is generally primarily raised for meat and we ll note that a separate ungraphed Activity value exists for the category Dairy. Is the Philippines Really the Country with the Most Kiva Activity phil 1. Distributions and Contributions dist 3. I broke the data up into somewhat arbitrary group sizes. gov article id El Salvador Agricultural Sector we have this quote Dairy production is increasing due to government incentives and sanitary regulations that provide protection against contraband cheese from Nicaragua and Honduras. In theory the interest rate the money is lent at accounts for both a small profit for the field partner as well as a factor to hedge against inflation. Users from around the world come to lend money to those in need around the world. org lend 1340274 we find that the latter information is indeed associated with the loan. Oh my Tis quite a large graph along the x axis. I also didn t like the black marks at the end of the charts when stack visually so I only ended up plotting those countries which have had loans in multiple currencies where their were more than 20 loans in a currency. 4 Bad Seeming Data data_bad 2. 1 El Salvador Investigation by Activity sal1 9. We do have some takeaways here 1. Some countries have no bullet loans perhaps Kiva could concentrate limited corporate resources there whereas in countries where field partners are already leveraging bullet loans encourage the field partners to spread the good news to other field partners 7. read_csv prettier graphs need dis too for da youtube memes let s me iterate stuff to work with dates looks cool man Any results you write to the current directory are saved as output. This included different partner ID values. It s small enough to be considered a don t care I suppose in any case among our 671 205 total I ve simply left them in untouched with no attempt to repair them for now. were borrowers asking for LBP or were field partners offering pushing it Inflation is more of the borrower s friend than deflation the borrower would likely not reap any benefits of increased purchasing power as they are likely borrowing to buy something right away. I m showing the average loan and I m showing the percentage of it by currency within the stacked bar. However sometimes this only meant a single loan and the graph was big. As a general rule anything in red on this chart is open for improvement 2. Loans are distributed by Kiva field partners to borrowers to improve their lives and help facilitiate their growth out of poverty. ILS and JOD Israel and Jordan thus only show one bar although in Palestine 20 loans in each currency was lent 4 and 8 respecitively. 4 Lebanese Field Partners leb_fld 9. It is the currency for Benin Burkina Faso Guinea Bissau Ivory Coast Mali Niger Senegal and Togo. We don t have default data perhaps this is lower for Agriculture bullet loans and Kiva could use this as a point to sell to field partners currently not offering them 6. 1 El Salvador Investigation by ActivityLet s take a look at El Salvador. The first partner id and country in this example is Mexico partner 294 Kubo. The list might be better sorted in order of food insecurity if some national level data is available. What if we make a per capita adjustment Keeping life simple I m just going to use 2016 population data. Note the kiva provided MPI is the same as MPI Regional in the richer MPI data. If a country has three 100 USD loans and one 200 PHP loan it would show a total bar length of 500 4 125. In exploring the data below I found a loan for 100k. 7 Loan Theme TypesLet s take a look at loan theme type. 2 Distribution of Funded Amount dist_fund 3. I lend heavily more towards business type use vs. Countries near the top of the chart may have some of the strongest impact in reducing poverty as they are generally more impoverished. MPI Poverty Metrics 2 external 1 kiva Why does kiva have so many more records from the same root datasource Well the file has junk in it. 1 Approach Data and Visual approach 1. Some of these loan counts are very low and arguably I should be excluding these groups perhaps a revisit in the future this was in part to test my learning python abilities unfortunately nothing too big to draw from here. Bullet Loans for Agriculture bullet_agg 9. com education archive 2017 09 boys are not defective 540204 4. Kiva funders insure capital is available and loans have funding to be made. gov releases chargeoff delallsa. Since India doesn t have MPI regions it s not in the data anywhere but I m going to set the World Region to South Asia for them as well same as Pakistan. After that we ll get the dataframe to use proper datetimes for our timestamps as well. csv is for 199 CrediCampo in El Salvador. It makes sense that funding the really big loans would have large values though and there s a fair amount of those. 2 El Salvador Loan Count Over Time 9. relation to education attainment general 2. Setting MPI National since I have some NaN still and can get the value. Maybe these aren t very suitable for these type of loans perhaps the duration is quick anyway Let s see what is done not so far away in Colombia are bullet loans popular for these specific activities there 10. Let s check out the loan data and make a superset to play with for visualization. On a per capita basis the Philippines is actually 7th El Salvador on the other hand has a ton of usage well over double the 2nd most popular country for Kiva loans More to come just wanted to get what I ve got so far published out Look it s me in the additional data snapshot This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. Kiva lenders receive no return on capital and are subject to loan defaults and currency exchange losses. These loans allow for the majority of pay back to made in in a lump sum at the end of the loan life timing well with the farmer actually selling their crop they have tended to for a farming cycle or an animal they have raised for years. Note Congo and The Democratic Republic of the Congo are different countries. Ultimately this took a lot of my hack python effort and although the final data set is small it seems the more currencies asked for the much more computationally expensive plotting the graph is. 3 Data Prep Update FieldsWorld Region isn t set now in many a place where joins failed although it s easy enough to update as it is simply based on country. It does allow us to see it s a few regions really driving this. It is curious as to who is making the distinction ie. 4 Data Prep Bad Seeming DataI say seeming in case someone points out that I ve made some flaws in my logic. I double checked to make sure the loan amount in the data description was indeed in USD and not local currency. The following countries outside the US only use USD Ecuador East Timor El Salvador Marshall Islands Micronesia Palau Turks and Caicos British Virgin Islands and Zimbabwe. 2 Distribution of Funded AmountWhat percentage of loans are actually funded What s the funded distribution look like Let s do the same for the count of lenders. Let s see how we can get this chart to be a little more useful. I wasn t sure how to deal with the NaN values either so with some googling this is what I came up with to assign my group categories and mark the NaNs as well. 9 Bullet Loans for AgriculturePer Kiva Labs Financing Agriculture https www. 4 Funding Speed by Group Type by Sector speed_gt 5. financiero in Mexico from kiva_loans. It is the currency for six independent states in central Africa Cameroon Central African Republic Chad Republic of the Congo Equatorial Guinea and Gabon. 5 Data Prep Completed DataA reordering to my liking along with the characteristics of the data that we will move forward with. 3 El Salvador Animal Loans sal3 10. 1 Distribution of Loan Amount dist_loan 3. However we can also see this was not very many loans. This graph contains all the countries where at least 100 loans total have been made. 1 Top Sectors ts 4. Also grabbing some population data from another dataset. If you have never used it I invite you to give it a try https www. 3 Update Fields data_update 2. 5 Loan Count by Gender and GroupWomen totally dominate Kiva followed by individual men and pairs of men. 2 Absolute Top 30 Overall Activities by Sector act30 4. personal investment or personal use. history for Pigs or Poultry. 3 Average Kiva Member Contribution avg_cont 4. After that we re back in full force with women s groups both small and large as well as mixed groups. The default rate for these loans is very low in comparison to other default rates https www. So let s do that with some ugleh python I wrote. org invitedby mikedev10 17. but 127 regions in our themes and 146 regions in our loans. 2 Data Prep Create New FieldsI also wanted to make a distinction about groups. 3 Average Kiva Member ContributionThe above graph is surprisingly dissimilar to me. I ve attempted to tie kiva provided data together as best I can along with additional MPI data to get a richer view of the areas and how they experience poverty to create one large set to work with. Let s stick with 99th percentile for plotting this data. Data Prep dataprep 2. Countries are only shown when they have at least 250 loans in the data. Often these loans are for small entrepeneurs. Kiva users will find the Philippines and women come up often in the data likely even more often in my own as I made a conscious effort to lend to both. We ll take the geo stuff from there though. com and that s what I expected here. It did increase but is tracking back towards very low numbers again. ", "id": "doyouevendata/kiva-exploration-by-a-kiva-lender-and-python-newb", "size": "22998", "language": "python", "html_url": "https://www.kaggle.com/code/doyouevendata/kiva-exploration-by-a-kiva-lender-and-python-newb", "git_url": "https://www.kaggle.com/code/doyouevendata/kiva-exploration-by-a-kiva-lender-and-python-newb", "script": "datetime # to work with dates group_type seaborn numpy matplotlib.pyplot HTML # for da youtube memes tag_hashtag pandas IPython.display datetime isbullet ", "entities": "(('successfully as well trouble', 'it'), 'feel') (('deflation very period', 'USD'), 'do') (('I', 'population just 2016 data'), 'what') (('they', '2014'), '3') (('I', 'new columns'), 'seem') (('so i', 'just it'), 'avg_loan_cur') (('s', 'visualization'), 'let') (('Average Kiva Member 3 ContributionThe', 'surprisingly me'), 'be') (('perhaps metrics', 'Human Freedom Index https www'), 'leverage') (('husband', 'regardless education'), 'relation') (('that', '2 countries'), 'include') (('indeed it', 'it'), 'be') (('countries', 'pretty big rather small comparison'), 'be') (('money', 'as well inflation'), 'lend') (('they', 'people'), 'see') (('It', 'back very low numbers'), 'increase') (('pretty average contribution', 'very 25'), 'expect') (('s', 'most popular hashtags'), '6') (('sanitary that', 'Nicaragua'), 'article') (('we', 'hack python'), 'close') (('partner', 'theme'), 'seem') (('s', 'amount average lent'), 'let') (('I', 'rest'), 'appear') (('plotting', 'graph'), 'take') (('we', 'already hot sectors'), 'show') (('livestock', 'commodities meat milk eggs fur etc'), 'LoansWhat') (('I', 'stacked bar'), 'm') (('too so I', 'it'), 'be') (('loans where at least 100 total', 'countries'), 'contain') (('20 CurrenciesThis', 'tricky one'), 'Loan') (('Data Prep Create New FieldsI', 'groups'), '2') (('I', 'logic'), 'say') (('loans', 'funding'), 'insure') (('Activity separate ungraphed value', 'category Dairy'), 'raise') (('s', 'data'), 'let') (('didn t', 'meaningful difference'), 's') (('Mexico', '294 Kubo'), 'be') (('Users', 'world'), 'come') (('we', 'small as well groups'), 're') (('level national data', 'food insecurity'), 'sort') (('Kiva lenders', 'loan defaults'), 'receive') (('they', 'poverty'), 'have') (('vast amount', 'loan counts'), 'see') (('60', 'PHP color'), 'be') (('dataframe', 'timestamps'), 'get') (('I', 'it'), 'choose') (('we', 'URL https www'), 'bring') (('50 much more often I', 'Top 4 Sectors'), 'appear') (('even it', 'single currency'), 'tell') (('initial version', 'it'), 'stack') (('PHP one 200 it', '500 4 125'), 'show') (('I', 'ugleh python'), 'let') (('latter information', 'indeed loan'), 'lend') (('how they', 'one large set'), 'attempt') (('It', 'Benin Burkina Faso Guinea'), 'be') (('matplotlib figure https', 'more 54 total Initialize'), 'reorder') (('I', 'business type use'), 'lend') (('when it', 'confusion'), 'produce') (('loan double amount', 'indeed USD'), 'check') (('I', 'both'), 'find') (('Developing countries', 'state poor currency'), 'end') (('Kiva', '6'), 'be') (('org', 'animals'), 'be') (('I', 'quick google'), 'consume') (('I', '100k'), 'find') (('20 loans', 'currency'), 'show') (('file', 'it'), 'kiva') (('only when they', 'data'), 'show') (('currency', 'purchasing actually power'), 'mean') (('Perhaps this', 'religious lenders'), 'be') (('This', 'partner ID different values'), 'include') (('some', 'kiva categories'), 'see') (('bullet loans', 'popular specific activities'), 't') (('vast majority', 'too 5'), 'mention') (('I', 'NaNs'), 'wasn') (('Loans', 'poverty'), 'distribute') (('This', 'LBP'), 'seem') (('Philippines', 'Most Kiva Activity phil'), 'be') (('here how quickly loans', 'world region'), 'try') (('didn Great we t', 'MPI data'), 'lose') (('loan', 'only USD'), 'be') (('Currency UsageLet', 'multiple countries'), '1') (('I', 'Chicago 2016 17 winter'), 'be') (('I', 'loans'), 'couple') (('they', 'all'), 'be') (('we', 'that'), 'complete') (('s', 'lenders'), 'funded') (('we', 'what'), 'order') (('general', 'improvement'), 'be') (('We', 'geo stuff'), 'take') (('where their', 'more than 20 currency'), 'didn') (('anywhere I', 'as well same Pakistan'), 't') (('you', 'output'), 'need') (('field where partners', 'field other partners'), 'have') (('this', 'own currencies'), 'be') (('as well loans', 'bullet just type'), 'have') (('I', 't'), 'find') (('El Salvador 1 Investigation', 'El Salvador'), 'take') (('I', 'still value'), 'set') (('Agriculture also Retail', 'loans'), 'Activities') (('here It', 'country'), 'go') (('isn forkiva however t', 'particularly chart'), 'NOTE') (('approach', 'memory usage'), 'Data') (('Arab States', 'similar rates'), 'see') (('Loan 5 Count', 'men'), 'dominate') (('currency', 'purchasing now less power'), 'mean') (('It', 'Congo Equatorial Guinea'), 'be') (('we', 'sets'), 'let') (('kind of it', 'Sharia complaint finance'), 'relation') (('relation', 'boys'), 'be') (('csv', 'El Salvador'), 'be') (('These', 'loan top 15 count'), 'be') (('CFA Franc Central African XAF', '1 Euro'), 'peg') (('s', 'own columns'), 'let') (('org', 'ID'), 'lend') (('they', 'stumbling points'), 'do') (('jpg Warning Newb', 'dirty python'), 'alert') (('Lebanon', 'field only two partners'), 'PartnersDigging') (('I', 'https try www'), 'invite') (('they', 'years'), 'allow') (('we', 'it'), 'look') (('We', 'capita per adjustment'), 'go') (('only amount', 'amount'), 'show') (('s', 'superset poverty useful geographic data'), 'let') (('Kiva field partner lenders', 'market interest local rate'), 'charge') (('even it', 'most expensive single step'), 'take') (('90', 'worth less dollar'), 'have') (('they', 'likely something'), 'be') (('obtaining', 'funding'), 'help') (('Often loans', 'small entrepeneurs'), 'be') (('Unfortunately we', 'rising trend'), 'be') (('following countries', 'USD Ecuador East Timor El Salvador Marshall Islands Micronesia Palau only Turks'), 'use') (('a few regions', 'really this'), 'allow') (('Note Congo', 'Democratic Congo'), 'be') (('Funding 4 Speed', 'borrower gender same now demographics'), 'be') (('graph', 'only single loan'), 'mean') (('I', 'group somewhat arbitrary sizes'), 'break') (('this', 'unfortunately nothing'), 'be') (('I', 'them'), 's') (('enough it', 'simply country'), 't') (('Loan Theme TypesLet', 'loan theme type'), '7') (('funding', 'though fair those'), 'make') (('Generally approach', 'very result'), 'be') (('loan how requested amounts', 'look'), 'take') (('that', 'currency use'), 'see') (('kiva', 'MPI richer data'), 'be') (('default rate', 'default rates https other www'), 'be') (('that', 'everything'), 'try') (('It', 'python docker image https kaggle github'), 'be') (('assume', 'mpi data'), 'set') ", "extra": "['gender', 'test']"}