{"name": "learn how to build a model for beginners ", "full_name": " h1 Ayad h3 Hi h3 I hope you are fine dude h3 Are you ready to learn h3 First pray for our prophet Muhammed h3 let s start h3 we will create the Algorthm in only 4 steps h3 The first three steps is about preprocessing the data h3 the final step is about the model building then submission it at the end of this notebook h3 h3 let s go then h1 1 Data h3 drop some columns h1 2 find out the missing values and fix it h3 Age h3 Embarked h3 Fare h4 we filled up all the missing values successfully h4 great job h4 let s go to the third step and continue h1 3 categorical data encoding h4 we are doing a really wonderful job h4 I m excited to continue the journy with you my friend what about you h1 4 models building h4 Before that h4 we ll split the data into X train y train X test and y test based on variable target len h4 if yo don t remember this variable you can see it in the first step Data in h4 the title data splitting h2 analysing target variable h3 1 Logistic Regression h3 2 Support Vector Classifier SVR h3 3 Decision Tree h3 4 Random Forest h3 5 Gradient Boosting h3 6 Neural Network h3 7 Naive Bayes h3 8 K Nearest Neighbor h3 9 XGBoost h2 Now it s your turn to try out my friend h2 I hope you made good h2 I ll miss you so much I wish we could meet again h2 Thanks a lot dude h1 Ayad ", "stargazers_count": 0, "forks_count": 0, "description": "analysing target variable 1 Logistic Regression 2 Support Vector Classifier SVR 3 Decision Tree 4 Random Forest 5 Gradient Boosting 6 Neural Network 7 Naive Bayes 8 K Nearest Neighbor 9 XGBoost Now it s your turn to try out my friend. _ I hope you made good. Ayad Titanic https faithmag. Ignore this command line. if yo don t remember this variable you can see it in the first step Data in the title data splitting. Ayad train data calling show the first 7 rows in data set in my opinion these columns PassengerId Survived Name Cabin in our dataset wouldn t affect. the accuracy So let s delete it. this command show the columns with missing values in descending order then we ll delete the columns have no any missing values and just show the columns have missing values let s convert any age less than 1 to 1 fill the missing values with the average of all Ages fill nan with the most frequent values fill nan with the most frequent values let s check the missing values again. we will create the Algorthm in only 4 steps The first three steps is about preprocessing the data the final step is about the model building then submission it at the end of this notebook let s go then 1 Data drop some columns 2 find out the missing values and fix it Age Embarked Fare we filled up all the missing values successfully great job let s go to the third step and continue. I ll miss you so much I wish we could meet again. 3 categorical data encoding we are doing a really wonderful job I m excited to continue the journy with you my friend what about you 4 models building Before that we ll split the data into X_train y_train X_test and y_test based on variable target_len. jpg h 5cc6d756 itok rTBw3Meh Hi I hope you are fine dude Are you ready to learn First pray for our prophet Muhammed let s start. check the categorical data Encoding them by SciKit learn library let s check the categorical again. com sites default files styles social_media public 2021 08 titanic. ", "id": "abdullah3yad/learn-how-to-build-a-model-for-beginners", "size": "2067", "language": "python", "html_url": "https://www.kaggle.com/code/abdullah3yad/learn-how-to-build-a-model-for-beginners", "git_url": "https://www.kaggle.com/code/abdullah3yad/learn-how-to-build-a-model-for-beginners", "script": "sklearn.metrics sklearn.naive_bayes sklearn.tree sklearn.neural_network KNeighborsClassifier DecisionTreeClassifier seaborn numpy XGBClassifier GradientBoostingClassifier sklearn.ensemble confusion_matrix OrdinalEncoder RandomForestClassifier matplotlib.pyplot pandas LogisticRegression sklearn.neighbors SVC sklearn.linear_model sklearn.preprocessing sklearn.svm BernoulliNB xgboost MLPClassifier ", "entities": "(('s', 'missing values'), 'show') (('we', 'you'), 'miss') (('Naive Nearest 7 8 9 Now it', 'friend'), 'analyse') (('you', 'title data splitting'), 'remember') (('4 we', 'variable target_len'), 'encoding') (('s', 'First prophet'), 'itok') (('Ayad train data calling', 'PassengerId Survived Name t dataset wouldn affect'), 'show') (('s', 'categorical'), 'check') (('successfully great s', 'third step'), 'create') ", "extra": "['test']"}