{"name": "mastering the sf library data ", "full_name": " h1 What attributes are most associated with library activity of checkouts of renewals ", "stargazers_count": 0, "forks_count": 0, "description": "Outside of Country is related with Year Patron Registered. org sites default files wysiwyg u150 bay area job trends. These changes may point to an increased immigration to San Francisco and thus may explain the increased number of Outside of Country Patrons. The enrollment boom in 2003 is most probably due to the transition to the digital archiving. Older people may be registered earlier than the toddlers for example or family may have registered later than the seniors. png 2 and the number of new constructions completed https cdn3. 36 correlation between Total Checkout and Registration Year 0. However 2003 and 2016 are the two outliers. Age is more or less weakly correlated with everything. Apart from that Age is highly negatively correlated with Year Patron Registered which makes sense. org news 2014 07 23 new data shows bay area and state economies are boomingThe above heatmap represents the count of members for the corresponding Age and Member Type. This year corresponds to the end of recession and the economic recovery. This one deserves a closer look The artificial 2003 increase in the number of Patrons Registered is probably due to the initial recording of the previous Patrons. the correlation matrix Generate a mask for the upper triangle Set up the matplotlib figure Generate a custom diverging colormap Draw the heatmap with the mask and correct aspect ratio. Patron Type groups are formed regarding the Age and senior people had more chance to checkout renew books compared to the younger peers. The enrolment decay in 2016 may be explained by the records being incomplete. Thanks for checking this Billur What attributes are most associated with library activity of checkouts of renewals I suspect that the year of enrolment would be correlated with library activity first let s see what is the distribution of member enrolments per year. We observe a dramatic increase in the number of Outside Country registrations after 2011. That s why we will keep all membersLet s assign a representative numerical age per Age Range and check the correlation between every parameter in our dataset As expected the most correlated parameter couple is Total Checkout and Total Renewals. com uploads chorus_asset file 4558025 5 15_SF New Housing Units Completed_since 1995. Let s see we are right the 2016 records are upto July. png 1 job trends http www. gov reports 2015 3305 Bay Area Home Prices Outpaced the State. As we can see from the below listed articles the home prices http www. They may have set existing members registration year to 2003. The number of enrolled Patrons has an increasing trend over the years. gov Publications Report 3305 2. Hi All In this notebook I am trying to understand which parameters are correlated with each other and library activity. jpg all start to increase. then lets see how the library activity is distributed over the yearsAs one can see from the above 2 plots and the correlation grid below there is 0. 29 correlation between Total Renewal and Registration Year Even though the majority of the members have relatively low library activity when we filter out the less active members such as members with renewal 2000 xor checkout 5000 the correlations get weaker. ", "id": "bengin/mastering-the-sf-library-data", "size": "3216", "language": "python", "html_url": "https://www.kaggle.com/code/bengin/mastering-the-sf-library-data", "git_url": "https://www.kaggle.com/code/bengin/mastering-the-sf-library-data", "script": "display_corr seaborn numpy matplotlib.pyplot pandas ", "entities": "(('number', 'years'), 'have') (('correlations', 'xor 2000 5000'), 'correlation') (('enrollment boom', 'digital'), 'be') (('boomingThe', 'corresponding Age'), 'news') (('year', 'recession'), 'correspond') (('upper triangle', 'mask'), 'Generate') (('enrolment decay', 'records'), 'explain') (('home prices', 'www'), 'see') (('distribution', 'year'), 'thank') (('Bay Area Home 2015 3305 Prices', 'State'), 'report') (('earlier toddlers', 'later seniors'), 'register') (('Patron Type groups', 'younger peers'), 'form') (('library how activity', 'above 2 plots'), 'see') (('parameters', 'other activity'), 'try') (('parameter most correlated couple', 'dataset'), 's') (('We', '2011'), 'observe') (('Age', 'more weakly everything'), 'be') (('which', 'sense'), 'correlate') (('org sites default files', 'bay area job u150 trends'), 'wysiwyg') (('changes', 'Country Patrons'), 'point') (('They', 'registration year 2003'), 'set') (('artificial 2003 increase', 'previous Patrons'), 'deserve') (('2 number', 'https cdn3'), 'complete') ", "extra": "[]"}