{"name": "mechanism of action exploratory data analysis ", "full_name": " h1 1 0 Introduction h2 1 1 About the Challenge h2 1 2 Dataset h4 Trainset h4 Train Targets scored and non scored h1 2 0 Exploratory Data Analysis h2 2 1 Univariate Analysis h3 2 1 1 CP Variables h4 Insights h3 2 1 2 Gene Expression Data h4 Insights h3 2 1 3 Cell Viability Data h4 Analyze fat tail using Q Q Plot h4 Insights h3 2 1 4 Target Features h4 Insights h2 2 2 Multivariate Analysis h3 2 2 1 CP Variables h4 Insights h3 2 2 2 Gene Expression h4 Insights h4 Predictive Power score of gene expression predictors h4 Insights h3 2 2 3 Cell Viability h4 Insights h4 Predictive power score of Cell Viability predictors h4 Insights ", "stargazers_count": 0, "forks_count": 0, "description": "Target FeaturesThere are total of 206 target features which belongs to categories such as inhibitor activators agonists etc. com rip correlation introducing the predictive power score 3d90808b9598 and thought of using this in the analysis. 2 the cv_list used in the following line is defined in section 2. In the competition like this fat tail could carry disproportionately high impact. Cell Viability DataAll the columns that starts with c refers to cell viability data. I guess it is because of this tail that we see positive correlations here. These targets are divided into two categories scored and non scored. In the training set majority of the data samples are the one treated with compound 11 times the data samples of control pertubations. This affects the correlation in general as the best fitted line is more or less parallel to the x axis hence predictors are weakly correlated. We will explore the predictors first with the regression plot and kde plot and then look into the predictive power among these variables. This is evident in the above graphs. Becuase the gene expression predictors are 772 in number it won t be possible to show each as a seperate plot so we will go with Dropdown Widget. Don t why that s the case. Though the distributions seems like normal distribution the tails cause quite a deviation as seen in the QQ plot. Looking at the alternatives of the correlation it can be quite misleading I found this blog https towardsdatascience. But it works fairly well in the edit mode. The risk associated with imperfectly modelling these tails is called tail risk. Skewness is also visible in the many of the gene expression predictors. IntroductionThe objective of this notebook is to do a exploratory analysis of Mechanism of Action MoA Prediction https www. The distributions seems very similar across different dose time frames. Like cp_time it is also evenly distributed. Multivariate AnalysisAfter looking into the distributions and frequency plots whichever applicable and developing a understanding of individual predictors we will look how these predictors interact among themselves. CP VariablesThese predictors indicates whether a certain observation or sample is treated with compound or not. Unlike the gene expression predictors the predictors do have a predictive among themselves. All the c predictors have fat tails with peak around the 10. To check the sparsity of data we will calculate the percentage of the non zero classes in each train_targets. Whether the sample is treated with compound or not4. Thus the problem that we have here is of multi label classification. The probability distributions of g predictors are bell shaped with mean of all around 0. TrainsetThe trainset contains 876 predictors which can be divided into four broad categories 1. The cp_type indicates sample treated with compound trt_cp or control pertubations ctl_vehicle. These tails are all on the left side. Most of the target variables are inhibitors. These tails indicate high likelihood of the improbable events and could be hard of for the machine learning model to grasp. The cp_time indicated treatment duration and contains three distinct time durations 24 48 and 72 hours with observations almost evenly distributed among these durations. Drugs can have multiple MoA annotations which describe binary cell responses from different cell type in different ways. One of the greatest disadvantage of using predictive power is the speed it is much slower than the correlation. Gene Expression DataAll the columns that starts with g signifies the gene expression data. So we will use the dropdown widget here too to include all the cell viability data predictors. com c lish moa overview description data using Matplotlib and Seaborn. DatasetIn this competition we have a dataset that combines gene expression and cell viability data. Checking the number of nulls and uniques in each predictor of the train_df. In the train_target every target has two classes 0 and 1. While by definition agonist causes an action and antagonist will inhibit it my initial understanding was they might be equal to each other. Following table shows the train_targets that are scored. The data is based on a technology that measures simultaneously human s cell response to drugs in a pool of 100 different cell types. A Q Q plot or quantile quantile plot compares quantiles of the dataset. Predictive Power score of gene expression predictorsIn this section we explore the predictive power score among the variables in the gene expression family. The tails in the both graphs shows that the distribution are skewed to right. The section 02 will visualize different predictors alone and against other variables. 3 we did a fat tail analysis that shed light on how despite looking like a bell curve the distributions of Cell Viability predictors deviate largely from the theoretical normal distribution. The variance between two gene expression predictors here g 0 and g 1 is high. The agonists and antagonists are not equal to each other. Unlike the gene expression predictors the cell viability predictors do have significant correlation among themselves. Univariate AnalysisIn this section we will visualize the predictors one by one to understand their distribution describe statistical summaries and find patterns in the data. It compares the quantiles of the real world dataset against the theoretical normal distribution. The control pertubations have no MoAs. It would be advisable to fork and open the NB in edit mode to access the Dropdown Widget. The concentration of the observations here too is in the range of 2 2 but with some concentration around negative tail too. The cp_dose indicates dose being high or low. Similarly checking the number of nulls and uniques in train_targets scored. Predictive power score of Cell Viability predictors Insights1. There is some difference in the 48 hour dose time between the D1 and D2 distribution for samples treated with the compound. Gene ExpressionTo identify the relationship between two predictors in the gene expression data we plot a jointplot with a regression line. Note The Jupyter Widgets doesn t work after committing the notebook. Exploratory Data AnalysisNow that we have a brief overview of the data we can delve deeper into the data exploration. Though the variance is high it is clear from the density plot above the data is concentrated in the range 2 2. Analyze fat tail using Q Q PlotAs we see quite a fat tails in all the cell viability predictors we will analyze it bit more using the Q Q plots. To use the widget uncomment the following two cells blocks. The predictive score isn t much high here which backs our hypothesis that High positive correlation is due to two primary areas of concentration one being in range of 2 2 and other around 10. To describe the biological activity of a given molecule scientist assign a label referred to as Mechanism of action or MoA. CP Variables Insights 1. So I am selecting 10 random variables below and calculating PPScore for them. Because the number of variables in the gene expression predictor family are way too high it won t be feasible to plot each and every one of those in this notebook. The univariate analysis will help us understand the predictors while multivariate analysis will help us establishes cause and effect or other relationships. In the following visualization we plot a frequency plot of different types of features available to us. Cell ViabilityThe appraoch to explore the relationships among the Cell Viability predictors will remain the same as that in Gene Expression predictors. importing the libraries setting the notebook parameters importing the datasets for annotation of counts list of gene expression columns feeding the above list to the dropdown display dropdown_ge_cols display ge_plot list of gene expression columns feeding the above list to the dropdown display dropdown_cv_cols display cv_plot types of target variables key the target column val number of such columns running count of how many columns are currently considered 1 for sig_id column plot the ge_list used in the following line is defined in section 2. There is isn t much predictive power in among the gene expression variables. Identifier sig_id Train Targets scored and non scored The train_targets contains the binary MoA targets. Due to similar reason as above widgets are not working after committing. Like gene expression predictors these too are quite a few in numbers 100 to be precise. About the ChallengeTo understand the biological mechanism of the disease scientists seek to identify the protein target associated with the disease and develop a molecule that can modulate that protein target. This communicates that there might not be any redundant information coming from these variables. This is backed by the jointplots above where two variables were weakly correlated. ", "id": "arjunsehajpal/mechanism-of-action-exploratory-data-analysis", "size": "8948", "language": "python", "html_url": "https://www.kaggle.com/code/arjunsehajpal/mechanism-of-action-exploratory-data-analysis", "git_url": "https://www.kaggle.com/code/arjunsehajpal/mechanism-of-action-exploratory-data-analysis", "script": "dropdown_cv_eventhandler seaborn - scored\" matplotlib.pyplot dropdown_ge_eventhandler ipywidgets pandas scipy.stats info_df ppscore ", "entities": "(('tails', 'grasp'), 'indicate') (('Most', 'target variables'), 'be') (('It', 'Dropdown Widget'), 'be') (('it', 'cp_time'), 'like') (('these', 'too a numbers'), 'be') (('Cell Viability that', 'cell viability data'), 'DataAll') (('probability distributions', 'mean'), 'be') (('cp_dose', 'dose'), 'indicate') (('non train_targets', 'MoA binary targets'), 'score') (('predictorsIn section we', 'gene expression family'), 'score') (('t', 'notebook'), 'be') (('risk', 'imperfectly tails'), 'call') (('We', 'variables'), 'explore') (('So I', 'them'), 'select') (('how predictors', 'themselves'), 'look') (('we', 'train_targets'), 'calculate') (('that', 'protein target'), 'understand') (('it', 'range'), 'be') (('Skewness', 'gene expression predictors'), 'be') (('sample', 'compound'), 'treat') (('we', 'Dropdown Widget'), 'be') (('predictors', 'themselves'), 'have') (('target', 'two classes'), 'have') (('High positive correlation', '2 2'), 'isn') (('we', 'available us'), 'plot') (('ge_list', 'section'), 'display') (('quite I', 'blog https towardsdatascience'), 'be') (('we', 'label here multi classification'), 'be') (('targets', 'two categories'), 'divide') (('it', 'much correlation'), 'be') (('certain observation', 'compound'), 'indicate') (('IntroductionThe objective', 'Action MoA Prediction https www'), 'be') (('which', 'four broad categories'), 'contain') (('that', 'gene expression'), 'datasetin') (('that', 'train_targets'), 'show') (('agonists', 'other'), 'be') (('treatment indicated duration', 'almost evenly durations'), 'distribute') (('concentration', 'negative tail'), 'be') (('distribution', 'data'), 'visualize') (('us establishes', 'cause'), 'help') (('distribution', 'right'), 'show') (('Q Q plot', 'dataset'), 'compare') (('we', 'data deeper exploration'), 'AnalysisNow') (('appraoch', 'Gene Expression predictors'), 'remain') (('which', 'different ways'), 'have') (('that', 'gene expression data'), 'signify') (('It', 'theoretical normal distribution'), 'compare') (('So we', 'cell viability data here too predictors'), 'use') (('where two variables', 'jointplots'), 'back') (('variance', 'gene expression two predictors'), 'be') (('it', 'edit fairly well mode'), 'work') (('c predictors', '10'), 'have') (('they', 'other'), 'cause') (('distributions', 'largely theoretical normal distribution'), 'do') (('more hence predictors', 'correlation'), 'affect') (('we', 'positive correlations'), 'guess') (('cv_list', 'section'), '2') (('distributions', 'dose time very different frames'), 'seem') (('we', 'Q Q bit more plots'), 'tail') (('we', 'regression line'), 'identify') (('which', 'etc'), 'be') (('section', 'alone other variables'), 'visualize') (('that', 'cell 100 different types'), 'base') (('tails', 'QQ plot'), 'cause') (('cell viability predictors', 'themselves'), 'have') (('cp_type', 'compound'), 'indicate') ", "extra": "['annotation', 'biopsy of the greater curvature', 'disease', 'test']"}