{"name": "merging and eda ", "full_name": " h2 Notebook Content h3 Importing Libraries and tables h3 before merge change some column names in some tables to escape misunderstanding Such as conditions sponsor responsible party intervention tables have name column renaming them as intervention name condition name sponsor name will clarify the values h3 dropped duplicated values before merge helps better results Since method merge will create duplicates itself to avoid dataframe full of duplicates and takes bigger memory h3 All tables has nct id common column therefore with inner join common nct id s can merge with left join columns exist in the left table and common nct id s at both table can merge or with outer join all nct id s at both table exist at one table n Another way to merge is to concat tables this method concates using append Appends the common rows or columns creates NaN values for unmatched values h3 Number of empty values h3 Separating data as unfinished studies and finished Saving unfinished studies for later model evaluation h3 First Observations h4 How many studies completed over years Do number of studies grow over time or are there any drowbacks h4 What phases are the most studied Some trials study more than one phase at a time such as phase2 and phase3 together this probably decrease the cost h4 Do most of the studies completed or failed Are there other status types or just recruitments status exists h4 Interventional studies or observational which one is more common h4 Its hard to conduct trials with more people higher enrollment number since the costs will be higher requires more people to keep records check results Lets see the distrubution of studies regarding number of enrollment h4 Most Studied Intervention types h4 What are the top 10 studied interventions h4 What organisations conduct trials the most h4 Top 10 studied diseases h4 What are the top 10 countries conducting interventional trials h4 Sponsors or principal investigators execute more trials h4 Which conditions require to study biomarker analysis more h4 How studies funded h4 Responsible parties positions of studies h4 What are the top 15 reasons that studies stop or intervene to their development h3 Saving output file as csv h3 Exploratory Data Analysis h4 drop some columns such as id s some dates since last 20 years trials determined before only date variable for future usage will be study start and completion date dropped qc dates quality control dates and varification dates h3 Groupby disease type h4 Oncology trials h4 Mental and Behavioral disorders h4 Blood and Lymph Conditions h4 Digestive System Diseases h4 Respiratory Tract Lung and Bronchial Diseases h4 Nervous System Diseases h4 Bacterial and Fungal Diseases h4 Nutritional and Metabolic Diseases h4 Parasitic Diseases h4 Urinary Tract Sexual Organs and Pregnancy Conditions h4 Viral Diseases h4 Wounds and Injuries h4 Immune System Diseases h4 Diseases and Abnormalities at or Before Birth h4 Disorders of Environmental Origin h4 Ear Nose and Throat Diseases h4 Eye Diseases h4 Gland and Hormone Related Diseases h4 Mouth and Tooth Diseases h4 Muscle Bone and Cartilage Diseases h4 Occupational Diseases h4 Skin and Connective Tissue Diseases h4 Substance Related Disorders h3 Creating column which has the info about condition type h3 Saving output file as csv h3 POS and LOA ", "stargazers_count": 0, "forks_count": 0, "description": "Researchers need to understand exactly how the medication is tolerated within unique segments of the population in order to complete the Investigational New Drug Application IND. Groupby disease type 7. png attachment fd64cd34 4e8a 41dc 8c7c 8141f6744168. Renaming some columns 3. During a clinical trial a control group receives a placebo drug enabling researchers to avoid unintentional biases and identify the statistically proven benefits or potential health concerns associated with an experimental drug. Such as conditions sponsor responsible party intervention tables have name column renaming them as intervention_name condition_name sponsor_name will clarify the values dropped duplicated values before merge helps better results. png attachment 055825e9 e148 4176 8840 e3dd4468b936. The following list details fundamental attributes of a successful clinical trial 1. A sufficient number of participants to generate accurate data Researchers must first meet the specific threshold for study participants before they can investigate a drug s safety and efficacy. png source 2 https www. Clinical researchers closely monitor participants for changes and meticulously document findings during the study. The more noteworthy the difference between these two groups the more they can attribute to the drug s effect. Appends the common rows or columns creates NaN values for unmatched values. Another way to merge is to concat tables this method concates using append. The volume of participants based on study protocol and the Food and Drug Administration FDA requirements must be sizeable enough to clearly demonstrate the validity of their findings. A clear difference in the data from the experimental drug and the placebo. png Number of empty values Separating data as unfinished studies and finished. Final Look Importing Libraries and tables before merge change some column names in some tables to escape misunderstanding. org pandas docs stable user_guide merging. Source https ocrc. for more detailed info for how merged here https pandas. Both the FDA approval and the pharmaceutical manufacturer s vested interest hinge on the results of the clinical study. A demonstration of how the medication is metabolized in a certain segment of the population. Since method merge will create duplicates itself to avoid dataframe full of duplicates and takes bigger memory All tables has nct_id common column therefore with inner join common nct_id s can merge with left join columns exist in the left table and common nct_id s at both table can merge or with outer join all nct_id s at both table exist at one table. Lets see the distrubution of studies regarding number of enrollment Most Studied Intervention types What are the top 10 studied interventions What organisations conduct trials the most Top 10 studied diseases What are the top 10 countries conducting interventional trials Sponsors or principal investigators execute more trials Which conditions require to study biomarker analysis more How studies funded Responsible parties positions of studies What are the top 15 reasons that studies stop or intervene to their development Saving output file as csv Exploratory Data Analysis drop some columns such as id s some dates since last 20 years trials determined before only date variable for future usage will be study start and completion date dropped qc_dates quality control dates and varification dates Groupby disease type Oncology trials Mental and Behavioral disorders Blood and Lymph Conditions Digestive System Diseases Respiratory Tract Lung and Bronchial Diseases Nervous System Diseases Bacterial and Fungal Diseases Nutritional and Metabolic Diseases Parasitic Diseases Urinary Tract Sexual Organs and Pregnancy Conditions Viral Diseases Wounds and Injuries Immune System Diseases Diseases and Abnormalities at or Before Birth Disorders of Environmental Origin Ear Nose and Throat Diseases Eye Diseases Gland and Hormone Related Diseases Mouth and Tooth Diseases Muscle Bone and Cartilage Diseases Occupational Diseases Skin and Connective Tissue Diseases Substance Related Disorders oncology_data behavioral_data blood_lymph_data digestive_data respiratory_data nervous_data infectious_data metabolic_data parasitic_data sexual_data viral_data wounds_data immune_data birth_data environmental_data ear_nose_throat_data eye_data hormone_data dental_data muscle_bone_cartilage_data Occupational_data skin_data substance_data Creating column which has the info about condition type Saving output file as csv POS and LOA How do researchers know if a clinical study is a success Declaring a clinical trial a success means that the researchers have successfully met their objective. Do most of the studies completed or failed Are there other status types or just recruitments status exists Interventional studies or observational which one is more common Its hard to conduct trials with more people higher enrollment number since the costs will be higher requires more people to keep records check results. If the drug does not perform well in clinical trials it likely be reformulated or abandoned altogether. Importing Libraries and tables 2. First observations and Exploratory Data Analysis 6. Narrowing Dataframe last 20 years 5. They also research which segments of the population experience the highest success rate with the investigational drug. gov pmc articles PMC3061013. Notebook Content 1. net how do researchers know if a clinical study is a success image. Saving unfinished studies for later model evaluation First Observations How many studies completed over years Do number of studies grow over time or are there any drowbacks What phases are the most studied Some trials study more than one phase at a time such as phase2 and phase3 together this probably decrease the cost. ", "id": "ilkeakar/merging-and-eda", "size": "11970", "language": "python", "html_url": "https://www.kaggle.com/code/ilkeakar/merging-and-eda", "git_url": "https://www.kaggle.com/code/ilkeakar/merging-and-eda", "script": "missing_values_table __version__ iplot init_notebook_mode numpy download_plotlyjs plotly.offline plotly.graph_objs pandas cufflinks plot = trials_2000_2021['sponsor_agency_class'].value_counts().sort_values(ascending=True)[-15 plotly ", "entities": "(('it', 'well clinical trials'), 'reformulate') (('exactly how medication', 'Investigational New Drug Application IND'), 'need') (('costs', 'results'), 'require') (('also segments', 'investigational drug'), 'research') (('following list', 'successful clinical trial'), 'detail') (('the more they', 'effect'), 'difference') (('volume', 'findings'), 'be') (('how medication', 'population'), 'demonstration') (('s', 'one table'), 'create') (('control group', 'health potential experimental drug'), 'receive') (('researchers', 'successfully objective'), 'see') (('Clinical researchers', 'study'), 'monitor') (('way', 'append'), 'be') (('together this', 'probably cost'), 'save') (('they', 'drug safety'), 'meet') (('values', 'better results'), 'have') ", "extra": "['biopsy of the greater curvature', 'disease', 'cd3', 'lung']"}