{"name": "nfl baseline simple helmet mapping ", "full_name": " h2 setting and loading data h2 adding Estimated video frame to tracking h2 mapping helmet box and NGS tracking data h2 validation ", "stargazers_count": 0, "forks_count": 0, "description": "calculate the area of union print uni 4. get the coordinate of inters 2. Map the players to have the smallest difference between each boxes and coordinates. Since the camera and the XY axis will be rotated if it is out of the center of the court. setting and loading data adding Estimated video frame to trackingI used robikscube s great code here. calculate the area of inters 3. The direction of the axis changes depending on the camera position so I choose the one that gives smaller distance for both directions. com robikscube nfl helmet assignment getting started guide Estimated video frame copied from https www. I used train test _baseline_helmets. Compare the NGS tracking data with the lateral coordinates of the boxes. copied from https www. In this notebook I will show you how to map helmet bbox and NGS tracking data. So the angle at which the distance is the smallest is selected by grid search. calculate the overlaps between pred_box and gt_box Keep sub_labels for review this would be 0. Please check the code for details. The reason why I did not use vertical coordinates is because simplicity and the lateral direction is more accurate but we can get more accurate mapping if we use depth as well. Check for unique boxes 1. com robikscube nfl helmet assignment getting started guide Read label from CSV Maximum of 22 boxes per frame. Only one label allowed per frame. mapping helmet box and NGS tracking data validationI used robikscube s great code here. ", "id": "its7171/nfl-baseline-simple-helmet-mapping", "size": "1029", "language": "python", "html_url": "https://www.kaggle.com/code/its7171/nfl-baseline-simple-helmet-mapping", "git_url": "https://www.kaggle.com/code/its7171/nfl-baseline-simple-helmet-mapping", "script": "sklearn.metrics __init__ rotate_arr merge_sub_labels multiprocessing calculate_metric_weighted tqdm.auto sklearn.cluster dist_rot filter_to_top_label_match KMeans pyplot as plt get_iou_df dist add_xy pyplot numpy dist_for_different_len norm_arr check_submission pandas find_nearest add_isCorrect_col accuracy_score tqdm score Pool NFLAssignmentScorer matplotlib add_track_features mapping_df ", "entities": "(('mapping', 'NGS tracking data great code'), 'use') (('that', 'directions'), 'direction') (('this', 'gt_box Keep review'), 'calculate') (('I', 'helmet how bbox'), 'show') (('com robikscube nfl helmet assignment', 'https www'), 'guide') (('distance', 'grid search'), 'select') (('com robikscube nfl helmet assignment', 'frame'), 'start') (('we', 'depth'), 'be') (('players', 'boxes'), 'Map') (('XY it', 'court'), 'rotate') ", "extra": "['test']"}