{"name": "nfl helmet assignment getting started guide ", "full_name": " h1 NFL Helmet Assignment Competition h1 What is the goal of this competition h1 How does scoring work h1 What data are provided h2 Video and Baseline Boxes h2 NGS Tracking Data h2 Example Animation of NGS Data h1 A Baseline Submission h1 What next ", "stargazers_count": 0, "forks_count": 0, "description": "When you submit your model will be rerun on a set of 15 unseen plays located in a holdout test set. Player labels are provided within the NGS tracking data for each play. A player s helmet label must only be predicted once per video frame i. If you participated in the 2020 NFL Impact Detection competition this dataset may look familiar to you. The provided add_track_features function may be helpful when attempting to synchronize the NGS data with the video footage. In some situations sideline players can be seen in the video footage. Your solution must account for matching the orientation of the video angle relative to the NGS data. csv contain imperfect baseline predictions for helmet boxes. Some things to note are NGS data is sampled at a rate of 10Hz while videos are sampled at roughly 59. The model used to create these files was trained only on the additional images found in the images folder. Next we create this submission on the test set for submission. Extra Images The images folder and image_labels. In this submission we ve randomly assigned labels to the top 22 baseline helmet boxes for each frame. calculate the overlaps between pred_box and gt_box Keep sub_labels for review Expected submission columns Score the sample submission Score a submission with only impacts Score a submission with only non impacts Score a perfect submission Black White Red We need to add 1 to the frame count to match the label frame index that starts at 1 Let s add a frame index to the video so we can track where we are Now add the boxes Filter for definitive head impacts and turn labels red Not all browsers support the codec we will re load the file at tmp_output_path and convert to a codec that is more broadly readable using ffmpeg scaling factor for display Estimated video frame Endzones fontname Arial fontname Arial Reference https www. Video and Baseline BoxesAs noted above the provided baseline boxes are imperfect but allow you to quickly tackle the problem without having to address the helmet detection. Check for unique boxes 1. Below is a plot of the NGS data for an example play at the moment the ball is snapped. No more than 22 helmet predictions per video frame the maximum number of players participating on field at a time. no identical left right height and width boxes per frame. train_baseline_helmets. Note This is a code competition. We are excited to see what solutions the kaggle community comes up with Read in data files Labels and sample submission Player tracking data Baseline helmet detection labels Extra image labels Maximum of 22 boxes per frame. What data are provided For the full data details please review the data description page https www. calculate the area of inters 3. Note that this is not the exact code used in the kaggle scoring system but results should be nearly identical. Ground truth fields have the suffix _gt while submission fields have the suffix _sub. A perfect submission would correctly identify the helmet box for every helmet in every frame of video and assign that helmet the correct player label. What next There are infinite ways of approaching this problem. The publicly provided test videos are simply a set of mock plays copied from the training set which are not used in scoring. How does scoring work The scoring used for this competition is Weighted Accuracy where detected helmets involved in an impact are weighted 1000x more than non impact helmets. Submission boxes must have at least a 0. com c nfl health and safety helmet assignment data. The below video shows an example of these baseline predictions alongside the true helmet labels. What is the goal of this competition Simply put we are trying to assign the correct player label on helmets in NFL game footage. com ammarnassanalhajali nfl big data bowl 2021 animating players A Baseline SubmissionThe following code shows how to make a baseline submission. Thanks to this notebook author for creating the awesome plotly football field https www. Only one label allowed per frame. Read label from CSV Maximum of 22 boxes per frame. NGS also includes the speed s acceleration a orientation o and direction dir for each player. Sideline players should not be included in the submission to avoid exceeding the 22 box and unique label constraints. To solve this problem Kagglers will need to leverage both video footage and NFL s Next Gen Stats NGS tracking data. While last year s competition was focused on detecting helmet impacts from video footage this competition challenges competitors to correctly assign each helmet to its associated player. calculate the area of union print uni 4. csv contains helmet boxes for random frames in videos. The NGS data and the orientation of the video cameras are not consistent. If you so choose you may train your own helmet detection model and ignore these files. For context below are images from the sideline and endzone view of the above play at the moment of snap. csv and test_baseline_helmets. Check for unique boxes The sample submission meets these requirements. The check_submission function can be used to check if your submission meets the above requirements. train_player_tracking. All submitted helmet boxes must be unique per video frame i. csv This file is only available for the training dataset and provides the ground truth for the 120 training videos. First we will run this code on the training data and calculate the expected score. Some ideas that can be explored are Using optimization methods to match helmet boxes to NGS data based on relative distances. Tracking of helmets throughout the duration of a play and assigning labels to these tracks. These images were used to train the model that produced the _baseline_helmets. 35 Intersection over Union IoU https en. org wiki Jaccard_index with the ground truth helmet box. Labels consist of a value H for home team and V for visiting team followed by the player s jersey number. NFL Helmet Assignment Competition Welcome to the 2021 NFL Health Safety Helmet Assignment competition The competition is part of a collaborative effort between National Football League NFL and Amazon Web Services AWS to assist in the development of the best sports injury surveillance and mitigation program in the world. After scoring the sub_labels dataframe within the NFLAssignmentScorer object can be used to evaluate results including the iou between predictions and ground truth boxes and isCorrect for correct labels. To reduce gamification of this metric additional restrictions are placed on submissions. Using computer vision techniques to identify player jersey numbers and pair with helmets. You may choose to use these to train your own helmet detection model. Each ground truth helmet box will only be paired with one helmet box per frame in the submitted solution. get the coordinate of inters 2. NGS data and videos can be approximately synced by linking the NGS data where event ball_snap to the 10th frame of the video approximately syncronized to the ball snap in the video. com ammarnassanalhajali nfl big data bowl 2021 animating players Take up to 22 helmets per frame based on confidence Identify player label choices for each game_play Loop through frames and randomly assign boxes Check to make sure it meets the submission requirements. NGS Tracking DataThe use of the NGS tracking data will be important for correctly labeling videos. More details can be found in the data description page https www. Example Animation of NGS DataBelow is an animation of an example play using plotly. This scoring is designed specifically because ultimately the NFL will be using this algorithm to assign helmet impacts to players. train and test folders contain the video mp4 files to be labeled. Sideline players helmets are not scored in the grading algorithm and can be ignored. The provided NFLImpactScorer class can be used to assist in scoring your local predictions. Sideline players will have the helmet labels H00 and V00. For each ground truth box the submitted box with the highest IoU will be considered for scoring. no duplicated labels per frame. csv contain the tracking data for all players on the field during the play. Imputing boxes for partially occluded helmets based on the surrounding frames. Identifying key points on the field line numbers hash marks as reference points. csv and test_player_tracking. ", "id": "robikscube/nfl-helmet-assignment-getting-started-guide", "size": "7459", "language": "python", "html_url": "https://www.kaggle.com/code/robikscube/nfl-helmet-assignment-getting-started-guide", "git_url": "https://www.kaggle.com/code/robikscube/nfl-helmet-assignment-getting-started-guide", "script": "sklearn.metrics __init__ create_football_field merge_sub_labels calculate_metric_weighted display filter_to_top_label_match add_plotly_field get_iou_df Video plotly.graph_objects add_xy matplotlib.patches random_label_submission numpy matplotlib.pylab plotly.express check_submission pandas add_isCorrect_col accuracy_score video_with_baseline_boxes score NFLAssignmentScorer add_track_features IPython.display ", "entities": "(('which', 'scoring'), 'be') (('Simply we', 'NFL game footage'), 'try') (('Sideline players', 'label 22 box constraints'), 'include') (('direction', 'player'), 'include') (('results', 'scoring exact kaggle system'), 'note') (('Weighted where detected helmets', 'non impact 1000x more helmets'), 'score') (('dataset', 'you'), 'look') (('helmet label', 'video frame only once i.'), 'predict') (('you', 'helmet detection'), 'note') (('Player labels', 'play'), 'provide') (('that', '_ baseline_helmets'), 'use') (('data', 'data description page https www'), 'provide') (('we', 'frame'), 've') (('that', 'relative distances'), 'use') (('helmet', 'H00'), 'have') (('solution', 'NGS relative data'), 'account') (('NGS data', 'video cameras'), 'be') (('competitors', 'associated player'), 'challenge') (('csv', 'helmet boxes'), 'contain') (('Baseline following code', 'baseline how submission'), 'com') (('sideline players', 'video footage'), 'see') (('used', 'images folder'), 'train') (('so you', 'files'), 'choose') (('helmet submitted boxes', 'video frame i.'), 'be') (('file', 'training 120 videos'), 'csv') (('where event', 'video'), 'sync') (('NFLImpactScorer provided class', 'local predictions'), 'use') (('submit', 'holdout test set'), 'be') (('submitted box', 'scoring'), 'consider') (('Kagglers', 'video footage'), 'need') (('csv', 'videos'), 'contain') (('sample submission', 'requirements'), 'check') (('videos', 'roughly 59'), 'be') (('NGS Tracking DataThe use', 'correctly videos'), 'be') (('_ submission fields', 'suffix _ sub'), 'have') (('that', 'video Endzones Arial fontname Arial Reference https display Estimated frame www'), 'calculate') (('More details', 'data description page https www'), 'find') (('csv', 'play'), 'contain') (('You', 'helmet detection own model'), 'choose') (('competition', 'world'), 'Welcome') (('Example Animation', 'example play'), 'be') (('specifically ultimately NFL', 'players'), 'design') (('Labels', 'jersey number'), 'consist') (('train folders', 'mp4 video files'), 'contain') (('First we', 'expected score'), 'run') (('Next we', 'submission'), 'create') (('ball', 'moment'), 'be') (('identical', 'frame'), 'leave') (('ground truth helmet box', 'submitted solution'), 'pair') (('provided function', 'video footage'), 'be') (('Baseline helmet detection', 'frame'), 'be') (('assign boxes randomly it', 'submission requirements'), 'com') (('that', 'player correct label'), 'identify') (('Sideline players helmets', 'grading algorithm'), 'score') (('below video', 'helmet true labels'), 'show') (('submission', 'above requirements'), 'use') ", "extra": "['test']"}