{"name": "nlp text mining disease behaviour ", "full_name": " h1 Current Research Status h1 Simulator h1 Custom Rule Execution Sequence Engine h1 Prepare term libraries h1 Defined generic Spacy pattern matchers and util library h2 Prepare COVID 19 Literature dataset h1 Define rule matching execution functions h1 Virus Symptoms h1 Incubation Period h1 Quarantine h1 Transmission methods h1 Affected Organs h1 Gender Report h1 Fatality Rate h1 Genome sequences mining h1 Known Facts h1 Antigen references ", "stargazers_count": 0, "forks_count": 0, "description": "Graph values represent reported percent Genome sequences miningMine the text for genome sequences and report found sentence and the article file that contain the detail Known Facts Search the code for false positives negatives in order to learn from other research. com watch v HykbOsHWDSY Custom Rule Execution Sequence EngineIn order to perform a more refined search that takes into account various rules of execution a custom engine was designed such that it can combine Spacys Pattern Matcher strategy with a preffered sequence execution of the matchers. The application will allow execution of predefined templates or you can configure your own scenario. low employment rate https www. Transmission methodsSearches for all transmission method NOUNS in articles where coronavirus is mentioned. Affected OrgansSearch for list of possible human organs affected by COVID 19 Gender ReportMine for any gender age intervals reports Fatality Rate Reported fatality rates scrape the COVID 19 reference literature for mortality fatality rate matchers percent reports. Sample videos on different simulated scenarios Environment with high vs. com assets static showcase_thumb 3 1. png The simulator was used to try out different scenarios in testing effectiveness of movement control strategies to prevent secondary transmission in health care and community settings. The current version of the notebook is providing information about the following Symptoms Incubation Period Quarantine Transmission Methods Reported Gender Percentiles Reported Fatality Rate Relevant gene sequences appearance in sentence and file False Positives Negatives Antigen references literature Added Pandemic Simulator AppThe mining is running on a custom rule matching engine built on top of Spacy in order to use POS in terms identification. For performance concerns most of the searches were perfomed on a filtered dataset if you wish to have a more accurate response replace filtered_df with df SimulatorIn order to understand the importance of isolation I wrote a simulator that takes into account housing commercial virus characteristics and social interactions. Screenshot https www. Rate is optional Percent matcher will identify all percentile references in the code Time Matcher will identify all numeric terms like 5 days 1 day Time Interval Matcher will identify all numeric intervals in days weeks 4 to 6 days 10 12 weeks Year Matcher will identify all numeric terms like 60 years Year Interval Matcher will identify all numeric intervals in years 56 80 years 10 to 12 years. The example above defines the following matchers Term Matcher looks for the term incubation and optionally period Time Matcher matches all time references in days weeks Time Interval Matcher matches all time intervals in days weeksThe next item in the dictionary is root that defines the preferred matching order execution if the order is not satisfied then the matcher executor won t get called Term Matcher Time Matcher Term Matcher Time Interval MatcherIf the matcher rule has the execute key present in the dictionary then the rule will get executed even if further specific matchers will get called later Virus SymptomsSearch for virus references and its symptoms in all articles that have a coronavirus reference and at least one term in symptoms dictionarySince is really important to understand the symptoms the search will be performed on the entire article dataset with no filter. For the moment the term incubation period is searched in text abstract in order to identify the potential articles. Incubation PeriodThe first analysis is parsing filtered articles that might refer to COVID 19 incubation period. g minute day year plot_dict utility to plot a dictionary dict_counter increase or set the value of a key in the dictionary day_value report the time value in days report_interval populates dictionary with values for an interval e. g day year Number Interval Matcher search for numeric intervals of time definition parametrized e. replace antigen. The plot will show most common NOUNS used to relate a false positive negative and they are converted to a Pandas dataset along with the referencing literature Antigen references Get string representation The matched span for article in literature regex r CF regex r antigen antibod text text. QuarantineSearches for all quarantine recommendations in the articles where coronavirus term is present. the execution rules are defined under the root key Incubation Matcher Time Matcher will identify The virus has an incubation period of 14 days Incubation Matcher Time Interval Matcher will identify The virus has an imbubation period of 10 to 14 days Mortality Rate Matcher Year Matcher Percent Matcher will identify The reported mortality rate for over 60 years old is 30. replace antigens. Mortality Rate Matcher Year Interval Matcher Percent Matcher will identify The reported mortality rate for patients between 20 and 30 years old uis 0. Link To Simulator https www. Given the following example rule Matchers Incubation Matcher LOWER incubation LOWER period OP Mortality Rate Matcher LOWER mortality LOWER rate OP Percent Matcher matchers Number Suffix Matcher percent Time Matcher matchers Number Suffix Matcher days weeks Time Interval Matcher matchers Number Interval Matcher days weeks Year Matcher matchers Number Suffix Matcher years old Year Interval Matcher matchers Number Interval Matcher years old root Incubation Matcher Time Matcher incubation_period_report Time Interval Matcher incubation_period_report Mortality Rate Matcher Year Matcher Percent Matcher mortality_report Year Interval Matcher Percent Matcher mortality_report matchers are documented below Will define a rule where the engine will look for the following Incubation Matcher incubation period terms in the sentence. com watch v chxFgObhcDQ Large office buildings vs multiple working locations https www. Period is optional Mortality Rate Matcher mortality rate terms in the sentence. 5 percents Prepare term librariesThe term libraries are taken from the medical literature and used to do seek or refine the searches in order to focus on the known terms virus_ref virus references in articles. The lookout will be performed at the sentence level and not at the full body level for a better approximation. Current Research StatusThe curent research notebook is focusin on understanding the behavior of the coronavirus by scraping the provided articles. Rule example rule Matchers Term Matcher LOWER incubation LOWER period OP Time Matcher matchers Number Suffix Matcher days weeks Time Interval Matcher matchers Number Interval Matcher days weeks root Term Matcher execute lambda x print x Time Matcher incubation_period_report Time Interval Matcher incubation_period_report A rule is made of Matchers and executors starting with root executor. 4 7 4 1 5 1 6 1 7 1 virus_match checks if any virus term is referenced in the text Prepare COVID 19 Literature dataset Define rule matching execution functionsWhen executing a set of rules on a text body the order of the mathcers will be appended to the matching array that will allow the user to define conditional executions when rules match. strip antibody antibodies. is used to filter the dataset when specific referentiation is needed symptoms list of generic symptoms organs list of human organs higher_terms list of terms that are used to define the starting point of an age group lower_terms list of terms that are used to define the end of an age group Defined generic Spacy pattern matchers and util librarythe patterns will be used in order to assemble a set of rules to identify the desired sequence of patterns matchers Term Matcher lookout for a single term Terms Matcher lookout in a list of terms Number Suffix Matcher search for numeric value preceeded by a time definition parametrized e. com watch v QpB9hPaavf4 t 38s Environment with normal working schedule vs work from home shopping allwed https www. ", "id": "debabrata1234/nlp-text-mining-disease-behaviour", "size": "9026", "language": "python", "html_url": "https://www.kaggle.com/code/debabrata1234/nlp-text-mining-disease-behaviour", "git_url": "https://www.kaggle.com/code/debabrata1234/nlp-text-mining-disease-behaviour", "script": "merge_dict_values organ_reference numval sequence_matcher quarantine_matcher figure report_term seaborn numpy virus_match quarantine_report percent_counter spacy.matcher merge_matches gender_match regex_match plot_dict matplotlib.pyplot execute_matches execute_ruleset match transmission_match pandas antigen_matcher dict_counter Matcher tqdm fp_matcher symptom_match merge_keys get_key fatality_match incubation_period_report report_interval parse_body day_value match_parser symptom ", "entities": "(('Matcher Year Matcher Percent Matcher', 'patients'), 'identify') (('Number Suffix Matcher search', 'e.'), 'use') (('that', 'incubation COVID 19 period'), 'parse') (('term librariesThe term libraries', 'virus_ref virus articles'), 'prepare') (('you', 'own scenario'), 'allow') (('Year Interval Matcher', 'years'), 'be') (('png simulator', 'health care'), 'use') (('where coronavirus', 'articles'), 'methodssearche') (('Mortality Matcher Matcher Percent Matcher', 'mortality reported rate'), 'define') (('coronavirus where term', 'articles'), 'QuarantineSearches') (('lookout', 'better approximation'), 'perform') (('when rules', 'conditional executions'), 'check') (('term incubation period', 'potential articles'), 'search') (('search', 'e.'), 'parametrize') (('Time Time incubation_period_report rule', 'root executor'), 'rule') (('it', 'matchers'), 'watch') (('Research curent research Current StatusThe notebook', 'provided articles'), 'be') (('Known Facts', 'other research'), 'represent') (('that', 'account virus housing commercial characteristics'), 'perfome') (('Antigen references', 'literature regex r CF regex r antigen antibod text text'), 'show') (('where engine', 'sentence'), 'rule') (('Period', 'Mortality Rate Matcher mortality rate optional sentence'), 'be') (('search', 'filter'), 'define') (('fatality Reported rates', 'mortality fatality rate matchers percent reports'), 'report') (('report_interval', 'interval e.'), 'year') (('mining', 'terms identification'), 'provide') ", "extra": "['gender', 'patient', 'test']"}