{"name": "panda eda ", "full_name": " h1 1 Introdução ao conjunto de dados PANDA h1 Câncer de Próstata h2 O que é h1 Sintomas h1 Fatores de Risco h3 Hereditariedade h3 Idade h3 Alimentação h3 Hábitos de vida h3 Idade h3 Cor de pele h3 Histórico Familiar h3 Obesidade h1 Prevenção h1 Gleason Score h1 Grade Groups h1 Cálculo h1 2 Bibliotecas h1 3 Carregando o conjunto de dados h1 4 EDA h3 4 1 Verificando a distribuição do isup grade h3 4 2 Verificando a distribuição do data provider h3 4 3 Verificando a distribuição do isup grade x data provider h3 4 4 Verificando a distribuição da base de treino e test h3 4 5 Verificando a distribuição de gleason score h3 4 6 Exibindo rapidamente algumas imagens h2 5 Carregando label masks h3 Visualizando masks usando matplotlib h3 Sobreposição de máscaras nos slides h1 6 Modelagem h3 Variáveis de saída ", "stargazers_count": 0, "forks_count": 0, "description": "PrevençãoO câncer de próstata não pode ser prevenido mas há 90 de chances de cura quando diagnosticado precocemente. Sensação de dor na parte baixa das costas ou na pélvis abaixo dos testículos. 1 Verificando a distribuição do isup_grade 4. As máscaras de etiqueta são armazenadas em um formato RGB para que possam ser facilmente abertas pelos leitores de imagem. Urinar em gotas ou jatos sucessivos. Essa rotação não tem valor clínico e depende apenas de como a biópsia foi coletada no laboratório. Carregando label masksAlém do rótulo no nível do slide presente no arquivo csv quase todos os slides no conjunto de treinamento têm uma máscara associada a informações adicionais sobre o rótulo. Os valores válidos são 0 fundo não tecido ou desconhecido 1 estroma tecido conjuntivo tecido não epitélio 2 epitélio saudável benigno 3 epitélio canceroso Gleason 3 4 epitélio canceroso Gleason 4 5 epitélio canceroso Gleason 5 Karolinska as regiões são rotuladas. O segundo grau secundário está relacionado com a minoria do tumor deve ser menos que 50 mas no mínimo 5 do padrão total do câncer observado. png Fonte https pt. Essas marcas de caneta estão disponíveis em alguns slides do conjunto de treinamento. Dificuldade de iniciar a passagem da urina. Hábitos de vidaOutros fatores cujas associações com câncer da próstata foram detectadas em alguns estudos incluem o fator de crescimento análogo à insulina insulin like growth factor consumo excessivo de álcool e tabagismo. Podem ser uma referência importante na hora de o médico levantar o seu histórico. O paciente pode se decidir se quer remover a próstata para evitar complicações ou não. O primeiro chamado de grau primário representa a maior parte do tumor deve ser maior que 50 do padrão total observado. Quando acontecer em três gerações consecutivas avô pai e filho Na precença de alguns desses critérios o risco de desenvolver a doença é de 50. Na fase inicial o câncer de próstata não tem sintomas. Abaixo algumas dicas de como se preparar para conversar com o seu médico 1. Confira os sintomas que são suspeitos e merecem uma consulta ao médico A sensação de que sua bexiga não se esvaziou completamente e ainda persiste a vontade de urinar. Grau 2 O tecido ainda possui glândulas bem formadas mas elas são maiores e possuem mais tecido entre cada uma. Convide um amigo ou parente próximo para ir com você ao médico. Caso a alteração seja detectada o médico pode solicitar outros exames para confirmar o diagnóstico como o PSA Antígeno Prostático Específico o ultrassom transretal e a biópsia da glândula que consiste na retirada de fragmentos da próstata para análise. Por exemplo uma amostra de próstata pode exibir dois padrões diferentes a um é atribuído o número 2 e ao outro é atribuído o número 3. O sistema Grade Group é mais simples com apenas cinco graus de 1 a 5. Em 95 dos casos eles aparecem em estágio avançado. Por isso muitos homens não apresentam nenhum sintoma ou quando apresentam são semelhantes aos do crescimento benigno da próstata também chamado de HPB. Escreva todos os sintomas que está sentindo mesmo que não pareça estar associado à razão principal da consulta médica. 2 Verificando a distribuição do data_provider 4. Câncer de próstata avançado Fatores de RiscoSabe se pouco sobre a maioria dos fatores de risco em relação ao câncer de próstata já que os estudos epidemiológicos têm encontrado resultados inconsistentes. Só então é feito o diagnóstico. Assim como nos slides as máscaras de etiqueta podem ser abertas usando o OpenSlide. Dois parentes de primeiro grau forem diagnosticados antes dos 55 anos de idade. As informações da etiqueta são armazenadas no canal vermelho R os outros canais são definidos como zero e podem ser ignorados. Isso será importante para ajudá lo a lembrar de tudo o que for discutido. png Localização das imagens de treinamento. Dessa forma se pode classificar em Pontuação 4 ou menor G1 Células bem diferenciadas bom prognóstico pouco risco de complicações. Ela é importante para que você faça os exames preventivos. Se tiver resultados de exames feitos recentemente leve os. Histórico FamiliarSe algum homem da família já teve câncer de próstata a chance de desenvolver a doença é ainda maior. Confira alguns fatores de risco HereditariedadeVários fatores podem ser responsáveis pelo câncer de próstata e a hereditariedade é um deles. As informações nas máscaras diferem dos dois centros Radboudumc as glândulas prostáticas são rotuladas individualmente. Por exemplo usando o matplotlib e um mapa de cores personalizado podemos visualizar rapidamente as diferentes regiões do câncer Sobreposição de máscaras nos slidesComo as máscaras têm a mesma dimensão que os slides podemos sobrepor as máscaras no tecido para ver diretamente quais áreas são cancerígenas. Muitas células estão invadindo o tecido circundante. Em uma magnificação maior algumas destas células deixaram as glândulas e estão começando a invadir o tecido circundante. Estes escores são então somados para se obter o escore final de Gleason. 3 Verificando a distribuição do isup_grade x data provider 4. 5 Verificando a distribuição de gleason scoreVariável de destino mostra distribuição diferente dependendo do provedor de dados. Necessidade de fazer força para manter o jato de urina. A doença é definida como hereditária quando Três ou mais parentes de primeiro grau são afetados. Carregando o conjunto de dados 4. Dica Deseja visualizar os slides de uma maneira mais interativa Usando um visualizador WSI você pode visualizar interativamente os slides. Visualizando masks usando matplotlib Dado que as masks são apenas matrizes inteiras você também pode usar outros pacotes para exibir as masks. Já outras substâncias geradas durante o preparo de alguns alimentos como as aminas heterocíclicas e hidrocarbonetos policíclicos aromáticos têm sido consideradas como componentes da dieta que poderiam aumentar o risco de câncer da próstata. As máscaras de rótulo de Karolinska foram geradas semi automaticamente com base em anotações de um patologista. set_index image_id. ObesidadeHomens com sobrepeso ou obesos além daqueles que fazem abuso de álcool e tabaco tem mais chances de contrair a doença. png Câncer de Próstata O que é O Câncer de Próstata é o resultado de uma multiplicação desordenada das células da próstata. Menos de 10 dos cânceres de próstata têm algum componente hereditário. Homens a partir dos 50 anos de idade ou 45 se houver casos de câncer de próstata na família devem procurar um urologista anualmente para realizar os exames preventivos. Nota No exemplo abaixo você também pode observar algumas marcas de caneta no slide manchas verde escuras. Dor durante a passagem da urina. Somente com o resultado dessa análise do tecido é que poderá ser fornecido o diagnóstico. O exame é rápido e indica se a próstata apresenta algum tipo de alteração. Além desses alguns componentes naturais dos alimentos como as vitaminas A D e E e minerais selênio também parecem desempenhar um papel protetor. Veja as principais perguntas Os sintomas que eu sinto podem significar câncer de próstata Só com o exame de toque retal é possível saber se tenho algum tumor O PSA é um complemento ao exame de toque retal De quanto em quanto tempo preciso repetir os exames Gleason ScoreEscore de Gleason também conhecido como escala ou pontuação de Gleason é uma pontuação dada a um câncer de próstata baseada em sua aparência microscópica. As biópsias podem estar em diferentes rotações. A maioria dos cânceres tem nota 3 ou superior. Os escores de Gleason estão associados com as seguintes características Grau 1 A próstata cancerosa se parece muito com o tecido normal. Sabe se que uma mudança no estilo de vida é crucial para aumentar a sobrevida incluindo uma alimentação saudável e a prática de atividades físicas no dia a dia. Um patologista examina a amostra da biópsia e fornece um escore baseado em dois padrões. Essas marcações não fazem parte do tecido mas foram feitas pelos patologistas que verificaram originalmente este caso. gleason_score Somente no treino. Grade Groups Em 2014 a Sociedade Internacional de Patologistas Urológicos divulgou orientações suplementares e um sistema revisado de classificação do câncer de próstata denominado Grade Groups. 6 Exibindo rapidamente algumas imagens Poucas informações As dimensões da imagem são bastante grandes geralmente entre 5. Mau prognóstico por maior risco de complicações e metástases a próstata deve ser removida. Homens com sobrepeso e obesos também possuem maior risco de desenvolver câncer de próstata. O toque retal é considerado indispensável e não pode ser substituído pelo exame de sangue ou por qualquer outro exame como o ultrassom. O ritual compreende o toque retal e o exame de sangue para checar a dosagem do PSA antígeno prostático específico. Problemas em conseguir ou manter a ereção. Um escore de 2 está associado com o melhor prognóstico enquanto o escore de 10 com o pior. com kaggle media competitions PANDA Screen 20Shot 202020 04 08 20at 202. Para fazer isso carregamos a máscara e a biópsia e as fundimos usando PIL. Grau 4 O tecido possui poucas glândulas reconhecíveis. IdadeAssim como em outros tipos de câncer a idade é um marcador de risco importante ganhando um significado especial no câncer da próstata uma vez que tanto a incidência como a mortalidade aumentam exponencialmente após os 50 anos. Dificuldade de interromper o ato de urinar. set_index image_id Display the image Print the case level label Gere uma miniatura de imagem pequena Opcional crie um mapa de cores personalizado Load data from the highest level Mask data is present in the R channel Create alpha mask Mapping 0 background 1 stroma 2 benign epithelium 3 Gleason 3 4 Gleason 4 5 Gleason 5 Mapping 0 background 1 benign 2 cancer Print the case level label. As glândulas são pequenas bem formadas e muito próximas. IdadeHomens acima dos 50 ou 45 se fizerem parte do grupo de risco devem ir ao urologista anualmente. Existem diferenças visíveis de cores entre as biópsias isso é muito comum na patologia e é causado por diferentes procedimentos laboratoriais. Grau 3 O tecido ainda possui glândulas reconhecíveis mas as células são mais escuras. SintomasEm sua fase inicial o câncer da próstata tem uma evolução silenciosa. Havendo alguma suspeita o paciente deve se submeter à biópsia da próstata. Principalmente se houver dois ou mais parentes de primeiro grau portadores da doença e se esta for descoberta antes dos 60 anos de idade. Assim realizar exames periodicamente é a melhor maneira de se prevenir contra a doença. Cada slide possui 3 níveis que você pode carregar correspondendo a uma redução de amostragem de 1 4 e 16. AlimentaçãoA influência da alimentação sobre a gênese do câncer ainda é incerta não sendo conhecidos os exatos componentes ou mecanismos pelos quais ela pode influenciar o desenvolvimento da doença. Um sistema alternativo de classificação de gravidade de câncer com mais níveis do que a escala ISUP. As evidências apontam que uma dieta rica em frutas verduras legumes grãos e cereais integrais e pobres em gordura principalmente as de origem animal não só ajuda a diminuir o risco de câncer como também o risco de outras doenças crônicas não transmissíveis. Dor nos testículos Dor lombar na bacia ou nos joelhos Sangramento pela uretra. Modelagem Variáveis de saída isup_grade a variável de destino. Para obter detalhes sobre como os sistemas gleason e ISUP se comparam consulte a guia Recursos adicionais. Acompanhar anualmente. Avise o médico se houver pessoas na sua família que tiveram câncer de próstata. Pontuação 8 ou maior G3 Células muito irregulares invasor câncer de alto grau. O mais rápido possível também pode sobrepor as máscaras em cima das imagens usando a funcionalidade Sobrepor. O escore final é uma combinação de dois escores diferentes que variam cada um de 1 a 5. Essa sobreposição pode ajudá lo a identificar os diferentes padrões de crescimento. Exemplos de visualizadores de código aberto que podem abrir o conjunto de dados PANDA são ASAP https github. A gravidade do câncer em uma escala de 0 a 5. O conjunto de dados consiste em cerca de 11. Portanto exames preventivos frequentes são fundamentais para que a doença não seja descoberta em estado avançado. Também tem sido apontada uma relação positiva entre o alto consumo energético total e ingestão de carne vermelha gorduras e leite e o risco de câncer da próstata. Pontuação 5 a 7 G2 Células moderadamente diferenciadas prognóstico menos previsível. Sociedades médicas recomendam que homens a partir dos 50 anos de idade façam o exame de próstata anualmente e acima dos 45 caso esteja inserido nos fatores de risco. Quando alguns sinais começam a aparecer 95 dos tumores já estão em fase avançada dificultando a cura. O escore final de Gleason neste caso seria 5. Quando há presença de câncer a glândula endurece. Pode ser um achado acidental em uma cirurgia para remover parte da hiperplasia benigna de próstata. Valores válidos 0 fundo não tecido ou desconhecido 1 tecido benigno estroma e epitélio combinados 2 tecido canceroso estroma e epitélio combinados As máscaras de etiqueta do Radboudumc foram geradas de forma semi automática por vários algoritmos de aprendizado profundo contêm ruído e podem ser consideradas como etiquetas pouco supervisionadas. org wiki Escore_de_Gleason CálculoO escore de Gleason varia de 2 a 10. Sangue na urina ou no esperma esses são casos muito raros. Introdução ao conjunto de dados PANDAEste notebook mostra alguns métodos para carregar e exibir imagens do conjunto de dados de desafio do PANDA. O escore de Gleason é importante porque escores maiores estão associados a piores prognósticos já que são dados a cânceres mais agressivos varia de 1 a 5 e descreve o quanto o câncer de uma biópsia se parece com tecido saudável pontuação mais baixa ou tecido anormal pontuação mais alta. Quando você for ao médico não se esqueça de esclarecer as dúvidas com relação ao câncer de prótata. png attachment image. Para previnir o câncer de próstata a consulta médica e exames periódicos são essenciais. 000 imagens de slides inteiros WSI de biópsias da próstata de Radboud University Medical Center e do Instituto Karolinska. Um desses exames é o toque retal. Grau 5 O tecido não possui glândulas reconhecíveis. Necessidade premente de urinar imediatamente. Cor de peleHomens negros têm mais casos deste tipo de câncer. Se você usa o Qupath e as imagens não são carregadas tente alterar a extensão do arquivo para. com computationalpathologygroup ASAP e QuPath https qupath. 4 Verificando a distribuição da base de treino e test 4. Caso não sinta absolutamente nada mas esteja na faixa etária dos 50 anos não deixe de fazer a consulta. As dimensões de cada nível diferem com base nas dimensões da imagem original. Essas máscaras indicam diretamente quais partes do tecido são saudáveis e quais são cancerígenas. As justificativas que norteiam a detecção precoce da doença assim como de qualquer outro tipo de câncer é que quanto mais inicialmente for diagnosticado maiores serão as chances de cura além de permitir um tratamento menos agressivo e mutilante. Faça uma lista das medicações que você usa incluindo vitaminas ou suplementos alimentares. Níveis intermediários podem ser criados reduzindo a amostragem de um nível de resolução mais alto. Por outro lado o consumo de frutas vegetais ricos em carotenoides como o tomate e a cenoura e leguminosas como feijões ervilhas e soja tem sido associado a um efeito protetor. ", "id": "rogeriodelfim/panda-eda", "size": "15873", "language": "python", "html_url": "https://www.kaggle.com/code/rogeriodelfim/panda-eda", "git_url": "https://www.kaggle.com/code/rogeriodelfim/panda-eda", "script": "display_mask_images display_images scipy display overlay_mask_on_slide ndimage six IPython.display string_types numpy seaborn matplotlib.pyplot skimage pandas matplotlib.image io ", "entities": "(('Assim realizar', 'doença'), 'exame') (('ObesidadeHomens sobrepeso ou obesos além daqueles que fazem abuso álcool e tabaco tem de mais', 'doença'), 'com') (('de câncer com mais de classificação de gravidade níveis', 'escala ISUP'), 'que') (('Câncer de próstata', 'relação ao câncer de próstata'), 'pouco') (('1 Verificando', 'isup_grade'), 'do') (('para incluindo uma estilo de vida é crucial sobrevida alimentação', 'dia'), 'Sabe') (('gravidade', 'uma'), 'câncer') (('cada dimensões de nível', 'com base nas dimensões da imagem'), 'diferem') (('padrão 5 total', 'câncer'), 'com') (('informações nas máscaras', 'glândulas prostáticas rotuladas são individualmente'), 'diferem') (('baixa das costas ou', 'abaixo dos na testículos'), 'pélvis') (('ou menor G1 4 Células', 'diferenciadas bom risco de bem pouco complicações'), 'pode') (('é combinação de dois escore final uma escores', 'de'), 'diferente') (('exemplo abaixo', 'verde escuras'), 'Nota') (('exemplo próstata pode exibir dois Por uma amostra de padrões', 'ao é 2 e atribuído'), 'diferente') (('PSA antígeno', 'específico'), 'o') (('Havendo alguma paciente', 'submeter biópsia da se próstata'), 'suspeita') (('quais diretamente partes', 'saudáveis e tecido são quais são cancerígenas'), 'indicam') (('maior parte', '50 total'), 'representa') (('slide arquivo csv quase todos', 'têm uma máscara informações adicionais sobre o de rótulo'), 'rótulo') (('Mask data', 'cancer 1 stroma 2 benign 3 Gleason 3 4 Gleason 4 5 5 Mapping 0 background 1 benign 2 Print'), 'image_id') (('tecido para ver diretamente quais', 'são cancerígenas'), 'usando') (('está escore de 2 associado', '10 escore de com pior'), 'com') (('biópsias podem estar', 'rotações'), 'diferente') (('Homens', 'também possuem câncer de sobrepeso e obesos maior risco de desenvolver próstata'), 'com') (('Essas marcações não fazem parte', 'feitas patologistas que originalmente este caso'), 'do') (('quanto', 'chances cura além de de'), 'norteiam') (('Homens', 'procurar'), 'idade') (('3 Verificando', 'isup_grade data provider'), 'do') (('Convide amigo ou', 'você ao ir com médico'), 'parente') (('algumas Poucas dimensões da 6 Exibindo rapidamente imagem', 'geralmente entre'), 'imagen') (('células', 'mais escuras'), 'Grau') (('preventivos frequentes', 'doença'), 'exame') (('magnificação maior algumas destas células Em uma deixaram', 'glândulas e estão começando'), 'invadir') (('fase avançada', 'cura'), 'começam') (('Essa sobreposição', 'padrões de crescimento'), 'pode') (('homem da família já', 'chance'), 'teve') (('Confira alguns de fatores risco', 'HereditariedadeVários podem ser responsáveis pelo câncer de próstata'), 'fatore') (('alguns estudos incluem o fator de crescimento', 'growth factor consumo excessivo de álcool e tabagismo'), 'detectadas') (('Quando', 'dúvidas com relação ao câncer de prótata'), 'você') (('intermediários podem ser Níveis criados', 'resolução mais amostragem de nível de alto'), 'reduzindo') (('cenoura e leguminosas como feijões', 'efeito associado protetor'), 'ricos') (('visualizar interativamente', 'slides'), 'os') (('Já', 'câncer da o risco de próstata'), 'outra') (('Quando há', 'glândula endurece'), 'presença') (('Gleason é uma de pontuação', 'sua aparência microscópica'), 'Veja') (('próstata se parece Grau 1 muito', 'o'), 'Os') (('5 regiões', '0 fundo'), 'são') (('de dados PANDA', 'ASAP https github'), 'abrir') (('próstata', 'deve ser removida'), 'metástase') (('alteração', 'o PSA Antígeno Prostático ultrassom biópsia da glândula que consiste'), 'exame') (('apresentam nenhum sintoma ou quando', 'crescimento'), 'homens') (('Além', 'selênio também parecem papel protetor'), 'desse') (('RGB para que possam facilmente abertas formato ser pelos', 'de imagem'), 'são') (('níveis que pode 3 carregar', 'uma'), 'correspondendo') (('fizerem IdadeHomens acima dos 50 45 se parte', 'ao urologista anualmente'), 'do') (('ainda Grau 2 O tecido possui', 'mas são elas maiores'), 'glândulas') (('mortalidade aumentam exponencialmente após', 'incidência como'), 'câncer') (('paciente', 'próstata para evitar complicações remover ou'), 'pode') (('ou nos joelhos Sangramento', 'pela uretra'), 'testículos') (('é causado por', 'procedimentos laboratoriais'), 'diferença') (('negros têm mais Cor de casos', 'de tipo câncer'), 'peleHomens') (('Se tiver resultados de', 'leve feitos recentemente os'), 'exames') (('PrevençãoO câncer de próstata', 'ser prevenido mas há'), 'pode') (('e agressivos 1 5 o', 'cânceres'), 'associado') (('tecido benigno estroma e epitélio tecido Valores válidos 0 não ou desconhecido 1 combinados 2 canceroso', 'Radboudumc de forma automática por máscaras de geradas vários'), 'fundo') (('como hereditária quando Três ou é mais', 'primeiro grau são de afetados'), 'definida') (('das imagens', 'funcionalidade'), 'pode') (('Estes', 'então somados para se o são obter escore'), 'escore') (('ou maior G3 Células Pontuação 8 muito', 'invasor câncer alto de grau'), 'irregulare') (('Faça uma', 'das medicações que você usa incluindo vitaminas ou suplementos alimentares'), 'lista') (('Principalmente houver dois ou mais', 'dos anos de 60 idade'), 'se') (('patologista examina', 'amostra da biópsia dois e fornece padrões'), 'baseado') (('Essas de caneta estão alguns marcas slides', 'de treinamento'), 'disponíveis') (('Essa rotação', 'biópsia foi laboratório'), 'coletada') (('ou mecanismos pelos quais ela pode', 'desenvolvimento da doença'), 'sobre') (('pai filho Na precença de alguns', 'doença é de 50'), 'acontecer') (('sistema revisado de classificação', 'próstata Grade câncer de denominado Groups'), 'Groups') (('50 de', 'façam'), 'homen') (('outros os canais', 'definidos como e podem ser zero ignorados'), 'são') (('ou', 'ereção'), 'conseguir') (('só', 'diminuir'), 'pobre') (('Visualizando masks usando', 'masks'), 'para') (('extensão', 'arquivo para'), 'são') (('maioria dos', 'tem nota'), 'cânceres') (('PANDAEste notebook mostra alguns métodos para carregar e exibir Introdução conjunto de dados imagens', 'PANDA'), 'ao') (('esperma', 'casos muito são raros'), 'sangue') (('destino mostra 5 Verificando distribuição de gleason scoreVariável de distribuição', 'provedor de dados'), 'diferente') (('rótulo de máscaras de Karolinska', 'anotações de patologista'), 'foram') (('Menos de 10 dos', 'têm algum de próstata componente hereditário'), 'cânceres') ", "extra": "['test', 'bag']"}