{"name": "panda eda visualizations suspicious data ", "full_name": " h1 Quick Overview h2 Findings from Quick Overview h1 Gleason Score and ISUP Grade h2 One Mislabeled Image h1 Differences Between Data Providers h1 Quick Check of Masks and ISUP Grade h2 Summary of Quick Check of Masks and ISUP Grade h1 Visualizing Image and Mask Samples h1 Summary of Suspicious Test Cases h1 One Last Thing Before You Go h1 Code References ", "stargazers_count": 0, "forks_count": 0, "description": "However the severity of the marked cancerous tissue shows an increase in the data provided by Radboud. They used different scanners with slightly different maximum microscope resolutions and worked with different pathologists for labeling their images. com xhlulu for this cool notebook on the most efficient image loading techniques https www. com c prostate cancer grade assessment discussion 145194 816268. The mislabeled image was one of those images but was later moved to the training set. Radboud Prostate glands are individually labelled. Karolinska does not have this label. So the Gleason score is the original label by the study pathologist and the ISUP is the consensus label by the pathologists who graded the test set. Quick OverviewIn this challenge the objective is to detect and classify the severity of prostate cancer on images of prostate tissue samples. This variability in ratings could lead to unnecessary treatment or worse missing a severe diagnosis. For the explanation see this discussion topic https www. Valid values are 0 background non tissue or unknown 1 benign tissue stroma and epithelium combined 2 cancerous tissue stroma and epithelium combined For Karolinska the description actually says values 1 through 3 but in the masks it is 0 through 2. In Karolinska s case these would be marked as benign tissue. Let s have a look whether that is the case Summary of Quick Check of Masks and ISUP GradeFor further analysis we will drop the following test cases 4 test cases with masks that only contain background and no tissue contains 3 test cases marked with ISUP Grade 0 but not cancerous tissue 85 test cases marked with a ISUP Grade 0 but not cancerous tissueHowever for your model it might be a good idea to use these test cases for validation. Below I have summarized the suspicious test cases and wrote them to a file called suspicious_test_cases. However the system suffers from significant inter observer variability between pathologists limiting its usefulness for individual patients. com dhananjay3 panda eda all you need to know linear algebra data processing CSV file I O e. Feel free to use it if you like. Let s have a quick look at the data and get an overview. Findings from Quick OverviewAt first glance we found 100 images without masks. For further analysis we will drop the 100 images without a mask. Gleason Score and ISUP Grade The grading process consists of finding and classifying cancer tissue into so called Gleason patterns 3 4 or 5. All suspicious test cases found in this EDA are summarized in a. com dhananjay3 for the cool idea about using scatter plots to show image width and heights https www. One Last Thing Before You GoThe test set only contains 3 images divided into two images provided by Radboud and one image provided by Karolinska. Visualizing Image and Mask SamplesLet s have a quick first look at the differences between the data providers in regards to the original images and the masks. After the biopsy is assigned a Gleason score it is converted into an ISUP grade on a 1 5 scale. Karolinska labels larger areas a cancerous tissue Interestingly the percentage of cancerous tissue decreases between ISUP Grade 3 and 4 in both data provided by Karolinska and Radboud. In the training set however we have more image provided by Karolinska than by Radboud. However for the test set we used several pathologists who each labeled the images using ISUP not Gleason and derived a consensus label. In Radboud s case ISUP grade 5 also has a lower percentage of cancerous tissue than ISUP Grade. Additionally we found one image that has inconsistent ISUP grade and Gleason score. For an ISUP Grade to be higher than 0 I would expect some cancerous tissue to be marked in the masks. One Mislabeled Image In the above dataframe it looks like one image might have been converted to a wrong ISUP grade. read_csv Loading images Resizing images Visualizing progress Check whether all three channels are empty background non tissue or unknown benign tissue stroma and epithelium combined benign tissue stroma and epithelium combined cancerous tissue stroma and epithelium combined cancerous tissue stroma and epithelium combined cancerous tissue stroma and epithelium combined. However this is not critical. Now let s look at some tissue samples and their corresponding masks Let s have a look at some samples when we use a common mask 0 background non tissue or unknown 1 benign tissue stroma and epithelium combined 2 cancerous tissue stroma and epithelium combined We can see that the labeling between the two data providers still seems to differ While the masks provided by Karolinska seem to be covering larger areas the masks provided by Radboud seem to be covering smaller more specific areas. Summary of Suspicious Test CasesDuring the EDA we found a few susupicious test cases Missing mask Mask only contains background Mask does not contain tissue marked as cancerous although ISUP grade 0Instead of dropping them it might be a good idea to use them for validation since I assume only the masks are suspicious but the ISUP grade might be trustworthy. Valid values are 0 background non tissue or unknown 1 stroma connective tissue non epithelium tissue 2 healthy benign epithelium 3 cancerous epithelium Gleason 3 4 cancerous epithelium Gleason 4 5 cancerous epithelium Gleason 5 Karolinska Regions are labelled. Quick Check of Masks and ISUP GradeLet s do a quick check of the provided masks. All the Karolinska images in the training data is graded by the same pathologist. In practice tissue samples are examined and scored by pathologists according to the so called Gleason grading system which is later converted to an ISUP grade. We will not drop this training data at this point but keep this in mind. Code ReferencesThanks to Xhlulu https www. csv file at the end of this kernel. However for your model it might be a good idea to use these test cases for validation. Differences Between Data ProvidersThere are two data providers. Based on this first comparison of pixel values we can already see As expected ISUP Grade 0 has no cancerous tissue Radboud labels most of the tissue as non epithelium tissue. com xhlulu panda resize and save train dataThanks to Dhananjay Raut https www. But we will get into this in a bit. ", "id": "iamleonie/panda-eda-visualizations-suspicious-data", "size": "6668", "language": "python", "html_url": "https://www.kaggle.com/code/iamleonie/panda-eda-visualizations-suspicious-data", "git_url": "https://www.kaggle.com/code/iamleonie/panda-eda-visualizations-suspicious-data", "script": "matplotlib.cm load_and_resize_image load_and_resize_mask seaborn numpy matplotlib.pyplot tqdm.notebook load_and_resize_mask_with_common_mask pandas get_image_data tqdm # Visualizing progress ", "entities": "(('Below I', 'file'), 'summarize') (('Mask s', 'original images'), 'visualize') (('it', 'validation'), 'let') (('we', 'masks'), 'finding') (('ISUP grade', 'ISUP Grade'), 'have') (('cancerous tissue', 'masks'), 'be') (('Karolinska', 'Karolinska'), 'label') (('Gleason ISUP grading process', 'Gleason so called patterns'), 'Score') (('it', '2'), 'be') (('we', 'mask'), 'drop') (('ISUP grade', 'validation'), 'Summary') (('objective', 'tissue prostate samples'), 'OverviewIn') (('that', 'ISUP inconsistent grade'), 'find') (('one image', 'ISUP wrong grade'), 'Image') (('three channels', 'progress'), 'image') (('However system', 'individual patients'), 'suffer') (('it', '1 5 scale'), 'assign') (('You GoThe One Last test', 'one Karolinska'), 'thing') (('mislabeled image', 'training later set'), 'be') (('s', 'overview'), 'let') (('these', 'benign tissue'), 'mark') (('who', 'consensus label'), 'use') (('They', 'images'), 'use') (('test suspicious cases', 'a.'), 'summarize') (('variability', 'worse severe diagnosis'), 'lead') (('which', 'ISUP later grade'), 'examine') (('all you', 'linear algebra data CSV file'), 'com') (('ISUP already Grade', 'epithelium non tissue'), 'have') (('masks', 'smaller more specific areas'), 'let') (('who', 'test set'), 'be') (('However severity', 'Radboud'), 'show') (('3 Karolinska 2 healthy benign epithelium 3 cancerous epithelium 4 cancerous 4 5 cancerous Gleason 5 Regions', 'stroma 0 background non unknown 1 connective non epithelium tissue'), 'be') (('it', 'validation'), 'be') (('Differences', 'Data ProvidersThere'), 'be') (('We', 'mind'), 'drop') (('however we', 'Radboud'), 'set') (('images', 'same pathologist'), 'grade') ", "extra": "['biopsy', 'biopsy of the greater curvature', 'patient', 'test', 'diagnosis']"}