{"name": "part 1 breast cancer analyzer web app ", "full_name": " h3 What problem needs to be solved h3 Project Objective h3 Glossary of Terms h3 Reference Papers h3 What is the potential of computational pathology h3 Part 1 IDC Model h3 What files are available h3 Copy all images into one directory h3 Create a dataframe containing all the information h3 Display a random sample of train images by class h3 Balance the class distribution h3 Create the train and val sets h3 Create a Directory Structure h3 Transfer the images into the folders h3 Set Up the Generators h3 Create the Model Architecture h3 Train the Model h3 Evaluate the model using the val set h3 Plot the Training Curves h3 Make a prediction on the val set h3 What is the AUC Score h3 Create a Confusion Matrix h3 Create a Classification Report h3 Convert the model to from Keras to Tensorflowjs h3 Conclusion ", "stargazers_count": 0, "forks_count": 0, "description": "Check the number of patient folders. com vbookshelf Breast Cancer Analyzer Glossary of Terms Histopathology This inolves examining glass tissue slides under a microscope to see if disease is present. Therefore to allow them to be used in machine learning these digital images are cut up into Patches. We will create the models in two kernels. Essentially it punishes extreme values. Sentinel Lymph Node A blue dye and or radioactive tracer is injected near the tumor. Metastasis The spread of cancer cells to new areas of the body often via the lymph system or bloodstream. Reference PapersThese are the papers that are associated with the two datasets that we will be using Automatic detection of invasive ductal carcinoma in whole slide images with Convolutional Neural Networks Link https www. The images are in png format. For example a 50x50 patch is a square patch containing 2500 pixels taken from a larger image of size say 1000x1000 pixels. These need to match the order shown above. Lymph nodes filter substances that travel through the lymphatic fluid. Results Our cnn model will achieve an accuracy and F1 score that is approximately 0. In order to detect cancer a tissue section is put on a glass slide. org stable auto_examples model_selection plot_confusion_matrix. Live web app http histo. Put the predictions into a dataframe. The web app will be able to detect two forms of breast cancer Invasive Ductal Carcinoma IDC Metastatic CancerWe will create two CNN models an IDC_model and a Metastatic_model. Create a new directory CREATE FOLDERS INSIDE THE BASE DIRECTORY now we create 2 folders inside base_dir train_dir a_no_idc b_has_idc val_dir a_no_idc b_has_idc create a path to base_dir to which we will join the names of the new folders train_dir val_dir CREATE FOLDERS INSIDE THE TRAIN AND VALIDATION FOLDERS Inside each folder we create seperate folders for each class create new folders inside train_dir create new folders inside val_dir check that the folders have been created Set the id as the index in df_data Get a list of train and val images Transfer the train images the id in the csv file does not have the. Create a list with all the patient id numbers. The columns need to be oredered to match the output of the previous cell Get the true labels Get the predicted labels as probabilities Source Scikit Learn website http scikit learn. work Github https github. What is the AUC Score Create a Confusion Matrix Create a Classification Report Recall Given a class will the classifier be able to detect it Precision Given a class prediction from a classifier how likely is it to be correct F1 Score The harmonic mean of the recall and precision. com vbookshelf part 2 breast cancer analyzer web app End of Intro Start of Part 1 Number of samples we want in each class. ConclusionIn part 2 we will use the same workflow to build a model to detect metastatic cancer. tif extension therefore we add it here get the label for a certain image these must match the folder names source path to image destination path to image move the image from the source to the destination check how many train images we have in each folder check how many val images we have in each folder End of Data Preparation Start of Model Building Note shuffle False causes the test dataset to not be shuffled Source https www. Copy all images into one directoryThis will make it easier to work with this data. This is based on a classification threshold of 0. com gpreda honey bee subspecies classification adjust size here draw a number of images for each location figure_cols is also the sample size What is the class distribution take a sample of the majority class 0 total 198738 take a sample of class 1 total 78786 concat the two dataframes Check the new class distribution train_test_split stratify y creates a balanced validation set. com watch v gcFnyuc7Bew Part 1 IDC ModelIn this section we will create the IDC_model. argmax returns the index of the max value in a row Print the label associated with each class Define the labels of the class indices. It should be noted that the creators of the paper https www. To ensure privacy and patient confidentiality all images will be processed locally and never uploaded to an external server. The first lymph node reached by this injected substance is called the sentinel lymph node. This model will predict whether or not Invasive Ductal Carcinoma is present. png split into a list the id is the first index in the list split into a list the target is part of the string in index 4 the ytarget i. Whole Slide Image WSI A digitized high resolution image of a glass slide taken with a scanner. com watch v MCRtJDDrdcA This 1 46 video features Ian Ellis Professor of Cancer Pathology at Nottingham Universityhttps www. com gigascience article 7 6 giy065 5026175 What is the potential of computational pathology This is what two experts have to say This is a 1 21 video featuring Prof Jeroen van der Laak a co author of the CAMELYON paper. Invasive Ductal Carcinoma This is the most common subtype of all breast cancers. Many thanks to Paul Mooney for making the Breast Histopathology Images dataset available on Kaggle. The images can be several gigabytes in size. A pathologist then examines this slide under a microscope. Lymph Node This is a small bean shaped structure that s part of the body s immune system. Patch A patch is a small usually rectangular piece of an image. 1 or 2 is the 5th index of the string class1 extract the patient id create a new column called patient_id create a new column called target source https www. Each patient folder has two sub folders that groups together images with the same class 0 or 1. Results Due to the large amount of high quality data that s available for training our models will produce the following results approx IDC_model Accuracy 0. 94 All the html css and javascript code used to build the web app is available on Github. Metastatic Cancer A metastatic cancer or metastatic tumor is one that has spread from the site where it started into different area s of the body. Link to Part 2 https www. display the loss and accuracy curves make a prediction This is how to check what index keras has internally assigned to each class. 88 Metastatic_model Accuracy 0. This dataset consists of 277 524 image patches of size 50x50 198 738 IDC negative and 78 786 IDC positive. com fmarazzi baseline keras cnn roc fast 5min 0 8253 lb get the metric names so we can use evaulate_generator Here the best epoch will be used. The technology that enables this app to work is new. In this case that would be examining tissue samples from lymp nodes in order to detect breast cancer. The pathologist needs to visually scan large regions where there s no cancer in order to ultimately find malignant areas. Project Objective The goal of this project is to create a web based tool that can batch analyze histopathology image patches and predict if breast cancer is present. Create a dataframe containing all the information Display a random sample of train images by class Balance the class distribution Create the train and val sets Create a Directory Structure Transfer the images into the folders Set Up the Generators Create the Model Architecture Train the Model Evaluate the model using the val set Plot the Training Curves Make a prediction on the val setWe need these predictions to calculate the AUC score print the Confusion Matrix and calculate the F1 score. What problem needs to be solved The process that s used to detect breast cancer is time consuming and small malignant areas can be missed. Convert the model to from Keras to TensorflowjsThis conversion needs to be done so that the model can be loaded into the web app. The images that we will be using are all of tissue samples taken from sentinel lymph nodes. A pathologist will be able to select which cancer he or she wants to detect submit many images at the same time and get an instant prediction indicating whether or not breast cancer is present in those images. In part 1 we will build the IDC_model and in part 2 the Metastatic_model. Create a new directory to store all available images check that the new diectory has been created This code copies all images from their seperate folders into the same folder called all_images_dir. tif extension therefore we add it here get the label for a certain image these must match the folder names source path to image destination path to image move the image from the source to the destination Transfer the val images the id in the csv file does not have the. Almost 80 of diagnosed breast cancers are of this subtype. Therefore I recommend using the latest version of the Chrome browser. What files are available The images are grouped into 279 folders by patient_id. Because these glass slides can now be digitized computer vision can be used to speed up a pathologist s workflow and provide diagnosis support. They contain lymphocytes white blood cells that help the body fight infection and disease. Generate a classification report For this to work we need y_pred as binary labels not as probabilities Use the command line conversion tool to convert the model Delete all_images_dir and base_dir directory to prevent a Kaggle error. Dataset We will use the Breast Histopathology Images dataset. 5GB Define Helper Functions Each file name has this format 14211_idx5_x2401_y1301_class1. When using Safari for example you may see a message indicating that the model is loading but the app may actually be frozen. Kaggle allows a max of 500 files to be saved. There are a lot of folders to work with. These models will be loaded into a Tensorflowjs web app. net publication 263052166_Automatic_detection_of_invasive_ductal_carcinoma_in_whole_slide_images_with_Convolutional_Neural_Networks realting to this dataset used a threshold of 0. net publication 263052166_Automatic_detection_of_invasive_ductal_carcinoma_in_whole_slide_images_with_Convolutional_Neural_Networks 1399 H E stained sentinel lymph node sections of breast cancer patients the CAMELYON dataset Link https academic. In part 2 I will also cover some lessons that I learned while building the app. Each patient id folder has 2 sub folders folder 0 and folder 1 Example 10285 0 1 create a list of all patient id s create a list of all files in folder 0 create a list of list all file in folder 1 move the 0 images to all_images_dir source path to image destination path to image copy the image from the source to the destination move the 1 images to all_images_dir source path to image destination path to image copy the image from the source to the destination check how many images are in all_images_dir should be 277 524 size 2. Total images used SAMPLE_SIZE X 2 The minority class is class 1 with 78786 samples. html sphx glr auto examples model selection plot confusion matrix py Get the labels of the test images. By deploying a machine learning solution as a web app it can be made available to medical personnel anywhere in the world for free. ", "id": "vbookshelf/part-1-breast-cancer-analyzer-web-app", "size": "7882", "language": "python", "html_url": "https://www.kaggle.com/code/vbookshelf/part-1-breast-cancer-analyzer-web-app", "git_url": "https://www.kaggle.com/code/vbookshelf/part-1-breast-cancer-analyzer-web-app", "script": "Flatten sklearn.utils sklearn.metrics tensorflow.keras.metrics tensorflow.keras.optimizers extract_target tensorflow.keras.layers tensorflow.keras.preprocessing.image tensorflow.keras.callbacks EarlyStopping Dropout Sequential tensorflow.keras.models Adam numpy.random shuffle Conv2D numpy plot_confusion_matrix ReduceLROnPlateau seed extract_patient_id ModelCheckpoint confusion_matrix ImageDataGenerator sklearn.model_selection matplotlib.pyplot Dense tensorflow pandas classification_report set_random_seed categorical_crossentropy Model draw_category_images MaxPooling2D roc_auc_score train_test_split ", "entities": "(('We', 'two kernels'), 'create') (('that', 'lymphatic fluid'), 'node') (('html javascript css code', 'Github'), '94') (('images', 'several size'), 'be') (('it', 'data'), 'make') (('it', 'anywhere world'), 'by') (('probabilities', 'Delete base_dir Kaggle error'), 'need') (('Patch patch', 'small usually rectangular image'), 'be') (('It', 'paper https www'), 'note') (('that', 'same class'), 'have') (('1 we', 'part'), 'build') (('1000x1000 pixels', 'size'), 'say') (('models', 'Tensorflowjs web app'), 'load') (('I', 'app'), 'cover') (('patient images', 'locally external server'), 'process') (('1 46 video', 'Nottingham Universityhttps www'), 'watch') (('pathologist', 'ultimately malignant areas'), 'need') (('Sentinel Lymph blue dye', 'radioactive tumor'), 'Node') (('train_test_split y', 'validation balanced set'), 'draw') (('Here best epoch', 'evaulate_generator'), 'cnn') (('breast cancer', 'images'), 'be') (('max', '500 files'), 'allow') (('html sphx glr auto examples model selection plot confusion matrix', 'test images'), 'get') (('Invasive Ductal Carcinoma IDC Metastatic CancerWe', 'CNN two models'), 'be') (('time small malignant areas', 'breast cancer'), 'need') (('new diectory', 'same folder'), 'check') (('computer now digitized vision', 'diagnosis support'), 'use') (('we', 'class'), 'com') (('i d', 'the'), 'extension') (('index keras', 'internally class'), 'display') (('disease', 'microscope'), 'com') (('label', 'class indices'), 'return') (('target', 'index'), 'split') (('Breast Histopathology Images', 'Kaggle'), 'thank') (('AUC score', 'F1 score'), 'create') (('We', 'Breast Histopathology Images'), 'Dataset') (('net realting', '0'), 'publication') (('dataset', 'Model Building Note shuffle False'), 'extension') (('that', 'following results'), 'produce') (('Therefore them', 'Patches'), 'allow') (('probabilities Source Scikit Learn website http scikit', 'predicted labels'), 'need') (('Therefore I', 'Chrome browser'), 'recommend') (('app', 'message'), 'see') (('pathologist', 'microscope'), 'examine') (('small bean shaped that', 'immune system'), 'Node') (('dataset', 'size'), 'consist') (('we', 'Convolutional Neural Networks Link https www'), 'be') (('images', 'patient_id'), 'be') (('GB Define Helper file 5 name', 'format 14211_idx5_x2401_y1301_class1'), 'function') (('IDC gcFnyuc7Bew Part 1 section we', 'IDC_model'), 'ModelIn') (('that', 'breast cancer'), 'in') (('model', 'web app'), 'convert') (('Link https', 'sentinel lymph node breast cancer net H E stained patients'), 'publication') (('These', 'order'), 'need') (('Almost 80', 'subtype'), 'be') (('how many images', 'all_images_dir'), 'have') (('minority 2 class', '1 78786 samples'), 'use') (('breast cancer', 'histopathology image analyze patches'), 'Objective') (('where it', 'body'), 'be') (('ConclusionIn part 2 we', 'metastatic cancer'), 'use') (('This', '1 Prof Jeroen van der CAMELYON 21 co paper'), 'article') (('patient i', 'd numbers'), 'create') (('lymph first node', 'injected substance'), 'call') (('index', 'the'), 'create') (('F1 that', 'accuracy'), 'achieve') (('tissue section', 'glass slide'), 'put') (('how it', 'F1 correct harmonic recall'), 'be') (('Invasive Ductal This', 'breast most common cancers'), 'Carcinoma') (('we', 'lymph sentinel nodes'), 'be') (('body', 'infection'), 'contain') (('that', 'app'), 'be') (('This', '0'), 'base') (('patient', 'new column'), 'extract') ", "extra": "['disease', 'patient', 'test', 'diagnosis', 'lymphocyte', 'metastasis']"}