{"name": "pinkdragon1000 mushroom classification ", "full_name": " h2 Mushroom Classification Is it poisonous or edible h2 PinkDragon1000 h4 Date 8 13 18 h2 h4 Abstract h3 1 Introduction h4 Objectives h3 2 Problem Definition h3 3 Data Sets h3 4 Preparation h3 5 Exploration and Visualization h3 6 Modeling and Evaluation h3 7 Conclusion h3 8 References ", "stargazers_count": 0, "forks_count": 0, "description": "Even though most mushrooms seem to be edible mushroom poisoning can cause discomfort and even in some cases death. The symptoms appear within twenty minutes to four hours of ingestion. The worst situation seems to be if it is predicted edible but it is actually poisonous. Cross validation is a way to check for overfitting. jpg AbstractFor this project I used the Mushroom Classification dataset from Kaggle. The purpose of these models are to predict that. Objectives Preprocessing and exploratory data analysis steps such as loading the data into the data frame checking the shape number of rows columns getting the head of data checking for missing and duplicate values etc. SVM gave about 100 accuracy while logistic gave about 94 accuracy and naive bayes performed the worst which was around 81 accuracy. Mushroom Classification Is it poisonous or edible PinkDragon1000 Date 8 13 18 https img. Let us predict our labels using the test portion of the data set. Poisonous mushrooms are found to mostly cause gastrointestinal problems and in the worst case may cause respiratory or kidney failure. Naive BayesScikit Learn ImplementationNow that we have trained our model. The goal is to find the best model to predict whether a mushroom is poisionous or edible poisonous or not poisonous. IntroductionI chose the Mushroom Classification dataset from Kaggle. The two matrices below show that the SVM model performed with 100 accuracy. The Kaggle website provides information on what the column data means class p poisonous e edible cap shape bell b conical c convex x flat f knobbed k sunken s cap surface fibrous f grooves g scaly y smooth s cap color brown n buff b cinnamon c gray g green r pink p purple u red e white w yellow y bruises bruises t no f odor almond a anise l creosote c fishy y foul f musty m none n pungent p spicy s gill attachment attached a descending d free f notched n gill spacing close c crowded w distant d gill size broad b narrow n gill color black k brown n buff b chocolate h gray g green r orange o pink p purple u red e white w yellow y stalk shape enlarging e tapering t stalk root bulbous b club c cup u equal e rhizomorphs z rooted r missing stalk surface above ring fibrous f scaly y silky k smooth s stalk surface below ring fibrous f scaly y silky k smooth s stalk color above ring brown n buff b cinnamon c gray g orange o pink p red e white w yellow y stalk color below ring brown n buff b cinnamon c gray g orange o pink p red e white w yellow y veil type partial p universal u veil color brown n orange o white w yellow y ring number none n one o two t ring type cobwebby c evanescent e flaring f large l none n pendant p sheathing s zone z spore print color black k brown n buff b chocolate h green r orange o purple u white w yellow y population abundant a clustered c numerous n scattered s several v solitary y habitat grasses g leaves l meadows m paths p urban u waste w woods d Let s look at the descriptive statistics for the data Looking at the number of poisonous and edible mushrooms in this dataset. To prepare the model the dataset needs to be split into test and train. Modeling and EvaluationThe sklearn naive bayes algorithm cannot directly operate on categorical features that are non numeric so we will use sklearn s LabelEncoder to convert the categorical features to numeric values. The sample set contains around 23 species of mushrooms from the gilled mushroom Agaricus and Lepiota Family. Exploration and VisualizationShows how many unique values there are for each column. Now let s evaluate how well the model performs. com dtmcms live webmd consumer_assets site_images articles health_tools all_about_mushrooms_slideshow 493ss_thinkstock_rf_poisonous_mushroom. This dataset is one of those. com uciml mushroom classification home. Making a confusion matrix The matrix below is the same but is normalized. Splitting the dataset into test and train. Support Vector Machines SVM Scikit Learn ImplementationNow let s evaluate how well the model performs. Normalized matrix Logistic RegressionScikit Learn ImplementationNow that we have trained our model. The mushrooms are either identified as completely poisonous or completely edible. com building a logistic regression in python step by step becd4d56c9c8https www. org mushroom_poisoning_syndromes. PreparationThere are 8124 rows and 23 columns in this dataset. phphttp scikit learn. Let s look at how the LabelEncoder transformed our data. Now the categorical variables are shown numerically. The data is completely categorical and there are 8124 rows and 23 columns. Same matrix with normalization 7. html Encodes labels from 0 to n_classes 1 75 train 25 test Vectorize the training and test data Creating a MultinomialNB classifier and fit the model. It was put on Kaggle by the UCI Machine Learning group. The best model was svm and it gave 100 accuracy the next best model was logistic regression with around 94 accuracy and finally naive bayes with 81 accuracy. There are more edible mushrooms than poisonous mushrooms 4 208 versus 3 916 in this dataset. Visualizing number of poisonous and edible mushrooms Looking at the cap color distribution in this dataset. Now let s evaluate how well the logistic model performs. Showing first 5 rows of the dataset. Cross validation Since the cross validation score is close to the logistic regression model score that means it is not overfitting the data. Data SetsThe dataset can be found here https www. The other situations are if it is predicted poisonous but is edible poisonous and is poisonous edible and is edible. The format of the data is in a CSV format and is in one single file called mushrooms. The two classes of mushrooms are p poisonous and e edible. Visualizing number of each cap shape 6. The method train_test_split randomly splits the dataset into 75 train and 25 test. To prepare the data for use in machine learning models I had to map these categorical values to numerical values using the labelEncoder function. Seeing what labelEncoder did to the poisonous p and edible e labels. I used three types of models using scikit learn which are naive bayes svm secure vector machines and logistic regression. Edible is set to 0 and Poisonous is now set to 1. There are no duplicate values in this dataset. Given the cross validation average is close to the accuracy of the naive bayes model we can conclude that our model does not really overfit. This dataset is comprised of completely categorical features. I first started with regular data preparation techniques and went on to exploring the data. Then I split the dataset into test 25 and train 75. Referenceshttps towardsdatascience. The two main classes of mushrooms are poisonous and not poisonous edible. There was nothing inaccurately predicted. The dataset was put on Kaggle by UCI Machine Learning Repository which maintains around 351 datasets. Problem DefinitionPoisonous mushrooms can often times confuse people into thinking they are not posionous due to their similar appearance to some non poisonous mushroom types. Given the cross validation average is close to the accuracy of the SVM model we can conclude that our model generalizes well and is not overfitting. Visualizing number of each cap color Looking at the number of mushrooms there are for each cap shape in this dataset. ConclusionEven though all models did well the best model out of naive bayes SVM and logistic regression is SVM. Finding the best sklearn model that accurately predicts whether a mushroom is poisonous or edible using naive bayes support vector machines and logistic regression 2. To prepare the dataset for classification purposes it needs to be split for the test and train. Looking at the columns in dataset There are no null values in this dataset. ", "id": "pinkdragon1000/pinkdragon1000-mushroom-classification", "size": "8446", "language": "python", "html_url": "https://www.kaggle.com/code/pinkdragon1000/pinkdragon1000-mushroom-classification", "git_url": "https://www.kaggle.com/code/pinkdragon1000/pinkdragon1000-mushroom-classification", "script": "sklearn.metrics cross_val_score sklearn.naive_bayes TfidfVectorizer recall_score precision_score numpy sklearn.feature_extraction.text MultinomialNB plot_confusion_matrix linear_model sklearn.model_selection sklearn f1_score confusion_matrix matplotlib.pyplot pandas accuracy_score svm model_selection datasets train_test_split preprocessing ", "entities": "(('html Encodes', 'model'), 'label') (('head', 'missing values'), 'preprocesse') (('models', 'naive bayes SVM regression'), 'be') (('dataset', 'test'), 'prepare') (('Exploration', 'how many unique column'), 'be') (('mushroom', 'best model'), 'be') (('it', 'test'), 'need') (('It', 'UCI Machine Learning group'), 'put') (('two main classes', 'mushrooms'), 'be') (('dataset', 'completely categorical features'), 'comprise') (('us', 'data set'), 'let') (('it', 'data'), 'be') (('how LabelEncoder', 'data'), 'let') (('SVM model', '100 accuracy'), 'show') (('s', 'dataset'), 'provide') (('which', 'naive worst'), 'give') (('which', 'around 351 datasets'), 'put') (('model', 'SVM model'), 'be') (('accurately mushroom', 'bayes support vector naive machines'), 'find') (('we', 'model'), 'Learn') (('next best model', 'finally naive 81 accuracy'), 'be') (('Poisonous', 'now 1'), 'set') (('Then I', '25 75'), 'split') (('which', 'scikit learn'), 'use') (('purpose', 'that'), 'be') (('we', 'model'), 'RegressionScikit') (('format', 'one single file'), 'be') (('symptoms', 'ingestion'), 'appear') (('non so we', 'numeric values'), 'sklearn') (('I', 'data'), 'start') (('IntroductionI', 'Kaggle'), 'choose') (('PreparationThere', '8124 23 dataset'), 'be') (('sample set', 'mushroom gilled Agaricus'), 'contain') (('jpg I', 'Kaggle'), 'AbstractFor') (('I', 'labelEncoder function'), 'prepare') (('labelEncoder', 'poisonous p'), 'see') (('model', 'bayes naive model'), 'be') (('Even most mushrooms', 'cases even death'), 'cause') (('Poisonous mushrooms', 'respiratory failure'), 'find') (('Cross validation', 'overfitting'), 'be') (('matrix', 'confusion matrix'), 'make') (('live consumer_assets', 'articles health_tools 493ss_thinkstock_rf_poisonous_mushroom'), 'webmd') (('com', 'step becd4d56c9c8https www'), 'build') (('method', '75 train'), 'split') (('two classes', 'mushrooms'), 'be') (('they', 'mushroom non poisonous types'), 'time') ", "extra": "['test']"}