{"name": "predict whether the cancer is benign or malignant ", "full_name": " h1 Breast Cancer Wisconsin Diagnostic Data Set h1 Exploratory Data Analysis EDA h1 Data Preprocessing h1 Model Evaluation Metrics h1 Breast Cancer Prediction h1 Feature decomposition using Principal Component Analysis PCA h1 Conclution ", "stargazers_count": 0, "forks_count": 0, "description": "Following the encoding of the categorical features we will continue with the normalization scalling of the numerical features. Model Evaluation Metrics For model evaluation and To perform a full ROC analysis let s define two functions Breast Cancer Prediction Feature decomposition using Principal Component Analysis PCA The importance of a feature is computed as the normalized total reduction of the criterion brought by that feature. We can also see that area_worst and perimeter_worst are also quite useful. The columns 3 32 contain 30 real value features that have been computed from digitized images of the cell nuclei which can be used to build a model to predict whether a tumor is benign or malignant. 9954 Random Forest Model Prediction with PCA The precision is 97. For this we will use the MinMax scalling method. 0 g concavity severity of concave portions of the contour h concave points number of concave portions of the contour i symmetryj fractal dimension coastline approximation 1 The mean standard error and worst or largest mean of the threelargest values of these features were computed for each image resulting in 30 features. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session Import datset Visualizing Multidimensional Relationships create the correlation matrix heat map Transform the yes and no values target variable to 1 and 0 respectively Split the data to train and test sets Defining model evaluation function Calculating the precision tp tp fp Calculating the recall tp tp fn Defining function for performing a full ROC analysis Calculate Area Under Curve AUC for the Receiver Operating Characteristics Curve ROC Instantiate the Random Forest model Pre tuned Hyperparameter of Random Forest Classifier on this dataset Assign the above probabilities to the corresponding class no yes Evaluate the model by using Recall Precission Evaluate the model by using ROC Curve Plot for feature importance Assign the above probabilities to the corresponding class no yes Evaluate the model by using Recall Precission Evaluate the model by using ROC Curve. Conclution Using PCA I used only 10 components important from the dataset though it contains 30 components However with PCA RF the model slightly outweigh in recall precision and ROC AUC score than that of the previous model. Here I use sklearn to scale and transform the data such that each attribute has a mean value of zero and a standard deviation of one. Values closer to zero show less skew. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. The dataset contains 569 samples of malignant and benign tumor cells. 24 The recall is 93. It is also known as the Gini importance. For instance field 3 is Mean Radius field13 is Radius SE field 23 is Worst Radius. png We will start with Dataset DescriptionThe Breast Cancer datasets is available UCI machine learning repository maintained by the University of California Irvine. 9974 This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. Random Forest Model Prediction without PCA The precision is 95. Exploratory Data Analysis EDA Data Preprocessing Transform the M and B values target variable to 1 and 0 respectively. read_csv Input data files are available in the read only. All feature values are recoded with four significant digits. 62 The recall is 95. 1 Malignant Cancerous Present M 0 Benign Not Cancerous Absent BAttribute Information 1 ID number2 Diagnosis M malignant B benign 3 32 Ten real valued features are computed for each cell nucleus a radius mean of distances from center to points on the perimeter b texture standard deviation of gray scale values c perimeterd areae smoothness local variation in radius lengths f compactness perimeter 2 area 1. The first two columns in the dataset store the unique ID numbers of the samples and the corresponding diagnosis M malignant B benign respectively. From the graphs we can see that radius_mean perimeter_mean area_mean concavity_mean and concave_points_mean are useful in predicting cancer type due to the distinct grouping between malignant and benign cancer types in these features. Breast Cancer Wisconsin Diagnostic Data Set image. Let s evaluate the same algorithms with a standardized copy of the dataset. Missing attribute values noneClass distribution 357 benign 212 malignant Let s load libraries Let s drop the unnecessary data NULL The skew result show a positive right or negative left skew. png attachment f1190e9a 0b29 424b aee0 a0acc7cb3b08. ", "id": "sevdatrumanidze/predict-whether-the-cancer-is-benign-or-malignant", "size": "3599", "language": "python", "html_url": "https://www.kaggle.com/code/sevdatrumanidze/predict-whether-the-cancer-is-benign-or-malignant", "git_url": "https://www.kaggle.com/code/sevdatrumanidze/predict-whether-the-cancer-is-benign-or-malignant", "script": "pandas.plotting sklearn.metrics getModelEvaluationMetrics PCA scatter_matrix MinMaxScaler seaborn numpy scipy.stats sklearn.decomposition sklearn.ensemble sklearn sklearn.model_selection confusion_matrix RandomForestClassifier matplotlib.pyplot pandas classification_report norm StandardScaler accuracy_score model_selection roc_auc_score sklearn.preprocessing roc_curve train_test_split createROCAnalysis ", "entities": "(('skew result', 'positive right left skew'), 'let') (('precision', 'Random Forest Model PCA'), 'Prediction') (('dataset', 'tumor malignant cells'), 'contain') (('png We', 'California Irvine'), 'start') (('1 mean standard error', '30 features'), 'severity') (('such attribute', 'standard one'), 'use') (('importance', 'feature'), 'metric') (('Exploratory Data Analysis EDA Data Preprocessing Transform', 'variable 1'), 'target') (('feature values', 'four significant digits'), 'recode') (('radius_mean perimeter_mean area_mean concavity_mean', 'features'), 'see') (('we', 'scalling MinMax method'), 'use') (('Mean Radius 3 field13', 'instance field'), 'be') (('we', 'numerical features'), 'follow') (('s', 'dataset'), 'let') (('read_csv Input data files', 'read'), 'be') (('cell nucleus', 'radius lengths'), 'compute') (('tumor', 'model'), 'contain') (('precision', 'Random Forest Model 9954 PCA'), 'Prediction') (('Pre', 'ROC Curve'), 'list') (('it', 'previous model'), 'Using') (('It', 'kaggle python Docker image https github'), '9974') ", "extra": "['biopsy of the greater curvature', 'test', 'diagnosis']"}