{"name": "prostate cancer detection end to end ml project ", "full_name": " h1 Introduction h1 Exploratory Data Analysis h1 Data h1 Data Labels h1 Data Pre Processing h1 Data Labelling h1 Training the Models h1 Conclusion ", "stargazers_count": 0, "forks_count": 0, "description": "Some really interesting ideas utilised by the top solutions included running predictions from several models and chosing the most common predicted value and accessing data from the highest resolution for uncertain regions. Our EDA checked for mislabelled examples i. I had to settle for binary cross entropy which doesn t distinguish how far away mis classifications are from the true value whereas the final grading for this competition does. At this stage we had three models which could ascertain with about 70 accuracy whether each pattern was present in a tile. Machine Learning has already shown promise in this domain. As mentioned in the introduction I trained three seperate pre trained RESNET50 models to detect the three patterns of prostate cancer Gleason 3 Gleason 4 and Gleason 5. Detailed code similar to the final code used can be found here http www. I repeated the process with cropping instead of padding to obtain twice as much data. Data LabelsEach image in our training data comes with a corresponding mask tiff file of same size providing us with pixelwise labelling in the red channel other channels are set to zero. The Radboud labels were semi automatically generated by several deep learning algorithms contain noise and can be considered weakly supervised while the Karolinska labels were semi automatically generated based on a pathologist s annotations. We see below that our data is split nearly 50 50 across our two data providers but that the examples provided by Radboud University Medical Center are more severe than those provided by the Karolinska institute. The ISUP grade follows directly from the given Gleason score it is essentially a tidier scale to reflect the Gleason Score. Techniques which proved fruitful for other entrants will be discussed as well as the principal avenues for improvement. There is definitely room for improvement in this step of the system and I will be experimenting by accessing different tiles for instance 16 tiles from the lowest layer as well as using augmentation of the training data. 1 is perfect 0 is no better than chance Designing the System The rest of this notebook will describe at a relatively high level each step of designing and training this system. I hard coded some procedures which got a QWK score of 0. Training the ModelsEach tile was copied to three folders according to whether each of the three possible patterns were present or not. com dararc introduction eda For the sake of brevity within this notebook I present a small snapshot of the analysis I conducted. I then accessed the intermediate layer of the data and padded it to so that both dimensions were multiples of 224 I then selected the 24 224x224 px boxes with the most tissue. The Data 10 616 Whole Slide Images between 5 000 and 40 000 pixels in both width and height lots of empty space of prostate tissue format Multi level tiff file with accompanying Masks which contain pixelwise labels for each image. That is to say only tiles coming from images which were either purely benign only gleason 3 only gleason 4 or only gleason 5 were used as training data for the RESNET50 models. DataIt took a little time to get used to working with multi level tiff files. These binary classifiers consist of a RESNET50 model pretrained on ImageNet and trained on our Data to detect one of three possible Gleason patterns of prostate cancer. Valid values 0 background non tissue or unknown 1 benign tissue stroma and epithelium combined 2 cancerous tissue stroma and epithelium combined We will label apply Karolinska s method of not distinguishing between stroma and epithelium. I dropped any suspicious image ids from our training data i. Validation accuracy got to roughly 0. Each of the selected tiles is fed to three distinct binary classifiers. The motivation Within Cancer grade assessment there can be significant inter observer variability and the time of expert pathologists is a valuable limited resource. I will certainly be gleaning as much as I can from the other entrant s work to improve my own system before taking the knowledge gained with me for other challenges. I trained it on all the training data minus suspicious slides. Key Karolinska Black Background Grey Healthy Tissue Purple Cancerous Radboud Black Background Grey Healthy Tissue Yellow Gleason 3 Orange Gleason 4 Red Gleason 5 Data Pre ProcessingThe training data above needed to be pre processed into a form that could train a model. After about 25 epochs the model tended towards overfitting. 53 on the unseen test data. com iafoss panda 16x128x128 tiles which he made public early on in the challenge was utilised by a lot of contenders. set directory load data useful function for plotting counts useful function for plotting relative distributions creating a function to take an image id and return an array of the image or mask as required we set up two colour maps as described above this function will take 5 image ids and display an image and the related mask. Valid values are 0 background non tissue or unknown 1 stroma connective tissue non epithelium tissue 2 healthy benign epithelium 3 cancerous epithelium Gleason 3 4 cancerous epithelium Gleason 4 5 cancerous epithelium Gleason 5 Karolinska Regions are labelled. I thoroughly enjoyed and appreciated the code and ideas that I learnt from and look forward to the next challenge. Two other points of note During the challenge it was revealed by the organisers that the Radboud data contained a significant level of noise. The output of each of these models are collected for each of the 30 tiles. I decided that a cancerous region could obviously be present in the tile with the 25th most amount still some of tissue so I decided to run these models on the top 30 tiles when predicting. I made two small Neural Networks I am currently unsure if a Neural Network was the best choice for this task I will be researching this over the coming weeks one for each data provider. Each data provider labels the data slightly differently so with the help of a custom colour map we can display some images alongside their labels. This was a deciding factor in my decision to split up the examples by data provider in the last step of grading. Access the intermediate layer of the Whole Slide Image multi level tiff file split it into 224x224 px tiles and select the 30 tiles with the most tissue. Links to the code will be provided and questions in the comments are welcome. I conducted the same process with the masks to obtain 224x224 label images for each tile. Radboudumc Prostate glands are individually labelled. This system was designed as an entry to a 25 000 Kaggle competition hosted by the Karolinska Institute Medical University Sweden and the Radboud University Medical Center Netherlands. Iafoss great tiling technique http www. The winning entry scored 0. Radboud data provided us with labels as to whether Gleason 3 Gleason 4 or Gleason 5 was present in a particular region so for each of our training tiles I could read the corresponding mask file and determine whether each of the patterns was present in the tile. ConclusionThe system scored a QWK of 0. We see here an sample from the same image at each of the three resolutions starting with the lowest before zooming in twice 4x in each case on a particular section. A score of 1 would be a perfect performance grading every example with the same grade given by expert pathologists. 19 before realising that several thousand examples of 90 values which predict a single value was a perfect task for machine learning. It is worth mentioning here how the gleason score and the isup grade are calculated. While a score of 0 is a performance no better than chance. com dararc eda on tile labels Karolinska data only labelled tissue as cancerous or benign. com dararc gl3 panda training. This will take a lot of GPU hours so it will probably be late August before these improvements are live. Multi level means the file contains the same image at three different resolutions corresponding to a downsampling of 1 4 and 16. Was copied to the three folders Gleason 3 present Gleason 4 absent Gleason 5 present. e for reasons of mislabelling pen marks or missing masks. Our csv file contains the image id with which we can access the multi level tiff file the data provider the ISUP grade and the underlying gleason patterns. This was my first ML competition having started upskilling into the field in March. The gleason score refers to which patterns are present 0 0 reflects no cancer present while a gleason score of 4 3 indicates gleason pattern four is the most prevalent cancer present while gleason three is also present. ISUP of 0 indicates no cancer while ISUP 5 is the most severe grading. The Result Quadratic Weighted Kappa score of 0. For instance a tile containing gleason 3 and gleason 5 but not gleason 4. These models would give us 3 figures per tiles so we still had to collate these 90 figures into a single ISUP grade. Exploratory Data AnalysisA detailed introduction to the challange and exploratory data analysis including python code can be found here. So I only used Karolinska slides which contained only one pattern. I could make use of all the Karolinska data in this phase as I was now predicting with our RESNET50 models on the top 30 tiles per image the mask files were irrelevant for this step as all the labels I needed was the final ISUP grade of the whole slide. I completed Introduction to TensorFlow for Artificial Intelligence Machine Learning and Deep Learning a four week course on the Coursera platform. I experiemented with some resizing methods and edge detection using convolutions but having seen the success of the tiling technique I decided to utilise it with an adjustment to obtain twice as much data. isup grades which did not match the underlying gleason patterns one mislabelled example was identified and removed. The tiles were saved as png files and my code for the process padding version cropping version differs only in two lines can be found here http www. 7 for these models training of one can be found here http www. This way I used all the data to train each model to ascertain whether each pattern was present or absent in a given tile. These 90 values split according to data provider are fed to one of two small Neural Networks which were trained on our data to output a final ISUP grade 0 1 2 3 4 or 5. Introduction The Task Design a system to grade Whole Slide Images of Prostate Tissue Biopsies. I tried to use the QWK as the loss function for this model but did not get this custom loss function finished in time Another task for the coming weeks. The NN would take 90 values and output a single ISUP grade. This was done using three seperate notebooks as I ran up against the memory limits when running it all in one notebook. This gave me a grounding in flowing image data to Neural Networks using the Keras API. com dararc panda step 1 tiling Data Labelling Up until now I had got by with an introduction from Andrew Ng s Machine Learning course plenty of python tutorials particularly several DataCamp courses learning from other entrants notebooks and many hours of trial and error. We see below for reference the first five rows of the CSV file provided alongside our images and masks. ", "id": "dararc/prostate-cancer-detection-end-to-end-ml-project", "size": "11329", "language": "python", "html_url": "https://www.kaggle.com/code/dararc/prostate-cancer-detection-end-to-end-ml-project", "git_url": "https://www.kaggle.com/code/dararc/prostate-cancer-detection-end-to-end-ml-project", "script": "plot5 plot_relative_distribution plot_count load_model tiles2pred seaborn numpy matplotlib.pyplot id2tiles pandas id2array matplotlib.image tensorflow.keras.models ", "entities": "(('model', 'overfitting'), 'after') (('it', 'Gleason essentially tidier Score'), 'follow') (('which', 'only one pattern'), 'use') (('I', 'analysis'), 'com') (('motivation', 'inter observer expert significant pathologists'), 'be') (('certainly as much I', 'other challenges'), 'glean') (('I', 'instead twice as much data'), 'repeat') (('rest', 'system'), 'be') (('he', 'contenders'), 'utilise') (('final grading', 'competition'), 'have') (('file', '1 4'), 'mean') (('ISUP', 'cancer'), 'indicate') (('output', '30 tiles'), 'collect') (('I', 'most tissue'), 'access') (('custom loss function', 'coming weeks'), 'try') (('I', 'forward next challenge'), 'enjoy') (('Machine Learning', 'domain'), 'show') (('pattern', 'tile'), 'have') (('I', 'many trial'), 'step') (('binary classifiers', 'prostate cancer'), 'consist') (('level tiff multi data', 'ISUP grade'), 'contain') (('I', 'Coursera platform'), 'complete') (('DataIt', 'level tiff multi files'), 'take') (('This', 'Keras API'), 'give') (('so I', 'top 30 tiles'), 'decide') (('probably late improvements', 'GPU hours'), 'take') (('which', 'machine perfect learning'), '19') (('one mislabelled example', 'gleason underlying patterns'), 'grade') (('cancer gleason most prevalent three', '4'), 'refer') (('Each', 'three distinct binary classifiers'), 'feed') (('I', 'data one provider'), 'make') (('3 only 4 gleason', 'RESNET50 models'), 'be') (('Karolinska data', 'only tissue'), 'com') (('models training', 'here www'), 'find') (('really interesting ideas', 'uncertain regions'), 'include') (('I', 'ISUP final whole slide'), 'make') (('pattern', 'given tile'), 'use') (('process', 'here www'), 'save') (('which', '0'), 'code') (('examples', 'Karolinska institute'), 'see') (('We', 'particular section'), 'see') (('EDA', 'examples mislabelled i.'), 'check') (('each', 'three possible patterns'), 'copy') (('I', 'training data'), 'be') (('which', 'image'), 'image') (('This', 'grading'), 'be') (('I', 'tile'), 'conduct') (('This', 'March'), 'be') (('score', 'expert pathologists'), 'be') (('first five rows', 'images'), 'see') (('Detailed code', 'here www'), 'find') (('I', 'training data'), 'drop') (('Radboud data', 'noise'), 'reveal') (('tissue tissue Valid values 0 background non unknown 1 benign epithelium combined 2 cancerous We', 'stroma'), 'tissue') (('Karolinska weakly labels', 'automatically pathologist annotations'), 'generate') (('Access', 'most tissue'), 'split') (('we', 'labels'), 'label') (('which', 'as well principal improvement'), 'discuss') (('introduction', 'python code'), 'detail') (('NN', 'ISUP single grade'), 'take') (('other channels', 'zero'), 'come') (('I', 'twice as much data'), 'experiemente') (('each', 'tile'), 'provide') (('3 Karolinska 2 healthy benign epithelium 3 cancerous epithelium 4 cancerous 4 5 cancerous Gleason 5 Regions', 'stroma 0 background non unknown 1 connective non epithelium tissue'), 'be') (('which', 'ISUP final grade'), 'feed') (('I', 'one notebook'), 'do') (('score', 'better chance'), 'be') (('I', 'prostate cancer Gleason'), 'train') (('I', 'minus suspicious slides'), 'train') (('questions', 'comments'), 'provide') (('so we', 'ISUP single grade'), 'give') (('that', 'model'), 'Healthy') (('system', 'Karolinska Institute Medical University Sweden'), 'design') (('we', 'image'), 'take') ", "extra": "['annotation', 'biopsy of the greater curvature', 'test', 'procedure']"}