{"name": "prostate cancer ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "Symptoms Prostate cancer may cause no signs or symptoms in its early stages. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. Prostate cancer that s more advanced may cause signs and symptoms such as Trouble urinating Decreased force in the stream of urine Blood in semen Discomfort in the pelvic area Bone pain Erectile dysfunction Reading File and Deleting the Unique Columns Diagnosis Result Chart k Neighbors Classifier Decision Tree Classifier This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. read_csv Input data files are available in the. Deleting the unique column First 10 Records 2. However while some types of prostate cancer grow slowly and may need minimal or even no treatment other types are aggressive and can spread quickly. What types of crimes are most common Making and Splitting The Training and Test Data Using KNN For Prediction How did our model perform Using Decision Tree For Prediction How did our model perform Using Gauian Naive Bayes For Prediction How did our model perform. What types of crimes are most common 2. I use seaborn for plotting. Prostate cancer is cancer that occurs in the prostate a small walnut shaped gland in men that produces the seminal fluid that nourishes and transports sperm. Introduction This EDA looks at the Prostate Cancer data. For example running this by clicking run or pressing Shift Enter will list all files under the input directory Any results you write to the current directory are saved as output. Usually prostate cancer grows slowly and is initially confined to the prostate gland where it may not cause serious harm. ", "id": "royrangan7/prostate-cancer", "size": "959", "language": "python", "html_url": "https://www.kaggle.com/code/royrangan7/prostate-cancer", "git_url": "https://www.kaggle.com/code/royrangan7/prostate-cancer", "script": "DecisionTreeClassifier sklearn metrics sklearn.model_selection sklearn.naive_bayes sklearn.tree seaborn numpy neighbors model_selection matplotlib.pyplot GaussianNB pandas tree train_test_split ", "entities": "(('read_csv Input data files', 'the'), 'be') (('you', 'output'), 'list') (('How model', 'Prediction'), 'be') (('Symptoms Prostate cancer', 'early stages'), 'cause') (('where it', 'serious harm'), 'grow') (('It', 'python docker image https kaggle github'), 'cause') (('that', 'seminal fluid'), 'be') (('even other types', 'slowly minimal'), 'be') (('EDA', 'Prostate Cancer data'), 'introduction') ", "extra": "['biopsy of the greater curvature', 'test', 'diagnosis']"}