{"name": "prostate cancer panda insight eda ", "full_name": " h1 About this Notebook h1 Domain Knowledge h3 Q 1 What is Prostate h3 Q 2 Where is it located h3 Q 3 What is the job of Prostate h3 Q 4 What is Prostate Cancer h3 Q 5 Causes h3 Q 6 How is it Diagnosed h3 Q 7 What are the benefits and risks of screening h3 Q 8 So what is Prostat biopsy and how it is done h2 Q 9 What is GLEASON score h3 Q 11 So What is ISUP grade now h3 Q 11 How has the Gleason scores been generated in the dataset h1 Now let s deep dive into the Data h4 Let s see the training data h4 Now let s check the number of images types of data provider ISUP Grades and Gleason Scores h4 Let s check the ISUP Grdes of different Gleason Scores h4 Converting negative Gleason Score to 0 0 h4 Dropping the image having incorrect ISUP Score from the train set h3 Let s see the test Data h3 Now it s time for presenting our Data in a beautiful way which is often called EDA h2 Now let s check the Image h4 Displaying few images h4 Displaying an image with it s Zoomed version h4 Displaying multiple images with it s attributes like Data Provider Gleason Score and ISUP Grade h3 Visualizing masks using matplotlib h3 Displaying Images and it s Mask Side by Side h3 Overlaying masks on the slides h3 Exploring images with pen markers h4 Future Work ", "stargazers_count": 0, "forks_count": 0, "description": "ASAP can also overlay the masks on top of the images using the Overlay functionality. A biopsy is a type of minor surgery. The urethra is a tube that carries urine from the bladder out through the penis. Also we see that Gleason Score 4 3 have two ISUP Grades which is 3 and 2. These markings are not part of the tissue but were made by the pathologists who originally checked this case. Since we know that the correct ISUP Grade for Gleason Score is 3 we need to find the one which is labeled as Gleason Score as 2 and remove that. A risk of a PSA test is that it may miss detecting cancer a false negative. Each epithelial unit is separate and has a lumen. For that reason it s treated as prostate cancer in bone. It should be done with a PSA test. Since prostate cancers often have areas with different grades a grade is assigned to the 2 areas that make up most of the cancer. Although most often the Gleason score is based on the 2 areas that make up most of the cancer there are some exceptions when a biopsy sample has either a lot of high grade cancer or there are 3 grades including high grade cancer. Q 2 Where is it located The prostate is below the bladder and in front of the rectum. The label information is stored in the red R channel the other channels are set to zero and can be ignored. com gpreda panda challenge starting eda This kernel will be a work in Progress and I will keep on updating it as the competition progresses and I learn more and more things about the data Future Work Building a Baseline model If you find this kernel useful Please consider Upvoting it it motivates me to write more Quality content Thank you Happy Kaggling Location of the training images image and mask directories Location of training labels Open the image does not yet read the image into memory Read a specific region of the image starting at upper left coordinate x 17800 y 19500 on level 0 and extracting a 256 256 pixel patch. Let s take a look on few of these images. Note that slightly different procedures were in place for the images used in the test set than the training set. D Prostatic adenocarcinoma Gleason Pattern 5 has an almost complete loss of glandular differentiation. This microphotograph shows irregular cribriform cancer i. Cancers with Gleason scores of 8 to 10 may be called poorly differentiated or high grade. The first number assigned is the grade that is most common in the tumor. This is a standard way of staining the originally transparent tissue to produce some contrast. C Prostatic adenocarcinoma Gleason Pattern 4 has partial loss of glandular differentiation. All microphotographs show hematoxylin and eosin stains at 20x lens magnification. Now let s deep dive into the Data Let s see the training data Now let s check the number of images types of data provider ISUP Grades and Gleason Scores. Q 3 What is the job of Prostate The main job of the prostate and seminal vesicles is to make fluid to bathe semen. epithelial sheets with multiple lumina. Being fully aware of the problem statement will help you to build a better model. This is likely to help some men live longer. There are also some poorly formed small glands and some fused glands. Visualizing masks using matplotlib Apart from the slide level label present in the csv file almost all slides in the training set have an associated mask with additional label information. The glands are grouped together. These pen markings are available on some slides in the training set. Q 7 What are the benefits and risks of screening The PSA test and DRE are very important tools. Intermediate levels can be created by downsampling a higher resolution level. So till now we are we gained the knowledge about this disease. Q 8 So what is Prostat biopsy and how it is done The decision to have a biopsy is based on PSA and DRE results. But the DRE by itself cannot detect early cancer. Because of this doctors have developed Grade Groups ranging from 1 most likely to grow and spread slowly to 5 most likely to grow and spread quickly Grade Group 1 Gleason 6 or less Grade Group 2 Gleason 3 4 7 Grade Group 3 Gleason 4 3 7 Grade Group 4 Gleason 8 Grade Group 5 Gleason 9 10Below is the video I should recommend you to watch for better understanding of GLEASON score Q 11 So What is ISUP grade now According to current guidelines by the International Society of Urological Pathology ISUP the Gleason scores are summarized into an ISUP grade on a scale from 1 to 5 according to the following rule Gleason score 6 ISUP grade 1 Gleason score 7 3 4 ISUP grade 2 Gleason score 7 4 3 ISUP grade 3 Gleason score 8 ISUP grade 4 Gleason score 9 10 ISUP grade 5 If there is no cancer in the sample we use the label ISUP grade 0 in this competition. The prostate is about the size of a walnut and weighs about one ounce. PSA is a protein made only by the prostate and prostate cancers. Finally I would like to thank the authors of following kernels. DRE is safe and easy to do. The grading system recognizes three categories 3 4 and 5. Converting negative Gleason Score to 0 0 Dropping the image having incorrect ISUP Score from the train set Let s see the test DataThey are only 3 images in the test and they too are hidden and we have access to them only when we are submitting. This rotation has no clinical value and is only dependent on how the biopsy was collected in the lab. Upon seeing any abnormality in the PSA and DRE test results doctor recommends Prostate biopsy. During ejaculation sperm is made in the testicles and then moves to the urethra. It looks scary don t be scared watch this video Now once the tissue is collected and if cancer cells are found the pathologist will assign a Gleason Score which helps to determine the severity risk of the disease. Let s check the ISUP Grdes of different Gleason Scores Two things we see Here we see that negative and 0 0 Gleason Scores have some ISUP Grade which is 0. Very little PSA is found in the blood of a man with a healthy prostate. To do this we load both the mask and the biopsy and merge them using PIL. Now let s explore the Diagnosis of this disease and come to our problem statetemt of how we can use Gleason Score. Small glands infiltrate between benign glands. The test might also detect very slow growing cancer that will never cause problems if left untreated. A low PSA is a sign of prostate health. Q 5 Causes No one knows why or how prostate cancer starts. For example men with a Gleason score 3 4 7 cancer tend to do better than those with a 4 3 7 cancer. Grades 2 through 4 have features in between these extremes. In Training set Biopsys are of more ISUP Grade 0 and ISUP Grade 1. Based on the Gleason score prostate cancers are often divided into 3 groups Cancers with a Gleason score of 6 or less may be called well differentiated or low grade. In theory the Gleason score can be between 2 and 10 but scores below 6 are rarely used. This mixture of semen and fluid from the prostate and seminal vesicles forms the ejaculate that passes through the urethra and out of the penis. Note In the example above you can also observe a few pen markings on the slide dark green smudges. After spreading cancer cells may attach to other tissues and grow to form new tumors causing damage where they land. The rise tells us that cancer may be present. For this exam the healthcare provider puts a lubricated gloved finger into the rectum. For example if the Gleason score is written as 3 4 7 it means most of the tumor is grade 3 and less is grade 4 and they are added for a Gleason score of 7. Grade GroupsIn recent years doctors have come to realize that the Gleason score might not always be the best way to describe the grade of the cancer for a couple of reasons Prostate cancer outcomes can be divided into more than just the 3 groups mentioned above. B Prostatic adenocarcinoma Gleason Pattern 3 has no loss of glandular differentiation. This blood test measures the level of PSA in the blood. The benefit of OpenSlide is that we can load arbitrary regions of the slide without loading the whole image in memory. ZOOMED FUGURE UNZOOMED FIGURE Here we compute the pixel spacing the physical size of a pixel in the image. DRE The digital rectal examination DRE helps your doctor find prostate problems. com c prostate cancer grade assessment discussion 145219 Now it s time for presenting our Data in a beautiful way which is often called EDAKarolinska has provided more images than Radbond. Gleason Pattern 5 may also contain solid sheets or strands of cancer cells. When found early it can be treated early which helps stop or slow the spread of cancer. About this NotebookGetting the domain knowledge is the first thing we should do for any Kaggle Competition. The man either bends over or lies curled on his side on a table. All of these are included in Gleason Pattern 4. Examples of open source viewers that can open the PANDA dataset are ASAP and QuPath. Biopsies can be in different rotations. Prostate cancer cells can spread by breaking away from a prostate tumor. Almost all cancers are grade 3 or higher grades 1 and 2 are not often used. Q 1 What is Prostate The prostate is a part of the male reproductive system. The scale of the Gleason score can be misleading for patients. Another reason for a high PSA can be benign non cancer enlargement of the prostate. If you use Qupath and the images do not load try changing the file extension to. Each slide has 3 levels you can load corresponding to a downsampling of 1 4 and 16. 000 pixels in both x and y. Cancers with a Gleason score of 7 may be called moderately differentiated or intermediate grade. These masks directly indicate which parts of the tissue are healthy and which are cancerous. com wouterbulten getting started with the panda dataset https www. The prostate surrounds the urethra. This overlay can help you identifying the different growth patterns. They can travel through blood vessels or lymph nodes to reach other parts of the body. IMAGE MASKS Create alpha mask Mapping 0 background 1 stroma 2 benign epithelium 3 Gleason 3 4 Gleason 4 5 Gleason 5 Mapping 0 background 1 benign 2 cancer. During this test the doctor feels for an abnormal shape or thickness to the prostate. This kernel will be a work in Progress and I will keep on updating it as the competition progresses and I learn more and more things about the data If you find this kernel useful Please consider Upvoting it it motivates me to write more Quality content Domain Knowledgelet s start with some basic questions that should come to everyones mind before getting your hands on dataset given for this Competition. Prostatitis inflammation of the prostate can also cause high PSA results. A Benign prostate glands with folded epithelium The cytoplasm is pale and the nuclei small and regular. About 1 in 9 men will be diagnosed with prostate cancer in their lifetime. The appearance of the glands forms the basis of the Gleason grading system. Display the image Close the opened slide after use Here we compute the pixel spacing the physical size of a pixel in the image. Q 11 How has the Gleason scores been generated in the dataset Each WSI in this challenge contains one or in some cases two thin tissue sections cut from a single biopsy sample. At the same time fluid from the prostate and the seminal vesicles also moves into the urethra. Displaying Images and it s Mask Side by Side Overlaying masks on the slidesAs the masks have the same dimension as the slides we can overlay the masks on the tissue to directly see which areas are cancerous. They help to find prostate cancer early before it spreads. Exploring images with pen markersIt is mentioned that in training dataset there are few images with pen markers on them. com rohitsingh9990 panda eda better visualization simple baseline https www. In these cases the way the Gleason score is determined is modified to reflect the aggressive fast growing nature of the cancer. The pathologist is the doctor who will look carefully at the tissue samples to look for cancer cells. The samples are made up of glandular tissue and connective tissue. As with the slides itself the label masks can be opened using OpenSlide. So We need to merge these two. Q 6 How is it Diagnosed Screening Screening means testing for a disease even if you have no symptoms. For example a man with a Gleason score 6 cancer might assume that his cancer is in the middle of the range of grades which in theory go from 2 to 10 even though grade 6 cancers are actually the lowest grade seen in practice. A rise in PSA level does not tell us the type of cancer cells present. The label masks of Karolinska were semi autotomatically generated based on annotations by a pathologist. When prostate cancer occurs it starts in the prostate gland and occasionally spreads to the seminal vesicles. The cytoplasm is often dark and the nuclei enlarged with dark chromatin and some prominent nucleoli. Prior to scanning the tissue is stained with haematoxylin eosin H E. This assumption might lead a man to think his cancer is more likely to grow and spread quickly than it really is which might affect his decisions about treatment. Q 4 What is Prostate Cancer Prostate cancer is a form of cancer that develops in the prostate gland. There is an attempt to form lumina but the tumor fails to form complete well developed glands. Here in this notebook I will be sharing complete insight of Prostate Cancer it s detection and using this knowledge we will be doing EDA and will build a model. Learnt a lot from https www. It is the second leading cause of cancer deaths for men in the U. The information in the masks differ from the two centers Radboudumc Prostate glands are individually labelled. Even though there is no known reason for prostate cancer there are many risks associated with the disease like Age Ethnicity Family History Smoking Diet etc. The disease is metastatic prostate cancer not bone cancer. A false positive result may lead to a biopsy that isn t needed. Displaying an image with it s Zoomed version Displaying multiple images with it s attributes like Data Provider Gleason Score and ISUP Grade Few Insights The image dimensions are quite large typically between 5. The glandular structure characteristic of healthy prostate tissue is progressively lost with increasing grade. Your doctor will also consider your family history of prostate cancer ethnicity biopsy history and other health factors. Valid values 0 background non tissue or unknown1 benign tissue stroma and epithelium combined 2 cancerous tissue stroma and epithelium combined The label masks of Radboudumc were semi automatically generated by several deep learning algorithms contain noise and can be considered as weakly supervised labels. com tanulsingh077 prostate cancer in depth understanding eda model https www. Q 9 What is GLEASON score The Gleason system which has been in use for many years assigns grades based on how much the cancer looks like normal prostate tissue. Some of the training set images have stray pen marks on them but the test set slides are free of pen marks. To know more about test submission folow this discussion https www. At this point image data is read from the file and loaded into memory. ISUP Grade 0 and 1 are more provided by Karolinska ISUP Grade 3 4 5 are more provided by Radbound Isup 2 in training set has come almost equal from the both data provider Gleason Score 0 0 and 3 3 contiribute more to the Training dataset Now let s check the Image Displaying few imagesIn the following sections we will load data from the slides with OpenSlide. For a prostate biopsy tiny pieces of tissue are removed from the prostate and looked at under a microscope. Prostate cancer is the most serious cause of a high PSA result. Eight out of ten autopsy cancers found are small with tumors that are not harmful. When prostate cancer spreads from its original place to another part of the body the new tumor has the same kind of abnormal cells and the same name as the primary original tumor. OpenSlide gives the resolution in centimeters so we convert this to microns. This is the only way to know for sure if you have prostate cancer. Autopsy studies show 1 in 3 men over the age of 50 have some cancer cells in the prostate. The label masks are stored in an RGB format so that they can be easily opened by image readers. If the cancer looks a lot like normal prostate tissue a grade of 1 is assigned. Valid values are 0 background non tissue or unknown1 stroma connective tissue non epithelium tissue 2 healthy benign epithelium3 cancerous epithelium Gleason 3 4 cancerous epithelium Gleason 4 5 cancerous epithelium Gleason 5 Karolinska Regions are labelled. There are noticable color differences between the biopsies this is very common within pathology and is caused by different laboratory procedures. The glands are hollow structures which can be seen as white holes or branched cavities in the WSI. A rapid rise in PSA may be a sign that something is wrong. Dispersed single cancer cells are seen in the stroma. The two main types of screenings are PSA Blood Test The prostate specific antigen PSA blood test is one way to screen for prostate cancer. These 2 grades are added to yield the Gleason score also called the Gleason sum. And men with a Gleason score 8 cancer tend to do better than those with a Gleason score of 9 or 10. If the cancer looks very abnormal it is given a grade of 5. For example if prostate cancer spreads to the bones the cancer cells in the bones are actually prostate cancer cells. The organizers left us with a Note as described below. The dimensions of each level differ based on the dimensions of the original image. Tip Want to view the slides in a more interactive way Using a WSI viewer you can interactively view the slides. Or the test may be a false positive suggesting something is wrong when you are actually healthy. ", "id": "spidyweb/prostate-cancer-panda-insight-eda", "size": "18279", "language": "python", "html_url": "https://www.kaggle.com/code/spidyweb/prostate-cancer-panda-insight-eda", "git_url": "https://www.kaggle.com/code/spidyweb/prostate-cancer-panda-insight-eda", "script": "display overlay_mask_on_slide IFrame display_masks YouTubeVideo mask_img plot_count seaborn numpy graph_objs get_values plotly plotly.express display_images IPython.display Image matplotlib.pyplot pandas graph_objs as go plotly.figure_factory ", "entities": "(('this', 'laboratory different procedures'), 'be') (('scale', 'patients'), 'be') (('structure glandular characteristic', 'progressively increasing grade'), 'lose') (('prostate', 'about one ounce'), 'be') (('label masks', 'pathologist'), 'generate') (('early it', 'prostate cancer'), 'help') (('Being', 'better model'), 'help') (('between scores', '6'), 'be') (('DRE', 'early cancer'), 'detect') (('cancer', 'why prostate'), 'cause') (('They', 'body'), 'travel') (('2 grades', 'Gleason score'), 'add') (('who', 'cancer cells'), 'be') (('even you', 'symptoms'), 'Q') (('rohitsingh9990 panda com eda', 'baseline https better simple www'), 'visualization') (('label masks', 'OpenSlide'), 'open') (('image dimensions', 'quite typically 5'), 'display') (('almost all slides', 'label additional information'), 'have') (('which', 'ISUP Grade'), 'let') (('prostate biopsy tiny pieces', 'microscope'), 'remove') (('PSA', 'only prostate cancers'), 'be') (('information', 'centers Radboudumc Prostate two glands'), 'label') (('s', 'images'), 'let') (('that', 'penis'), 'form') (('Prostate cancer cells', 'away prostate tumor'), 'spread') (('first we', 'Kaggle Competition'), 'be') (('organizers', 'Note'), 'leave') (('pixel', 'image'), 'FIGURE') (('Cancers', '7'), 'call') (('you', '1 4'), 'have') (('following we', 'OpenSlide'), 'provide') (('you', 'interactively slides'), 'want') (('ejaculation sperm', 'then urethra'), 'make') (('when you', 'something'), 'be') (('healthcare provider', 'rectum'), 'put') (('cytoplasm', 'often dark chromatin'), 'be') (('biopsy when sample', 'grade 3 high cancer'), 'be') (('other channels', 'zero'), 'store') (('mask Location', '256 pixel 0 256 patch'), 'challenge') (('that', 'problems'), 'detect') (('About 1 in 9 men', 'lifetime'), 'diagnose') (('man', 'table'), 'bend') (('which', 'tissue'), 'indicate') (('which', 'Radbond'), 'discussion') (('test results PSA doctor', 'Prostate biopsy'), 'upon') (('we', 'model'), 'share') (('how much cancer', 'prostate normal tissue'), 'q') (('isn t', 'that'), 'lead') (('that', 'most tumor'), 'be') (('who', 'originally case'), 'be') (('appearance', 'Gleason grading system'), 'form') (('we', 'memory'), 'be') (('It', 'U.'), 'be') (('it', 'occasionally seminal vesicles'), 'start') (('Now s', 'data provider ISUP Grades'), 'let') (('early which', 'cancer'), 'treat') (('grade', '1'), 'tissue') (('reason', 'cancer benign non prostate'), 'be') (('prostate', 'rectum'), '2') (('directly areas', 'tissue'), 'display') (('Gleason score', '6'), 'divide') (('doctor', 'prostate cancer ethnicity biopsy history'), 'consider') (('you', 'slide dark green smudges'), 'note') (('main job', 'bathe semen'), 'Q') (('grading system', 'three categories'), 'recognize') (('Cancers', '8 to 10'), 'call') (('epithelial unit', 'lumen'), 'be') (('slightly different procedures', 'training set'), 'note') (('that', 'PANDA dataset'), 'be') (('Gleason 4 3 7 cancer', '3 4 7 cancer'), 'score') (('This', 'contrast'), 'be') (('only sure you', 'prostate cancer'), 'be') (('prostate', 'male reproductive system'), 'q') (('hollow which', 'branched WSI'), 'be') (('which', 'that'), 'need') (('Very little PSA', 'healthy prostate'), 'find') (('only when we', 'them'), 'convert') (('biopsy', 'PSA results'), 'Q') (('Prostatitis inflammation', 'PSA also high results'), 'cause') (('that', 'Competition'), 'be') (('very it', '5'), 'give') (('doctor', 'prostate problems'), 'DRE') (('tissue two thin sections', 'biopsy single sample'), 'q') (('that', 'penis'), 'be') (('men', '9'), 'tend') (('Intermediate levels', 'resolution higher level'), 'create') (('only how biopsy', 'lab'), 'have') (('where they', 'damage'), 'attach') (('Gleason score', 'cancer'), 'modify') (('cytoplasm', 'prostate Benign folded epithelium'), 'gland') (('test set slides', 'pen marks'), 'have') (('microphotograph', 'cribriform cancer irregular i.'), 'show') (('seminal vesicles', 'also urethra'), 'at') (('microphotographs', '20x lens magnification'), 'show') (('tumor', 'complete well developed glands'), 'be') (('pixel', 'image'), 'display') (('really which', 'treatment'), 'lead') (('C Prostatic adenocarcinoma', 'glandular differentiation'), 'have') (('we', 'PIL'), 'load') (('Biopsys', 'ISUP more Grade'), 'set') (('it', 'bone'), 'for') (('so we', 'microns'), 'give') (('doctor', 'prostate'), 'feel') (('tissue tissue label benign epithelium combined 2 cancerous masks', 'weakly supervised labels'), 'combine') (('Autopsy studies', 'prostate'), 'show') (('7 are', 'PSA test'), 'Q') (('Finally I', 'kernels'), 'like') (('cancer Dispersed single cells', 'stroma'), 'see') (('Small glands', 'benign glands'), 'infiltrate') (('Grades', '2 through 4 extremes'), 'feature') (('you', 'growth different patterns'), 'help') (('cancer cells', 'bones'), 'be') (('Exploring', 'them'), 'mention') (('we', 'disease'), 'gain') (('Prostate cancer outcomes', 'just 3 groups'), 'GroupsIn') (('D Prostatic adenocarcinoma', 'glandular differentiation'), 'have') (('B', 'glandular differentiation'), 'have') (('even grade 6 cancers', 'actually lowest practice'), 'assume') (('that', 'tumors'), 'be') (('rise', 'cancer cells'), 'tell') (('image data', 'memory'), 'read') (('ASAP', 'Overlay functionality'), 'overlay') (('they', 'image easily readers'), 'store') (('that', 'cancer'), 'have') (('PSA Blood antigen PSA blood prostate specific test', 'prostate one cancer'), 'be') (('All', 'Gleason Pattern'), 'include') (('something', 'PSA'), 'be') (('that', 'prostate gland'), 'q') (('Prostate cancer', 'PSA most serious high result'), 'be') (('new tumor', 'same primary original tumor'), 'have') (('pen markings', 'training set'), 'be') (('which', 'disease'), 'look') (('cancer', 'us'), 'tell') (('we', '0 competition'), 'develop') (('samples', 'glandular tissue'), 'make') (('dimensions', 'original image'), 'differ') (('how we', 'Gleason Score'), 'let') (('3 4 they', '7'), 'mean') (('Gleason Pattern', 'cancer cells'), 'contain') (('which', 'ISUP 4 3 two Grades'), 'see') (('it', 'false negative'), 'be') (('images', 'file extension'), 'try') ", "extra": "['annotation', 'biopsy', 'biopsy of the greater curvature', 'disease', 'outcome', 'patient', 'test', 'diagnosis', 'procedure']"}