{"name": "prostate cancer grading ", "full_name": " h1 About this notebook h1 What is prostate cancer h1 Symptoms of prostate cancer h1 Diagnosing prostate cancer h1 What causes prostate cancer h2 Prostate cancer risk factors h1 Analysis h1 Importing Dataset h1 Exploratory Data Analysis ", "stargazers_count": 0, "forks_count": 0, "description": "Many men develop a noncancerous condition called bengin prostatic hyperplasia BPH or enlargement of the prostate. Before the scan you receive an injection of fluciclovine F18 Axumin a radioactive agent that tends to collect in areas of cancer activity which then light up on your scan. DHT is important for normal prostate growth but can also cause the prostate to get bigger and may play a role in development of prostate cancer. If your father or brother had prostate cancer your risk is two to three times greater than if you had no family history of the disease. In some men it is slow growing and unlikely to cause serious problems. What is prostate cancer Prostate cancer is the most common cancer after skin cancer in men in the United States. In many men doctors first detect signs of prostate cancer during routine check up. More advanced prostate cancer symptoms may include Weak or interrupted flow of urine Urinating often especially at night Difficulty getting or sustaining an erection impotance Painful ejaculation Frequent pain or stiffness in the lower back hips or upper thighs Diagnosing prostate cancer Prostate cancer is curable when it is diagnosed early. Whether cancer is suspected based on symptoms or a digital rectal exam or PSA test the actual diagnosis is made with a prostate biposy a procedure in which samples of your prostate are removed and examined under a microscope. A diet high in red meat dairy foods and calcium and low in fruits and vegetables may play a part. The doctor uses the needle to take about 12 samples of cells. The disease is less common among men of Asian or Hispanic Latino descent than among those of European descent. The prostate contains several types of cells but nearly all prostate cancers develop from glandular cells which make fluid that becomes part of semen. Prostate cancer cells can spread by invading nearby organs and tissues such as the bladder or rectum or by travelling through the blood or lymph to other parts of the body. Testosterone is changed into dihydrotestostrone DHT by an enzyme in the body. Diet Scientists believe that diet is a critical factor in prostate cancer risk. isup_grade is the target variable which illustrats the severity of the cancer on a 0 5 scale. The main risk factors variables are as follows Age Although prostate cancer can occur at any age it is most often found in men over age 50 and more than two thirds of men diagnosed with the disease are over 65. Your prostate makes and stores seminal fluid a milkey liquid that protects and nourishes sperm. gleason_score is an alternative cancer severity rating system with more levels than the ISUP scale. Hormone levels Research suggests that the development of prostate cancer is linked to higher levels of certain hormones such as testosterone the main male sex hormone. If the prostate which is normally about the size of a walnut grows too large it can slow or block the flow of urine. About 1 man in 41 will die of prostate cancer. Analysis The dataset consists of around 11 000 whole side images WSI of digitized H E stained prostate biopsies originating from Radboud University Medical Center and the Karolinska Institute. Importing Dataset Exploratory Data Analysis. Your prostate surrounds part of your urethra the tube that carries urine and semon out of your body. Good prostate cancer screening tests like the prostate specific antigen PSA test have resulted in early diagnosis in about 80 percent of men with the disease. About this notebook This notebook consists of domain knowledge about the prostatce cancer as well predictive analytics. Other than the lymph nodes near the prostate the most common site of prostate cancer spread or metastatis is the bones especially in the spine. Prostate cancer starts in the prostate a gland located below the bladder and in front of the rectum. Symptoms of prostate cancer Prostate cancer symptoms typically don t appear early in the disease. Also it is the third leading cause of cancer death behind lung cancer and colon cancer in men in the United States. What causes prostate cancer While the exact cause of prostate cancer is unknown generally speaking it results from mutations in cell DNA. Vitamin E and folic acid are also thought to increase the risk. According to the American Cancer Society ACS all of these men survive at least five years. If you find this kernel useful Please consider upvoting it It motivates me to write more quality content. This is known as metastatic prostate cancer. About 1 man in 9 will be diagnosed with prostate cancer during his lifetime. DNA is the chemical that makes up your genes which control when your cells grow divide into new cells and die. Race or ethnicity African American men are more likely than men of other races to develop prostate according to different research conducted in this area. DNA mutations that turn on oncogenes which help cells growand divide or that turn off tumor suppressor genes which slow cell division or make cells die when they should can cause prostate cells to grow abnormally and lead to cancer. Nationality Prostate cancer is most common in North America northwestern Europe Australia and the Caribbean and less common in Asia Africa and Central and South America. An imaging test called an Axumin positron emission tomography PET scan may assist in detecting prostate cancer that has come back in men whose PSA levels rise after they ve had treatment. A core needle biopsy the main method for diagnosing prostate cancer is typically performed in a doctor s office by a urologist as follows Using transrectal ultrasound TRUS and a local anesthetic the doctor inserts a needle into your prostate through a probe in your rectum. About 6 cases in 10 are diagnosed in men who are 65 or older and it is rare in men under 40. Prostate cancer risk factors Numerous factors may contribute to prostate cancer risk. The procedure typically takes no more than 5 to 10 minutes and you should have very little discomfort. Family history and genetics A family history of prostate cancer may increase your risk particularly if you have a number of close relatives who were younger than 60 when they were diagnosed. In others the disease is very aggressive. ", "id": "hossein2015/prostate-cancer-grading", "size": "6430", "language": "python", "html_url": "https://www.kaggle.com/code/hossein2015/prostate-cancer-grading", "git_url": "https://www.kaggle.com/code/hossein2015/prostate-cancer-grading", "script": "torch.utils.data sklearn.metrics plot_relative_distribution display cohen_kappa_score torch.utils.model_zoo fastai.vision tqdm_notebook display_masks DataLoader plot_count torch.nn seaborn numpy models tqdm_notebook as tqdm plotly.graph_objs config PIL torchvision display_images Image matplotlib.pyplot pandas Dataset tqdm torch.nn.functional transforms fastai seed_torch Image as pil_image IPython.display ", "entities": "(('two to three times you', 'disease'), 'be') (('Many men', 'bengin hyperplasia prostatic prostate'), 'develop') (('Testosterone', 'body'), 'change') (('Nationality Prostate cancer', 'Asia less Africa'), 'be') (('which', 'then scan'), 'receive') (('when they', '60'), 'increase') (('all', 'men'), 'survive') (('notebook', 'prostatce cancer'), 'about') (('you', 'very little discomfort'), 'take') (('they', 'treatment'), 'assist') (('Prostate cancer cells', 'body'), 'spread') (('gleason_score', 'ISUP scale'), 'be') (('that', 'semen'), 'contain') (('target which', '0 5 scale'), 'be') (('This', 'prostate metastatic cancer'), 'know') (('Analysis dataset', 'Radboud University Medical Center'), 'consist') (('Numerous factors', 'prostate cancer risk'), 'contribute') (('Symptoms', 'don typically early disease'), 'appear') (('Prostate cancer', 'rectum'), 'start') (('diet', 'part'), 'play') (('samples', 'microscope'), 'suspect') (('when cells', 'new cells'), 'be') (('disease', 'others'), 'be') (('that', 'body'), 'surround') (('it', '65'), 'be') (('also prostate', 'prostate cancer'), 'be') (('prostate cancer screening Good tests', 'disease'), 'result') (('Also it', 'United States'), 'be') (('diet', 'cancer critical prostate risk'), 'believe') (('About 1 man', 'prostate cancer'), 'die') (('doctor', 'cells'), 'use') (('Race', 'area'), 'be') (('generally it', 'cell DNA'), 'cause') (('It', 'quality more content'), 'find') (('most common site', 'especially spine'), 'be') (('doctors', 'routine check'), 'detect') (('Diagnosing prostate cancer Prostate upper when it', 'lower back hips'), 'include') (('prostate cancer Prostate cancer', 'United States'), 'be') (('Vitamin E', 'folic also risk'), 'think') (('local doctor', 'rectum'), 'biopsy') (('it', '40'), 'diagnose') (('it', 'serious problems'), 'be') (('milkey that', 'seminal fluid'), 'make') (('prostate cells', 'abnormally cancer'), 'mutation') (('disease', 'European descent'), 'be') (('development', 'sex main male hormone'), 'suggest') (('About 1 man', 'lifetime'), 'diagnose') (('too it', 'urine'), 'grow') ", "extra": "['biopsy', 'biopsy of the greater curvature', 'disease', 'test', 'diagnosis', 'lung', 'lung cancer', 'procedure']"}