{"name": "pulmonary tuberculosis snomed ct ", "full_name": " h1 Preferred Name Pulmonary tuberculosis SNOMED CT Clinical Terms h1 Synonyms PTB Pulmonary tuberculosis h1 altLabel PTB Pulmonary tuberculosis h1 Pulmonary tuberculosis disorder h1 TB Pulmonary tuberculosis h1 That visualization is interative in SNOMED CT bioportal https bioportal bioontology org ontologies SNOMEDCT p classes conceptid 154283005 visualization h1 Has associated morphology Granulomatous inflammation h1 Associated morphology of BCG induced scrofuloderma Isolated bronchial tuberculosis h1 Has causative agent Mycobacterium tuberculosis complex h1 Has finding site Lung structure h1 Has pathological process Infectious process h1 Preferred Name Post tuberculous pleural fibrosis ", "stargazers_count": 0, "forks_count": 0, "description": "org ontology SNOMEDCT 6266001 Associated morphology of BCG induced scrofuloderma Isolated bronchial tuberculosis Has causative agent Mycobacterium tuberculosis complexSubClassOf Non photochromogenic mycobacteria Slow growing mycobacteriaAltLabel Mycobacterium tuberculosis complex organism Mycobacterium tuberculosis group. com images q tbn ANd9GcQREgQT9pWTVjYd 7jmnoZ4SFjFoQjIKQrmdQ usqp CAU slideserve. org ontology SNOMEDCT 441862004 Preferred Name Post tuberculous pleural fibrosisOccurs before Late effects of respiratory tuberculosisSynonyms Post tuberculous pleural fibrosis disorder Has associated morphology FibrosisHas finding site Pleural structureOccurs after Pulmonary tuberculosissubClassOf Post infective pleural fibrosisID http purl. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session might fail with probability 2 2 100 picked only 1s or 1s Code by Olga Belitskaya https www. org ontologies SNOMEDCT p classes conceptid 154283005 visualization Has associated morphology Granulomatous inflammationTuberculosis of limb bonesTuberculous peritonitisTuberculous oophoritisTuberculosis of lung bacteriologically and histologically negativeTuberculosis of vertebral columnTuberculous encephalitisOrificial tuberculosisTuberculosis of rectumTuberculosis of the upper arm boneTuberculosis of prostateTuberculous chronic iridocyclitisTuberculosis of subcutaneous cellular tissueTuberculosis of lung confirmed histologicallyTuberculous osteomyelitisTuberculous arachnoiditisTuberculosis of earTuberculosis of bones of lower extremityTuberculous pleurisy confirmed bacteriologically and histologicallyTuberculosis of spinal meningesTuberculosis of hilar lymph nodesTuberculosis of lung with cavitationTuberculosis of middle earTuberculosis of mediastinumTuberculosis of seminal vesicleInfection of digestive system caused by Mycobacterium tuberculosisTuberculosis verrucosa cutisTuberculosis of bladderTuberculous ileitisTuberculous arthritisTuberculosis of the pelvic and or thigh bonesTuberculosis of nasal septumTuberculosis of esophagusFemale tuberculous pelvic inflammatory diseaseTuberculosis of mastoid processTuberculosis of abdomenAcute diffuse tuberculosisTuberculous urethritisPrimary tuberculous complex with bacteriological or histological examination results unknownTuberculous interstitial keratitisTuberculosis of lung confirmed by sputum microscopy with or without cultureTuberculous salpingitisTuberculosis of left knee jointTuberculosis of intrathoracic lymph nodesTuberculosis of the bones of the handTuberculosis of bones and or jointsTuberculosis of spinal cordTuberculosis of meningesTuberculosis limb bones Tuberculous dactylitisTuberculosis of glottisTuberculosis of epididymisRespiratory tuberculosis not confirmed bacteriologically or histologicallyTuberculosis of the bones of multiple sitesTuberculosis of the bones of the shoulder regionTuberculosis of intestines peritoneum and mesenteric glandsTuberculosis of cervical spineTuberculosis of brainTuberculosis of kneeTuberculosis cutis indurativaTuberculous necrosis of boneTuberculous uveitisPulmonary tuberculosisID http purl. org ontology SNOMEDCT 39607008 Has pathological process Infectious processPreferred Name Infectious processSynonyms Infectious process qualifier value Tuberculosis of lung bacteriologically and histologically negativeTuberculosis in mother complicating childbirthAcute pulmonary African histoplasmosisTuberculosis of lung with cavitationRelapse pulmonary tuberculosisID http purl. org ontology SNOMEDCT 154283005 altLabel PTB Pulmonary tuberculosis Pulmonary tuberculosis disorder TB Pulmonary tuberculosisID http purl. com olgabelitskaya sequential data comments. Preferred Name Pulmonary tuberculosis SNOMED CT Clinical Terms https encrypted tbn0. org ontology SNOMEDCT 233657008 This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. com Synonyms PTB Pulmonary tuberculosisID http purl. read_csv Input data files are available in the read only. org ontology SNOMEDCT 113858008 Has finding site Lung structureFluoroscopy lungsLung volume reduction surgeryCT of lungs with diagnostic pneumothoraxNeedle biopsy of lesion of lungEndoscopy of lungDTPA aerosol ventilation studyLung plastic operationXenon 133 ventilation studyPulmonary perfusion imaging particulateLung closurePulmonary ventilation studyImaging of lungPulmonary ventilation study aerosolPuncture aspiration of lung using computed tomography guidanceSuture of lungUltrasonography of lungLung tomogramsCT of lungsCavernostomizing of bulla of lungLung tumor excisionCT guided cryoablation of lesion of lungBronchoscopic cryotherapy of neoplasm of lungImaging guided percutaneous drainage of lungAllotransplant of heart and lungHeart lung transplant with recipient cardiectomy pneumonectomyPulmonary ventilation perfusion study by radioactive xenonSingle photon emission computed tomography with computed tomography of ventilation of lungID http purl. CAUSATIVE AGENT OF Multidrug resistant tuberculosisChronic tuberculosis Active tuberculosisCiprofloxacin resistant tuberculosisTuberculosis extrapulmonaryExtreme drug resistant tuberculosisTuberculosis associated with AIDSRespiratory tuberculosis bacteriologically and histologically confirmedTuberculosis of lung bacteriological and histological examination not doneHuman immunodeficiency virus World Health Organization 2007 stage 1 co occurrent with tuberculosisCongenital tuberculosisTuberculous pleurisy in primary progressive tuberculosisID http purl. org ontology SNOMEDCT 154283005 That visualization is interative in SNOMED CT bioportal. ", "id": "mpwolke/pulmonary-tuberculosis-snomed-ct", "size": "5716", "language": "python", "html_url": "https://www.kaggle.com/code/mpwolke/pulmonary-tuberculosis-snomed-ct", "git_url": "https://www.kaggle.com/code/mpwolke/pulmonary-tuberculosis-snomed-ct", "script": "dhtml fastai.vision.all flip_lr display fastai _add1 HTML numpy Image _batch_ex pandas fastai.text.all fastai.medical.imaging PIL fastai.tabular.all IPython.display datetime ", "entities": "(('2 2 100', '1s Olga Belitskaya https www'), 'list') (('Infectious Name Infectious Infectious process', 'cavitationRelapse pulmonary http tuberculosisID purl'), 'have') (('org ontology 154283005 visualization', 'SNOMED'), 'SNOMEDCT') (('limb meningesTuberculosis Tuberculous dactylitisTuberculosis', 'uveitisPulmonary http boneTuberculous tuberculosisID purl'), 'conceptid') (('Slow', 'agent Mycobacterium tuberculosis'), 'SNOMEDCT') (('tomography guidanceSuture', 'purl'), 'SNOMEDCT') (('It', 'kaggle python Docker image https github'), 'SNOMEDCT') (('CAUSATIVE AGENT', 'http primary progressive tuberculosisID purl'), 'resistant') (('read_csv Input data files', 'read'), 'be') (('CT Clinical Terms https', 'tbn0'), 'encrypt') (('pleural infective fibrosisID', 'purl'), 'fibrosisoccur') ", "extra": "['biopsy', 'biopsy of the greater curvature', 'disease', 'granuloma', 'organization', 'test', 'abdomen', 'lung', 'mediastinum', 'necrosis', 'pleura', 'thoracic lymph node']"}