{"name": "rainforest which model is better ", "full_name": " h1 Imports and Setups h1 Download Dataset from W B Artifacts and Prepare h3 Train test Split h3 Dataloader h1 Model h1 Setup Sweep h1 Sweep Config h1 Initialize Sweep and Run Agent ", "stargazers_count": 0, "forks_count": 0, "description": "com ayuraj rainforest create image dataset with w b. We will also see the effect of batch size and learning rate along with the model size. com sweeps to find the best model for our dataset. Imports and Setups Download Dataset from W B Artifacts and Prepare Train test Split Dataloader Model Setup Sweep Sweep Config Initialize Sweep and Run Agent parse image normalize image parse data Specify the hyperparameter to be tuned along with an initial value Initialize wandb with a sample project name Specify the other hyperparameters to the configuration if any download and prepare data train validation split dataloader Iniialize model with hyperparameters Compile the model Train the model WandbCallback to automatically track metrics Evaluate wandb. We will set up a Weights and Biases Sweep https docs. log to track custom metrics save model initialize a new artifact to save the model. In this Kaggle kernel we will perform an ablation study to find the connection between model size and validation accuracy with the dataset that I have created in this Kaggle kernel https www. ", "id": "ayuraj/rainforest-which-model-is-better", "size": "631", "language": "python", "html_url": "https://www.kaggle.com/code/ayuraj/rainforest-which-model-is-better", "git_url": "https://www.kaggle.com/code/ayuraj/rainforest-which-model-is-better", "script": "sklearn.metrics get_model librosa skimage.transform tensorflow.keras.layers train Path parse_data tensorflow.keras.models numpy cifar10 pathlib PIL sklearn.model_selection ImageGrid Image matplotlib.pyplot stats tensorflow WandbCallback pandas classification_report tensorflow.keras.datasets wandb.keras resize scipy keras train_test_split IPython.display mpl_toolkits.axes_grid1 ", "entities": "(('com ayuraj rainforest', 'w b.'), 'create') (('I', 'Kaggle kernel https www'), 'perform') (('We', 'Sweep https Weights docs'), 'set') (('image normalize Run Agent parse image parse data', 'metrics Evaluate automatically wandb'), 'Dataset') (('custom metrics', 'model'), 'log') (('We', 'learning model size'), 'see') ", "extra": "['test']"}