{"name": "sciplex2 part 3e main cyclins closer look and cc ", "full_name": " h1 What is about h2 Conclusions Findings h3 1 h3 2 h3 3 h4 4 h3 Cyclins E peaks in G1 S h3 Cyclins B peaks in G2 M h3 Cyclins A peaks in G2 starts at S and ends at M h3 Cyclins D h4 Cyclin F CCNF h4 Reminder in previous notebook h3 Further info on genes h4 CDK1 subunit of MPF Cyclin B CDK1 h4 CCNA1 https en wikipedia org wiki Cyclin A1 h4 Dataset reminder h1 Load information files genes annotations cells info etc h1 Load count matrix and convert it to sparse matrix csr matrix h1 Create columns with information on each cell drug dose etc h1 Normalization and log h1 Look at duplicates h1 Preliminaries h1 get independence pvalue chi2 h1 Check anticorrelation of tp53 with cyclins B not confirmed h1 Look at A cyclins check relation with F cyclin and CDK1 2 h1 Info on genes h1 get top correlated genes h1 Statistics on top correlated h1 Correlation analysis h1 Plot expressions of top selected genes h1 UMAP visualization h1 Color by Cyclins E which should peak at G1 S not enough points to clearly see localization only some hints as we guess afterwards h1 Color by Cyclin E and CDK2 it gives better view h1 Color by sum of cyclins E can see something h1 Color by cyclins B h1 Color by sum of B cyclins expect to see G2 M h1 Cyclins A and F h1 D cyclins h1 Analyse E2F theoretically negative feedback with Cyclins A h1 Retinoblastoma protein h1 Histone genes info ", "stargazers_count": 0, "forks_count": 0, "description": "Cyclin A1 was shown to be expressed in testis and brain as well as in several leukemic cell lines and is thought to primarily function in the control of meiosis. iloc a i b i list_selected_genes range 10 100 10 0 droping columns same as make them zeros but does not create memory alloc prob list_selected_genes_ordered CDKN1A LINC01021 MALAT1 NEAT1 TP53I3 FDXR TMSB10 drug. This cyclin was found to bind to important cell cycle regulators such as Rb family proteins transcription factor E2F1 and the Kip Cip family of CDK inhibitor proteins. From theory we know that D cyclins expressed almost in all phases except G1 begining of the G1 phase so that corresponds to the fact that CCND1 CCND3 are strongly expressed. 2Interesting fact that Cyclins D are most expressed and that correspond to theory they areexpressed in all cell cycle loop. org wiki Cyclin_B Cyclin_B_and_p53That is not true for current dataset. copy list_selected_genes_ordered CDKN1A LINC01021 MALAT1 NEAT1 TP53I3 FDXR TMSB10 drug. Exposed to 4 different compounds DEXA nutlin BMS SAHA HDAC. What is about Here we analyse sciPlex2 subdataset looking at main cyclins. describe S phase of cell cycle expressed gene indices for top expressed convert top expressed to numpy array from sparse some strange reindex to extract correlation vector from matrix I do not know why matrix her range len genes. toarray Consistency check. describe CCNE1 CCNE2 list_selected_genes g_inf. And also A1 and A2 are very small negatively correlated. Cyclins A peaks in G2 starts at S and ends at MGenes CCNA1 CCNA2 Poorly expressed for current dataset and low correlated CCNA1 424 343CCNA2 2136 1574CCNA1 https en. Load count matrix and convert it to sparse matrix csr_matrix Create columns with information on each cell drug dose etc Normalization and log Look at duplicates Preliminaries get_independence_pvalue_chi2 Check anticorrelation of tp53 with cyclins B not confirmed Look at A cyclins check relation with F cyclin and CDK1 2 Info on genes get_top_correlated_genes Statistics on top correlated Correlation analysis Plot expressions of top selected genes UMAP visualization Color by Cyclins E which should peak at G1 S not enough points to clearly see localization only some hints as we guess afterwards Color by Cyclin E and CDK2 it gives better view Color by sum of cyclins E can see something Color by cyclins B Color by sum of B cyclins expect to see G2 M Cyclins A and F D cyclins Analyse E2F theoretically negative feedback with Cyclins Awe see some very small negative correlation with A1 not really with A2. copy count_made_zeros str count_made_zeros Non binarized m IX1. cyclin dependent kinase inhibitor 1 or CDK interacting protein 1 is a cyclin dependent kinase inhibitor CKI that is capable of inhibiting all cyclin CDK complexesSee in particular here https www. Dataset reminder It is the second toy subdataset while sciPlex3 is the main very huge subdataset. values t Color count_made_zeros str count_made_zeros Non binarized m IX1. count_made_zeros str count_made_zeros Non binarized m IX1. E2F is responsible for initiating the transcription of many critical S phase genes. org wiki CCNF Reminder in previous notebookwe saw MDM2 top correlation 0. Check that n_umi is exactly the m. Cyclin B is a mitotic cyclin. That is not quite sucesseful because some cyclins are expressed quite low so we cannot be sure in results. Cyclins D CCND1 CCND2 CCND3 CCND1 CCND3 strongly expressed comparing to other cyclins. Conclusions Findings. Cyclins function as activating subunits of enzymatic complex together with cyclin dependent kinases CDKs. CCNA1 https en. copy count_made_zeros str count_made_zeros Non binarized list_selected_genes_ordered CDKN1A LINC01021 MALAT1 NEAT1 TP53I3 FDXR TMSB10 drug. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. Cyclins B peaks in G2 MGenes CCNB1 CCNB2 CCNB3 Cyclin B binds Cdk1 MPF maturation promoting factor or mitosis promoting factor https en. The amount of cyclin B which binds to Cdk1 and the activity of the cyclin B Cdk complex rise through the cell cycle 2 until mitosis where they fall abruptly due to degradation of cyclin B Cdk1 is constitutively present. org wiki Cyclin media File Cyclin_Expression. 2 Hypophosphorylated pRb binds E2F which prevents transcription of cyclin A. txt Load information files genes annotations cells info etc. read_csv Input data files are available in the read only. ravel 0 drug. org wiki Cyclin_A Cyclins E peaks in G1 S Cyclin E peaks between G1 and S that seems everywhere agreed. Cyclins B are quite expressed they are markers of G2 M regions so we can guess assign corresponding regions as G2 M right part of the plot so lefter part is probably the G1 S part. It exists in two states hypophosphorylated pRb and hyperphosphorylated pRb. get summary No summary display t. get summary No summary g_inf map_location g_inf. In general levels of p53 and cyclin B are negatively correlated. svgwith activities of cyclins in different phases of cell cycle. See for discussion https www. 3Cyclins B1 and B2 are quite correlated. Genes CCNE1 CCNE2 https en. org wiki Cyclin_BCyclin B is a member of the cyclin family. values t Color. Different cyclins exhibit distinct expression and degradation patterns that contribute to the temporal coordination of cell cycle events. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session header None shape len genes len cells. iloc a i b i np. 24 hours across SEVEN doses. Cdk1 like other kinases contains a cleft in which ATP fits. org wiki Cyclin_ECyclin E binds to G1 phase Cdk2 which is required for the transition from G1 to S phase of the cell cycle that determines initiation of DNA duplication. This cyclin binds both Cdk1 and Cdk2 kinases which give two distinct kinase activities one appearing in S phase the other in G2 and thus regulate separate functions in cell cycle. 1We tried to identify phases of cell cycle using cyclin genes as markers. The Cyclin E CDK2 complex phosphorylates p27Kip1 an inhibitor of Cyclin D tagging it for degradation thus promoting expression of Cyclin A allowing progression to S phase. There are 24262 rows one row one cell. describe TP53 CCNB1 CCNB2 CCNB3 display t. txt contains information on cell drugs doses etc. 2 9 12 Histone genes info This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. After the cell passes through the R point cyclin D E complexes phosphorylate pRb. org wiki Cyclin dependent_kinase CDKs_and_cyclins_in_the_cell_cycleTable 2 Cyclins and CDKs by Cell Cycle Phase Phase Cyclin CDK G0 C Cdk3 G1 D E Cdk4 Cdk2 Cdk6 S A E Cdk2 G2 A Cdk2 Cdk1 M B Cdk1 Cyclin F CCNFCCNFIts expression pattern closely resembles the one from cyclin A. The human homolog of Cdk1 CDC2 shares approximately 63 amino acid identity with its yeast homolog. The index row number of cell in that file corresponds to its index in the countmatrix after transforming csv file with count matrix to sparse countmatrix Count matrix in list of edges format cell ids genes ids are in the files respectively GSM4150377_sciPlex2_A549_Transcription_Modulators_UMI. Cyclin A2 is also quite correlated with B1Cyclin B1 with CDK1. 1 3 6 Cyclin A transcription is off during most of G1 and the begins shortly after the R point. get summary No summary g_inf. org wiki Cyclin_A Retinoblastoma proteinThe retinoblastoma protein pRb is involved in the regulation of cyclin A through its interaction with E2F. org wiki Cyclin_B Cyclin_B_and_p53 display t. com alexandervc singlecell rnaseq exposed to multiple compounds discussion 229699See image https en. Cyclin F levels begin to rise during S phase and reaches its peak during G2. Transcription of cyclin A is predominantly regulated by the transcription factor E2F in a negative feedback loop. values t Color count_made_zeros str count_made_zeros Non binarized Leave more than 1000 expressed E2F1 E2F2 E2F8 Leave more than 1000 expressed E2F1 E2F2 E2F8. 36 is CDKN1A coding p21Waf1 which is biologically meaningful see below. matrix GSM4150377_sciPlex2_A549_Transcription_Modulators_cell. values t Color count_made_zeros str count_made_zeros Non binarized list_selected_genes_ordered CDKN1A LINC01021 MALAT1 NEAT1 TP53I3 FDXR TMSB10 drug. org wiki Cyclin_A1 This cyclin binds both Cdk1 and Cdk2 kinases which give two distinct kinase activities one appearing in S phase the other in G2 and thus regulate separate functions in cell cycle. 24262 cells x 58347 genes GSM4150377_sciPlex2_pData. sum axis 1 In general levels of p53 and cyclin B are negatively correlated. Here only one cell line A549 human lung adenocarcinoma. 4 Analyse E2F theoretically negative feedback with Cyclins Awe see some very small negative correlation with A1 not really with A2. The absence of cyclin A prior to the R point is due to the inhibition of E2F by hypophosphorylated pRb. txt GSM4150377_sciPlex2_A549_Transcription_Modulators_gene. copy count_made_zeros str count_made_zeros Non binarized 0 drug. 3 The complex of Cdk and cyclin B is called maturation promoting factor or mitosis promoting factor MPF. The protein encoded by this gene belongs to the highly conserved cyclin family whose members are characterized by a dramatic periodicity in protein abundance through the cell division cycle. Cdk1 is comprised mostly by the bare protein kinase motif which other protein kinases share. It somehow not very clearly corresponds to expressionof the A and E cyclins. Hyperphosphorylated pRb can no longer bind E2F E2F is released and cyclin A genes and other crucial genes for S phase are transcribed. com alexandervc singlecell rnaseq exposed to multiple compounds discussion 227621 Further info on genes CDK1 subunit of MPF Cyclin B CDK1 Structure Cdk1 is a small protein approximately 34 kilodaltons and is highly conserved. ", "id": "alexandervc/sciplex2-part-3e-main-cyclins-closer-look-and-cc", "size": "9144", "language": "python", "html_url": "https://www.kaggle.com/code/alexandervc/sciplex2-part-3e-main-cyclins-closer-look-and-cc", "git_url": "https://www.kaggle.com/code/alexandervc/sciplex2-part-3e-main-cyclins-closer-look-and-cc", "script": "seaborn numpy matplotlib.pyplot pandas scipy.stats get_independence_pvalue_chi2 csr_matrix sklearn.decomposition get_top_correlated_genes chi2_contingency scipy.sparse TruncatedSVD ", "entities": "(('org Cyclin_B_and_p53That', 'current dataset'), 'wiki') (('E2F', 'S phase many critical genes'), 'be') (('MGenes CCNA1 CCNA2 Poorly', 'CCNA1'), 'peak') (('Transcription', 'feedback negative loop'), 'regulate') (('ATP', 'which'), 'contain') (('org Cyclin_BCyclin B', 'cyclin family'), 'wiki') (('members', 'cell division cycle'), 'belong') (('absence', 'hypophosphorylated pRb'), 'be') (('Cyclin 1 3 6 transcription', 'R shortly point'), 'be') (('interacting kinase inhibitor 1 CDK 1 cyclin dependent that', 'cyclin CDK complexesSee'), 'be') (('ids', 'files'), 'correspond') (('Cyclins', 'kinases together cyclin dependent CDKs'), 'function') (('complex', 'factor MPF'), '3') (('227621 Further info', 'CDK1 MPF Cyclin B CDK1 Structure Cdk1'), 'expose') (('that', 'cell cycle events'), 'cyclin') (('protein other kinases', 'which'), 'comprise') (('cell', 'pRb'), 'phosphorylate') (('E2F1 E2F2 more than 1000 E2F8', 'E2F1 E2F2 more than 1000 expressed E2F8'), 't') (('count_made_zeros str count_made_zeros Non', 'IX1'), 'copy') (('txt Load information files', 'annotations cells info etc'), 'gene') (('Cyclin A2', 'CDK1'), 'correlate') (('org wiki CCNF Reminder', 'MDM2'), 'see') (('CCND1 CCND3', 'fact'), 'know') (('Here we', 'main cyclins'), 'be') (('same them', 'CDKN1A LINC01021 MALAT1 NEAT1 TP53I3 FDXR TMSB10 drug'), 'iloc') (('G1 D Cdk4 Cdk6 A E Cdk2 G2 Cdk2 Cdk1 M B Cdk1 Cyclin F CCNFCCNFIts expression pattern', 'cyclin A.'), 'dependent_kinase') (('G2 M Cyclins A', 'really A2'), 'matrix') (('Cyclin A1', 'meiosis'), 'show') (('count_made_zeros str count_made_zeros Non', 'IX1'), 'binarized') (('None', 'len genes len cells'), 'list') (('cyclin', 'Kip Cip CDK inhibitor proteins'), 'find') (('p27Kip1', 'S phase'), 'phosphorylate') (('sum', 'p53'), 'axis') (('values count_made_zeros str count_made_zeros Color Non', 'IX1'), 't') (('txt', 'etc'), 'contain') (('count_made_zeros str count_made_zeros Non', '0 drug'), 'copy') (('Cyclins CCND1 CCND3 CCND1 D CCND3', 'strongly other cyclins'), 'ccnd2') (('read_csv Input data files', 'read'), 'be') (('that', 'G1'), 'wiki') (('1We', 'markers'), 'try') (('which', 'cell cycle'), 'Cyclin_A1') (('Cyclin F levels', 'G2'), 'begin') (('org wiki Cyclin_A Retinoblastoma proteinThe retinoblastoma protein pRb', 'E2F.'), 'involve') (('com alexandervc singlecell rnaseq', 'compounds multiple discussion'), 'expose') (('It', 'pRb'), 'exist') (('that', 'DNA duplication'), 'wiki') (('cyclin', 'S other crucial phase'), 'bind') (('they', 'cell cycle loop'), 'areexpresse') (('It', 'kaggle python Docker image https github'), 'info') (('where they', 'cyclin B Cdk1'), 'be') (('It', 'somehow very clearly A cyclins'), 'correspond') (('quite low we', 'results'), 'be') (('I', 'range len why genes'), 'express') (('pRb 2 Hypophosphorylated which', 'cyclin A.'), 'bind') (('Analyse E2F', 'really A2'), '4') (('which', 'cell cycle'), 'bind') (('assign corresponding regions', 'plot'), 'express') ", "extra": "['annotation', 'lung adenocarcinoma', 'test', 'lung']"}