{"name": "single cell patterns with examples from train ", "full_name": " h1 Single Cell Patterns Train Set Analysis h3 Nice people that enjoy this notebook also press the upvote button h1 0 Nucleoplasm h1 1 Nuclear membrane h1 2 Nucleoli h1 3 Nucleoli fibrillar center h1 4 Nuclear speckles h1 5 Nuclear bodies h1 6 Endoplasmic reticulum h1 7 Golgi apparatus h1 8 Intermediate filaments h1 9 Actin filaments h1 10 Microtubules h1 11 Mitotic spindle h1 12 Centrosome h1 13 Plasma membrane ", "stargazers_count": 0, "forks_count": 0, "description": "Single Cell Patterns Train Set AnalysisThe objective of this notebook is to compare the theory single cell patterns as described in the original host notebook with reality examples coming from the train set. More examples 5. NegativeThis class include negative stainings and unspecific patterns. Intermediate filaments may extend through the whole cytosol or be concentrated in an area close to the nucleus. Nuclear specklesNuclear speckles can be seen as irregular and mottled spots inside the nucleoplasm. It has a folded ribbon like appearance but the shape and size can vary between cell types and in response to cellular various processes. At this stage the chromatin of the cell is condensed as visible by intense DAPI staining. I hope this insights will help with the modelling The train set examples were generated by segmenting train images with HPA Cell Segmentator and saving the RGB channels to jpg images. Mitotic spindleThe mitotic spindle can be seen as an intricate structure of microtubules radiating from each of the centrosomes at opposite ends of a dividing cell mitosis. And yes as you might have guessed this overlaps the staining in the red channel. More examples 11. When a cell is dividing the two centrosomes move to opposite ends of the cell and form the poles of the mitotic spindle. AggresomeAn aggresome can be seen as a dense cytoplasmic inclusion which is usually found close to the nucleus in a region where the microtubule network is disrupted. PNG attachment Capture. PNG Please upvote if you found this helpful you will make my day. Nice people that enjoy this notebook also press the upvote button 0. Endoplasmic reticulumThe endoplasmic reticulum ER is recognized by a network like staining in the cytosol which is usually stronger close to the nucleus and weaker close to the edges of the cell. They vary in shape size and numbers depending on the type of bodies as well as cell type but are usually more rounded compared to nuclear speckles. Golgi apparatusThe Golgi apparatus is a rather large organelle that is located next to the nucleus close to the centrosome from which the microtubules in the red channel originate. Intermediate filamentsIntermediate filaments often exhibit a slightly tangled structure with strands crossing every so often. MicrotubulesMicrotubules are seen as thin strands that stretch throughout the whole cell. More examples 12. They are usually located close to the edges of the cells. In some cell lines the staining can be uniform across the entire cell. MitochondriaMitochondria are small rod like units in the cytosol which are often distributed in a thread like pattern along microtubules. More examples 2. It can appear smooth or granular and the staining is often stronger close to the nucleus. They can be round or more elongated. More examples 17. This means that the cells have no green staining negative or have staining but no pattern can be deciphered from the staining unspecific. Cell junctions can be observed at contact sites between neighboring cells. Nucleoli fibrillar centerNucleoli fibrillary center can appear as a spotty cluster or as a single bigger spot in the nucleolus depending on the cell type. Vesicles Peroxisomes Endosomes Lysosomes Lipid droplets Cytoplasmic bodies 18. More examples 1. More examples 13. Plasma membraneThis class includes plasma membrane and cell junctions. NucleoplasmThe nucleus is found in the center of cell and can be identified with the help of the signal in the blue nucleus channel. CytosolThe cytosol extends from the plasma membrane to the nuclear membrane. Actin filaments Actin filaments can be seen as long and rather straight bundles of filaments or as branched networks of thinner filaments. More examples 16. They can be seen as a more or less distinct staining of a small area at the origin of the microtubules close to the nucleus. More examples 6. More examples 7. Nuclear bodiesNuclear bodies are visible as distinct spots in the nucleoplasm. More examples 9. It is almost always possible to detect the center from which they all originate the centrosome. More examples 4. Both are at the outer edge of the cell. More examples 15. The number and size of nucleoli varies between cell types. These may contain a lot of noise as individuall cells may not necessarily reflect the image level labels. NucleoliNucleoli can be seen as slightly elongated circular areas in the nucleoplasm which usually display a much weaker staining in the blue DAPI channel. The ER can be identified with the help of the staining in the yellow ER channel. More examples 8. Nuclear membraneThe nuclear membrane appears as a thin circle around the nucleus. They can appear similar to microtubules but do not match well with the staining in the red microtubule channel. The size and exact shape of the mitotic spindle changes during mitotic progression clearly reflecting the different stages of mitosis. More examples 14. Plasma membrane sometimes appears as a more or less distinct edge around the cell occasionally with characteristic protrusions or ruffles. More examples 3. CentrosomeThis class includes centrosomes and centriolar satellites. Vesicles and punctate cytosolic patternsThis class includes small circular compartments in the cytosol Vesicles Peroxisomes lipid metabolism Endosomes sorting compartments Lysosomes degradation of molecules or eating up dead molecules Lipid droplets fat storage Cytoplasmic bodies distinct granules in the cytosol. They are highly dynamic varying in numbers and size in response to environmental and cellular cues. It is not perfectly smooth and sometimes it is also possible to see the folds of the membrane as small circles or dots inside the nucleus. A staining of the nucleoplasm may include the whole nucleus or of the nucleus without the regions known as nucleoli Class 2. More examples 10. ", "id": "thedrcat/single-cell-patterns-with-examples-from-train", "size": "12401", "language": "python", "html_url": "https://www.kaggle.com/code/thedrcat/single-cell-patterns-with-examples-from-train", "git_url": "https://www.kaggle.com/code/thedrcat/single-cell-patterns-with-examples-from-train", "script": "fastai.vision.all ", "entities": "(('that', 'whole cell'), 'see') (('Nucleoli fibrillar centerNucleoli fibrillary center', 'cell type'), 'appear') (('Intermediate filamentsIntermediate filaments', 'strands crossing'), 'exhibit') (('negative pattern', 'staining unspecific'), 'mean') (('you', 'day'), 'upvote') (('Nuclear membraneThe nuclear membrane', 'nucleus'), 'appear') (('They', 'environmental cues'), 'be') (('NucleoplasmThe nucleus', 'nucleus blue channel'), 'find') (('staining', 'entire cell'), 'be') (('class', 'plasma membrane'), 'include') (('which', 'DAPI blue channel'), 'see') (('Cell junctions', 'neighboring cells'), 'observe') (('shape', 'cellular various processes'), 'have') (('Vesicles Peroxisomes Endosomes Lysosomes Lipid', 'Cytoplasmic bodies'), 'droplet') (('When cell', 'mitotic spindle'), 'move') (('train set examples', 'jpg images'), 'hope') (('which', 'microtubules'), 'be') (('Mitotic spindleThe mitotic spindle', 'cell dividing mitosis'), 'see') (('CytosolThe cytosol', 'nuclear membrane'), 'extend') (('Plasma membrane', 'occasionally characteristic protrusions'), 'appear') (('They', 'cell as well usually more nuclear speckles'), 'vary') (('staining', 'nucleoli Class'), 'include') (('Cell Patterns Train Set AnalysisThe Single objective', 'train set'), 'be') (('Nuclear specklesNuclear speckles', 'nucleoplasm'), 'see') (('microtubules', 'red channel'), 'be') (('ER', 'ER yellow channel'), 'identify') (('storage fat Cytoplasmic', 'cytosol'), 'include') (('Intermediate filaments', 'close nucleus'), 'extend') (('bodiesNuclear Nuclear bodies', 'nucleoplasm'), 'be') (('perfectly sometimes it', 'nucleus'), 'be') (('they', 'centrosome'), 'be') (('individuall cells', 'image level necessarily labels'), 'contain') (('chromatin', 'DAPI visible intense staining'), 'condense') (('that', 'upvote also button'), 'press') (('They', 'cells'), 'locate') (('staining', 'often close nucleus'), 'appear') (('Actin Actin filaments', 'thinner filaments'), 'filament') (('CentrosomeThis class', 'centrosomes'), 'include') (('number', 'cell types'), 'varie') (('They', 'microtubule red channel'), 'appear') (('class', 'negative stainings'), 'include') (('which', 'cell'), 'recognize') (('you', 'red channel'), 'yes') (('microtubule where network', 'region'), 'see') (('They', 'close nucleus'), 'see') ", "extra": "['biopsy of the greater curvature']"}