{"name": "single cell patterns ", "full_name": " h1 Welcome to the Human Protein Atlas Single Cell Competition h1 Image channels h1 Protein localization patterns h1 0 Nucleoplasm h1 1 Nuclear membrane h1 2 Nucleoli h1 3 Nucleoli fibrillar center h1 4 Nuclear speckles h1 5 Nuclear bodies h1 6 Endoplasmic reticulum h1 7 Golgi apparatus h1 8 Intermediate filaments h1 9 Actin filaments h1 10 Microtubules h1 11 Mitotic spindle h1 12 Centrosome h1 13 Plasma membrane ", "stargazers_count": 0, "forks_count": 0, "description": "Please note that you are required to submit associated detection score Confidence for each prediction. Any combination of patterns can be possible for a single cell except 18 if the cell s staining is Negative there isn t any other pattern. com c hpa single cell image classification overview evaluation. Focal adhesions are large macromolecular assemblies at the plasma membrane through which bundles of actin filaments connect to the extracellular matrix ECM. Endoplasmic reticulumThe endoplasmic reticulum ER is recognized by a network like staining in the cytosol which is usually stronger close to the nucleus and weaker close to the edges of the cell. org humanproteome cell organelle and explore the Cell dictionary https www. MicrotubulesMicrotubules are seen as thin strands that stretch throughout the whole cell. Actin filaments This class includes Actin filaments and Focal adhesion sites. Note that Negative cells will be present in images labeled as other classes as well. Cell junctions can be observed at contact sites between neighboring cells. Vesicles Peroxisomes Endosomes Lysosomes Lipid droplets Cytoplasmic bodies 18. More examples 13. CytosolThe cytosol extends from the plasma membrane to the nuclear membrane. More examples 6. This is called single cell variability SCV and has been observed across images in HPA and been described in numerous scientific publications. More examples 7. cell line distribution plot. Welcome to the Human Protein Atlas Single Cell Competition This is a single cell classification challenge. Nuclear bodiesNuclear bodies are visible as distinct spots in the nucleoplasm. More examples 4. NucleoliNucleoli can be seen as slightly elongated circular areas in the nucleoplasm which usually display a much weaker staining in the blue DAPI channel. The results are published and you can read the discussion on the strategies of the winning teams. They can appear similar to microtubules but do not match well with the staining in the red microtubule channel. More examples 8. Nuclear membraneThe nuclear membrane appears as a thin circle around the nucleus. The size and exact shape of the mitotic spindle changes during mitotic progression clearly reflecting the different stages of mitosis. A staining of the nucleoplasm may include the whole nucleus or of the nucleus without the regions known as nucleoli Class 2. More examples 5. The phenomenon of how genetically identical cells can show functional heterogeneity for example in response to drug treatment is poorly understood. For example this is how Plasma Membrane looks in U2OS left vs A 431 right. As you can see the label distribution is imbalanced but even the rarest organelle class has at least 78 examples at least 1 cell in each image carry this pattern. When a cell is dividing the two centrosomes move to opposite ends of the cell and form the poles of the mitotic spindle. They vary in shape size and numbers depending on the type of bodies as well as cell type but are usually more rounded compared to nuclear speckles. SCV and multi localization examplesSingle or muliple patterns can be seen together in a cell. More examples 2. It can appear smooth or granular and the staining is often stronger close to the nucleus. For some images all cells will inherit the labels from image level labels. This means that the cells have no green staining negative or have staining but no pattern can be deciphered from the staining unspecific. You can read more about the Organelles https www. NucleoplasmThe nucleus is found in the center of cell and can be identified with the help of the signal in the blue nucleus channel. com c human protein atlas image classification that aimed to classify image level labels paper https www. Here are some examples to demonstrate the SCV scroll down for SCV and multi localization examples section. Furthermore the patterns sometimes differ in different cell lines in here we have 17 cell lines. Plasma membrane sometimes appears as a more or less distinct edge around the cell occasionally with characteristic protrusions or ruffles. Nucleoli fibrillar centerNucleoli fibrillary center can appear as a spotty cluster or as a single bigger spot in the nucleolus depending on the cell type. More examples 10. MitochondriaMitochondria are small rod like units in the cytosol which are often distributed in a thread like pattern along microtubules. It has a folded ribbon like appearance but the shape and size can vary between cell types and in response to cellular various processes. At this stage the chromatin of the cell is condensed as visible by intense DAPI staining. In other words the test set will have higher SCV than the training set. Mitotic spindleThe mitotic spindle can be seen as an intricate structure of microtubules radiating from each of the centrosomes at opposite ends of a dividing cell mitosis. We want to study this observed variation to better understand the functional heterogeneity of cells. Here you can also see how patterns look like in different cell lines. Golgi apparatusThe Golgi apparatus is a rather large organelle that is located next to the nucleus close to the centrosome from which the microtubules in the red channel originate. U 2 OS A 341 The model will be graded on mean Average Precision score for each matched cell passing segmentation IoU threhold of 0. Intermediate filamentsIntermediate filaments often exhibit a slightly tangled structure with strands crossing every so often. They are usually located close to the edges of the cells. In some cell lines the staining can be uniform across the entire cell. PNG Please also note that border cells where most of the cells are out of the field of view and to cells that have been damaged or suffer from staining artifacts. Also Cytokinetic bridge is not in this competition just for demonstration. Good luck and enjoy Image channelsAll images have 4 channels Red Microtubules Green Protein of interest Blue Nucleus Yellow Endoplasmic reticulum as followed Protein localization patternsIt s always nice to know a bit about what you are working on isn t it So in this part I will give you a basic introduction about the patterns that you are asked to predict. More examples 16. There are NO images in the private test set that were ever published. They can be seen as a more or less distinct staining of a small area at the origin of the microtubules close to the nucleus. Nucleoplasm Mitochrondria ER Plasma membrane Nucleoplasm However for other images especially in the test set each cell will have only a part of the image level label or completely new label 18 Negative. Label distribution in the training setBelow is the distribution of image level labels in the training set. This competition is a weakly labeled challenge based on the image level label you build models to predict labels for each individual cell. More examples 9. It is almost always possible to detect the center from which they all originate the centrosome. com articles s41592 019 0658 6. Both are at the outer edge of the cell. org learn dictionary cell under CELL STRUCTURE. Just like people all cells are different in terms of their morphology shape size and they can also differ in the spatial distribution of their proteins. The ER can be identified with the help of the staining in the yellow ER channel. Actin filaments can be seen as long and rather straight bundles of filaments or as branched networks of thinner filaments. As you see within the same image same cell types same protein staining the green patterns are not similar in every cell. More examples 14. CentrosomeThis class includes centrosomes and centriolar satellites. More examples 11. PNG attachment Capture. We also want to clarify that there is a public test set for public leaderboard and private test set private leaderboard. The same type of data was used in a previous Human Protein Atlas Classification challenge https www. For this competition we specifically annotated every single cell in a subset of images mostly private never published and some public images with higher SCV compared to public HPA images to act as test set. NegativeThis class include negative stainings and unspecific patterns. Intermediate filaments may extend through the whole cytosol or be concentrated in an area close to the nucleus. 6 See Evaluation tab https www. Nuclear specklesNuclear speckles can be seen as irregular and mottled spots inside the nucleoplasm. epdf no_publisher_access 1 r3_referer nature. AggresomeAn aggresome can be seen as a dense cytoplasmic inclusion which is usually found close to the nucleus in a region where the microtubule network is disrupted. And yes as you might have guessed this overlaps the staining in the red channel. I left out blue channels so you can see the green one more clearly. This will be used as order predictions for matched cells. More examples 12. They can be round or more elongated. More examples 17. Therefore a single cell classifier is more helpful than a whole image classifier as developed in the previous challenge. More examples 1. Plasma membraneThis class includes plasma membrane and cell junctions. A good rule of thumb that our annotators used in generating ground truth is if more than half of the cell is not present don t predict it In total there are 19 classes 0 18 that will be scored. In the hidden test set of this challenge we purposely chose images with high single cell variation SCV. In short the submission format isImageAID ImageAWidth ImageAHeight LabelA1 ConfidenceA1 EncodedMaskA1 LabelA2 ConfidenceA2 EncodedMaskA2. More examples 15. The number and size of nucleoli varies between cell types. Therefore I believe you won t gain significant advantages with a metric learning approach like the winning solution last challenge. These patterns sometimes vary among 17 cell lines in this competition A 431 A549 EFO 21 HAP1 HEK 293 HUVEC TERT2 HaCaT HeLa PC 3 RH 30 RPTEC TERT1 SH SY5Y SK MEL 30 SiHa U 2 OS U 251 MG hTCEpi. Predicted masks are run length encoded Please note that there are multilabeled cells more than one class for each cell. More examples 3. Vesicles and punctate cytosolic patternsThis class includes small circular compartments in the cytosol Vesicles Peroxisomes lipid metabolism Endosomes sorting compartments Lysosomes degradation of molecules or eating up dead molecules Lipid droplets fat storage Cytoplasmic bodies distinct granules in the cytosol. They are highly dynamic varying in numbers and size in response to environmental and cellular cues. It is not perfectly smooth and sometimes it is also possible to see the folds of the membrane as small circles or dots inside the nucleus. In this case predict separate detections for each class using the same mask. ", "id": "lnhtrang/single-cell-patterns", "size": "20517", "language": "python", "html_url": "https://www.kaggle.com/code/lnhtrang/single-cell-patterns", "git_url": "https://www.kaggle.com/code/lnhtrang/single-cell-patterns", "script": "seaborn pandas matplotlib.pyplot idx_to_label ", "entities": "(('NucleoplasmThe nucleus', 'nucleus blue channel'), 'find') (('Cell junctions', 'neighboring cells'), 'observe') (('SCV', 'muliple multi together cell'), 'see') (('that', 'staining artifacts'), 'note') (('When cell', 'mitotic spindle'), 'move') (('which', 'microtubules'), 'be') (('Mitotic spindleThe mitotic spindle', 'cell dividing mitosis'), 'see') (('CytosolThe cytosol', 'nuclear membrane'), 'extend') (('you', 'winning solution'), 'believe') (('we', 'test set'), 'annotate') (('SCV', 'localization examples SCV multi section'), 'be') (('Nuclear specklesNuclear speckles', 'nucleoplasm'), 'see') (('We', 'private private leaderboard'), 'want') (('microtubules', 'red channel'), 'be') (('ER', 'ER yellow channel'), 'identify') (('Intermediate filaments', 'close nucleus'), 'extend') (('cells', 'image level labels'), 'inherit') (('which', 'cell'), 'recognize') (('class', 'negative stainings'), 'include') (('staining', 'cell'), 'be') (('Actin class', 'Actin filaments'), 'filament') (('Label distribution', 'training set'), 'be') (('they', 'proteins'), 'be') (('that', 'whole cell'), 'see') (('Nucleoli fibrillar centerNucleoli fibrillary center', 'cell type'), 'appear') (('They', 'environmental cues'), 'be') (('This', 'matched cells'), 'use') (('HUVEC RPTEC TERT1 SY5Y SiHa OS A 431 A549 EFO 21 HAP1 HEK 293 HeLa PC 3 30 SK MEL 30 U 2 U', 'competition'), 'vary') (('They', 'cell as well usually more nuclear speckles'), 'vary') (('Also Cytokinetic bridge', 'just demonstration'), 'be') (('how genetically identical cells', 'drug treatment'), 'understand') (('also how patterns', 'cell different lines'), 'see') (('same type', 'Human Protein Atlas Classification challenge https previous www'), 'use') (('we', 'cell 17 lines'), 'differ') (('matched cell', '0'), 'u') (('they', 'centrosome'), 'be') (('Predicted masks', 'multilabeled more than one cell'), 'run') (('chromatin', 'DAPI visible intense staining'), 'condense') (('This', 'Human Protein Atlas Single Cell Competition'), 'welcome') (('They', 'cells'), 'locate') (('19 0 that', 'total'), 'be') (('CentrosomeThis class', 'centrosomes'), 'include') (('number', 'cell types'), 'varie') (('test set', 'training set'), 'have') (('Negative', '18'), 'be') (('you', 'individual cell'), 'be') (('microtubule where network', 'region'), 'see') (('Intermediate filamentsIntermediate filaments', 'strands crossing'), 'exhibit') (('negative pattern', 'staining unspecific'), 'mean') (('This', 'numerous scientific publications'), 'call') (('staining', 'entire cell'), 'be') (('class', 'plasma membrane'), 'include') (('shape', 'cellular various processes'), 'have') (('we', 'cell variation high single SCV'), 'choose') (('Plasma membrane', 'occasionally characteristic protrusions'), 'appear') (('Plasma how Membrane', '431 right'), 'be') (('bodiesNuclear Nuclear bodies', 'nucleoplasm'), 'be') (('perfectly sometimes it', 'nucleus'), 'be') (('They', 'microtubule red channel'), 'appear') (('you', 'red channel'), 'yes') (('you', 'that'), 'have') (('They', 'close nucleus'), 'see') (('Nuclear membraneThe nuclear membrane', 'nucleus'), 'appear') (('You', 'Organelles https www'), 'read') (('which', 'DAPI blue channel'), 'see') (('green one', 'blue channels'), 'leave') (('Actin filaments', 'thinner filaments'), 'see') (('Vesicles Peroxisomes Endosomes Lysosomes Lipid', 'Cytoplasmic bodies'), 'droplet') (('org', 'CELL STRUCTURE'), 'learn') (('staining', 'nucleoli Class'), 'include') (('We', 'cells'), 'want') (('you', 'winning teams'), 'publish') (('that', 'test private set'), 'be') (('Negative cells', 'other classes'), 'note') (('bundles', 'extracellular matrix ECM'), 'be') (('cell Therefore single classifier', 'previous challenge'), 'be') (('storage fat Cytoplasmic', 'cytosol'), 'include') (('you', 'prediction'), 'note') (('com c human protein atlas image that', 'image level labels paper https www'), 'classification') (('staining', 'often close nucleus'), 'appear') (('at least 1 cell', 'pattern'), 'imbalanced') ", "extra": "['biopsy of the greater curvature', 'test']"}