{"name": "skin cancer analyzer streamlit app ", "full_name": " h4 Imports Done h1 1 Exploratory Data Analysis h1 2 Data Preprocessing h1 3 Model Build h1 4 Predictions h3 Github h2 Demo Application Available here h3 Don t hesitate to Upvote if You like this kernal ", "stargazers_count": 0, "forks_count": 0, "description": "Basal cell carcinoma 5. This benchmark dataset can be used for machine learning and for comparisons with human experts. Data Preprocessing 3. Automated classification of skin lesions using images is a challenging task owing to the fine grained variability in the appearance of skin lesions. Benign keratosis like lesions 4. Exploratory Data Analysis 2. It has 7 different classes of skin cancer which are listed below 1. Predictions Streamlit App for Skin cancer Analyzer on my Github Github https github. PNG used for converting labels to one hot encoding convert to one hot encoding Merging images from both folders HAM10000_images_part1. zip into one dictionary This dictionary is useful for displaying more human friendly labels later on figure size in inches Let s confirm the number of classes p summarize history for accuracy summarize history for loss Predict the values from the validation dataset Convert predictions classes to one hot vectors Convert validation observations to one hot vectors compute the confusion matrix plot the confusion matrix. com shashwatwork Skin cancer Analyzer Demo Application Available here https skin cancer analysis. Skin cancer is the most common human malignancy is primarily diagnosed visually beginning with an initial clinical screening and followed potentially by dermoscopic analysis a biopsy and histopathological examination. It consists of 10015 dermatoscopicimages which are released as a training set for academic machine learning purposes and are publiclyavailable through the ISIC archive. Vascular lesions 7. com Don t hesitate to Upvote if You like this kernal Capture. Dermatofibroma Imports Done 1. Actinic keratoses 6. This the HAM10000 Human Against Machine with 10000 training images dataset. zip and HAM10000_images_part2. PNG attachment Capture. Melanocytic nevi 2. ", "id": "shashwatwork/skin-cancer-analyzer-streamlit-app", "size": "1518", "language": "python", "html_url": "https://www.kaggle.com/code/shashwatwork/skin-cancer-analyzer-streamlit-app", "git_url": "https://www.kaggle.com/code/shashwatwork/skin-cancer-analyzer-streamlit-app", "script": "Flatten sklearn.metrics keras.preprocessing.image glob keras.layers keras.callbacks label_binarize train_test_split rcParams Dropout np_utils Sequential MaxPool2D to_categorical # convert to one-hot-encoding Adam keras.utils.np_utils imread Conv2D seaborn numpy plot_confusion_matrix ReduceLROnPlateau PIL plotly.express to_categorical # used for converting labels to one-hot-encoding ModelCheckpoint confusion_matrix ImageDataGenerator sklearn.model_selection Image matplotlib.pyplot Activation Dense keras.utils pandas keras.optimizers BatchNormalization MaxPooling2D sklearn.preprocessing backend matplotlib backend as K keras keras.models keras.layers.normalization skimage.io ", "entities": "(('Predictions', 'Github Github https github'), 'streamlit') (('Automated classification', 'skin lesions'), 'be') (('PNG', 'HAM10000_images_part1'), 'use') (('You', 'kernal Capture'), 'hesitate') (('which', 'ISIC archive'), 'consist') (('dataset Convert predictions', 'confusion matrix'), 'zip') (('which', '1'), 'have') (('training 10000 images', 'Machine'), 'dataset') (('most common human malignancy', 'dermoscopic potentially analysis'), 'be') (('benchmark dataset', 'human experts'), 'use') ", "extra": "['biopsy', 'biopsy of the greater curvature']"}