{"name": "smote with model lightgbm ", "full_name": " h1 Starter Code EDA and LGBM Baseline h2 1 Loading the Data h2 2 EDA h3 Target Experiment h3 Seat h3 Time of the experiment h3 Electroencephalogram recordings h3 Electrocardiogram h3 Respiration h3 Galvanic Skin Response h2 3 Gradient Boosting h3 Normalizing h2 Solve Class Imbalance Problem Using SMOTE h3 Train Test split h3 Model h3 Feature importance h3 Confusion Matrix h3 Submission h3 Thanks for reading ", "stargazers_count": 0, "forks_count": 0, "description": "However we can t use this feature because time in the flight simulator has nothing to do with time in the experiments. Electrocardiogram 3 point Electrocardiogram signal. 2 EDA Target ExperimentThe pilots experienced distractions intended to induce one of the following three cognitive states Channelized Attention CA is roughly speaking the state of being focused on one task to the exclusion of all others. 2384186 µV and a range of 2. DataFrame train_df train_df. 45 bagging_fraction 0. Time of the experimentThe repartition of events is interesting. The data are provided in microvolts. Startle Surprise SS is induced by having the subjects watch movie clips with jump scares. Again quite similar. The galvanic skin response GSR which falls under the umbrella term of electrodermal activity or EDA refers to changes in sweat gland activity that are reflective of the intensity of our emotional state otherwise known as emotional arousal. Note that the variance is larger on the test set. collect scaler MinMaxScaler train_df scaler. I do believe the following features depend a lot of the person therefore I apply a Min Max Scaler for each pilot. 3 reg_alpha 0. It s a shame because take off and landing could have been exploited. Periodically a math problem showed up which had to be solved before returning to the monitoring task. Galvanic Skin Response A measure of electrodermal activity. Electroencephalogram recordingsWe Also check if features have the same distribution on the test and train setReparitions seem consistent Gaussians with a sinusoïdal noise centered at 0. SeatWhich seat the pilot is sitting in. Except foir the 20000 ish samples train test repartitions are similar. 3 Gradient Boosting Normalizing Because of earlier remarks we normalize our features. Samples are labelled the following way A baseline B SS C CA D DAThe experiment of the test set is LOFT Line Oriented Flight Training which is a full flight take off flight and landing in a flight simulator. 012215 µV and a range of 100mV to 100mV. The sensor had a resolution bit of. This is induced by having the subjects perform a display monitoring task. Feature importance Confusion Matrix SubmissionAny feedback is always appreciated Thanks for reading test_df pd. Diverted Attention DA is the state of having one s attention diverted by actions or thought processes associated with a decision. 05 num_leaves 60 max_depth 9 feature_fraction 0. csv dtype dtypes print gc. Respiration A measure of the rise and fall of the chest. columns tr_col train_df Classes as integers params boosting_type gbdt objective multiclass num_class 4 metric multi_error learning_rate 0. 15 reg_lambda 0. This is induced in benchmarking by having the subjects play an engaging puzzle based video game. Solve Class Imbalance Problem Using SMOTE Train Test split ModelNote that I did not bother tweaking the parameters yet. Nothing much to say here the test set has a bunch of sample with lower values though. 15 min_child_weight 50. 0 left seat 1 right seatThis probably has nothing to do with the outcome of the experiment though. fit_transform train_df train_df pd. Starter Code EDA and LGBM Baseline 1 Loading the DataNo missing values. ", "id": "ashishpatel26/smote-with-model-lightgbm", "size": "3157", "language": "python", "html_url": "https://www.kaggle.com/code/ashishpatel26/smote-with-model-lightgbm", "git_url": "https://www.kaggle.com/code/ashishpatel26/smote-with-model-lightgbm", "script": "sklearn.metrics lightgbm tqdm_notebook MinMaxScaler SMOTE seaborn numpy tqdm_notebook as tqdm plot_confusion_matrix sklearn.model_selection confusion_matrix imblearn.over_sampling matplotlib.pyplot pandas gc tqdm dask.dataframe log_loss sklearn.preprocessing yellowbrick.text run_lgb train_test_split TSNEVisualizer ", "entities": "(('time', 'experiments'), 'use') (('Also features', '0'), 'check') (('EDA Target ExperimentThe 2 pilots', 'others'), 'experience') (('Attention Diverted DA', 'thought decision'), 'be') (('subjects', 'video based game'), 'induce') (('1 seatThis', 'experiment'), 'left') (('Feature importance Confusion Matrix SubmissionAny feedback', 'always Thanks'), 'appreciate') (('LOFT Line Oriented Flight which', 'flight simulator'), 'label') (('integers', 'columns tr_col'), 'Classes') (('subjects', 'task'), 'induce') (('Nothing', 'lower values'), 'have') (('which', 'monitoring task'), 'show') (('Time', 'events'), 'be') (('that', 'otherwise emotional arousal'), 'refer') (('variance', 'test set'), 'note') (('ish samples train test 20000 repartitions', 'foir'), 'be') (('subjects', 'jump scares'), 'induce') (('therefore I', 'pilot'), 'believe') (('I', 'parameters'), 'solve') (('we', 'features'), 'Normalizing') ", "extra": "['biopsy of the greater curvature', 'outcome', 'test', 'bag']"}