{"name": "starter notebook ", "full_name": " h1 Detection of spark erosion in Insulation Joints h1 1 prepare data h1 2 load the model h1 3 evaluate the prediction ", "stargazers_count": 0, "forks_count": 0, "description": "The image will be normalized and cropped to the region of interest. set paths read image normailize the image crop Read ground truth image return pink values into Reshape Predict the picture Add probability value normally higher than 50 plot the spark erosion prediction. com abreheret PixelAnnotationTool. The spark erosion is harder to detect and can be found just above the insulation joint the small withe dotted area. Note please run all cells one by one in order for the notebook to work properly. evaluate the predictionThe final step is to see how well we performde. Lets predict an image. load the modelFor this project we used a unet model which is a type of model often used for image segmantation. IoU is an evaluation metric used to measure the accuracy of an object detector or image segmentation on a particular dataset. We can evaluate how good the region is predicted. nl This project was performed by Olivier Spliethof who worked at ProRail at the time. 1 being the spark erosion and 0 the rail. prepare dataThe first step is to load the image and its mask. In this case we crop both sides of the images such that we only look at the rail with its insulation joint. Each mask contains an array with vallues 0 and 1. To see the spark erosion better we created a mask by annotating each pixel with the help of the PixelAnnotationTool https github. The image of the rail above shows a clear insulation joint the horizontal line. Detection of spark erosion in Insulation JointsAuthor Oscar van Hees oscar. We will use the Intersection over Union method. ", "id": "oscarvanhees/starter-notebook", "size": "1404", "language": "python", "html_url": "https://www.kaggle.com/code/oscarvanhees/starter-notebook", "git_url": "https://www.kaggle.com/code/oscarvanhees/starter-notebook", "script": "sklearn.metrics confusion_matrix numpy matplotlib.pyplot tensorflow ", "entities": "(('We', 'Union method'), 'use') (('set paths', 'spark erosion prediction'), 'read') (('notebook', 'order'), 'run') (('IoU', 'particular dataset'), 'be') (('spark erosion', 'small withe dotted area'), 'be') (('such we', 'insulation joint'), 'crop') (('better we', 'PixelAnnotationTool https github'), 'create') (('above clear insulation', 'horizontal line'), 'show') (('first step', 'image'), 'be') (('image', 'interest'), 'normalize') (('which', 'image often segmantation'), 'load') (('who', 'time'), 'nl') (('mask', 'vallues'), 'contain') ", "extra": "['annotation', 'biopsy of the greater curvature']"}