{"name": "team 4 report notebook ", "full_name": " h1 Histopathologic Cancer Detection h1 Project Description h1 Import Packages h1 Exploratory Data Analysis h2 Number of images in the training and test set h2 Label Distribution h2 Images Size h2 Visualization h1 Technical Challenges h1 Model Architecture Summary h1 Final Model Evaluation h1 Conclusion ", "stargazers_count": 0, "forks_count": 0, "description": "Kaggle provides a limited amount of hours for each user every week. In our case we constructed two models using this technique. Our data set contains 220 025 training images and 57 456 test images. However using techniques like transfer learning with VGG16 and ensemble learning can significantly improve the model s accuracy and performance. Furthermore when you see the first Confusion Matrix see diagram below Accuracy is about 94 but the False benign rate is around 3. 8569 LP Cancer Detection Ensemble Model with LR https www. Number of images in the training and test set There are 220 025 training images and 57 458 test images in the dataset. 9589 on the validation dataset. 45 which is two times higher than False Malignant. com lokanathpatro lp cancer detection models submission scriptVersionId 81777457 0. com gauravsamudra gs cancerdetection v01 scriptVersionId 79421784 Model With Pre Cropped Images 32x32 25 0. In this project we created an algorithm to identify metastatic cancer in small image patches taken from larger digital pathology scans. So it took us some time to familiarize ourselves and learn how to navigate the platform. 7813 LT Cancer Detection with Pre Cropped Images https www. com drive 1_PvSVhBlYdwXEAqbb7a8RABTXgcU14ME usp sharing scrollTo yYkbG_C6KJ1Y Final Model Evaluation Final_Model_Evaluation_Notebook https www. The images are labeled as 0 or 1 where 0 No Cancer Tissue and 1 Has Cancer Tissue s. And our final model is NOT upto the mark. 9537 and a private score of 0. For our last model in this competition we implemented PyTorch and the result was surprisingly better than all the models where Keras was used. We achieved an AUC of 0. It was noticed that the pre cropped dataset was consuming noticably more time than the original dataset. com lokanathpatro lp cancer detection models submission scriptVersionId 81797079 0. 9642 and a private score of 0. We got a public score of 0. 5 of images in the dataset belong to cancerous class and 59. 9815 on the validation set. If we stretch further and add 20 basis points Accuracy goes down along with False benign percentage. In the subsequent model we used the original 96x96 images and cropped them down to the middle 32x32 using Cropping2D Layer. Images Size As we can see the images are 96x96 pixels and are full color. com lokanathpatro lp cancer detection models submission scriptVersionId 81778571 0. com lokanathpatro lp cancer detection cnn model with pytorch scriptVersionId 81689603 0. On this Kaggle competition our model achieved a private score of 0. about our work journey in the following notebook TRAINING NOTEBOOK https www. When a trusted model predicts Benign the case doesn t go for further review and hence False Benign rate is a very important parameter of trust after Accuracy. 9537 LP Cancer Detection Models Submission https www. Lets update the dataset to include filename extensions. 9449 LP Cancer Detection VGG16 Model https www. 9397 LT Cancer Detection_Simple Model https colab. png attachment fd8dca3d 51ac 4202 b5b2 bb247b523c2d. One of the biggest challenges we had was related to the management of the GPU hours. We applied this technique on the original 96x96 images and this gave us an AUC score of 0. Import Packages Exploratory Data Analysis In this section we start looking at some basic statistics like the amount of images the label distribution and the image size. In the subsequent model we applied transfer learning on the same original 96x96 size images. Each pixel is made up of three channels R G B with each channel representing a color. com leopoldtchomgwi lt cancer detection cropped im Model With Augmented Images 96x96 25 0. 25 and got an AUC score of 0. png attachment 9c6fc180 1dd6 495c b82c 1cc405d73110. Metastasis is a term used to describe the spread of cancer cells from the primary tumor into other organs or tissues of the body. First we combined three models simple model VGG16 ResNet50 with logistic regression. Image augmentation is a technique that consists of artificially creating new training data by applying image transformation such as scaling rotations and translations to the original training images. 9449 and the private score 0. In the next step of our journey we explored more advanced techniques such as image augmentation transfer learning and ensemble learning. To evaluate our classification model s performance the Area Under the Curve AUC was used. For our submissions anything more than 50 probability is predicted a Malignant and less than 50 is predicted and Benign. The images are in the tif format and are 96x96 pixels color. Histopathologic Cancer Detection Identification of Metastatic Tissue in Histopathologic Scans of Lymph Node Sections Library used Keras PyTorch Language PythonBy Jenna Ward Gaurav Samudra Lokanath Pedna and Leopold Kamga Tchomgwi Project Description Metastasis is the principal cause of death for 66 to 90 of patients with cancer Chaffer CL Weinberg RA. com jennaward6 jw cancerdetection v01 with visualizations. The second challenge was that it was not possible to work or edit the same notebook on kaggle at the same time with our collaborator s otherwise you get an error when you try to open the notebook. We started our journey by creating very basic models. This is a binary classification problem. 9642 LP Cancer Detection CNN Model with PyTorch https www. com jennaward6 jw cancerdetection v01 with visualizations scriptVersionId 80269876 Simple Model2 96x96 20 0. com gauravsamudra team 4 training overview notebook. And the second diagram displays the number of observations belonging to class 0 Non_cancerous and to class 1 cancerous. com lokanathpatro team 4 final model evaluation notebook Conclusion At the end of our work we were able to create several convolutional neural network models or algorithms that can be used to detect metastatic cancer in histopathological image scans. You will find detailed information such as the code traning and validation learning curves etc. png The entire code and results of our final model can be found here Final_Model_Evaluation_Notebook https www. com leopoldtchomgwi cancerdetection submission final2 scriptVersionId 81039203 0. This technique also involves human error. com lokanathpatro lp cancer detection models submission scriptVersionId 81797079 PyTorch 96x96 40 0. The conventional diagnostic procedure which relies on a manual detection is very challenging and time consuming for pathologists as they must review multiple scans of lymph node sections before any conclusion. In the second model we combined the same three previously mentioned models but this time with weighted average. To conclude it is possible to create a good model that can detect metastatic cancer and classify histopathologic images without using advanced deep learning or machine learning techniques. com jennaward6 team 4 cancer detection submit jw edit scriptVersionId 80319158 0. Ensemble learning is a technique where multiple models or CNN are combined to generate one optimal model. Later on by simply twisting the CNN architecture of the model that uses the original 96x96 size images we were able to significantly increase the AUC from 0. 9124 JW Cancer Detection with Augmented Images https www. It turned out that the model created with the pre cropped 32x32 images yielded a lower accuracy while the model created with the full size images led to an acceptable result 75 80 accuracy. com lokanathpatro lp cancer detection cnn model with pytorch Cropping2D Layer Model 96x96 25 0. At first we explored the 96x96 size images from Kaggle and the pre cropped 32x32 images dataset provided by the instructor. com lokanathpatro lp cancer detection ensemble model with lr Ensemble VGG16 ResNet50 Simple Model with Weighted Average 96x96 40 0. The difference between the public score 0. Our model also correctly identifies 96 of benign tissues and 92 of malignant tissues. Model Architecture Image Size Epochs Private Score Public Score Notebook Simple Model 96x96 30 0. 9298 than the model with logistic regression. According to our results the second model with weighted average produced a better score public score of 0. Label Distribution The first diagram shows that 40. com lokanathpatro lp cancer detection vgg16 model ResNet50 96x96 40 0. com leopoldtchomgwi lt cancer detection v01 submission revised 0. com gauravsamudra gs cancersubmission v1 scriptVersionId 79504395 0. com leopoldtchomgwi lt cancer detection cropped images submission scriptVersionId 79658223 0. We used the pre trained VGG16 model to build our best model. 8958 GS Cancer Detection with Cropping2D Layer https www. 2011 331 6024 1 559 64. 8669 LT Cancer Detection Simple Model https www. Sample images of original dataset 96x96 Sample images for cropped dataset 32x32 Example of images for Class 1 Example of images for Class 0 Look at some augmented images Visualize Filters Visualize Feature Maps Cancerous Feature Map Non Cancerous Feature Map Class Activation Map Heatmap Function Distribution of Pixel Channels Technical Challenges For most of us it was the first time working on the kaggle platform. Some of our best models are summarized in the table below. The sceond confusion matrix shows that when we add a 10 basis point positive bias to our probabilities and then derive the predictions The accuracy stays same but the False Benign percentage drops significantly. com lokanathpatro lp cancer detection ensemble model with lr scriptVersionId 81787013 0. png Classification Report The report also indicates our model is correct 95 of the time when it predicts a tumor is benign and 94 of the time when it predicts a tumor is malignant. This technique yielded an AUC value of 0. com lokanathpatro team 4 final model evaluation notebook. 9956 for VGG16 and ResNet50 respectively. We achieved an accuracy of 94 and an AUC score of 0. With this model we achived an accuracy of 94. Transfer learning with VGG16 was selected as our final model. 8798 LP Cancer Detection ResNet50 Model https www. com leopoldtchomgwi lt cancerdetection v01 with balanced target dist VGG16 96x96 60 0. With the emergence of digital pathology it is possible today to utilize convolutional neural networks CNN to detect metastatic cancer and classify histopathology images with a high accuracy. Model Architecture Summary It was challenging to find the best model for this problem. A perspective on cancer cell metastasis. 5 of images are Non cancerous. As a result some of us ran out of GPU hours since most of our models could take up to 6 hours to train depending on the number of epochs selected. com lokanathpatro lp cancer detection resnet50 model Ensemble VGG16 ResNet50 Simple Model with Logistic Regression 96x96 40 0. The idea was to find a model that will be used as a baseline for more complex models. In transfer learning a pre trained model developed for a task is re used as the starting block for a model on a second task. 9316 and a public score of 0. In our case we used the pre trained VGG16 model and the ResNet50 model. We may obtain improved results by altering the network design architecture and parameters. Visualization Here we display the following items in this visualization notebook CANCER_DETECTION_VISUALIZATION_NOTEBOOK https www. ", "id": "jennaward6/team-4-report-notebook", "size": "12382", "language": "python", "html_url": "https://www.kaggle.com/code/jennaward6/team-4-report-notebook", "git_url": "https://www.kaggle.com/code/jennaward6/team-4-report-notebook", "script": "seaborn numpy matplotlib.pyplot pandas matplotlib.image ", "entities": "(('Metastasis', 'body'), 'be') (('that', 'image histopathological scans'), 'team') (('model', '0'), 'achieve') (('we', 'GPU hours'), 'relate') (('which', 'two times False Malignant'), '45') (('First we', 'simple logistic regression'), 'combine') (('images', 'tif format'), 'be') (('Label first diagram', '40'), 'Distribution') (('False Benign hence rate', 'Accuracy'), 'go') (('we', 'Cropping2D Layer'), 'use') (('We', 'very basic models'), 'start') (('we', 'label distribution'), 'Analysis') (('about False benign rate', 'Accuracy'), 'see') (('You', 'code curves such traning learning etc'), 'find') (('most', 'epochs'), 'run') (('We', 'best model'), 'use') (('However using', 'significantly accuracy'), 'improve') (('We', 'network design architecture'), 'obtain') (('we', 'pathology larger digital scans'), 'create') (('we', 'dataset instructor'), 'explore') (('we', '0'), 'be') (('We', 'AUC 0'), 'achieve') (('tumor', 'time'), 'Report') (('pre trained model', 'second task'), 'use') (('Transfer', 'final model'), 'select') (('Lets', 'filename extensions'), 'update') (('second diagram', 'class'), 'display') (('model', 'acceptable result'), 'turn') (('we', 'technique'), 'construct') (('cropped pre dataset', 'original dataset'), 'notice') (('Some', 'table'), 'summarize') (('Accuracy', 'along False benign percentage'), 'stretch') (('5', 'cancerous class'), 'belong') (('we', 'VGG16 pre trained model'), 'use') (('model', 'malignant tissues'), 'identify') (('final model', 'mark'), 'upto') (('that', 'advanced deep learning'), 'be') (('they', 'conclusion'), 'be') (('technique', '0'), 'yield') (('images', 'Cancer 0 Tissue'), 'label') (('where Keras', 'surprisingly models'), 'implement') (('we', 'time weighted average'), 'combine') (('we', '94'), 'achive') (('classification model', 'Curve AUC'), 'use') (('data set', '220 training 025 images'), 'contain') (('Visualization Here we', 'visualization notebook CANCER_DETECTION_VISUALIZATION_NOTEBOOK https www'), 'display') (('we', 'image augmentation transfer such learning'), 'explore') (('that', 'more complex models'), 'be') (('So it', 'how platform'), 'take') (('when you', 'notebook'), 'be') (('we', 'size same original 96x96 images'), 'apply') (('it', 'first kaggle platform'), 'image') (('Histopathologic Cancer Detection Identification', 'cancer Chaffer CL Weinberg RA'), 'use') (('technique', 'also human error'), 'involve') (('pixel', 'color'), 'make') (('com leopoldtchomgwi lt cancer detection', 'm Augmented Images'), 'crop') (('entire code', 'final model'), 'png') (('False Benign percentage', 'then predictions'), 'show') (('Kaggle', 'user'), 'provide') (('where multiple models', 'one optimal model'), 'be') (('this', '0'), 'apply') (('Model Architecture It', 'problem'), 'Summary') (('Malignant than 50', 'anything'), 'predict') (('that', 'training original images'), 'be') (('it', 'high accuracy'), 'be') (('second model', '0'), 'produce') ", "extra": "['biopsy of the greater curvature', 'patient', 'test', 'metastasis', 'procedure']"}