{"name": "text2image gan ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "ndf x 32 x 32 state size. embed_dim out_features self. ndf 2 x 16 x 16 state size. num_channels x 64 x 64 input is nc x 64 x 64 state size. to know the categories in hdf5 file 2. see what data is stored in each category pdb. num_channels x 64 x 64 projected_embed self. ngf 4 x 8 x 8 state size. BOTTOM UP approach ahead The code in the next cell follows bottom up execution flow to understand which method is getting called when start from the last part i. LeakyReLU negative_slope 0. Reference links Paper https arxiv. Linear in_features self. h_el One sided label smoothing Helps preventing the discriminator from overpowering the generator adding penalty when the discriminator is too confident Train the discriminator Train the generator Generator Loss function This is a customized loss function the first term is the regular cross entropy loss The second term is feature matching loss this measure the distance between the real and generated images statistics by comparing intermediate layers activations The third term is L1 distance between the generated and real images this is helpful for the conditional case because it links the embedding feature vector directly to certain pixel values. cat projected_embed z 1 based on https github. The references used are mentioned below. ndf 4 x 8 x 8 state size. ngf x 32 x 32 state size. ngf 8 x 4 x 4 based on https github. num_channels x 64 x 64 state size. ngf 2 x 16 x 16 state size. BatchNorm1d num_features self. com ashual Text to Image Synthesis Datasets used in this kernel are same as the datasets used in the above git repository. ndf 8 x 4 x 4 self. ngf 8 x 4 x 4 state size. Please note This kernel is for practice purposes only. All imports are here view contents in HDF5 files 1. pdf Git repo https github. projected_embed_dim nn. projection embed_vector. change this if you want to train any other gan Convert nested Python dict to object. 2 inplace True based on https github. unsqueeze 3 latent_vector torch. com pytorch examples blob master dcgan main. ", "id": "msripooja/text2image-gan", "size": "525", "language": "python", "html_url": "https://www.kaggle.com/code/msripooja/text2image-gan", "git_url": "https://www.kaggle.com/code/msripooja/text2image-gan", "script": "torch.utils.data __init__ NearestNeighbor discriminator_factory _train_gan torch find_wrong_image generator_factory torch.autograd gan_factory(object) vae_encoder_generator(nn.Module) train DataLoader Text2ImageDataset(Dataset) forward numpy NearestNeighbors __getitem__ vae_encoder(nn.Module) generator(nn.Module) PIL Utils(object) nn test Trainer(object) Concat_embed(nn.Module) save_checkpoint generator_only Image matplotlib.pyplot vae_generator(nn.Module) get_text_and_images discriminator(nn.Module) Dataset __len__ Struct smooth_label Variable weights_init find_inter_embed get_text sklearn.neighbors validate_image cuda timedelta vae_discriminator(nn.Module) encoder_only datetime get_text_and_images_and_embedding ", "entities": "(('Synthesis Datasets', 'git above repository'), 'Text') (('it', 'pixel directly certain values'), 'sided') (('data', 'category pdb'), 'see') (('kernel', 'practice purposes'), 'note') (('Python', 'gan other Convert'), 'change') (('view here contents', 'HDF5'), 'be') (('method', 'when last part'), 'follow') ", "extra": "[]"}