{"name": "the secret to getting the second date ", "full_name": " h1 The Secret to Getting the Second Date h3 Do you believe in love at first sight or should I walk by again Anonymous h2 Introduction h3 About the data h2 Table of Contents h2 Data Cleaning and EDA h2 Modeling Classification h2 Conclusion ", "stargazers_count": 0, "forks_count": 0, "description": "how many of each gender are there and does that affect the other person s decision That is do women receive more positive final decisions from the other person dec_o than men do It looks like women received about 1750 no and about 1600 yes for the decision question Would you like to see him or her again. Conclusion ccn Data Cleaning and EDAFrom the peek at the data we had above there are a ton of fields with NaNs. The dataset also includes questionnaire data gathered from participants at different points in the process. Let s look into the interests some more Just for fun I wanted to see how interests differed by gender. thanks kagglers counting null values age distribution of participants out of curiosity I want to see how many speed daters found a match narrowing dataset counting null values removing null rows now that the nulls are in the hundreds and not the thousands checking datatypes creating an object free dataframe for later use heatmap just for fun looking at interest overlap just for fun looking at interest overlap just for fun looking at interest overlap just for fun looking at interest overlap removing interests looking at dec_o by gender chi square test unrequited love count encoding unrequited love as a new column looking at url by attractiveness chi square test OLS model with coefficients OLS model with coefficients preparing the data logistic regression classification model random forest model xgboost model. com annaeshen speed dating experiment blob master speed dating 938x625. These fields include demographics dating habits self perception across key attributes beliefs on what others find valuable in a mate lifestyle informationSee the speed dating data key. Hang in there single people About the data Data was gathered from 552 participants in experimental speed dating events from 2002 2004. It turns out that being intelligent or sincere or having similar interests actually slightly hurts your chances at securing that second date Don t panic though this is just from 4 minutes of meeting each other We might take this as advice to focus on breaking the ice and being more fun and likeable in the first date Now let s run an OLS but with both respondents ratings instead of just one and this time on match instead of decision dec. This makes sense given that we know only 26 of people were heartbroken if you like someone odds are they will like you back Let s try some other models to see if we can get closer to predicting a match. There are 8 378 rows and a bunch of fields have thousands of NaNs and probably bad practice to use imputation to guess the values. First though let s take a look at some totals before we throw out some fields and rows due to missing values. Random forest gave us a slightly more accurate model at 82. During the events the attendees would have a four minute first date with every other participant of the opposite sex. 9 accuracy in train and 82. XGBoost was ever so slightly less accurate than Random Forest in the validation set. In other words men are more likely to be rejected by women than women are to be rejected by men wahwah. Men received about 2050 no and about 1300 yes. They were also asked to rate their date on six attributes Attractiveness Sincerity Intelligence Fun Ambition Shared Interests. com annavictoria speed dating experiment image https github. 5 accuracy in predicting a match on both the training and the validation using logistic regression. This is a statistically significant difference as confirmed by the above chi squared test p value. It s not interests or hobbies it s not attractiveness or intelligence or other traits. To summarize Take your date out to the cliche dinner and a movie because both genders are likely to enjoy it Dating is tougher for men perhaps women can be more selective More participants experienced unrequited love than those that found love so don t feel too bad People get their heartbroken regardless of their personal traits like attractiveness so if you strike out it s not you that is the problem Your impression of yourself is often wrong There is no one trait that makes you likeable Being likeable is important for securing that second date importing packages handy for showing truncated results importing data use this encoding funky error otherwise. Conclusion Although this was slightly disappointing it looks like there still is no real answers to the secret of love. The histograms above show that if you want to suggest a date that both genders are likely to enjoy choose movies or dining However referring back to the heatmap none of the interests really correlated with match so that gives me the go ahead to remove interests from my match prediction model It also looks like match the variable we are interested in is mostly correlated to the decisions of the partners and the partner s attributes how well they rated the partner s attractiveness sincerity intelligence fun ambition and how much they liked them. So most of the participants were in their mid twenties to early thirties. So the good news is the likelihood of getting rejected is not dependent on your attractiveness It looks like regardless of your attractiveness or any other trait for that matter you are just as likely to experience heartbreak It also looks like typically your own opinion of how attractive you are attr3_1 is only weakly correlated with how attractive your date finds you attr_o And in fact there is nearly no correlation between how smart or sincere you think you are versus how smart and sincere your date thinks of you Perhaps these are tough qualities to get across in a 4 minute date So that brings up the question between attractiveness sincerity intelligence fun ambition and liking what was the most influential in the final decision dec I ll run a linear regression model. More than the percentage of people who got a second date On an unrelated note I wonder if the incidence of unrequited love differs by the attractiveness of the partner. Looks like Random Forest is my champion model. jpg raw true IntroductionWhat makes people attractive What gets people a second date Why isn t garlic breath a variable in this dataset We re about to find out. Data Cleaning and EDA cln Heatmap hm Interest Overlap io Decisions by Gender dg Unrequited Love url OLS Model ols II. For example men gender 1 seem to have a preference for attractive partners attr1_1 while women gender 0 seem to have a preference for ambitious partners amb1_1 In other news women like shopping and yoga and men like gaming so at least we know this heatmap is working. Interestingly match was not correlated to age or race or even how similar the participant and partner s interests are int_corr Love does not discriminate according to the data Going along investigating further gender differences I wonder. Really it s just how much someone likes you. Who would have thought On the other hand we did learn a thing or two. doc for data dictionary and question key. From the coefficients it looks like all that really matters is the decision of both participants and perhaps whether or not they liked one another. It looks like only about 20 of people found themselves a second date after the speed dating session In looking at the heatmap above there are some interesting observations. At the end of their four minutes participants were asked if they would like to see their date again. Poor guys Now I wonder how many interactions were unrequited love That is getting the count of rows where dec_o 1 AND dec 0 OR a dec 1 AND dec_o 0 So it seems 26 of participants unfortunately had their heart broken. Looks like the difference in attractiveness was not statistically significant. Instead I ll just disregard these fields with over 4000 null values from the dataset and narrow my analysis to the fields that I can use. The Secret to Getting the Second Date Do you believe in love at first sight or should I walk by again Anonymous An analysis on the Speed Dating dataset from Kaggle https www. Modeling mdl Logistic Regression log Random Forest rf XGBoost xgb III. Table of ContentsI. Modeling Classification Without knowing what the partner s decision is dec_o it turns out that given how much the respondent likes the partner and what the respondent s decision is we have about an 82. ", "id": "aeshen/the-secret-to-getting-the-second-date", "size": "7982", "language": "python", "html_url": "https://www.kaggle.com/code/aeshen/the-secret-to-getting-the-second-date", "git_url": "https://www.kaggle.com/code/aeshen/the-secret-to-getting-the-second-date", "script": "LogisticRegression sklearn.ensemble sklearn.model_selection sklearn metrics RandomForestClassifier seaborn numpy matplotlib.pyplot GradientBoostingClassifier sklearn.linear_model pandas train_test_split statsmodels.api ", "entities": "(('single people', '2002'), 'gather') (('others', 'data key'), 'include') (('I', 'Kaggle https www'), 'Secret') (('themselves', 'heatmap'), 'look') (('just how someone', 'you'), 's') (('I', 'regression linear model'), 'be') (('second date', 'encoding funky error'), 'summarize') (('This', 'test p squared value'), 'be') (('I', 'gender along further differences'), 'correlate') (('now nulls', 'data logistic regression classification forest model xgboost model random model'), 'kaggler') (('perhaps they', 'one'), 'look') (('slightly it', 'love'), 'Conclusion') (('Looks', 'attractiveness'), 'be') (('Random forest', '82'), 'give') (('how much they', 'them'), 'show') (('I', 'partner'), 'wonder') (('doc', 'data'), 'dictionary') (('we', 'NaNs'), 'be') (('XGBoost', 'validation'), 'be') (('Men', 'about 2050 no'), 'receive') (('we', 'missing values'), 'let') (('I', 'gender'), 'let') (('we', 'thing'), 'think') (('attendees', 'opposite sex'), 'have') (('So most', 'early thirties'), 'be') (('unfortunately heart', 'participants'), 'guy') (('women', 'men wahwah'), 'be') (('we', 'match'), 'make') (('Now s', 'instead decision'), 'turn') (('We', 'about'), 'make') (('they', 'date'), 'ask') (('you', 'him'), 'be') (('dataset', 'process'), 'include') (('I', 'that'), 'disregard') (('They', 'six attributes'), 'ask') (('we', 'about 82'), 'model') (('heatmap', 'shopping'), 'seem') (('Looks', 'Random Forest'), 'be') ", "extra": "['gender', 'test']"}