{"name": "time series analysis and forecasting reliance ", "full_name": " h2 This notebook will the cover h2 Import Libraries h2 Import dataset h2 Converting Date into DateTime format h2 data summary h2 Check for missing values h2 Visualizing the locations of the missing data h2 Handling missing values h2 Plotting VWAP Volume Weighted Average Price over time h2 VWAP in 2019 h2 VWAP in 2020 h2 Open close High low prices over time h2 Volume over Time h2 Volume in 2020 h2 Q Q plot of VWAP h2 Stationarity h2 Check Stationarity i e Dicky Fuller Test h2 Seasonal Decompose h2 Convert Stationary into Non Stationary h3 Differencing h2 Plotting ACF and PACF ", "stargazers_count": 0, "forks_count": 0, "description": "e Dicky Fuller TestThe Augmented Dickey Fuller test is a type of statistical test called a unit root test. We interpret this result using the p value from the test. Steady increase after month of april. Whether we wish to predict the trend in financial markets or electricity consumption time is an important factor that must now be considered in our models. It is also the highest income tax payer in the private sector in India. The cross moment i. Check Stationarity i. It does not mean that the series does not change over time just that the way it changes does not itself change over time. For example it would be interesting to forecast at what hour during the day is there going to be a peak consumption in electricity such as to adjust the price or the production of electricity. com stationarity in time series analysis 90c94f27322 text In 20the 20most 20intuitive 20sense not 20itself 20change 20over 20time. A plot of the autocorrelation of a time series by lag is called the AutoCorrelation Function or the acronym ACF. It is these indirect correlations that the partial autocorrelation function seeks to remove. The null hypothesis of the test is that the time series can be represented by a unit root that it is not stationary has some time dependent structure. Seasonal Decompose cyclic patter is shown in every 30 days monthly Convert Stationary into Non Stationary Differencing We don t actually need to convert the time series data into stationary data. The autocorrelation for an observation and an observation at a prior time step is comprised of both the direct correlation and indirect correlations. png Note If you want to know more about stationarity you can refer this link http https towardsdatascience. com rohanrao a modern time series tutorial Reliance Industries Limited Reliance Industries Limited RIL is an Indian multinational conglomerate company headquartered in Mumbai Maharashtra India. Reliance is one of the most profitable companies in India the largest publicly traded company in India by market capitalization and the largest company in India as measured by revenue after recently surpassing the government controlled Indian Oil Corporation. u v a cov xᵤ xᵥ cov xᵤ ₐ xᵥ ₐ image. The intuition behind a unit root test is that it determines how strongly a time series is defined by a trendIt uses an autoregressive model and optimizes an information criterion across multiple different lag values. Reliance continues to be India s largest exporter accounting for 8 of India s total merchandise exports with a value of 1 47 755 crore and access to markets in 108 countries. Read more about the dataset https www. the auto covariance depends only on the difference u v i. Time series forecasting is the use of a model to predict future values based on previously observed values. The company is ranked 96th on the Fortune Global 500 list of the world s biggest corporations as of 2020. Open close High low prices over time All are following same pattern Volume over Time Volume in 2020 Q Q plot of VWAP used to determine whether dataset is distributed a certain way data is not normally distributed however this is what we usually expect from timeseries Stationarity In the most intuitive sense stationarity means that the statistical properties of a process generating a time series do not change over time. It has some time dependent structure. 05 Fail to reject the null hypothesis H0 the data has a unit root and is non stationary. com parulpandey getting started with time series using pandas https www. VWAP is a trading benchmark used by traders that gives the average price the stock has traded at throughout the day based on both volume and price. About DatasetThe dataset used is stock market data of the Nifty 50 index from NSE National Stock Exchange India over the last 20 years 2000 2019 The historic VWAP Volume Weighted Average Price is the target variable to predict. Alternate Hypothesis H1 The null hypothesis is rejected it suggests the time series does not have a unit root meaning it is stationary. png Formally the process xᵢ i ℤ is weakly stationary if 1. Because the correlation of the time series observations is calculated with values of the same series at previous times this is called a serial correlation or an autocorrelation. AUTO ARIMA Model Analyzing residuals Evaluating Model I hope you enjoyed this kernel Please don t forget to appreciate me with an Upvote. png Feature Engineering Adding lag values of High Low Volume Turnover will use three sets of lagged values one previous day one looking back 7 days and another looking back 30 days as a proxy for last week and last month metrics. A partial autocorrelation is a summary of the relationship between an observation in a time series with observations at prior time steps with the relationships of intervening observations removed. Reliance is responsible for almost 5 of the government of India s total revenues from customs and excise duty. 05 Reject the null hypothesis H0 the data does not have a unit root and is stationary. On 22 June 2020 Reliance Industries became the first Indian company to exceed US 150 billion in market capitalization after its market capitalization hit 11 43 667 crore on the BSE. png attachment image. Inspired from https www. Reliance owns businesses across India engaged in energy petrochemicals textiles natural resources retail and telecommunications. png IntroductionTime series analysis comprises methods for analyzing time series data in order to extract meaningful statistics and other characteristics of the data. Source wikipedia This notebook will the cover Data Preparation Exploratory Data Analysis Feature Engineering AUTO ARIMA Model Analyzing residuals Evaluating Model Data Preparation Import Libraries Import dataset Converting Date into DateTime format data summary Check for missing values There are missing vales in Trades Deliverable Volumne and deliverable Visualizing the locations of the missing data As you can see all the starting values are missing in columns Trades Deliverable Volume and Deliverble Handling missing values we don t have data of Trades on and before 31 05 2011 Exploratory Data Analysis Plotting VWAP Volume Weighted Average Price over time There is steady increase in prices upto year 2008 Stock price fell after jan 2008 and attain pick again in may june 2009 after that it fell again. The alternate hypothesis rejecting the null hypothesis is that the time series is stationary. Without going into the math this is the intuition for the partial autocorrelation. For study purpose I have explained how to check stationarity and how to convert non stationary data into stationary data Plotting ACF and PACF Autocorrelation and partial autocorrelation plots are heavily used in time series analysis and forecasting. Visualising using KDEs Summarizing the data with Density plots to see where the mass of the data is located There are two picks in VWAP prices VWAP in 2019 There was many dips in year 2019 like in May June Aug Sept and in end of the Sept month VWAP in 2020 as you can see there is deep in the month of march and april. that variance is finite for all t 3. Statistical correlation summarizes the strength of the relationship between two variables. png A partial autocorrelation is a summary of the relationship between an observation in a time series with observations at prior time steps with the relationships of intervening observations removed. This plot is sometimes called a correlogram or an autocorrelation plot. These are plots that graphically summarize the strength of a relationship with an observation in a time series with observations at prior time steps. A p value below a threshold such as 5 or 1 suggests we reject the null hypothesis stationary otherwise a p value above the threshold suggests we fail to reject the null hypothesis non stationary. t E xᵢ² which also implies of course E xᵢ 𝜇 ² i. Total missing values Percentage of missing values Make a table with the results Rename the columns Sort the table by percentage of missing descending Print some summary information Return the dataframe with missing information removing missing columns Multiplicative Decomposition Additive Decomposition Plot. The first moment of xᵢ is constant i. com rohanrao nifty50 stock market dataI am using Reliance stock prices. It is ranked 8th among the Top 250 Global Energy Companies by Platts as of 2016. The algebraic equivalent is thus a linear function perhaps and not a constant one the value of a linear function changes as 𝒙 grows but the way it changes remains constant it has a constant slope one value that captures that rate of change. The second moment of xᵢ is finite for all t i. We can calculate the correlation for time series observations with observations with previous time steps called lags. It does not have time dependent structure. Null Hypothesis H0 If failed to be rejected it suggests the time series has a unit root meaning it is non stationary. These indirect correlations are a linear function of the correlation of the observation with observations at intervening time steps. ", "id": "yashvi/time-series-analysis-and-forecasting-reliance", "size": "10345", "language": "python", "html_url": "https://www.kaggle.com/code/yashvi/time-series-analysis-and-forecasting-reliance", "git_url": "https://www.kaggle.com/code/yashvi/time-series-analysis-and-forecasting-reliance", "script": "sklearn.metrics missing_values_table adfuller auto_arima parse plotly.graph_objects matplotlib.dates mean_squared_error seaborn numpy plotly.express statsmodels.tsa.stattools seasonal_decompose matplotlib.pyplot dicky_fuller_test pandas statsmodels.tsa.seasonal dateutil.parser mean_absolute_error missingno pmdarima statsmodels.api ", "entities": "(('market capitalization', 'BSE'), 'become') (('com parulpandey', 'pandas https www'), 'start') (('Reliance', '108 countries'), 'continue') (('itself', 'time'), 'mean') (('stock', 'volume'), 'be') (('VWAP Volume Weighted Average 2000 2019 historic Price', 'last 20 years'), 'use') (('don t', 'Upvote'), 'analyze') (('it', 'time dependent structure'), 'be') (('second moment', 't i.'), 'be') (('it', '2009 that'), 'wikipedia') (('that', 'time prior steps'), 'be') (('partial autocorrelation', 'intervening observations'), 'be') (('Reliance', 'natural resources'), 'own') (('Statistical correlation', 'two variables'), 'summarize') (('we', 'null hypothesis'), 'suggest') (('t E which', '² i.'), 'xᵢ²') (('e Dicky Fuller TestThe Augmented Dickey Fuller test', 'statistical test'), 'be') (('rohanrao stock com nifty50 market', 'Reliance stock dataI prices'), 'use') (('Time series forecasting', 'previously observed values'), 'be') (('this', 'previous times'), 'call') (('time series', 'time'), 'be') (('you', 'https towardsdatascience'), 'Note') (('one that', 'change'), 'be') (('We', 'test'), 'interpret') (('it', 'unit root'), 'h1') (('It', 'time dependent structure'), 'have') (('We', 'time previous steps'), 'calculate') (('it', 'electricity'), 'be') (('you', 'march'), 'visualise') (('png IntroductionTime series analysis', 'other data'), 'comprise') (('electricity consumption important that', 'now models'), 'be') (('auto covariance', 'only difference'), 'depend') (('this', 'partial autocorrelation'), 'be') (('company', '2020'), 'rank') (('indirect correlations', 'time steps'), 'be') (('plot', 'lag'), 'call') (('autocorrelation', 'direct correlation'), 'comprise') (('data', 'unit root'), '05') (('one previous day one back 7 days another', 'last metrics'), 'use') (('columns', 'columns Multiplicative Decomposition Additive Decomposition missing Plot'), 'make') (('It', 'India'), 'be') (('Reliance', 'customs'), 'be') (('It', '2016'), 'rank') (('time how strongly series', 'lag multiple different values'), 'be') (('time series', 'null hypothesis'), 'be') (('recently government', 'Indian Oil controlled Corporation'), 'be') (('com time series tutorial Reliance Industries Limited Reliance Industries Limited modern RIL', 'conglomerate Mumbai Maharashtra Indian multinational India'), 'rohanrao') (('t', 'stationary data'), 'show') (('partial autocorrelation', 'intervening observations'), 'png') (('PACF partial plots', 'time series heavily analysis'), 'explain') ", "extra": "['test']"}