{"name": "train sartorius segmentation eda effdet tf ", "full_name": " h2 Cell Instance Segmentation Challenge h1 TABLE OF CONTENTS h3 0 xa0 xa0 xa0 xa0IMPORTS h3 1 xa0 xa0 xa0 xa0BACKGROUND INFORMATION h3 2 xa0 xa0 xa0 xa0SETUP h3 3 xa0 xa0 xa0 xa0HELPER FUNCTIONS h3 4 xa0 xa0 xa0 xa0DATASET CREATION AND EXPLORATION h3 5 xa0 xa0 xa0 xa0MODELLING h1 0 xa0 xa0IMPORTS xa0 xa0 xa0 xa0 h1 1 xa0 xa0BACKGROUND INFORMATION xa0 xa0 xa0 xa0 h3 1 1 BASIC COMPETITION INFORMATION h3 1 2 COMPETITION EVALUATION h3 1 3 DATASET OVERVIEW h1 2 xa0 xa0SETUP xa0 xa0 xa0 xa0 h3 2 1 ACCELERATOR DETECTION h1 The name you gave to the TPU to use h1 or you can also specify the grpc path directly h1 TPU WORKER grpc xxx xxx xxx xxx 8470 h1 The zone you chose when you created the TPU to use on GCP h1 The name of the GCP project where you created the TPU to use on GCP h3 2 2 COMPETITION DATA ACCESS h3 2 3 LEVERAGING XLA OPTIMIZATIONS h3 2 4 BASIC DATA DEFINITIONS INITIALIZATIONS h1 n 3 xa0 xa0HELPER FUNCTION CLASSES xa0 xa0 xa0 xa0 n h1 n 4 xa0 xa0DATASET CREATION AND EXPLORATION xa0 xa0 xa0 xa0 n h3 4 0 UPDATE THE TRAIN DATAFRAME h3 4 1 VISUALIZE THE TRAIN DATA h3 4 2 INVESTIGATE THE TRAIN DATAFRAME h3 4 3 VISUALIZE INVESTIGATE THE LIVECell DATA h3 4 4 VISUALIZE INVESTIGATE THE SEMI SUPERVISED TRAIN DATA h3 4 5 VISUALIZE INVESTIGATE INDIVIDUAL CELLS h3 4 6 ADD BBOXES TO DATAFRAME h3 4 7 STATS REGARDING BOUNDING BOXES h1 n 5 xa0 xa0MODELLING xa0 xa0 xa0 xa0 n h3 5 0 EFFICIENTDET UTILITY FUNCTIONS CONSTANTS h3 5 1 LOAD EFFICIENTDET MODEL AND INITIALIZE h3 5 2 CREATE A DATASET WITH THE CORRECT STRUCTURE h3 5 3 INSTANIATE OUR DATALOADER h3 5 4 CREATE MODEL AND LOAD PRETRAINED WEIGHTS h3 5 5 TRAIN THE MODEL h3 5 6 VALIDATE THE MODEL IS LEARNING h3 5 7 IOU ON VALIDATION DATASET h3 5 8 CONFUSION MATRIX FOR VALIDATION DATASET h1 n 5 xa0 xa0SUBMISSION xa0 xa0 xa0 xa0 n ", "stargazers_count": 0, "forks_count": 0, "description": "4 BASIC DATA DEFINITIONS INITIALIZATIONS 3 nbsp nbsp HELPER FUNCTION CLASSES nbsp nbsp nbsp nbsp 10514 4 nbsp nbsp DATASET CREATION AND EXPLORATION nbsp nbsp nbsp nbsp 10514 4. 5 a predicted object is considered a hit if its intersection over union with a ground truth object is greater than 0. com namgalielei which reshape is used in rle4. Submission files may take several minutes to process due to the size. com inversion run length decoding quick start Split the string by space then convert it into a integer array Every even value is the start every odd value is the run length The image image is actually flattened since RLE is a 1D run The color here is actually just any integer you want Don t forget to change the image back to the original shape https www. 3 DATASET OVERVIEW GENERAL INFORMATIONIn this competition we are segmenting neuronal cells in images. nbsp REFERENCES Guide Use TPUs Doc TPUClusterResolver2. IS THIS A CODE COMPETITION YES1. nbsp TIPS If you have multiple datasets attached to the notebook you should pass the name of a specific dataset to the get_gcs_path function. Please see a previous version of this notebook Version 33 https www. If successful you ll help further research in neurobiology thanks to the collection of robust quantitative data. They empower scientists and engineers to simplify and accelerate progress in life science and bioprocessing enabling the development of new and better therapies and more affordable medicine. In our case the name of the dataset is the name of the directory the dataset is mounted within. The pixels are one indexedand numbered from top to bottom then left to right 1 is pixel 1 1 2 is pixel 2 1 etc. xxx 8470 The zone you chose when you created the TPU to use on GCP. 2 COMPETITION DATA ACCESS TPUs read data must be read directly from G oogle C loud S torage GCS. tbd wrap in fn GT Bounding Boxes Confidence Scores Segmentation Mask PRED Bounding Boxes Confidence Scores Instance Classes Segmentation Mask. In this competition you ll detect and delineate distinct objects of interest in biological images depicting neuronal cell types commonly used in the study of neurological disorders. 5 TRAIN THE MODEL Since I trained the model in a previous version I will be loading the trained model from that previously trained checkpoint. white black Aggregate under training Capture Image Path As Well Takes about 1 minute CORT ASTRO SHSY5Y Plot Background 3 Cell Types Background Foreground Cells Whether or not we train from scratch or load Change how input preprocessing is done BytesList won t unpack a string from an EagerTensor. com dschettler8845 train sartorius segmentation eda effdet tf scriptVersionId 78096161 to see the training run. It also checks that no two predicted masks for the same image are overlapping. com namgalielei which reshape is used in rle Reshape from top bottom first ref. Therefore for efficient utilization of Cloud TPU a program should make use of each of the EIGHT 4x2 cores. com stainsby fast tested rle https github. Each TensorFlow operation has a precompiled GPU TPU kernel implementation that the executor dispatches to. Kaggle provides a utility library KaggleDatasets which has a utility function. Because these kernels are unique to the model they can exploit model specific information for optimization. 3 INSTANIATE OUR DATALOADER Augmentations are breaking the masks. function calls FIX THE TRAIN DATAFRAME GROUP THE RLEs TOGETHER Capture Image Path As Well This is required for plotting so that the smaller distributions get plotted on top ref https www. 95 In other words at a threshold of 0. com paulorzp run length encode and decode modified from https www. Current solutions have limited accuracy for neuronal cells in particular. A false positive indicates a predicted object had no associated ground truth object. py if the length the contours tuple returned by cv2. In internal studies to develop cell instance segmentation models the neuroblastoma cell line SH SY5Y consistently exhibits the lowest precision scores out of eight different cancer cell types tested. However on G oogle C ompute E ngine GCE you will need to do the following python The name you gave to the TPU to useTPU_WORKER my tpu name or you can also specify the grpc path directly TPU_WORKER grpc xxx. More specifically you ll use phase contrast microscopy images to train and test your model for instance segmentation of neuronal cells. As a result new drugs could be discovered to treat the millions of people with these leading causes of death and disability. 2 INVESTIGATE THE TRAIN DATAFRAME 4. findContours return signature yet again and I have no idea WTH is going on return the actual contours array Get contour s There should be only one Get extreme coordinates Early Exit Else Return images Flip black white. get_gcs_path that will allow us to access the location of our input datasets within GCS. Each replica is essentially a copy of the training graph that is run on each core and trains a mini batch containing 1 8th of the overall batch size Google Cloud Dataset path to training and validation images Local path to training and validation images enable XLA optmizations 10 speedup when using tf. They re a magnet and dynamic platform for pioneers and leading experts in the field. They bring creative minds together for a common goal technological breakthroughs that lead to better health for more people. InvalidArgumentError exception is thrown nbsp REFERENCE XLA Optimizing Compiler for Machine Learning2. LIVECell is the predecessor dataset to this competition. The training annotations are provided as run length encoded masks and the images are in PNG format. Unfortunately segmenting individual neuronal cells in microscopic images can be challenging and time intensive. Instead of submitting an exhaustive list of indices for your segmentation you will submit pairs of values that contain a start position and a run length. Researchers may be able to use this to more easily measure the effects of disease and treatment conditions on neuronal cells. id unique identifier for object annotation run length encoded pixels for the identified neuronal cell width source image width height source image height cell_type the cell line plate_time time plate was created sample_date date sample was created sample_id sample identifier elapsed_timedelta time since first image taken of sample sample_submission. 0 EFFICIENTDET UTILITY FUNCTIONS CONSTANTS 5. either the entire function is compiled with XLA or an errors. PROJECT my tpu project tpu tf. 4 v4 beta or v4 official if the length of the contours tuple is 3 then we are using either OpenCV v3 v4 pre or v4 alpha otherwise OpenCV has changed their cv2. Create a Features message using tf. train_semi_supervised unlabeled images offered in case you want to use additional data for a semi supervised approach. TABLE OF CONTENTS 0 nbsp nbsp nbsp nbsp IMPORTS 1 nbsp nbsp nbsp nbsp BACKGROUND INFORMATION 2 nbsp nbsp nbsp nbsp SETUP 3 nbsp nbsp nbsp nbsp HELPER FUNCTIONS 4 nbsp nbsp nbsp nbsp DATASET CREATION AND EXPLORATION 5 nbsp nbsp nbsp nbsp MODELLING 0 nbsp nbsp IMPORTS nbsp nbsp nbsp nbsp 10514 1 nbsp nbsp BACKGROUND INFORMATION nbsp nbsp nbsp nbsp 10514 1. Sartorius is a partner of the life science research and the biopharmaceutical industry. However it is hard to quantify how well these deadly disorders respond to treatment. This could be because neuronal cells have a very unique irregular and concave morphology associated with them making them challenging to segment with commonly used mask heads. Create a dictionary mapping the feature name to the tf. ImageId EncodedPixels 0114f484a16c152baa2d82fdd43740880a762c93f436c8988ac461c5c9dbe7d5 1 1 0999dab07b11bc85fb8464fc36c947fbd8b5d6ec49817361cb780659ca805eac 1 1 0999dab07b11bc85fb8464fc36c947fbd8b5d6ec49817361cb780659ca805eac 2 3 8 9 etc. so disablled for now5. 2 CREATE A DATASET WITH THE CORRECT STRUCTURE INPUT Raw Image 256x256x3 OUTPUT TARGET Bounding Boxes Instance Classes Segmented Image 64x64x3 We first create the tfrecord datasets. This can be found on the GCP project dashboard page. Cell Instance Segmentation ChallengeCREATED BY DARIEN SCHETTLER nbsp WARNING THIS IS A WORK IN PROGRESS nbsp IF YOU FORK THIS OR FIND THIS HELPFUL nbsp PLEASE UPVOTE This was a lot of work for me and while it may seem silly it makes me feel appreciated when others like my work. 1 ACCELERATOR DETECTION In order to use TPU we use TPUClusterResolver for the initialization which is necessary to connect to the remote cluster and initialize cloud TPUs. No parameters necessary if TPU_NAME environment variable is set. When using TPU on Kaggle you don t need to specify arguments for TPUClusterResolver 2. 2 nbsp nbsp SETUP nbsp nbsp nbsp nbsp 10514 2. 7 IOU ON VALIDATION DATASET 5. 8 CONFUSION MATRIX FOR VALIDATION DATASET TRAINING DATA FIRST BATCH VALIDATION DATA FIRST BATCH 5 nbsp nbsp SUBMISSION nbsp nbsp nbsp nbsp 10514 WIP Try to skip and disable so we can submit w o internet pip install q upgrade tensorflow_datasets pip install q neural structured learning Machine Learning and Data Science Imports Built In Imports Visualization Imports SET LIBRARY DIRECTORY To give access to automl files EfficientDET Module Imports Detect hardware return appropriate distribution strategy TPU detection. csv IDs and masks for all training objects. The hidden test set is roughly 240 images. nbsp WARNING XLA can not currently compile functions where dimensions are not inferrable that is if it s not possible to infer the dimensions of all tensors without running the entire computation nbsp NOTE XLA compilation is only applied to code that is compiled into a graph in TF2 that s only a code inside tf. 1 LOAD EFFICIENTDET MODEL AND INITIALIZE 5. Successful models will do this with a high level of accuracy. csv a sample submission file in the correct format train train images in PNG format test test images in PNG format. 95 with a step size of 0. Let s go over two important points1. The results are improvements in speed and memory usage. 5 VISUALIZE INVESTIGATE INDIVIDUAL CELLS Let s review a single image and then look into the cells that make up that image4. 3 LEVERAGING XLA OPTIMIZATIONS XLA Accelerated Linear Algebra is a domain specific compiler for linear algebra that can accelerate TensorFlow models with potentially no source code changes. Make dataframe iterable Create folder Create tfrecords This makes the tfrecord TRAIN VAL VAL Compute intersection between all objects Compute areas needed for finding the union between all objects Compute union exclude background Correct objects Missed objects Extra objects We want. 6 ADD BBOXES TO DATAFRAME Let s iterate over the images and add the bounding box coordinates to the dataframe in order matching the RLE We also add the 0 1 normalized version of the bboxes to the dataframe for later training purposes4. 4 VISUALIZE INVESTIGATE THE SEMI SUPERVISED TRAIN DATA Let s review the semi supervised training data4. For example 1 3 10 5 implies pixels 1 2 3 10 11 12 13 14 are to be included in the mask. The average precision of a single image is then calculated as the mean of the above precision values at each IoU threshold frac 1 thresholds sum_t frac TP t TP t FP t FN t Lastly the score returned by the competition metric is the mean taken over the individual average precisions of each image in the test dataset. One accepted method is to review neuronal cells via light microscopy which is both accessible and non invasive. 7 STATS REGARDING BOUNDING BOXES 5 nbsp nbsp MODELLING nbsp nbsp nbsp nbsp 10514 EfficientDET for Object Detection Classification and Segmentation5. 1 3 implies starting at pixel 1 and running a total of 3 pixels 1 2 3. SUBMISSION FILE INFORMATIONIn order to reduce the submission file size our metric uses run length encoding RLE on the pixel values. On Kaggle this is always the case. The IoU of a proposed set of object pixels and a set of true object pixels is calculated as IoU A B frac A cap B A cup B The metric sweeps over a range of IoU thresholds at each point calculating an average precision value. 5At each threshold value 𝑡 a precision value is calculated based on the number of true positives 𝑇𝑃 false negatives 𝐹𝑁 and false positives 𝐹𝑃 resulting from comparing the predicted object to all ground truth objects frac TP t TP t FP t FN t A true positive is counted when a single predicted object matches a ground truth object with an IoU above the threshold. 6 VALIDATE THE MODEL IS LEARNING 5. XLA provides us with an alternative mode of running models it compiles the TensorFlow graph into a sequence of computation kernels generated specifically for the given model. What Is a Replica A single Cloud TPU device consists of FOUR chips each of which has TWO TPU cores. 0 UPDATE THE TRAIN DATAFRAME We need to change a few things with the train dataframe Aggregate under id Add in certain columns4. com PyImageSearch imutils blob master imutils convenience. The jit_compile API has must compile semantics i. The metric checks that the pairs are sorted positive and the decoded pixel values are not duplicated. None of this metadata is provided for the test set. then we instantiate a dataloader 5. LIVECell_dataset_2021 A mirror of the data from the LIVECell dataset. 4 CREATE MODEL AND LOAD PRETRAINED WEIGHTS COCO weights5. When a TensorFlow program is run all of the operations are executed individually by the TensorFlow executor. Accurate instance segmentation of these cells with the help of computer vision could lead to new and effective drug discoveries to treat the millions of people with these disorders. 3 VISUALIZE INVESTIGATE THE LIVECell DATA Let s review the LIVECell dataset4. Only a few test set images are available for download the remainder can only be accessed by your notebooks when you submit. ZONE us east1 b The name of the GCP project where you created the TPU to use on GCP. You will find extra data for the SH SHY5Y cell line plus several other cell lines not covered in the competition dataset that may be of interest for transfer learning. Each row in your submission represents a single predicted nucleus segmentation for the given ImageId. 1 BASIC COMPETITION INFORMATION PRIMARY TASK DESCRIPTIONThis is a placeholder copy paste from the OVERVIEW DESCRIPTION page of the Kaggle competitionNeurological disorders including neurodegenerative diseases such as Alzheimer s and brain tumors are a leading cause of death and disability across the globe. 2 COMPETITION EVALUATION GENERAL EVALUATION INFORMATIONThis competition is evaluated on the mean average precision at different intersection over union 𝐼𝑜𝑈 thresholds. The competition format requires a space delimited list of pairs. The number of images is small but the number of annotated objects is quite high. findContours is 2 then we are using either OpenCV v2. Example compatible data type. Yield the default distribution strategy in Tensorflow Works on CPU and single GPU. A false negative indicates a ground truth object had no associated predicted object. 1 VISUALIZE THE TRAIN DATA Let s create a function to take a single example row of the dataframe and plot the resulting informationQUICK DOUBLECHECK ON RLE DECODE FUNCTION https www. The file should contain a header and have the following format. TPUClusterResolver tpu TPU_WORKER zone ZONE project PROJECT nbsp WARNING Although the Tensorflow documentation says it is the project name that should be provided for the argument project it is actually the Project ID that you should provide. The threshold values range from 0. ", "id": "dschettler8845/train-sartorius-segmentation-eda-effdet-tf", "size": "25650", "language": "python", "html_url": "https://www.kaggle.com/code/dschettler8845/train-sartorius-segmentation-eda-effdet-tf", "git_url": "https://www.kaggle.com/code/dschettler8845/train-sartorius-segmentation-eda-effdet-tf", "script": "glob label_util postprocess visualize_image rle_encode plot_img_and_mask ImageEnhance plot_diff train_lib flatten_l_o_l get_contour_bbox serialize_raw vis_utils pd_get_bboxes GroupKFold; plot_pred pandarallel; pandarallel.initialize(); plotly.graph_objects matplotlib.patches tf2 util_keras collections seaborn numpy efficientdet _bytes_feature dataloader grab_contours PolynomialFeatures _int64_feature PIL tf2.train plotly.express write_tfrecords seed_it_all sklearn.model_selection setup_model plot_gt rle_decode tensorflow_addons serialize_test_raw Image matplotlib.pyplot efficientdet_keras create_id_to_iloc_map tqdm.notebook tensorflow iou_map pandas kaggle_datasets load_npz get_pred_instance_mask anchors matplotlib.colors inference Counter RobustScaler compute_iou image_preprocess rle_decode_top_to_bot_first load_json_to_dict get_img_and_mask pandarallel visualize get_bbox_stats KaggleDatasets sklearn.preprocessing ListedColormap tqdm; tqdm.pandas(); tf_load_png _float_feature precision_at tf_load_image datetime ", "entities": "(('InvalidArgumentError exception', 'nbsp REFERENCE XLA Optimizing Machine Learning2'), 'throw') (('file', 'following format'), 'contain') (('that', 'image4'), 'let') (('row', 'given ImageId'), 'represent') (('com paulorzp', 'https www'), 'run') (('Lastly score', 'test dataset'), 'calculate') (('which', 'cloud TPUs'), 'DETECTION') (('We', 'tfrecord first datasets'), 'create') (('1 2 3 10 14', 'mask'), 'imply') (('They', 'new therapies'), 'empower') (('you', 'grpc also path'), 'need') (('nbsp REFERENCES Guide', 'TPUs Doc TPUClusterResolver2'), 'Use') (('LIVECell', 'competition'), 'be') (('you', 'robust quantitative data'), 'help') (('then we', 'OpenCV v2'), 'use') (('d', 'certain columns4'), 'update') (('Successful models', 'accuracy'), 'do') (('Missed Extra We', 'background Correct objects'), 'make') (('you', 'semi supervised approach'), 'image') (('executor', 'that'), 'have') (('v4 otherwise OpenCV', 'cv2'), 'beta') (('metric uses', 'pixel values'), 'FILE') (('when you', 'GCP'), 'xxx') (('when you', 'only notebooks'), 'be') (('all', 'TensorFlow individually executor'), 'execute') (('predicted object', 'ground truth associated object'), 'indicate') (('Unfortunately segmenting', 'microscopic images'), 'challenge') (('that', 'only tf'), 'compile') (('Researchers', 'treatment neuronal cells'), 'be') (('VISUALIZE LIVECell 3 s', 'LIVECell dataset4'), 'INVESTIGATE') (('number', 'annotated objects'), 'be') (('us', 'GCS'), 'get_gcs_path') (('data', 'S torage directly G oogle C loud GCS'), 'read') (('one indexedand', 'then right 1'), 'be') (('dataset', 'directory'), 'be') (('semi', 'data4'), 'INVESTIGATE') (('I', 'previously trained checkpoint'), 'train') (('sample_date date sample', 'sample sample_submission'), 'd') (('which', 'utility function'), 'provide') (('you', 'get_gcs_path function'), 'TIPS') (('where you', 'GCP'), 'b') (('you', 'TPUClusterResolver'), 'need') (('Don t', 'shape https back original www'), 'run') (('competition', 'union 𝐼𝑜𝑈 thresholds'), 'EVALUATION') (('ground truth', 'threshold'), '𝑡') (('masks', 'same image'), 'check') (('entire function', 'XLA'), 'compile') (('them', 'mask commonly used heads'), 'be') (('instance Accurate segmentation', 'disorders'), 'lead') (('Current solutions', 'neuronal cells'), 'have') (('copy placeholder paste', 'globe'), 'be') (('Sartorius', 'life science research'), 'be') (('you', 'neurological disorders'), 'detect') (('More specifically you', 'neuronal cells'), 'use') (('Module Imports Detect hardware', 'distribution strategy TPU appropriate detection'), 'TRAINING') (('This', 'GCP project dashboard page'), 'find') (('WTH', 'contour Exit Else Return only one Get extreme Early Flip black white'), 'signature') (('which', 'light microscopy'), 'be') (('that', 'start position'), 'submit') (('They', 'leading field'), 're') (('competition we', 'images'), 'OVERVIEW') (('3', '3 pixels'), 'implie') (('Submission files', 'size'), 'take') (('DATALOADER Augmentations', 'masks'), '3') (('IoU A B cap B A cup metric sweeps', 'precision average value'), 'calculate') (('results', 'speed usage'), 'be') (('they', 'optimization'), 'be') (('smaller distributions', 'ref https top www'), 'call') (('that', 'source code potentially changes'), 'be') (('We', 'later purposes4'), 'bboxe') (('that', 'transfer learning'), 'find') (('each', 'TPU TWO cores'), 'consist') (('you', 'Project actually that'), 'WARNING') (('that', '10 speedup when tf'), 'be') (('that', 'more people'), 'bring') (('com reshape', 'top bottom first ref'), 'namgalielei') (('com reshape', 'rle4'), 'namgalielei') (('None', 'test set'), 'provide') (('SY5Y', 'cancer cell eight different types'), 'model') (('competition format', 'pairs'), 'require') (('me', 'work'), 'ChallengeCREATED') (('jit_compile API', 'semantics i.'), 'compile') (('images', 'PNG format'), 'provide') (('it', 'specifically given model'), 'provide') (('ground truth object', 'associated predicted object'), 'indicate') (('new drugs', 'death'), 'discover') (('intersection', '0'), 'consider') (('how well deadly disorders', 'treatment'), 'be') (('s', 'RLE DECODE FUNCTION https www'), 'VISUALIZE') (('BytesList', 'EagerTensor'), 'Aggregate') (('tuple', 'cv2'), 'py') ", "extra": "['annotation', 'disease', 'test']"}