{"name": "transfer learning with pytorch ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "format best_acc load best model weights model. Got same error but in another part of a code. load_state_dict best_model_wts found it on internet. Any results you write to the current directory are saved as output. state_dict print Best val Acc 4f. not sure if it helps. state_dict best_acc 0. Training the model Disclaimer most of following code was gathered from all over the internet. com andrewjong 6b02ff237533b3b2c554701fb53d5c4d override the __getitem__ method. I need path to use it in the tool I developed to analyse output of the network https gist. Load the dataset file names Extract the actual file names and labels as entries Split the data into two sets test_size 200 Create folders for new data Copying the splits into their folders I need this small tweek to ImageFolder class to be able to get paths to images. this is the method dataloader calls this is what ImageFolder normally returns the image file path make a new tuple that includes original and the path Data augmentation and normalization for training Just normalization for validation Different visualization for train and test Data Line bars Train set Validation set pause a bit so that plots are updated Get a batch of training data Make a grid from batch best_model_wts copy. 0 Each epoch has a training and validation phase Set model to training mode Set model to evaluate mode Iterate over data. Let s first split dataset into train and val foldersAll images are 150 150 pxls but we need to resize them to 224 to use pretrained network. zero the parameter gradients forward track history if only in train backward optimize only if in training phase statistics deep copy the model if phase val and epoch_acc best_acc best_acc epoch_acc best_model_wts copy. enabled False Observe that all parameters are being optimized Decay LR by a factor of 0. ", "id": "dickensons/transfer-learning-with-pytorch", "size": "177", "language": "python", "html_url": "https://www.kaggle.com/code/dickensons/transfer-learning-with-pytorch", "git_url": "https://www.kaggle.com/code/dickensons/transfer-learning-with-pytorch", "script": "torch.optim makedirs isdir train_model listdir torch.nn exists numpy models __getitem__ os.path torchvision sklearn.model_selection join countSamples lr_scheduler isfile torchvision.datasets matplotlib.pyplot os expanduser pandas imshow transforms remove getcwd abspath datasets ImageFolderWithPaths(datasets.ImageFolder) train_test_split ", "entities": "(('parameters', '0'), 'enable') (('I', 'images'), 'load') (('I', 'network https gist'), 'need') (('you', 'output'), 'save') (('best_acc epoch_acc best_model_wts', 'val'), 'gradient') (('150 150 we', 'pretrained network'), 'let') (('most', 'all internet'), 'gather') (('batch', 'batch best_model_wts copy'), 'be') (('load_state_dict best_model_wts', 'internet'), 'find') (('epoch', 'data'), '0') ", "extra": "['test']"}