{"name": "unsupervised view towards relative grading system ", "full_name": " h1 Objective h3 I Absolute Grading System h3 II Relative Grading system h3 III Applying ML based clustering for sound grading h3 IV Removing the outliers using DBSCAN h3 The Dataset h1 Data Preprocessing h1 Removing the outliers h3 Eps and minimum sample is selected by intelligent guess to optimise outlier predictions h1 Performing K means clustering on the sample h1 Generating optimum number of grades h3 This shows that a cluster of 3 or 4 better represents our distribution ", "stargazers_count": 0, "forks_count": 0, "description": "Imagine a distribution of 3 3 4 9 9 10 we can easily segregate the bunch into 4 5 grades but to a human eye it makes more sense to assign 2 grades instead of 4. Here we follow following steps 1. Removing the outliers using DBSCANDBSCAN or Density based spatial clustering of applications with noise is an excellent algorithm when we need to detect the outlier in a spatial data. Absolute Grading SystemThis is one of the most common form of grading where the criteria for grading is set before students is yet to start writing the paper. Cons Considering that the marks are assinged by merit this method does not guarantees that the grades would be assigned on the basis of students merit. com max 832 1 8wV1j klQA1xFvfaNXuVzg. You can reach me at https www. One example could be 1. com K Means algorithm exactly matches with this problem statement. Pros This sets a standard for excellence and failing and is good for the courses with predefined difficulty of the examination. Assign top 10 students A2. jpg Image above is a rough representation of a linear data seperated into different clusters. Recommended Number of grades It might happen that it will make more sense to assign a lower number of grades to class than maximum. Assign the next 20 students B3. We observe outliers at the lower end of the spectrum Data Preprocessing Removing the outliers Eps and minimum sample is selected by intelligent guess to optimise outlier predictions Performing K means clustering on the sample Generating optimum number of gradesWhile we modelled the data using user specified grades the question remains whether we can detect if the distribution is explained better by lower or higher number of grades. Cons This reduces the flexibility of the examination grately. We will increase the number of clusters only when it results in significant decline in the J value compared to previous k values. com vi fGkGRoiBtKg hqdefault. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. The value representing the most significant bent is considered as the best fit for clustering The plot would look something like this Image https miro. It already depicts the loop holes in the approaches that models it as normal distributions. These two values are hyperparameters to DBSCAN. Assign the remaining 30 D This method brings in compeitition among students. The intution here is that as we increase the number of clusters J cost function which naturally reduce and become 0 for number of clusters number of datapoints. com rDYuyg00Z0w WXA OQpkAfI AAAAAAAAI_I QshfNVNHD_wXJwXEipRIVzDSX5iOEAy2wCEwYBhgL s1600 DBSCAN_Points. Assign marks 90 A2. Here is how it works 1. The data has does not have normal distribution and is negatively skewed. We take centroid of newly formed clusters4. This shows that a cluster of 3 or 4 better represents our distributionFeel free to share your views in the discussions for critical constructive reviews and improvements. Assign the next 40 students C4. Now we can start forming the problem statement For a student to feel that the grades are fair other students having the same grade should have their marks as close as possible to the student. We group each data point to the closest chosen centroid3. PNG If a data point doesn t have minimum number of samples within set threshold it will be considered as an outlier. Run the algorithms for different values of k2. Inertial represents the total sum of squared distances to the respective cluster point while distortion represeents the average the average of the squared distances. According this system the grade vs marks distribution is decided by the the collective performance for a particular batch. A value of minimum sample 4 and a distance threshold 4 is found to be working in most cases however you can tune it as per your need. If we assign top 20 of the students a grade of A this wouldn t be fair to the 8th student since it s more logical for 6 to fall into a grade with 4s and 5s than with 10. Pros Difficulty of the paper no longer plays a role in the grade assignment. Now the examiners are compiled to set predefined level of difficulty which in it s nature is a subjective concept. We select the number of clusters k number of grades we want to allot 2. Hence the problem becomes a minimization problem of inter cluster distances. For each k calculate the total loss3. png img source kdnuggets The DatasetThe dataset consist of the classroom marks of a specific subjects. If we consider BiDirectional space DBSCAN groups together points based on distances usually euclidean distances and a minimum density number of points in this circle or hypersphere for multi dimiensional data. A slight difficult question could result in unfair grades of the batch. How does our model handles these values To tackle this issue we use elbow method to figure out the sutiable numer of clusters for a distribution. Assign the next 70 B3. ObjectiveThe purpose of this kernel is to propose a machine learing based approach for grading students in any course. Relative Grading systemThis is commonly adopted in universities. com images Clustering_kmeans_c. com in jay dhanwant Thanks a lot and have a better day than me This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. read_csv Input data files are available in the read only. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session Input the value of grades here Building and fitting the model. We chose the number of clusters from where the loss starts decreasing in a linear fashion. Applying ML based clustering for sound gradingLets consider a distribution 1 1 2 2 3 4 5 5 6 10. Our objective is to model the data into sensible cluster for generating grades. png img source https www. It classifies the points in density regions below a specific thresholds as noise. We can use the elbow method on distortion as well as the inertial. Assign the next 30 C II. Here is a depiction Image https 3. Let s first look at the current techniques that s being used by universites to grade students. Plot total loss against the number of clusters 4. We repeat 2 and 3 until the change in cluster points reduces below desired errors IV. While this is better or not is a topic of another discussion but this method certainly grades few students low regardless their absolute marks. For each set of marks we effectively want to minimize this cost function Image https www. ", "id": "jaydhanwant/unsupervised-view-towards-relative-grading-system", "size": "6510", "language": "python", "html_url": "https://www.kaggle.com/code/jaydhanwant/unsupervised-view-towards-relative-grading-system", "git_url": "https://www.kaggle.com/code/jaydhanwant/unsupervised-view-towards-relative-grading-system", "script": "DBSCAN conv100 sklearn metrics seaborn numpy matplotlib.pyplot sklearn.cluster sklearn.preprocessing KMeans pandas cdist scipy.spatial.distance MinMaxScaler ", "entities": "(('ObjectiveThe purpose', 'course'), 'be') (('We', 'distortion'), 'use') (('It', 'kaggle python Docker image https github'), 'com') (('excellent when we', 'spatial data'), 'be') (('value', 'Image https miro'), 'consider') (('method', 'students'), 'Assign') (('png img source', 'specific subjects'), 'kdnugget') (('we', 'multi dimiensional data'), 'consider') (('method', 'low regardless absolute marks'), 'be') (('cluster', 'critical constructive reviews'), 'show') (('we', 'k grades'), 'select') (('it', 'outlier'), 'PNG') (('which', 'it'), 'compile') (('grade', 'particular batch'), 'decide') (('we', 'cost function Image https effectively www'), 'want') (('students', 'yet paper'), 'be') (('grades', 'students merit'), 'con') (('it', 'maximum'), 'number') (('where loss', 'linear fashion'), 'choose') (('more 6', '10'), 'be') (('which', 'datapoints'), 'be') (('that', 'grade students'), 'let') (('distribution', 'grades'), 'observe') (('Pros This', 'examination'), 'set') (('that', 'normal distributions'), 'depict') (('only when it', 'k previous values'), 'increase') (('2 change', 'errors below desired IV'), 'repeat') (('jpg Image', 'different clusters'), 'be') (('We', 'closest chosen centroid3'), 'group') (('Relative Grading systemThis', 'commonly universities'), 'adopt') (('Hence problem', 'minimization inter cluster distances'), 'become') (('data', 'normal distribution'), 'have') (('We', 'newly formed clusters4'), 'take') (('Pros Difficulty', 'grade assignment'), 'play') (('read_csv Input data files', 'read'), 'be') (('t', 'here model'), 'list') (('objective', 'grades'), 'be') (('Applying', 'distribution'), 'consider') (('it', 'instead 4'), 'segregate') (('It', 'noise'), 'classify') (('slight difficult question', 'batch'), 'result') (('we', 'distribution'), 'handle') (('two values', 'DBSCAN'), 'be') (('grades', 'as close possible student'), 'start') (('This', 'examination'), 'con') (('distortion', 'squared distances'), 'represent') (('however you', 'need'), 'find') (('K Means', 'problem statement'), 'com') ", "extra": "[]"}