{"name": "visual in depth eda siim covid19 detection ", "full_name": " h1 Visual In Depth EDA SIIM COVID19 Detection h2 Exploratory Data Analysis EDA h2 TABLE OF CONTENTS h2 0 xa0 xa0 xa0 xa0IMPORTS h2 1 xa0 xa0 xa0 xa0BACKGROUND INFORMATION h2 2 xa0 xa0 xa0 xa0SETUP h2 3 xa0 xa0 xa0 xa0HELPER FUNCTIONS h2 4 xa0 xa0 xa0 xa0TABULAR DATA h2 5 xa0 xa0 xa0 xa0IMAGE DATA h2 6 xa0 xa0 xa0 xa0IDENTIFY DUPLICATES h1 0 xa0 xa0IMPORTS h1 1 xa0 xa0BACKGROUND INFORMATION h2 1 1 THE DATA h2 1 2 THE GOAL h2 1 3 ADDITIONAL INFORMATION ON ABNORMALITIES h1 2 xa0 xa0NOTEBOOK SETUP h1 3 xa0 xa0HELPER FUNCTIONS h1 4 xa0 xa0TABULAR DATA h2 4 1 IMAGE ID COLUMN EXPLORATION h2 4 2 HUMAN LABEL COLUMN EXPLORATION h2 4 3 EXPLORATION OF BBOX COORDINATE COLUMNS h1 5 xa0 xa0IMAGE DATA h2 5 1 CLASS TO HELP PARSE THE DATA h2 5 2 VISUALIZE EACH TYPE OF BBOX ", "stargazers_count": 0, "forks_count": 0, "description": "pal ann class_id label int_2_str ann class_id opacity 0. Example Radiographs https i. Review of chest radiograph findings of COVID 19 pneumonia and suggested reporting language. subplot n 2 2 i 1 plt. csv id unique study identifier Negative for Pneumonia 1 if the study is negative for pneumonia 0 otherwise Typical Appearance 1 if the study has this appearance 0 otherwise Indeterminate Appearance 1 if the study has this appearance 0 otherwise Atypical Appearance 1 if the study has this appearance 0 otherwise train_image_level. to_numpy image_ids tmp_numpy 0 class_ids tmp_numpy 1 rad_ids tmp_numpy 2 bboxes tmp_numpy 3 self. Annotators did have access to the COVID status for each patient but were asked to adhere to the grading system above irrespective of the status. The goal in this challenge is to determine the appropriate category for each radiograph as well as localize the lung opacities with a bounding box prediction. iloc index annotations image_id for image_id in tmp_df. 2 HUMAN LABEL COLUMN EXPLORATION The human_label column indicates the label as a string for the respective object annotation each row is for one object annotation. For a given patient image we also know that all the detections are the same label. get_annotated_image IMAGE_ID annots None plot True plot_size 18 22 plot_title f ORIGINAL xa0IMG i 1 gt_data. collect def get_annotations self get_all False image_ids None class_ids None rad_ids None index None TBD Args get_all bool optional TBD image_ids list of strs optional TBD class_ids list of ints optional TBD rad_ids list of strs optional TBD index int optional Returns if not get_all and image_ids is None and class_ids is None and rad_ids is None and index is None raise ValueError Expected one of the following arguments to be passed n t t get_all image_id class_id rad_id or index tmp_df self. png DATASET INFORMATIONThe train dataset comprises 6 334 chest scans in DICOM format which were de identified to protect patient privacy. 1 IMAGE_ID COLUMN EXPLORATION The id column contains a U nique ID entifier UID that indicates which deidentified patient the respective row object relates to. If you predict that there are no findings you should create a prediction of none 1 0 0 1 1 none is the class ID for no finding and this provides a one pixel bounding box with a confidence of 1. array c 255 255 255 for c in sns. No bounding boxes were placed for the negative for pneumonia category. The images are in DICOM format which means they contain additional data that might be useful for visualizing and classifying. From the bar chart plotted below we can ascertain the following information 5 nbsp nbsp IMAGE DATARecall that the image data is stored in DICOM format and the annotations are stored in our train_df Dataframe. To identify the distribution of counts across the labels we will use a bar chart. As there can be up multiple objects within a single radiograph the id column can contain duplicates. copy if not get_all if image_ids is not None tmp_df tmp_df tmp_df. get_annotations rad_ids rad_id_list annotated_imgs plt. The study ID here relates directly to the study level predictions the image ID is the ID used for image level predictionsThe test dataset is of roughly the same scale as the training dataset. 1. More detail to come later6 nbsp nbsp IDENTIFY DUPLICATESFind duplicate images using perceptual hash. items if i n break if verbose print f. More detail to come later5. WHAT PERCENTAGE OF IMAGES HAVE BOUNDING BOXESPLOT HEATMAP REPRESENTING BOUNDING BOXES FOR VARIOUS CLASSESThere s a lot to digest within these plots. As such some patients who were COVID negative still had chest radiographs with typical appearances. 1 CLASS TO HELP PARSE THE DATA Classes are very useful when we need to bind data to functionality. ANNOTATIONS PER CLASSWe know there are 4 different possible human_label s. Typical Appearance Multifocal bilateral peripheral opacities with rounded morphology lower lung predominant distribution2. pop 2 tmp_numpy self. As this is a kernels only competition we shsould plan accordingly i. title f Image ID image_id plt. Atypical Appearance Pneumothorax pleural effusion pulmonary edema lobar consolidation solitary lung nodule or mass diffuse tiny nodules cavity4. figure figsize 20 height_multiplier n for i image_id annots in enumerate annotations. The P R curve and AP calculations remain the same. In this case I have created a class unwieldy as it may be currently in it s initial version to help with that called TrainData. and for today I will simply generate the outputs using each method to show their functionality. atypical 1 0 0 1 1 MESSAGE FROM THE COMPETITION HOST ON LABEL AND BBOX DETAILS In this challenge the chest radiographs CXRs were categorized using a specific grading schema based on a published paper Litmanovich DE Chung M Kirkbride RR Kicska G Kanne JP. Let s visualize what this looks like by the numbers. tight_layout rect 0 0. The important thing to focus on will be identifying for each class the approximate range of locations the annotations are found in and the intensity of the locations within the heatmap. COLOR_GRAY2RGB for ann in image_annots if ann class_id 14 img draw_bboxes img ann bbox 2 ann bbox 2 rgb self. aspx Per the grading schema chest radiographs are classified into one of four categories which are mutually exclusive 1. negative for pneumonia or typical indeterminate or atypical You ll work with a dataset consisting of 8 781 scans that have been annotated by experienced radiologists. The challenge uses the standard PASCAL VOC 2010 mean Average Precision mAP at IoU 0. show def plot_classes self class_list n 4 height_multiplier 6 verbose True annotations self. concat gt_df train_df. copy if type annots list image_annots annots image_id else image_annots annots img cv2. reset_index drop True. axis False plt. 3 ADDITIONAL INFORMATION ON ABNORMALITIES Negative for Pneumonia No lung opacitiesTypical Appearance Multifocal bilateral peripheral opacities with rounded morphology lower lung predominant distributionIndeterminate Appearance Absence of typical findings AND unilateral central or upper lung predominant distributionAtypical Appearance Pneumothorax pleural effusion pulmonary edema lobar consolidation solitary lung nodule or mass diffuse tiny nodules cavity2 nbsp nbsp NOTEBOOK SETUP3 nbsp nbsp HELPER FUNCTIONS4 nbsp nbsp TABULAR DATAWE ARE GIVEN AND HAVE CREATED THE FOLLOWING TRAIN COLUMNS id unique image identifier UID dcm_path Path to the respective detection s dicom image xmin minimum X coordinate of the object s bounding box ymin minimum Y coordinate of the object s bounding box xmax maximum X coordinate of the object s bounding box ymax maximum Y coordinate of the object s bounding box human_label Which category is this rows detection negative boolean label typical boolean label indeterminate boolean label atypical boolean label StudyInstanceUID Study UID SeriesInstanceUID Series UID ImageInstanceUID Series UID image_shape Image shape from dicom meta width Self explanatory height Self explanatory integer_label Integer label instead of human readable. index 0 100 20 for i IMAGE_ID in enumerate IMAGE_ID_LIST train_data. there is no concept of difficult classes in VOC 2010. loc train_df class_id 14. Note that the images are in DICOM format which means they contain additional data that might be useful for visualizing and classifying. img_annotations self. 3 EXPLORATION OF BBOX COORDINATE COLUMNS The xmin ymin xmax and ymax columns indicate the location of the annotated object bounding box where the top left corner is represented by the tuple xmin ymin and the bottom right corner is represented by the tuple xmax ymax. From the heatmaps plotted below we can ascertain the following information TBDINVESTIGATE THE SIZES OF BOUNDING BOXES AND THE IMPACT OF CLASS From the boxplot plotted below we can ascertain the following information TBDINVESTIGATE THE ASPECT RATIO OF BOUNDING BOXES AND THE IMPACT OF CLASSWe want to understand the average shape wide narrow square etc. end plt. apply lambda x x 1 gt_df x_max gt_df bbox. sort_values by class_id ascending False. PLOT IMAGESSummary to be done later More detail to come laterPLOT IMAGES CONTAINING A SINGLE CLASSSummary to be done later. groupby image_id. 2 THE GOAL In this competition you ll identify and localize COVID 19 abnormalities on chest radiographs. In cases of multiple adjacent opacities we opted for one large bounding box rather than multiple adjacent smaller boxes to improve consistency in the labeling. dicom image_id row 0 class_id int row 1 rad_id int row 2 1 if row 1 14 annotations row 0 1 bbox row 3 else annotations row 0 1 bbox row 3. Bounding boxes were also placed on some atypical findings including solitary lobar consolidation nodules masses and cavities. If you grab all the rows for a single id you will have all of the objects detected within that patients radiograph. 08 line_thickness 4 if plot plot_image img title plot_title figsize plot_size return img def plot_image_ids self image_id_list height_multiplier 6 verbose True annotations self. NOTE You can have no opacities detected and still have an atypical study level label. to_list for row in tmp_df. Visual In Depth EDA SIIM COVID19 DetectionExploratory Data Analysis EDA CREATED BY DARIEN SCHETTLER TABLE OF CONTENTS 0 nbsp nbsp nbsp nbsp IMPORTS 1 nbsp nbsp nbsp nbsp BACKGROUND INFORMATION 2 nbsp nbsp nbsp nbsp SETUP 3 nbsp nbsp nbsp nbsp HELPER FUNCTIONS 4 nbsp nbsp nbsp nbsp TABULAR DATA 5 nbsp nbsp nbsp nbsp IMAGE DATA 6 nbsp nbsp nbsp nbsp IDENTIFY DUPLICATES 0 nbsp nbsp IMPORTS1 nbsp nbsp BACKGROUND INFORMATION 1. Negative for Pneumonia No lung opacitiesBounding boxes were placed on lung opacities whether typical or indeterminate. More detail to come laterNEGATIVE 2 Summary to be done later. we should be able to infer on the entirety of the training dataset within the submission kernelDATA FILES train_study_level. A value of 0 0 1 1 indicates that no opacities are detected. More detail to come laterTYPICAL 3 Summary to be done later. show def plot_radiologists self rad_id_list n 4 height_multiplier 6 verbose True annotations self. get_annotations class_ids class_list annotated_imgs plt. apply lambda x x 3 gt_df. df df self. I will get into the details of how the methods work at a later time. Indeterminate Appearance Absence of typical findings AND unilateral central or upper lung predominant distribution3. potential future improvement or option. apply lambda x x 2 gt_df y_max gt_df bbox. NOTE Images need not contain ALL the classes. probably a TBD in the future as a possible arg More detail to come laterPLOT IMAGES CONTAINING ONE OR MORE CLASSES FROM A LISTSummary to be done later. You can train your model with 6 334 independently labeled images and you will be evaluated on a test set of 2 447 images. plot_classes class_list 5 8 11 n 4 verbose False def calc_iou bbox_1 bbox_2 x_left max bbox_1 0 bbox_2 0 y_top max bbox_1 1 bbox_2 1 x_right min bbox_1 2 bbox_2 2 y_bottom min bbox_1 3 bbox_2 3 if x_right 0. 2 VISUALIZE EACH TYPE OF BBOX TBDATYPICAL 0 Summary to be done later. append inner_box new_class_ids. train_dir train_dir self. to_numpy annotations row 0. cmap cmap self. NUMBER OF ANNOTATIONS FOR THE SAME CLASS PER IMAGEWe know there are 4 different possible human_label s. append class_id new_rad_ids. get_annotated_image image_id annots plt. get_annotations get_all True del tmp_numpy gc. append rad_id annots bbox new_bboxes annots rad_id new_rad_ids annots class_id new_class_ids return annots gt_df train_df train_df. intersecting_boxes. Note that all images are stored in paths with the form study series image. apply lambda x x 0 gt_df y_min gt_df bbox. 2020 Nov 14 35 6 354 60. show train_data TrainData train_df TRAIN_DIR train_data. columns if k image_id. For each test image you will be predicting a bounding box and class for all findings. loc x_min y_min x_max y_max. count. This is an object detection and classification problem. pal tuple int x for x in np. 0Further for each test study you should make a determination within the following labels Negative for Pneumonia Typical Appearance Indeterminate Appearance Atypical Appearance To make a prediction of one of the above labels create a prediction string similar to the none class above i. agg k list for k in gt_df. int32 return annotations def get_annotated_image self image_id annots None plot False plot_size 18 25 plot_title if annots is None annots self. In particular you ll categorize the radiographs as one of a possible 4 categories. csv id unique image identifier boxes bounding boxes in easily readable dictionary format label the correct prediction label for the provided bounding boxes1. Note that the linked document describes VOC 2012 which differs in some minor ways e. isin class_ids if rad_ids is not None tmp_df tmp_df tmp_df. drop_duplicates subset image_id. Journal of thoracic imaging. Similarly some patients who were COVID positive had atypical appearances or were negative for pneumonia no lung opacities because the grading system is based off the chest radiographic findings alone. Note that we use a log axis for the count axis to handle the large number of values where their is only 1 or 2 opacities present. Bounding boxes were not placed on pleural effusions or pneumothoraces. cvtColor dicom2array image_annots 0 img_path cv2. reset_index gt_df gt_df. get_annotated_image IMAGE_ID annots None plot True plot_size 18 22 plot_title f REDUX VERSION xa0IMG i 1. plot_classes class_list 7 n 2 verbose False train_data. com thoracicimaging Fulltext 2020 11000 Review_of_Chest_Radiograph_Findings_of_COVID_19. TOTAL OPACITIES PER IMAGE PATIENTLet s count the distribution of the amount of annotations per unique id value. class_id 14 gt_df bbox gt_df. color_palette cmap 4 self. of the bouning boxes associated with each class and to do this we will use a bar chart with some pre drawn lines. isin image_ids if class_ids is not None tmp_df tmp_df tmp_df. get_annotations image_ids image_id_list annotated_imgs n len image_id_list plt. isin rad_ids if index is not None tmp_df tmp_df. apply redux_bboxes axis 1 gt_df gt_df. reset_index drop True gt_data TrainData gt_df TRAIN_DIR IMAGE_ID_LIST gt_df gt_df. TBD conda install c conda forge gdcm y Machine Learning and Data Science Imports Other Competition Related Imports Built In Imports Visualization Imports LABEL_COLORS_WOUT_NO_FINDING LABEL_COLORS 8 LABEL_COLORS 9 Triple Checks Define the root data directory Define the paths to the training and testing dicom folders respectively Define paths to the relevant csv files Create the relevant dataframe objects Use the pydicom library to read the dicom file VOI LUT if available by DICOM device is used to transform raw DICOM data to human friendly view The XRAY may look inverted If we want to fix this we can Normalize the image array and return DEFAULTS Change the bar mode DEFAULT Initialize Color map stuff Update bbox dataframe to make this easier Aspect Ratio is Calculated as Width Height Generate the bar plot class TrainData def __init__ self df train_dir cmap Spectral self. 1 THE DATA BACKGROUND INFORMATIONIn this competition we are identifying and localizing COVID 19 abnormalities on chest radiographs. append other_bbox if len intersecting_boxes 1 inner_box _get_inner_box intersecting_boxes if inner_box and inner_box not in new_bboxes new_bboxes. In this competition we are making predictions at both a study multi image and image level. drop columns x_min y_min x_max y_max inplace True gt_df gt_df. drop columns bbox inplace True gt_df pd. NOTE Only the bounding boxes for the specified classes will be drawn. If successful you ll help radiologists diagnose the millions of COVID 19 patients more confidently and quickly. More detail to come laterINDETERMINATE 1 Summary to be done later. append dict img_path os. dropna gt_df x_min gt_df bbox. ", "id": "dschettler8845/visual-in-depth-eda-siim-covid19-detection", "size": "20406", "language": "python", "html_url": "https://www.kaggle.com/code/dschettler8845/visual-in-depth-eda-siim-covid19-detection", "git_url": "https://www.kaggle.com/code/dschettler8845/visual-in-depth-eda-siim-covid19-detection", "script": "__init__ glob get_annotated_image draw_bboxes apply_voi_lut pydicom.pixel_data_handlers.util _get_inner_box get_annotations pandarallel; pandarallel.initialize(); calc_iou plotly.graph_objects dicom2array matplotlib.patches collections seaborn numpy TrainData() redux_bboxes PIL plotly.express seed_it_all plot_image_ids tensorflow_addons Image matplotlib.pyplot get_human_label plot_radiologists tqdm.notebook tensorflow pandas kaggle_datasets get_absolute_file_paths matplotlib.colors Counter plot_classes create_fractional_bbox_coordinates pandarallel KaggleDatasets ListedColormap tqdm; tqdm.pandas(); get_dicom_data unpack_bbox_column datetime ", "entities": "(('we', 'submission kernelDATA FILES train_study_level'), 'be') (('explanatory integer_label explanatory Self Integer', 'instead human readable'), 'INFORMATION') (('d unique image identifier boxes', 'boxes1'), 'label') (('0 Summary', 'EACH BBOX 2 TBDATYPICAL'), 'visualize') (('annots', 'False 18 25 plot_title'), 'annotation') (('i d column', 'duplicates'), 'be') (('opacities', 'study level still atypical label'), 'note') (('this', 'numbers'), 'let') (('particular you', 'possible 4 categories'), 'categorize') (('that', 'experienced radiologists'), 'negative') (('plot_classes class_list', 'False 7 2 train_data'), 'verbose') (('lung grading system', 'chest radiographic findings'), 'have') (('append len', 'new_bboxes new_bboxes'), 'other_bbox') (('that', 'additional data'), 'be') (('radiologists', '19 patients'), 'help') (('plot_radiologists self def 4', 'annotations height_multiplier 6 True self'), 'show') (('images', 'form study series image'), 'note') (('lung opacitiesBounding boxes', 'lung opacities'), 'negative') (('challenge', 'IoU'), 'mean') (('NOTE Images', 'classes'), 'contain') (('only we', 'accordingly i.'), 'plan') (('figure', 'enumerate annotations'), 'figsize') (('we', 'drawn lines'), 'use') (('we', 'bar chart'), 'use') (('image ID', 'training dataset'), 'relate') (('Bounding boxes', 'lobar consolidation nodules solitary masses'), 'place') (('you', 'findings'), 'predict') (('bar mode DEFAULT Initialize Color map Update bbox Aspect easier Ratio', 'bar plot class TrainData def _ _ init'), 'install') (('annotations', 'heatmap'), 'identify') (('Only bounding boxes', 'specified classes'), 'NOTE') (('that', 'additional data'), 'note') (('which', 'de patient privacy'), 'DATASET') (('which', 'four categories'), 'classify') (('bounding boxes', 'pneumonia category'), 'place') (('we', 'labeling'), 'opt') (('2012 which', 'minor ways'), 'note') (('where their', 'values'), 'note') (('chest radiographs CXRs', 'published paper'), 'message') (('NUMBER', 'IMAGEWe'), 'know') (('how methods', 'later time'), 'get') (('iloc index annotations', 'tmp_df'), 'image_id') (('we', 'study multi image level'), 'make') (('currently it', 'initial that'), 'create') (('this', '1'), 'predict') (('row', 'one object annotation'), 'exploration') (('line_thickness', 'plot plot_image img title plot_title figsize plot_size return img plot_image_ids image_id_list annotations 4 def 6 True self'), '08') (('bottom right corner', 'tuple'), 'EXPLORATION') (('show plot_classes self class_list n 4 height_multiplier', 'annotations 6 True self'), 'def') (('Annotators', 'status'), 'have') (('else image_annots', 'img cv2'), 'copy') (('PLOT IMAGESSummary', 'laterPLOT IMAGES'), 'contain') (('all', 'patients'), 'have') (('very when we', 'functionality'), 'parse') (('I', 'functionality'), 'generate') (('you', 'chest radiographs'), '2') (('DATA BACKGROUND competition we', 'chest radiographs'), 'INFORMATIONIn') (('prediction', 'i.'), 'make') (('goal', 'box bounding prediction'), 'be') (('PERCENTAGE', 'plots'), 'bound') (('we', 'wide narrow square etc'), 'ascertain') (('you', '2 447 images'), 'train') (('annotations', 'train_df Dataframe'), 'ascertain') (('probably TBD', 'LISTSummary'), 'contain') (('row respective object', 'patient'), '1') (('Atypical 0 otherwise 1 study', 'appearance'), 'csv') (('who', 'typical appearances'), 'have') (('0 100 20 i', 'IMAGE_ID_LIST train_data'), 'enumerate') (('0 1 opacities', '0'), 'indicate') (('Bounding boxes', 'pleural effusions'), 'place') (('ANNOTATIONS', 'CLASSWe'), 'know') (('also detections', 'given patient image'), 'know') (('one', 'following arguments'), 'collect') ", "extra": "['annotation', 'patient', 'test', 'edema', 'lung', 'pleura']"}