{"name": "white blood cell classification with fastai ", "full_name": " h1 White Blood Cell Classification with ResNet34 h1 The Dataset h2 Importance h1 Dataset loading h1 Training of model h1 Results h1 Future work h1 Acknowledgements ", "stargazers_count": 0, "forks_count": 0, "description": "Dataset loading Training of modelWe will use transfer learning to train a ResNet34 model pretrained on the ImageNet dataset on our dataset instead. The cell types are Eosinophil Lymphocyte Monocyte and Neutrophil. Importance White blood cell WBCs counting is an important indicator of health and is important for many diagnostic tests. Detecting the WBCs is the first step for achieving this goal. In addition for some reason the model predicts neutrophil for monocyte but not the vice versa. The previous training only trained the last layer of the model. There are approximately 3 000 images for each of 4 different cell types grouped into 4 different folders according to cell type. Original dataset from https github. The original dataset provides annotations for bounding box detection so we could try in future work to predict the bounding boxes. Therefore providing an automated way to detect and count WBCs would be advantageous. Overall the model is performing quite well There does seem to be some confusion between neutrophils and eosinophils. I have tried progressive resizing but that did not improve training. White Blood Cell Classification with ResNet34 The DatasetThis dataset contains 12 500 augmented images of various types of white blood cells JPEG with accompanying cell type labels CSV. I will load the previously trained model and analyze how well it did. Acknowledgements The techniques are inspired by fastai lesson 1. It would be interesting to see what the results would be just using the 366 files provided by the original dataset. Currently doctors utilize expensive automated counters like flow cytometers or manually count blood cells on a microscope slide. Interestingly the learning rate finder does not work it stops prematurely as loss wasn t decreasing when adjusting the learning rate and the training these earlier layers does not significantly improve the model. ResultsWe will now analyze the results of the model. com Shenggan BCCD_Dataset Thanks to Paul Mooney for the augmented dataset If you enjoyed this kernel please leave an upvote batch size image size. We will use the amazing learning rate finder to determine the optimal learning rate for training. If you have any input regarding how to improve model please leave a comment below Future work Note again that the dataset in the folder dataset2 master used here was already augmented along with the augmentations done by fastai. We can try to unfreeze and train earlier layers of the model. ", "id": "tanlikesmath/white-blood-cell-classification-with-fastai", "size": "2543", "language": "python", "html_url": "https://www.kaggle.com/code/tanlikesmath/white-blood-cell-classification-with-fastai", "git_url": "https://www.kaggle.com/code/tanlikesmath/white-blood-cell-classification-with-fastai", "script": "pandas fastai.vision fastai ", "entities": "(('Currently doctors', 'microscope slide'), 'utilize') (('previous training', 'model'), 'train') (('earlier layers', 'significantly model'), 'work') (('Overall model', 'quite well neutrophils'), 'perform') (('Therefore providing', 'WBCs'), 'be') (('you', 'upvote batch size image size'), 'com') (('We', 'training'), 'use') (('ResultsWe', 'model'), 'analyze') (('vice', 'monocyte'), 'predict') (('techniques', 'fastai lesson'), 'inspire') (('work again dataset', 'fastai'), 'leave') (('we', 'bounding boxes'), 'provide') (('Dataset', 'dataset'), 'use') (('We', 'model'), 'try') (('White Blood Cell DatasetThis dataset', 'cell type labels accompanying CSV'), 'Classification') (('Detecting', 'first goal'), 'be') (('that', 'training'), 'try') (('results', 'original dataset'), 'be') (('how well it', 'previously trained model'), 'load') (('Importance White blood cell WBCs counting', 'many diagnostic tests'), 'be') ", "extra": "['annotation', 'test', 'lymphocyte']"}