{"name": "advanced uses of shap values ", "full_name": " h1 Recap h1 SHAP Values Review h1 Summary Plots h1 Summary Plots in Code h1 SHAP Dependence Contribution Plots h1 Dependence Contribution Plots in Code h1 Your Turn ", "stargazers_count": 0, "forks_count": 0, "description": "That s where SHAP dependence contribution plots come into play. Index of 1 is explained in text below. The fact this slopes upward says that the more you possess the ball the higher the model s prediction is for winning the Man of the Match award. But through some algorithmic cleverness Shap values allow us to decompose any prediction into the sum of effects of each feature value yielding a graph like this Imgur https i. png Start by focusing on the shape and we ll come back to color in a minute. png For comparison a simple linear regression would produce plots that are perfect lines without this spread. The code isn t too complex. This didn t require writing a lot of code. If a feature has medium permutation importance that could mean it has a large effect for a few predictions but no effect in general or a medium effect for all predictions. But it doesn t tell you how each features matter. But there s a lot they don t show. png This plot is made of many dots. So multiple threads from the previous exercises will come together here. You can interpret this to say In general having the ball increases a team s chance of having their player win the award. But if they only score one goal that trend reverses and the award judges may penalize them for having the ball so much if they score that little. For instance what is the distribution of effects Is the effect of having a certain value pretty constant or does it vary a lot depending on the values of other feaures. For example consider an ultra simple model y 4 x1 2 x2 If x1 takes the value 2 instead of a baseline value of 0 then our SHAP value for x1 would be 8 from 4 times 2. SHAP dependence contribution plots provide a similar insight to PDP s but they add a lot more detail. These are harder to calculate with the sophisticated models we use in practice. Calculating SHAP values can be slow. SHAP summary plots give us a birds eye view of feature importance and what is driving it. png These two points stand out spatially as being far away from the upward trend. We then learned about SHAP values to break down the components of individual predictions. The only line that s different from the summary_plot is the last line. But the trick with these techniques is in thinking critically about the results rather than writing code itself. But there are a few caveats. These visualizations have conceptual similarities to permutation importance and partial dependence plots. We will focus on two of these visualizations. This is what we will plot. High values of Goal scored caused higher predictions and low values caused low predictionsIf you look for long enough there s a lot of information in this graph. Summary Plots Permutation importance https www. Each dot has three characteristics Vertical location shows what feature it is depicting Color shows whether that feature was high or low for that row of the dataset Horizontal location shows whether the effect of that value caused a higher or lower prediction. This provides a great overview of the model but we might want to delve into a single feature. SHAP Values ReviewShap values show how much a given feature changed our prediction compared to if we made that prediction at some baseline value of that feature. Plus with a little effort they can be explained to a non technical audience. But you ll want to be careful when running these to plot with reasonably sized datasets. But sometimes it will jump out at you. When plotting we call shap_values 1. Each dot represents a row of the data. You ll face some questions to test how you read them in the exercise. Summary Plots in CodeYou have already seen the code to load the soccer football data We get the SHAP values for all validation data with the following code. com learn machine learning explainability discussion to chat with other learners. Some things you should be able to easily pick out The model ignored the Red and Yellow Red features. png In addition to this nice breakdown for each prediction the Shap library https github. Convert from string Yes No to binary package used to calculate Shap values Create object that can calculate shap values calculate shap values. For example here we have highlighted two points with similar ball possession values. Have questions or comments Visit the course discussion forum https www. png Link to larger view https i. These are insightful and relevant for many real world use cases. Consider the following very narrow example for concreteness. The spread suggests that other features must interact with Ball Possession. That value caused one prediction to increase and it caused the other prediction to decrease. We ll walk through an example plot for the soccer data Imgur https i. In this case we index in to get the SHAP values for the prediction of True. While the primary trend is upward you can visually inspect whether that varies by dot color. Calculate shap_values for all of val_X rather than a single row to have more data for plot. It isn t a problem here because this dataset is small. RecapWe started by learning about permutation importance and partial dependence plots for an overview of what the model has learned. This helped us make comparisons between features easily and you can present the resulting graphs to non technical audiences. Now we ll expand on SHAP values seeing how aggregating many SHAP values can give more detailed alternatives to permutation importance and partial dependence plots. For classification problems there is a separate array of SHAP values for each possible outcome. The exception is when using an xgboost model which SHAP has some optimizations for and which is thus much faster. com slundberg shap offers great visualizations of groups of Shap values. This suggests we delve into the interactions and the plots include color coding to help do that. com dansbecker permutation importance is great because it created simple numeric measures to see which features mattered to a model. com kernels fork 1699743 with some questions to develop your skill with these techniques. For example the point in the upper left was for a team that scored few goals reducing the prediction by 0. Your Turn Test yourself https www. Usually Yellow Card doesn t affect the prediction but there is an extreme case where a high value caused a much lower prediction. They are both colored purple indicating the team scored one goal. The horizontal location is the actual value from the dataset and the vertical location shows what having that value did to the prediction. package used to calculate Shap values Create object that can calculate shap values calculate shap values. SHAP Dependence Contribution PlotsWe ve previously used Partial Dependence Plots to show how a single feature impacts predictions. If you don t supply an argument for interaction_index Shapley uses some logic to pick one that may be interesting. Outside of those few outliers the interaction indicated by color isn t very dramatic here. It is short enough that we explain it in the comments. Dependence Contribution Plots in CodeWe get the dependence contribution plot with the following code. ", "id": "dansbecker/advanced-uses-of-shap-values", "size": "7159", "language": "python", "html_url": "https://www.kaggle.com/code/dansbecker/advanced-uses-of-shap-values", "git_url": "https://www.kaggle.com/code/dansbecker/advanced-uses-of-shap-values", "script": "train_test_split sklearn.model_selection pandas sklearn.ensemble RandomForestClassifier numpy ", "entities": "(('that', 'summary_plot'), 'be') (('that', 'perfect spread'), 'png') (('pretty it', 'other feaures'), 'be') (('we', 'minute'), 'Start') (('SHAP then value', 'x1'), 'consider') (('We', 'individual predictions'), 'learn') (('SHAP dependence contribution where plots', 'play'), 's') (('here we', 'ball possession similar values'), 'highlight') (('visualizations', 'permutation importance'), 'have') (('SHAP Dependence Contribution PlotsWe', 'feature impacts how single predictions'), 'use') (('two points', 'spatially far away upward trend'), 'stand') (('questions', 'course discussion forum https www'), 'have') (('which', 'optimizations'), 'be') (('features', 't you'), 'doesn') (('it', 'general medium predictions'), 'have') (('easily model', 'Yellow Red features'), 'ignore') (('features', 'model'), 'be') (('value', 'prediction'), 'be') (('These', 'world use many real cases'), 'be') (('we', 'single feature'), 'provide') (('you', 'reasonably sized datasets'), 'want') (('easily you', 'non technical audiences'), 'help') (('didn t', 'code'), 'require') (('Dependence Contribution Plots', 'following code'), 'get') (('so much they', 'little'), 'penalize') (('trick', 'rather code'), 'be') (('that', 'one'), 'use') (('So multiple threads', 'previous exercises'), 'come') (('model', 'what'), 'start') (('other features', 'Ball Possession'), 'suggest') (('Create that', 'shap values'), 'convert') (('how aggregating', 'permutation importance'), 'expand') (('they', 'non technical audience'), 'explain') (('They', 'one goal'), 'be') (('you', 'graph'), 'cause') (('visually that', 'dot color'), 'inspect') (('the higher prediction', 'Match award'), 'say') (('what', 'it'), 'shap') (('We', 'following code'), 'see') (('how you', 'exercise'), 'face') (('com slundberg shap', 'Shap values'), 'offer') (('player', 'award'), 'interpret') (('We', 'visualizations'), 'focus') (('enough we', 'comments'), 'be') (('plots', 'that'), 'suggest') (('we', 'practice'), 'be') (('We', 'soccer data'), 'walk') (('us', 'Imgur https i.'), 'allow') (('Create that', 'shap values'), 'calculate') (('we', 'True'), 'index') (('effect', 'higher prediction'), 'have') (('extreme where high value', 'much lower prediction'), 'affect') (('they', 'lot more detail'), 'provide') (('that', '0'), 'be') (('we', 'feature'), 'show') "}