{"name": "als gene mutations ", "full_name": " h1 Genetics of Amyotrophic Lateral Sclerosis h1 Gene mutations that cause ALS h1 Proportion of ALS explained by the four most commonly mutated genes in Asian and European populations Data adapted from Zou et al 2017 h1 Angiogenin and Ribonuclease 4 h1 ALS Genetics Mechanisms and Therapeutics Where Are We Now h1 SOD1 Disease Mechanisms h1 TDP 43 h1 C9orf72 h1 FUS h1 Molecular Approaches to Treat ALS ", "stargazers_count": 0, "forks_count": 0, "description": "Although the most common repeat size is a triplet of the hexanucleotides controls may have up to 25 or 30 repeats. Furthermore the blood brain barrier prevents the dispersion into peripheral tissues and subsequent clearance by the kidney and liver allowing clinically effective concentrations to be more easily reached. Although they share many similarities TDP 43 and FUS regulate different RNA targets and show different sequence binding specificity. They can be used to restore or reduce protein expression or to modify protein isoform production through splice switching strategies. The review focuses on potential AO therapeutics for ALS. TDP 43 functions as a regulator of gene expression and is involved in several RNA processing steps with roles in pre mRNA splicing regulation of mRNA stability mRNA transport translation and the regulation of non coding RNAs. FUS variants are associated with early onset and juvenile ALS. This means smaller doses can be used minimizing any potential toxicity or systemic off target effects. gov pmc articles PMC6909825 Angiogenin and Ribonuclease 4 Angiogenin ANG or ribonuclease 5 is a 123 amino acid protein with multiple functions including stimulation of angiogenesis hydrolysis of nucleic acids and context dependent activation of proteases. mutSOD1 mutant superoxide dismutase 1 SOD1 Major cytosolic antioxidant NCI NII DN GCI aggregates p62 C9ORF72 ubiquilin 2 others impaired axonal transport mitochondrial function disturbed dendritic arborization of neurons oxidative stress related neuronal toxicity. AOs utilizing RNase H mediated degradation that targets only HRE containing transcripts or all C9ORF72 transcripts have been developed with both methods reported to reduce RNA foci in patient derived fibroblasts and iPSCs. HRE targeting AOs have also been able to reduce pathological C9ORF72 RNA in transgenic mice With the scope of RNA therapeutics rapidly expanding and the genetic basis of ALS continuing to be uncovered AOs may be a promising area for future therapeutic developments for subsets of ALS patients. By contrast the disease alleles may have hundreds or even thousands of the hexanucleotide repeats. Data adapted from Zou et al. a024125Protein homeostasis is disturbed in ALS. An increase in rare variants many of unknown significance has been found in the untranslated regions of known disease causing genes including SOD1 TARDBP FUS VCP OPTN and UBQLN2 highlighting the potential importance of regulatory gene regions when determining disease pathogenesis and making genetic diagnoses. FUS shares many physiological roles with TDP 43 playing a role in several aspects of gene expression including transcription pre mRNA splicing RNA transport and translation regulation. Exploration of AO therapeutics has also begun for the treatment of ALS. TDP 43 is a DNA RNA binding protein composed of 414 amino acids encoded by the TARDBP gene. Because it has neuroprotective properties it is of considerable interest that rare variants in ANG are overrepresented in both ALS sALS and in some small families and Parkinson s disease. Once in the nervous system AOs are readily taken up by neurons and glia. FUS encodes a ubiquitously expressed 526 amino acid protein belonging to the FET family of RNA binding proteins. Self assembly of misfolded proteins may lead to propagated instability and prion like spreading of pathology. gov pmc articles PMC6909825 bin fnins 13 01310 g001. C9ORF72 and ATXN2 variants for example show incomplete penetrance with symptoms not always manifesting in mutation carriers. Ribonuclease 4 is a paralog of ANG that also has angiogenic and neuroprotective properties one study as yet unconfirmed has described a hypofunctional missense mutation in this enzyme that is more abundant in ALS than controls. Therapeutic use of many RNA analog drugs has been slowed by inefficient and poorly targeted delivery. Cold Spring Harb Perspect Med. Over 50 autosomal dominant FUS variants have now been identified in ALS patients. gov pmc articles PMC5932579 Proportion of ALS explained by the four most commonly mutated genes in Asian and European populations. FUS is predominantly localized to the nucleus under normal physiological conditions but crosses over to the cytoplasm functioning in nucleocytoplasmic transport. gov pmc articles PMC5932579 ALS Genetics Mechanisms and Therapeutics Where Are We Now Authors Rita Mejzini Loren L. These C9orf72 intronic expansions underlie 45 50 of fALS and 20 25 of familial FTD cases in the United States. Additionally FUS is involved in DNA repair mechanisms including both homologous recombination during DNA double strand break repair and in non homologous end joining. VAPB Regulation of ER Golgi transport and secretionhttps www. TDP 43 TAR DNA binding protein Transcription and pre mRNA splicing regulation micRNA biogenesis RNA transport and stabilization translational regulation of ApoE II and CFTR. gov pmc articles PMC6909825. Although usually concentrated in the nucleus TDP 43 contains both a nuclear localization signal and a nuclear export signal and shuttles back and forth between the nucleus and cytoplasm. FUS ALS is characterized by pathological FUS aggregation generally reported to occur only in patients with pathogenic variants in the FUS gene. gov pmc articles PMC6909825 TDP 43 Histological examinations of spinal cord samples had revealed that neuronal cytoplasmic ubiquitinated inclusions were present in the majority of ALS patients. Additionally non native formations of wild type SOD1 have been detected in small granular SOD1 immunoreactive inclusions in the motor neurons of sALS patients without pathogenic SOD1 variants and in patients carrying the C9ORF72 repeat expansion and pathogenic variants in other ALS associated genes. There is a tendency for bulbar ALS to be more common in the C9 expanded populations. Little is known about the normal function of the C9orf72 gene. Misfolding of proteins may reflect many factors including aberrant folding and quality control at the ER disturbed ER associated degradation or ERAD inherent instability due to mutations aggregation during residence in stress granules or imperfect clearance via proteasomes or autophagy. A range of chemical modifications has helped to address some of these issues. In conditions of cellular stress ANG induces expression of a class of tRNAs tiRNAs or transfer RNA derived stress induced small RNAs that suppress protein synthesis presumably thereby conserving cellular energy reserves. Pitout Sue Fletcher Steve D. Synthetic RNA like drugs are commonly delivered to target cells using a nanoparticle delivery platform usually a cationic polymer or lipid or through conjugation to a bioactive ligand or cell penetrating peptide. Pre clinical studies of AOs targeted to C9ORF72 transcripts have also begun. 01310 Although more than 50 potentially causative or disease modifying genes have been identified pathogenic variants in SOD1 C9ORF72 FUS and TARDBP occur most frequently with disease causing variants in other genes being relatively uncommon. However a later study showed that dismutase activity did not correlate with disease severity indicating that a toxic gain of function mechanism might be at play. TDP 43 aggregation is not commonly seen in FUS ALS patients suggesting that the FUS disease pathway is independent of TDP 43. Many ALS genes highlight loss of protein quality control as a central feature of the disease. gov pmc articles PMC5932579 FUS In 2009 pathogenic variants in the gene encoding another RNA binding protein fused in sarcoma FUS were identified in a subset of ALS patients. siRNA are double stranded RNA molecules that can be used to downregulate the expression of target genes to which they are complementary through interactions with the RNA induced silencing complex. Genetics of Amyotrophic Lateral SclerosisAuthors Mehdi Ghasemi and Robert H. In the case of C9ORF72 researchers have been able to exploit the location of the pathogenic hexanucleotide expansion that occurs in an intron between two alternatively used first exons. VCP or p97 Protein degradation via UPS autophagy and the ER membrane fusion. gov pmc articles PMC6909825 SOD1 Disease Mechanisms Variations in SOD1 have been associated with a decrease in enzyme activity of 50 80 leading to early propositions that disease was conferred through a loss of dismutase activity. FUS fused in sarcoma Transcription and pre mRNA splicing regulation micRNA processing mRNA transport and stabilization maintenance of genomic integrity regulating protein synthesis at synapse. 2018 May 8 5 a024125. Several AO drugs have received FDA approval in recent years to treat a variety of conditions including Eteplirsen Exondys 51 for Duchenne muscular dystrophy for spinal muscular atrophy and Inotersen Tegsedi for hereditary transthyretin mediated amyloidosis hATTR. Although there have been several preclinical investigations on the use of siRNA to target ALS genes none have yet reached clinical trials. FUS also plays a role in the formation of paraspeckles providing cellular defense against various types of stress. gov pmc articles PMC5932579 bin cshperspectmed PRD 024125_F3. They also account for 5 10 of sporadic ALS and FTLD. Published online 2019 Dec 6. This suggests that misfolding of wild type SOD1 may be deleterious or be part of a common downstream event in ALS progression. gov pmc articles PMC6909825 Molecular Approaches to Treat ALS RNA targeted therapeutics have entered a new phase of growth with the two main strategies investigated being short interfering RNA siRNA and antisense oligonucleotides AOs. A large proportion of the genetic risk for sALS remains elusive this has meant much research to date has focused on understanding how variations and differences in expression of known ALS linked genes lead to disease. Clinical diagnosis presently involves repeat primed polymerase chain reaction PCR coupled with Southern blotting to define the size of the expansion. SOD1 TARDBP FUS and C9ORF72 have been most extensively characterized. gov pmc articles PMC6909825 C9orf72In 2011 three landmark studies identified the most common cause of ALS and ALS FTD an expansion of a hexanucleotide intronic repeat GGGGCC within the first intron of a poorly understood gene termed C9orf72 chromosome 9 open reading frame 72. In 2006 a shift in the understanding of ALS pathogenesis occurred with the discovery that the main component of the ubiquitinated protein aggregates found in sALS patients was TAR DNA binding protein 43 TDP 43. The aggregation of TDP 43 in ubiquitin positive cytoplasmic neuronal inclusions in the brain and spinal cord is now considered a pathological hallmark of ALS. Unmodified single stranded RNA is unable to cross the cell membrane efficiently unaided due to its size and negative charge and is susceptible to rapid degradation by nucleases. gov pmc articles PMC5932579 Gene mutations that cause ALSGENES and FUNCTIONALITYANG Angiogenin RNA processing and tRNA modification vascularization RNAase activity and assembly of stress granules neurite outgrowth and pathfindingC9ORF72 Chromosome 9 open reading frame 72 Transcription and pre mRNA splicing regulation membrane traffic via Rab GTPase family. Further histological studies have since confirmed that TDP 43 is present in the cytoplasmic aggregates of the majority of ALS patients including sporadic cases without pathogenic variants in the TARDBP gene and in those with C9ORF72 hexanucleotide repeat expansions. Achieving effective concentrations of AOs in the organ or tissue of interest can be challenging although treatment of neurodegenerative diseases with AOs may be advantageous in this regard as the AOs can be administered directly to the CNS via intrathecal administration. AOs are short single stranded nucleic acids that can bind to RNA through Watson Crick base pairing and can alter gene expression through several different mechanisms. ", "id": "mpwolke/als-gene-mutations", "size": "13345", "language": "python", "html_url": "https://www.kaggle.com/code/mpwolke/als-gene-mutations", "git_url": "https://www.kaggle.com/code/mpwolke/als-gene-mutations", "script": "seaborn pandas matplotlib.pyplot numpy ", "entities": "(('They', 'splice switching strategies'), 'use') (('suppress protein synthesis', 'energy presumably thereby cellular reserves'), 'induce') (('SOD1', 'pathogenic other ALS associated genes'), 'detect') (('Additionally FUS', 'end non homologous joining'), 'involve') (('FUS ALS', 'FUS gene'), 'characterize') (('FUS', 'synapse'), 'fuse') (('targeted therapeutics', 'two main strategies'), 'article') (('gov pmc PMC6909825 Angiogenin', 'proteases'), 'article') (('ALS Many genes', 'disease'), 'highlight') (('how variations', 'disease'), 'mean') (('smaller doses', 'target effects'), 'mean') (('triplet', 'up to 25 repeats'), 'have') (('main component', 'sALS patients'), 'occur') (('FUS variants', 'early onset'), 'associate') (('that', 'patient'), 'mediate') (('clinically effective concentrations', 'subsequent kidney'), 'prevent') (('aggregation', 'now pathological ALS'), 'consider') (('C9ORF72 variants', 'mutation always carriers'), 'show') (('AOs', 'intrathecal administration'), 'challenge') (('FUS', 'transcription'), 'share') (('Little', 'C9orf72 gene'), 'know') (('FUS', 'RNA binding proteins'), 'encode') (('disease alleles', 'even hexanucleotide repeats'), 'have') (('TDP', 'TARDBP gene'), 'be') (('that', 'controls'), 'be') (('Synthetic RNA', 'cell penetrating bioactive ligand peptide'), 'deliver') (('disease', 'dismutase activity'), 'article') (('transport mitochondrial C9ORF72 ubiquilin 2 others impaired axonal function', 'oxidative stress related neuronal toxicity'), 'p62') (('Exploration', 'ALS'), 'begin') (('FUS', 'nucleocytoplasmic transport'), 'localize') (('FUS variants', 'ALS now patients'), 'identify') (('SOD1', 'ALS progression'), 'suggest') (('since TDP', 'repeat C9ORF72 hexanucleotide expansions'), 'confirm') (('Pre', 'C9ORF72 transcripts'), 'begin') (('they', 'silencing induced complex'), 'strand') (('range', 'issues'), 'help') (('Misfolding', 'imperfect proteasomes'), 'reflect') (('that', 'two alternatively used first exons'), 'be') (('Unmodified single stranded RNA', 'nucleases'), 'be') (('rare variants', 'small families'), 'have') (('FUS disease pathway', 'TDP'), 'see') (('variants', 'other genes'), '01310') (('Therapeutic use', 'inefficient poorly delivery'), 'slow') (('FUS', 'stress'), 'play') (('SOD1', 'FUS'), 'TARDBP') (('toxic gain', 'play'), 'show') (('uncovered AOs', 'ALS patients'), 'be') (('Clinical diagnosis', 'expansion'), 'involve') (('nucleic short single stranded that', 'several different mechanisms'), 'be') (('gov pmc Proportion', 'Asian populations'), 'article') (('review', 'ALS'), 'focus') (('gov pmc landmark PMC6909825 2011 three studies', 'poorly understood gene'), 'article') (('muscular dystrophy', 'Inotersen hereditary transthyretin mediated amyloidosis'), 'receive') (('Angiogenin RNA modification RNAase ALSGENES processing activity', 'Rab GTPase family'), 'article') (('TDP', 'export nuclear back nucleus'), 'contain') (('genes', 'genetic diagnoses'), 'find') (('neuronal cytoplasmic ubiquitinated inclusions', 'ALS patients'), 'article') (('a024125Protein homeostasis', 'ALS'), 'disturb') (('Self assembly', 'pathology'), 'lead') (('none', 'yet clinical trials'), 'be') (('43 FUS', 'sequence different binding specificity'), 'share') (('gov pmc 2009 pathogenic variants', 'ALS patients'), 'article') (('gov pmc PMC5932579 bin', 'PRD 024125_F3'), 'articles') (('C9orf72 intronic expansions', 'United States'), 'underlie') (('bulbar ALS', 'more C9 expanded populations'), 'be') (('They', '10 sporadic ALS'), 'account') "}