{"name": "alzheimer ", "full_name": " h2 Problem Statement h2 DATASET DESCRIPTION h2 COLUMN DESCRIPTORS h2 Table of Content h2 1 Import Libraries h2 2 Set Options h2 3 Read Data h2 4 Data Analysis and Preparation h2 5 Logistic Regression h3 5 1 Logistic Regression MLE with Scaled Features h3 5 2 Logistic Regression MLE without Scaled Features h3 5 3 Logistic Regression using SGD h2 6 Decision Tree h3 6 1 Decision Tree h3 6 2 Prune the Decision Tree h3 6 3 Decision Tree using GridSearchCV h2 7 Support Vector Machine using GridSearchCV and Regularization h2 9 Conclusion and Interpretation ", "stargazers_count": 0, "forks_count": 0, "description": "Import Libraries 2. There is a higher concentration of 70 80 years old in the Demented patient group than those in the nondemented patients. 3 Decision Tree using GridSearchCV 7. We guess patients who suffered from that kind of disease has lower survival rate so that there are a few of 90 years old. Demented patients were less educated in terms of years of education. 2 Prune the Decision Tree 6. 1 Decision Tree DecisionTreeWFS 6. Conclusion and Interpretation conclusion 1. Nondemented 0 Demented 0 EDUC Years of Education Nondemented 0 Demented 1 set the figure size use mask to plot a diagonal correlation matrix triu_indices_from returns the indices for the upper triangle of matrix plotting the heat map corr give the correlation matrix cmap color code used for plotting vmax gives a maximum range of values for the chart vmin gives a minimum range of values for the chart annot prints the correlation values in the chart annot_kws Sets the font size of the annotation specify name of the plot plot multiple boxplots print dimensions of train and test sets scaling the train set scaling the test set fit the logistic regression function label the confusion matrix set size of the plot plot a heatmap True Positives are denoted by TP Actual 1 values which are classified correctly False Negatives are denoted by FN Actual 1 values which are classified wrongly as 0 False Positives are denoted by FP Actual O values which are classified wrongly as 1 print the result set the figure size plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid creating an empty dataframe of the colums appending our result table view the result table fit the logistic regression function label the confusion matrix set size of the plot plot a heatmap True Positives are denoted by TP Actual 1 values which are classified correctly False Negatives are denoted by FN Actual 1 values which are classified wrongly as 0 False Positives are denoted by FP Actual O values which are classified wrongly as 1 print the result set the figure size plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid appending our result table view the result table instantiate the SGDClassifier to bild model using SGD fit the model on training data compute the confusion matrix label the confusion matrix set sizeof the plot plot a heatmap True Positives are denoted by TP Actual 1 values which are classified correctly False Negatives are denoted by FN Actual 1 values which are classified wrongly as 0 False Positives are denoted by FP Actual O values which are classified wrongly as 1 accuracy measures by classification_report print the result set the figure size plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid appending our result table view the result table instantiate the DecisionTreeClassifier object using entropy criterion train model plot the decision tree plot the decision tree predict the model using X_test label the confusion matrix set sizeof the plot plot a heatmap True Positives are denoted by TP Actual 1 values which are classified correctly False Negatives are denoted by FN Actual 1 values which are classified wrongly as 0 False Positives are denoted by FP Actual O values which are classified wrongly as 1 accuracy measures by classification_report print the result set the figure size plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid appending our result table view the result table train the classifier plot the decision tree label the confusion matrix set sizeof the plot plot a heatmap True Positives are denoted by TP Actual 1 values which are classified correctly False Negatives are denoted by FN Actual 1 values which are classified wrongly as 0 False Positives are denoted by FP Actual O values which are classified wrongly as 1 print the result plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid appending our result table view the result table criterion The function to measure the quality of split max_depth The maximum depth of the tree max_leaf_nodes The maximum number of leaf nodes required min_samples_leaf The minimum number of samples required to be at a leaf node min_samples_split The minimum number of samples required to split an internal node set of parameters to test plot the decision tree label the confusion matrix set sizeof the plot plot a heatmap True Positives are denoted by TP Actual 1 values which are classified correctly False Negatives are denoted by FN Actual 1 values which are classified wrongly as 0 False Positives are denoted by FP Actual O values which are classified wrongly as 1 print the result plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid appending our result table view the result table use GridSearchCV to find best parameter fit the model fit the model get accuracy Note In case of classification algorithms score method represents accuracy. Brain Imaging via magnetic resonance imaging MRI is used for evaluation of patients with suspected AD. 3 Decision Tree using GridSearchCV DecisionTreewithGridSearchCv 7. Data Analysis and Preparation We see that there are 373 observations and 12 features we have changed the values of Gender to 0 1 we have changed the targer value to 0 1 we have dropped the MRI ID Visit Hand columns The above graph indicates that men are more likely with dementia than women The chart shows Nondemented group got much more higher MMSE scores than Demented group. Higher concentration of 70 80 years old in Demented group than those in the nondemented patients. 64 of the subjects were grouped as Demented at the time of their initial visits and remained so throughout the study. Logistic Regression LogisticReg 5. The dataset consists of a longitudinal MRI data of 150 subjects aged 60 to 96. These fall under the Converted category. label the confusion matrix set sizeof the plot plot a heatmap plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid appending our result table view the result table Train the model using the training sets y_pred clf. predict X_test predict the model label the confusion matrix set sizeof the plot plot a heatmap True Positives are denoted by TP Actual 1 values which are classified correctly False Negatives are denoted by FN Actual 1 values which are classified wrongly as 0 False Positives are denoted by FP Actual O values which are classified wrongly as 1 print the result plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid appending our result table view the result table label the confusion matrix set sizeof the plot plot a heatmap print the result plot the ROC curve set limits for x and y axes plot the straight line showing worst prediction for the model add the AUC score name the plot and both axes plot the grid appending our result table view the result table. The earliest clinical manifestation of AD is selective memory impairment and while treatments are available to ameliorate some symptoms there is no cure currently available. Import Libraries import_lib 2. DATASET DESCRIPTION We will be using the longitudinal MRI data. 72 of the subjects were grouped as Nondemented throughout the study. 2 Logistic Regression MLE without Scaled Features 5. DETECTING EARLY ALZHEIMER S USING MRI DATA AND MACHINE LEARNING Problem Statement Alzheimer s disease AD is a neurodegenerative disorder of uncertain cause and pathogenesis that primarily affects older adults and is the most common cause of dementia. b The chart indicates that Nondemented group has higher brain volume ratio than Demented group. 2 Logistic Regression using SGD usingSGD 6. 3 Logistic Regression using SGD 6. Set Options set_options 3. COLUMN DESCRIPTORS EDUC Years of education SES Socioeconomic Status MMSE Mini Mental State Examination CDR Clinical Dementia Rating eTIV Estimated Total Intracranial Volume nWBV Normalize Whole Brain Volume ASF Atlas Scaling Factor Table of Content1. Data Analysis and Preparation data_preparation 5. 1 Logistic Regression MLE with Scaled Features withScaledFeatures 5. Generally the MMSE indicates value less than 24 indicates Abnormality which implies the observations are true as the MMSE Metrics The above graph indicates that almost half of the patients visiting for the first time are detected with Alzhimers Intermediate Result Summary Men are more likely with demented an Alzheimer s Disease than Women. MRI findings include both local and generalized shrinkage of brain tissue. Some studies have suggested that MRI features may predict rate of decline of AD and may guide therapy in the future. This is assumed to be because the diseases affect the brain to be shrinking its tissue. 1 Decision Tree 6. However in order to reach that stage clinicians and researchers will have to make use of machine learning techniques that can accurately predict progress of a patient from mild cognitive impairment to dementia. From the above graph demented patients have less MMSE and Non Demented patients have more MMSE value. Support Vector Machine using GridSearchCV and Regularization 9. Nondemented group has higher brain volume than Demented group. Support Vector Machine using GridSearchCV and Regularization SVM 9. 14 subjects were grouped as Nondemented at the time of their initial visit and were subsequently characterized as Demented at a later visit. There are some null values in SES The data is well Balanced 5. Each subject was scanned at least once. Everyone is right handed. Read Data RD 4. 1 Logistic Regression MLE with Scaled Features 5. Decision Tree DecisionTree 6. We propose to develop a sound model that can help clinicians do that and predict early alzheimer s. Logistic Regression 5. Conclusion and Interpretation use first visit data only because of the analysis we re doing reset index after filtering first visit data M F column Target variable Target variable Drop unnecessary columns SES CDR categorical plot the histogram of numeric variables Note the hist function considers the numeric variables only by default bar_chart ASF Atlas Scaling Factor eTIV Estimated Total Intracranial Volume nWBV Normalized Whole Brain Volume Nondemented 0 Demented 1 AGE. 2 Prune a Decision Tree DecisionTreePruning 6. ", "id": "mohandeep20/alzheimer", "size": "8573", "language": "python", "html_url": "https://www.kaggle.com/code/mohandeep20/alzheimer", "git_url": "https://www.kaggle.com/code/mohandeep20/alzheimer", "script": "cohen_kappa_score classification_report train_test_split IPython.display confusion_matrix xgboost sklearn.svm numpy Image XGBClassifier seaborn pandas.api.types SGDClassifier accuracy_score SVC tree sklearn.neighbors sklearn.tree sklearn.linear_model sklearn matplotlib.pyplot sklearn.externals.six DecisionTreeClassifier StringIO metrics statsmodels.api sklearn.model_selection pandas roc_curve RandomForestClassifier LogisticRegression export_graphviz is_string_dtype KNeighborsClassifier is_numeric_dtype GridSearchCV sklearn.metrics sklearn.ensemble StandardScaler statsmodels.formula.api sklearn.preprocessing ", "entities": "(('64', 'so study'), 'group') (('We', 'MRI longitudinal data'), 'description') (('best parameter', 'accuracy'), 'demente') (('diseases', 'tissue'), 'assume') (('that', 'dementia'), 'have') (('Nondemented group', 'Demented group'), 'Analysis') (('Demented patients', 'MMSE more value'), 'demente') (('Nondemented group', 'Demented group'), 'have') (('that', 'most common dementia'), 'detect') (('Nondemented group', 'Demented group'), 'indicate') (('14 subjects', 'subsequently later visit'), 'group') (('MRI findings', 'brain tissue'), 'include') (('72', 'study'), 'group') (('Demented patients', 'education'), 'be') (('result table', 'y_pred clf'), 'label') (('imaging MRI', 'suspected AD'), 'Imaging') (('almost half', 'Women'), 'indicate') (('clinicians', 'alzheimer early s.'), 'propose') (('memory selective treatments', 'symptoms'), 'be') (('data', 'null SES'), 'be') (('bar_chart Atlas Scaling Factor eTIV Estimated Total Intracranial Normalized Whole Brain Volume nWBV Volume', '0 1 AGE'), 'use') (('who', 'survival lower rate'), 'guess') (('MRI features', 'future'), 'suggest') (('dataset', 'aged 60 96'), 'consist') (('axes', 'result table'), 'predict') "}