{"name": "analyze lending loan club ", "full_name": " h1 Who is paying and NOT paying the loan h2 About dataset ", "stargazers_count": 0, "forks_count": 0, "description": "Stated otherwise we are 45. We can see from the confusion matric that out of 15 167 non current customers it placed 10 correctly less than 0. California has the highest Total Loan Amount. A significant amount of data remains and we will move forward with the following columns remaining AnalysisWe first begin to look at our data to better understand our demographics. About dataset This dataset was provided by Kaggle and can be accessed from here Lending Club Loan Data https www. Nearly 100 of those guessed to be in default were in default using only information available at the time of the loan being issued. jpg Our missionIn order to provide meaningful analysis of LendingClub s customers we first need to understand a little bit about the business and several key questions. The core queston for LendingClub becomes Who can repay their loans. In this section we will look at some machine learning examples. We have no reasonable expectation to receive this money back3. The first algorithm simply splits the entire data set into two groups the first 70 it learns from and it tests its accuracy on the remaining 30. Similiarily recently issued loans could mislead our analysis as no payment has been expected yet. To support this question we first ask severl other questions 1. Summary The lower grade the higher loan amount loan issued F. You can therefor think of LendingClub s role in these transactions as a credit auditor. The loan_status column is the source of our answer to the core question if people are paying the loans they take out. However due to the extreme imbalance in that data set that 1 is all that matters. SummaryAs we can see the second algorithm trained with the one sided selection data is significantly more accurate reaching up to 88. Short clip for this analysis Lending Club Loan Video https youtu. 76 accurate in classifying the loan status of our customers. Interestingly we are 99. This data set is a matrix of about 890 000 observations and 75 columns images cash. Who is paying and NOT paying the loan by Jay Ko and Richard Petrie On my honor as a student I have neither given nor received unauthorized aid on this academic work. Heatmap Summary sub_grade and term seem they have high correlation. It does not seem like loan_status is correlated to other factors G 2 Statistical TestingNull Hypothesis There is no correlation between grade and loan_status. This could be due to the age of the loans Default has the highest count among other loan status. The data did not include the age of our customers but from this data we can say that many of LendingClub customers are 30. There are still several highly valuable things that can be taken from this algorithm 1. It indicates there is correlation between int_rate and loan_status Summary On the simple heatmap it is difficult to find correlation between loan_status and other factors However on the statistical analysis we also cannot ignore the heatmap result base on null hypothesis analysis We need to further analyse images statistics. Even with a reasonable depth and feature selection our algorithim is less accurate. be Ct35lwyPWYw Data processingThe first step to understanding our data is to clean up our data and identify columns that are important or not important. It indicates there is correlation between term and loan_status With low p value we can reject null hypothesis. Future workIt would be intersting to take some of the recently issued loans that were excluded from our data set predict their loan status now and test the accuracy of the predictions once the loan term is up. We start by taking a look at the length of employment for our customers. There is no correlation between term and loan_status. Loan Amount Base on GradeThe next question we wanted to answer was What kind of loans are being issued. Summary Interest rate varies wildly reaching nearly 30 for high risk loans Grade A has the lowest interest rate around 7 Grade G has the highest interest rate above 25 E. 9997 accurate at correctly classifying borrowers who are caught up on payments. Here we run each algorithm twice with a perspective of our data. With low p value we can reject null hypothesis. Data removalWe ve identified several columns that fit into one of the following categories Unneccesary data such as the URL to view the loan Redundant data. In the above chart we can see that our loan status is highly imbalanced with very few customers being late 16 30 days and many customers being current or paid off. The second algorithm uses an undersampling technique called One Sided Selection. Region Summary Alaska has the highest Average Loan Amount. What kind of loans are being given out 3. Interest Rate base on GradeWe also wanted to look at the distribution of interst rate that loans are given based on their LendingClub assigned grade. According to its description this dataset contains completed load data for all all loans issued through the 2007 2015 including the current loan status and latest payment information. Luckily we no longer have to do the work. Summary Fully Paid loans tend to be smaller. Drop charged off loans. Overall it s only 1 less accurate than our prediction above. For this run we use the undersampled data to train the algorithm and the entire dataset to test accuracy. Loan status by gradeWe were also curious how accurate LendingClub s Grades were. It indicates there is correlation between grade and loan_status With low p value we can reject null hypothesis. 39 accurate at predicting who is late or in default. Import basic data science packages A helper function that converts a b a c into 1 2 1 3 This allows the machine learning algorithims to work on integers instead of strings Drop unneccesary columns make temporary dataframe in order to keep original dataframe check employment length Using regex to easy convert Loan amount by its status clean plot Import map visulization libraries create dataframe that holds values by state. Who is getting loans 2. Typically we would like to create simpilier but less accurate algorithims in order to export how they made their decision and understand some of the key patterns it found. As we can see in the code below even with a depth of 20 allowing it potentially over a million classification rules 2 20 1 nodes against 8 most relevant columns of our 12 we still lose 11 of our total accuracy 90 000 more incorrect predictions The same issue persists in the second perspective moving forward. Lower graded loans are less likely to pay as expected. Loan StatusNext we wanted to take a look at some data points regarding the status of loans. SumarryLendingClubs assigned Grades are actually fairly accurate or at least logical. com states add more columns create num_default column create default_rate column create average dti by the state plotly color setting create text column setting plotly and deploy the map create new dataset for exploratory analysis import necessary libraries for statistical testing Data set up We specifically exclude LendingClub s grades. The next payment date for the loan at the time the data was generated is not relevant to usAdditionally we identified some rows that we decided were not relevant to our needs. Notes The 10 year column is for 10 years of employment which is as high as the data went. To accomplish this analysis we do three things to our data 1. Employement Length For Issued Loans SummaryIn the above chart we can see that a significant number of our customers have been employeed for 10 or more years. Many factors grade loan_amnt and int_rate seem they also have high correlation with term. Understanding the algorithmsUnfortunantly this data sets are rather complex. LendingClub is a peer to peer loan provider meaning they allow people to apply for loans and other individuals or companies to furfil those loans. Group late loans into a single categoryWith these three actions taken we can ask our algorithim to look at only our current loans and predict if they will pay on time pay late or default on their loans. The above output perfectly highlights the effect of an imbalanced data set. Splitting up the data setNot only is it important to give our algorithms data to learn from but also to test their accuracy. Exploratory Data G 1. Iowa has the highest Default rate. jpg Machine LearningOne thing that may be clear by now is that there is simply too much data to accuratly understand the data without a significant time investment. Because a majority of our data fits into only 2 of our 7 loan status categories we must be careful that our algorithm doesn t simply decide to put all loans into those two categories and call it a day. In Grace Period and Late 16 30 days have the highest loan amount and mean. LendingClub itself needs not finance any loans with their own money but has a responsability to its customers to verify that those who are applying for loans have the ability to pay in a timely manner. 1 accurate where it matters. This is great of predicting the status of future customers but is a little too complex for predicting the fate of currently outstanding loans which could help budget for the future of the company. Predicting payoffs for outstanding loansThe above algorithims are doing classification on every status of loan from paid off to charged off. The Grade is a value from A to G that is a culmination of LendingClubs own analysis on the ability for the customer to repay the grade. 98 of those errors are in non current customers which we care about the most. While it is an impressive sounding 98. They are likely generated using a clustering algorithm and would provide artificial insight into the borrowers. We found some records with a loan_status of Does not meet the credit policy. We continue to use the one sided selection due to the imbalanced number of current loans. We believe these may be older loans that would simply not be accepted under LendingClubs current criteria. How accurate is LendingClubs loan grading system 4. Loan description may be useful to some but the much more conciese loan purpose fits our needs User provided information. There is no correlation between int_rate and loan_status. We no longer care about the past2. As these data points will provide no value moving forward we ve ecluded them from our data. com wendykan lending club loan data. Employer titles may offer some insight into employment industry but would need significant cleanup to provide useful statistics Operational data. Additionally it would have been nice to include unfilled loans in the dataset. We decided to approach this by the grade that LendingClub assigns to the loan. Out of the 5 996 instances of the algorithm predicting the borrower would be late only 2 were errors. What data points are important in determining if someone will repay After answering these questions we explore making accurate machine learning algorithims and attempt to answer our core question. Maine has the highest DTI and 0 default rate G. 5 year column is a replacement of the 1 year employment value B. This will be important later. create loan amount by state column create number of loan issued by state column create average loan amount column create average employment length change index from state abbreviation to numeric value population by states from http worldpopulationreview. This is a look into what percentage of loans are current or already paid off by grade. Like the above LendingClub could use this information to screen applicants and reduce the number of loans provided to people who are extremely unlikely to pay on time. To state otherwise if this algorithm classifies someone as in default there is an extremely high degree of confidence they will default. ", "id": "jkjay333/analyze-lending-loan-club", "size": "117", "language": "python", "html_url": "https://www.kaggle.com/code/jkjay333/analyze-lending-loan-club", "git_url": "https://www.kaggle.com/code/jkjay333/analyze-lending-loan-club", "script": "tools categorize imblearn.under_sampling train_test_split init_notebook_mode download_plotlyjs stats numpy seaborn plotly.plotly plotly sklearn.tree scipy sklearn plotting RandomUnderSampler matplotlib.pyplot DecisionTreeClassifier pandas.tools metrics plotly.graph_objs plotly.offline pandas plot svm sklearn.model_selection iplot RandomForestClassifier OneSidedSelection sklearn.ensemble ", "entities": "(('dataset', 'Lending Club Loan Data https www'), 'provide') (('Overall it', 'only 1 less prediction'), 's') (('We', 'customers'), 'start') (('they', 'high correlation'), 'seem') (('who', 'default'), 'accurate') (('kind', 'loans'), 'Base') (('Maine', 'highest DTI'), 'have') (('Grade around 7 G', '25 E.'), 'vary') (('they', 'loans'), 'be') (('many', 'LendingClub customers'), 'include') (('we', 'other questions'), 'ask') (('loans', 'LendingClub assigned grade'), 'want') (('We', 'specifically grades'), 'add') (('percentage', 'already grade'), 'be') (('setNot only it', 'also accuracy'), 'be') (('Default', 'loan other status'), 'be') (('They', 'borrowers'), 'generate') (('data set', '890 about 000 observations'), 'be') (('significant number', '10 years'), 'Length') (('customer', 'grade'), 'be') (('we', 'business'), 'jpg') (('that', 'state'), 'package') (('who', 'timely manner'), 'need') (('payment', 'analysis'), 'mislead') (('we', 'most'), 'be') (('California', 'Total Loan highest Amount'), 'have') (('Luckily we', 'longer work'), 'have') (('they', 'extremely high confidence'), 'be') (('same issue', 'second perspective'), 'lose') (('that', 'loan Redundant data'), 'identify') (('they', 'late loans'), 'loan') (('it', '10 correctly less than 0'), 'see') (('we', 'core question'), 'be') (('LendingClub', 'loan'), 'decide') (('also how Grades', 'gradeWe'), 'be') (('Here we', 'data'), 'run') (('We', 'images further statistics'), 'indicate') (('Region Summary Alaska', 'Average Loan highest Amount'), 'have') (('which', 'company'), 'be') (('feature algorithim', 'Even reasonable depth'), 'be') (('records', 'credit policy'), 'find') (('we', 'machine learning examples'), 'look') (('algorithm doesn', 'it'), 'be') (('second algorithm', 'undersampling technique'), 'use') (('loan amount average column', 'http worldpopulationreview'), 'create') (('we', 'needs'), 'be') (('year 5 column', 'year employment 1 value'), 'be') (('that', 'time significant investment'), 'be') (('We', 'current loans'), 'continue') (('above output', 'data imbalanced set'), 'highlight') (('dataset', 'loan current status'), 'contain') (('who', 'extremely time'), 'use') (('we', 'null hypothesis'), 'indicate') (('You', 'credit auditor'), 'think') (('User', 'information'), 'be') (('kind', '3'), 'give') (('Employer titles', 'useful statistics Operational data'), 'offer') (('loan_status', 'TestingNull G 2 Statistical grade'), 'seem') (('Summary loan amount lower grade higher loan', 'F.'), 'issue') (('older that', 'simply LendingClubs current criteria'), 'believe') (('it', 'remaining 30'), 'split') (('Predicting', 'loan'), 'do') (('grade they', 'term'), 'seem') (('that', 'data'), 'set') (('Who', 'loans'), 'become') (('we', 'null hypothesis'), 'reject') (('forward we', 'data'), 'eclude') (('I', 'academic work'), 'pay') (('who', 'payments'), 'accurate') (('Nearly 100', 'loan'), 'be') (('still several highly valuable that', 'algorithm'), 'be') (('second algorithm', 'significantly more accurate 88'), 'see') (('as data', 'employment'), 'Notes') (('it', 'key patterns'), 'like') (('that', 'columns'), 'be') (('We', 'money'), 'have') (('we', 'data'), 'do') (('we', 'better demographics'), 'remain') (('16 late 30 days many customers', 'above chart'), 'see') (('loan term', 'predictions'), 'interste') (('we', 'entire accuracy'), 'use') (('people', 'other loans'), 'be') (('Loan StatusNext we', 'loans'), 'want') (('Additionally it', 'dataset'), 'be') "}