{"name": "artifact rejection using ica ", "full_name": " h1 Artifact Rejection using ICA h2 In continuation to my previous notebook on introduction to PCA and ICA in EEG h2 https www kaggle com tarunchilkur ica for eeg h2 In this notebook we will look at how individual artifacts look in real life and how rejecting them changes our output h2 For this we will be going with MNE package and using their sample dataset h1 Plotting the raw data h2 The Vertical is the signal from each electrodes and the horizontal is the timestamp h2 In the above plots we have tweaked the duration and number of electrodes as we can see there is a lot of interference from unwanted sources we will now eliminate these h1 Running ICA h1 Drop artefactual components h2 From the above analysis we can see that the elimination of artifacts from the EEG data there is a significant change in the signal h2 In the case of EEG the EOG and EEG artifacts are activated in all the topo plots even if we increase the number of components in the ICA and PCA due to them being active throughout the experiment h2 When we increase the number of components in the ICA and PCA we are able to see more topo plots and we can decide the artifacts more effectively but more number of components does not mean more accuracy We can increase the number of components to cross check out analysis for eg in the case of EEG if we increase the number of components we are able to see some topo plots being similiar to before ", "stargazers_count": 0, "forks_count": 0, "description": "Occasionally a smiley face was presented at the center of the visual field. Running ICA https mne. for eg in the case of EEG if we increase the number of components we are able to see some topo plots being similiar to before. EEG data from a 60 channel electrode cap was acquired simultaneously with the MEG For first part we are using only EEG data along with EOG and ECG channels recorded The second part has code to work with MEG dataLink to the description https mne. apply changes the Raw object in place so let s make a copy first Reconstruced after removing artefactual components. com tarunchilkur ica for eeg In this notebook we will look at how individual artifacts look in real life and how rejecting them changes our output. We can increase the number of components to cross check out analysis. tools stable overview datasets_index. The subject was asked to press a key with the right index finger as soon as possible after the appearance of the face. tools stable generated mne. html Drop artefactual components From the above analysis we can see that the elimination of artifacts from the EEG data there is a significant change in the signal. In the above plots we have tweaked the duration and number of electrodes as we can see there is a lot of interference from unwanted sources we will now eliminate these. Selecting EEG EOG and ECG channels Tweak duration number of channels Setup ICA Run ICA Plot time series Plot topographies indices chosen based on various plots above ica. The interval between the stimuli was 750 ms. html sample Plotting the raw data The Vertical is the signal from each electrodes and the horizontal is the timestamp. For this we will be going with MNE package and using their sample dataset. In this experiment checkerboard patterns were presented to the subject into the left and right visual field interspersed by tones to the left or right ear. In the case of EEG the EOG and EEG artifacts are activated in all the topo plots even if we increase the number of components in the ICA and PCA due to them being active throughout the experiment When we increase the number of components in the ICA and PCA we are able to see more topo plots and we can decide the artifacts more effectively but more number of components does not mean more accuracy. This is a sample dataset provided by MNE. Artifact Rejection using ICA In continuation to my previous notebook on introduction to PCA and ICA in EEG. ", "id": "tarunchilkur/artifact-rejection-using-ica", "size": "2253", "language": "python", "html_url": "https://www.kaggle.com/code/tarunchilkur/artifact-rejection-using-ica", "git_url": "https://www.kaggle.com/code/tarunchilkur/artifact-rejection-using-ica", "script": "ICA sample matplotlib.pyplot mne.preprocessing mne.datasets numpy ", "entities": "(('interval', 'stimuli'), 'be') (('This', 'sample MNE'), 'be') (('we', 'now these'), 'eliminate') (('horizontal', 'electrodes'), 'sample') (('how rejecting', 'output'), 'ica') (('We', 'analysis'), 'increase') (('topo plots', 'components'), 'for') (('Setup ICA Run ICA Plot time series Plot topographies', 'ica'), 'tweak') (('we', 'sample dataset'), 'go') (('Occasionally smiley face', 'visual field'), 'present') (('more effectively more number', 'more accuracy'), 'activate') (('checkerboard patterns', 'left ear'), 'present') (('so s', 'first artefactual components'), 'apply') (('second part', 'description https mne'), 'acquire') (('elimination', 'significant signal'), 'component') (('subject', 'face'), 'ask') "}