{"name": "assignment elucidata ", "full_name": " h1 Question 1 h1 What does the analysis say about the general behaviour of the different samples h1 Ans Adenocarcinoma sample are forming dense cluster while other one is showing greater variation like Neuroendocrine showing low denser h1 Are the neuroendocrine tumors clearly separable from the adenocarcinoma tumors h1 Ans some neuroendocrine tumors are clrearly separable from adenocarcinoma tumors but very few are overlapped with adenocarcinoma tumors h1 What can be said about the variance of the PCA h1 Ans 96 variance is captured on eigen vector value 125 h1 Question 2 h1 Can you characterize the presence of IFN signature in pancreatic adenocarcinoma tumors by assigning a score to each sample which denotes the positive or negative presence of IFN genes in the sample h1 Ans Yes I can characterize the presence of IFN signature in pancreatic adenocarcinoma tumors and also assigned score to each gene per histological type by taking sum of each the sample gene divide by count of each sample h1 How is the distribution of this score among the different samples h1 Ans Distribution of each gene score to each sample type is not varied too much h1 Based on this distribution can we identify the presence of high and low IFN subtypes in PAAD h1 Yes we can identify the presence of IFN in PAAD subtypes ", "stargazers_count": 0, "forks_count": 0, "description": "How is the distribution of this score among the different samples Ans Distribution of each gene score to each sample type is not varied too much. Are the neuroendocrine tumors clearly separable from the adenocarcinoma tumors Ans some neuroendocrine tumors are clrearly separable from adenocarcinoma tumors but very few are overlapped with adenocarcinoma tumors. What can be said about the variance of the PCA Ans 96 variance is captured on eigen vector value 125. Question 1 What does the analysis say about the general behaviour of the different samples Ans Adenocarcinoma sample are forming dense cluster while other one is showing greater variation like Neuroendocrine showing low denser. Based on this distribution can we identify the presence of high and low IFN subtypes in PAAD Yes we can identify the presence of IFN in PAAD subtypes. Question 2 Can you characterize the presence of IFN signature in pancreatic adenocarcinoma tumors by assigning a score to each sample which denotes the positive or negative presence of IFN genes in the sample Ans Yes I can characterize the presence of IFN signature in pancreatic adenocarcinoma tumors and also assigned score to each gene per histological type by taking sum of each the sample gene divide by count of each sample. ", "id": "nithinreddyy/assignment-elucidata", "size": "1319", "language": "python", "html_url": "https://www.kaggle.com/code/nithinreddyy/assignment-elucidata", "git_url": "https://www.kaggle.com/code/nithinreddyy/assignment-elucidata", "script": "seaborn myplot PCA figure sklearn.preprocessing matplotlib.pyplot parse LabelEncoder sklearn.decomposition cmapPy.pandasGEXpress.parse pandas numpy ", "entities": "(('I', 'sample'), 'question') (('we', 'PAAD subtypes'), 'identify') (('Ans Distribution', 'sample type'), 'be') (('very few', 'adenocarcinoma tumors'), 'be') (('96 variance', 'eigen vector value'), 'say') (('other one', 'low denser'), 'question') "}