{"name": "awesome ml frameworks and mnist classification ", "full_name": " h1 Awesome Machine Learning ML Frameworks and Classification of MNIST Dreams from MIT Deep Learning h4 Credits Thanks to Lex Fridman s MIT Deep Learning Joseph Misiti and other contributers for such wonderful work h3 Here are some of my kernel notebooks for Machine Learning and Data Science as follows Upvote them if you like them h1 Classification of MNIST Dreams with Convolutional Neural Networks from MIT Deep Learning h3 Build the model h3 Train the model h3 Evaluate accuracy h3 Make predictions h2 Acknowledgements h1 Awesome Machine Learning ML Frameworks h3 Frameworks and Libraries h3 Tools h2 APL h4 General Purpose Machine Learning h2 C h4 General Purpose Machine Learning h4 Computer Vision h3 Speech Recognition h2 C h4 Computer Vision h4 General Purpose Machine Learning h4 Natural Language Processing h4 Speech Recognition h4 Sequence Analysis h4 Gesture Detection h2 Common Lisp h4 General Purpose Machine Learning h2 Clojure h4 Natural Language Processing h4 General Purpose Machine Learning h4 Data Analysis Data Visualization h2 Crystal h4 General Purpose Machine Learning h2 Elixir h4 General Purpose Machine Learning h4 Natural Language Processing h2 Erlang h4 General Purpose Machine Learning h2 Go h4 Natural Language Processing h4 General Purpose Machine Learning h4 Data Analysis Data Visualization h4 Facial Detection and Recognition h4 Image Classification h2 Haskell h4 General Purpose Machine Learning h2 Java h4 Natural Language Processing h4 General Purpose Machine Learning h4 Speech Recognition h4 Data Analysis Data Visualization h4 Deep Learning h2 Javascript h4 Natural Language Processing h4 Data Analysis Data Visualization h4 General Purpose Machine Learning h4 Misc h4 Demos and Scripts h2 Julia h4 General Purpose Machine Learning h4 Natural Language Processing h4 Data Analysis Data Visualization h4 Misc Stuff Presentations h2 Lua h4 General Purpose Machine Learning h4 Demos and Scripts h2 Matlab h4 Computer Vision h4 Natural Language Processing h4 General Purpose Machine Learning h4 Data Analysis Data Visualization h2 NET h4 Computer Vision h4 Natural Language Processing h4 General Purpose Machine Learning h4 Data Analysis Data Visualization h2 Objective C h3 General Purpose Machine Learning h2 OCaml h3 General Purpose Machine Learning h2 Perl h3 Data Analysis Data Visualization h3 General Purpose Machine Learning h2 Perl 6 h3 Data Analysis Data Visualization h3 General Purpose Machine Learning h2 PHP h3 Natural Language Processing h3 General Purpose Machine Learning h2 Python h4 Computer Vision h4 Natural Language Processing h4 General Purpose Machine Learning h4 Data Analysis Data Visualization h4 Misc Scripts iPython Notebooks Codebases h4 Neural Networks h4 Kaggle Competition Source Code h4 Reinforcement Learning h2 Ruby h4 Natural Language Processing h4 General Purpose Machine Learning h4 Data Analysis Data Visualization h4 Misc h2 Rust h4 General Purpose Machine Learning h2 R h4 General Purpose Machine Learning h4 Data Analysis Data Visualization h2 SAS h4 General Purpose Machine Learning h4 Data Analysis Data Visualization h4 High Performance Machine Learning h4 Natural Language Processing h4 Demos and Scripts h2 Scala h4 Natural Language Processing h4 Data Analysis Data Visualization h4 General Purpose Machine Learning h2 Swift h4 General Purpose Machine Learning h2 TensorFlow h4 General Purpose Machine Learning h2 Tools h4 Misc h2 Further resources h2 Credits Reference h2 License h3 Please UPVOTE my kernel if you like it or wanna fork it h4 I am open to have your feedback for improving this kernel h3 Thanks for visiting my Kernel and please UPVOTE to stay connected and follow up the further updates ", "stargazers_count": 0, "forks_count": 0, "description": "com cortical io Public tree master iris Cortical. Node SVM https github. com Kalvar ios KRFuzzyCMeans Algorithm It implemented Fuzzy C Means FCM the fuzzy clustering classification algorithm on Machine Learning. com Lazin go ngram In memory n gram index with compression. Cats https github. PGM https github. CoverTree https github. com clementfarabet vowpal_wabbit An old vowpalwabbit interface to torch. jl Receiver Operating Characteristics and functions for evaluation probabilistic binary classifiers. org mrjob A library to let Python program run on Hadoop. auto_ml https github. Get list of pretty much anything stop words countries non words in txt json or hash. com JuliaStats Distributions. Neural Network Designer https sourceforge. KRFuzzyCMeans Algorithm https github. com scruffy a beautiful graphing toolkit for ruby 194. AIToolbox https github. comportex https github. Rmalschains http cran. bigRR http cran. html ncvreg Regularization paths for SCAD and MCP penalized regression models. DEEP LEARNING Bolt https github. com deap deap Evolutionary algorithm framework. js Simple Javascript implementation of the k means algorithm for node. MLPNeuralNet https github. Implemented using vDSP and vecLib it s 20 times faster than its Java equivalent. go pr https github. jl Deep Learning framework for Julia inspired by Caffe. com AllenDowney ThinkComplexity Code for Allen Downey s book Think Complexity. html A tool kit for processing text using computational linguistics. randomForest http cran. com nlp compromise compromise Natural Language processing in the browser. ganitha https github. rustlearn https github. org web packages arules index. com oryxproject oryx Lambda Architecture Framework using Apache Spark and Apache Kafka with a specialization for real time large scale machine learning. com c home credit default risk. com vispy vispy GPU based high performance interactive OpenGL 2D 3D data visualization library. Mixed Models https github. grplasso http cran. GLM https github. Consider it your personal data science assistant automating a tedious part of machine learning. html Automatically creates deployable machine learning models across numerous market or customer segments using a GUI. Infections clj https github. com dn2a dn2a javascript Digital Neural Networks Architecture. com josephmisiti machine learning module Class on machine w PDF lectures code Caffe http caffe. com JuliaImages Images. sofia ml https code. For instance you can find Naïve Bayes https metacpan. mlens https github. Send it commands over a RESTful API to store data explore it using SQL then train machine learning models and expose them as APIs. Vowpal Wabbit BLLIP Parser https pypi. PCV https github. Timbl is an elaborate k Nearest Neighbours machine learning toolkit. com madhusudancs sentiment analyzer Tweets Sentiment Analyzer sentiment_classifier https github. com JuliaStats MLBase. com jeff1evesque machine learning automated build consisting of a web interface https github. C General Purpose Machine Learning Darknet https github. GAMBoost http cran. com seatgeek fuzzywuzzy Fuzzy String Matching in Python. com zygmuntz kaggle blackbox Deep learning made easy. caret http caret. A GUI based workbench is also provided to help model and train neural networks. matplotlib http matplotlib. com maxsklar BayesPy Bayesian Inference Tools in Python. html glmpath L1 Regularization Path for Generalized Linear Models and Cox Proportional Hazards Model. com c jigsaw toxic comment classification challenge. libfolia https github. Intel R DAAL https github. kaggle advertised salaries https github. sfm https github. io MLPleaseHelp provided via Github Pages. evtree http cran. com twitter scalding A Scala API for Cascading. This package provides routines to construct graphs on videos segment them build trees out of them and convert them back to videos. com chartbeat labs textacy higher level NLP built on Spacy. ml neptune ml Home Credit Default Risk for Home Credit Default Risk https www. com catboost catboost General purpose gradient boosting on decision trees library with categorical features support out of the box for R. com BRML climin Optimization library focused on machine learning pythonic implementations of gradient descent LBFGS rmsprop adadelta and others. It provides immutable objects and exposes its functionality through a scikit learn like API. XGBoost https github. mboost http cran. stacked_generalization https github. Edict Dictionary parallel sentences Search. gensim https github. MLPleaseHelp https github. js with an emphasis on numeric computing. graphlab create https turi. Annoy https github. com pprett nut Natural language Understanding Toolkit. igraph http igraph. html CoxBoost Cox models by likelihood based boosting for a single survival endpoint or competing risks Cubist http cran. Breeze https github. com plotly dash A framework for creating analytical web applications built on top of Plotly. com Netflix PigPen Map Reduce for Clojure. mrjob https pythonhosted. com chrislo data_visualisation_ruby Source code and supporting content for my Ruby Manor presentation on Data Visualisation with Ruby. org web packages tmap vignettes tmap getstarted. clortex https github. com pprett bolt Bolt Online Learning Toolbox. com yconst YCML A Machine Learning framework for Objective C and Swift OS X iOS. neon https github. com spotify annoy Approximate nearest neighbours implementation. jl A Julia package for manifold learning and nonlinear dimensionality reduction. com williamFalcon pix2pix keras Implementation of image to image pix2pix translation from the paper by isola et al https arxiv. open solution value prediction https github. Optunity http optunity. albumentations https github. Go Natural Language Processing go porterstemmer https github. com ContinuumIO topik Topic modelling toolkit. org web packages ncvreg index. io DiffSharp An automatic differentiation AD library providing exact and efficient derivatives gradients Hessians Jacobians directional derivatives and matrix free Hessian and Jacobian vector products for machine learning and optimization applications. org web packages caretEnsemble index. com LanguageMachines libfolia C library for the FoLiA format http proycon. Kaggle Stackoverflow https github. com reiver go porterstemmer A native Go clean room implementation of the Porter Stemming algorithm. jl Signal Processing tools for Julia. com library written on Vanilla JS for big data visualization. com itamarwe kalman Kalman filter for Javascript. com peterwittek somoclu Massively parallel self organizing maps accelerate training on multicore CPUs GPUs and clusters has python API. tar MATLAB source code that implements the contourlet transform and its utility functions. nn https github. com sassoftware enlighten deep Example code and materials that illustrate using neural networks with several hidden layers in SAS. FFT DCT Hilbert cepstrums stft. ruby plot https www. com apache incubator predictionio PredictionIO a machine learning server for software developers and data engineers. com fsprojects Vulpes Deep belief and deep learning implementation written in F and leverages CUDA GPU execution with Alea. com ageitgey face_recognition Face recognition library that recognize and manipulate faces from Python or from the command line. com aleph7 BrainCore The iOS and OS X neural network framework. com jmschrei yahmm Hidden Markov Models for Python implemented in Cython for speed and efficiency. org bringing javascript libraries to R. dockerface https github. com neptune ml open solution ship detection source code and experiments results https app. Supports TensorFlow models. html lars Least Angle Regression Lasso and Forward Stagewise. Kaldi is intended for use by speech recognition researchers. NLP Compromise https github. Numba http numba. com A Java Toolbox for Scalable Probabilistic Machine Learning. html svmpath svmpath the SVM Path algorithm. com mne tools mne python notebooks IPython notebooks for EEG MEG data processing using mne python. Retext https github. Introduction to machine learning with scikit learn https github. com nutsiepully NaiveBayes. com SeniorSA hybrid rs trainner A hybrid recommender system based upon scikit learn algorithms. com mining mining Business Intelligence BI in Python Pandas web interface PyMC https github. Implemented in literate JavaScript with no dependencies designed to work in all modern browsers including IE as well as in Node. com Wavelets sarah palin lda Topic Modeling the Sarah Palin emails. rpart http cran. General Purpose Machine Learning BanditLib https github. figue https code. Curvelets http www. To start training call the model. org Incanter is a Clojure based R like platform for statistical computing and graphics. Fuzzy Wuzzy https github. Natural Language Processing Topic Models https github. html rpart Recursive Partitioning and Regression Trees. com meta toolkit meta MeTA ModErn Text Analysis https meta toolkit. com numenta nupic 2012 paper diginorm https github. com autumnai leaf open source framework for machine intelligence sharing concepts from TensorFlow and Caffe. jl Methods for dimensionality reduction. com IllinoisCogComp lbjava Learning Based Java is a modeling language for the rapid development of software systems offers a convenient declarative syntax for classifier and constraint definition directly in terms of the objects in the programmer s application. com npellet visualizer project. General Purpose Machine Learning DeepLearning. This network can be used in products recommendation user behavior analysis data mining and data analysis. If everything ran correctly you should get an animation like this MNIST dream predictions https i. NN and SVM in classification and regression. io en latest notebooks index. fit method the model is fit to the training data As the model trains the loss and accuracy metrics are displayed. FACTORIE https github. 5 decision tree Kalimdor. kNear https github. RankLib https sourceforge. com archive p figue K means fuzzy c means and agglomerative clustering. com tflearn tflearn Deep learning library featuring a higher level API for TensorFlow. Distance https github. org web packages gbm index. com WizardMac ReadStat. com torch cunn Torch CUDA Neural Network Implementation. pattern https github. edu an nlp library for matlab An NLP library for Matlab. com natanielruiz dockerface Easy to install and use deep learning Faster R CNN face detection for images and video in a docker container. accuracy is the fraction of images that are correctly classified. Encog contains classes to create a wide variety of networks as well as support classes to normalize and process data for these neural networks. arules http cran. com bloomberg bqplot An API for plotting in Jupyter IPython. com Somnibyte MLKit A simple Machine Learning Framework written in Swift. climin https github. com wildart ManifoldLearning. com maciejkula rustlearn a machine learning framework featuring logistic regression support vector machines decision trees and random forests. com Element Research rnn A Recurrent Neural Network library that extends Torch s nn. GeneticSharp https github. com arunkumarramanan data scientist s toolkits awesome ds resources Awesome Computer Vision Resources TBU https www. Naive Bayes https github. com ayush1997 visualize_ML A python package for data exploration and data analysis. Machine Learning Ruby https github. com tqchen xgboost tree master R package R binding for eXtreme Gradient Boosting Tree Library. org web packages rdetools index. jl A neural network in Julia. The library provides a collection of robust high performance libraries for mathematics statistics streams utilities and more. Chalk https github. Python tesseract is a wrapper for Google s Tesseract OCR Engine. com rasbt mlxtend A library consisting of useful tools for data science and machine learning tasks. It is easy to install contains fast inference implementation and supports CPU and GPU even multi GPU computation. com machinalis featureforge A set of tools for creating and testing machine learning features with a scikit learn compatible API. com proycon python ucto Python binding to ucto a unicode aware rule based tokenizer for various languages. NeuralN https github. com nickgillian grt The Gesture Recognition Toolkit GRT is a cross platform open source C machine learning library designed for real time gesture recognition. com torch optim An optimization library for Torch. com zygmuntz kaggle merck Merck challenge at Kaggle. com sassoftware enlighten apply tree master ML_tables Concise cheat sheets containing machine learning best practices. Stanford Topic Modeling Toolbox http nlp. com jbrownlee CleverAlgorithmsMachineLearning CORElearn http cran. Envision https github. Images https github. js React and Flask Misc Scripts iPython Notebooks Codebases Map Reduce implementations of common ML algorithms https github. It provides its users with a succinct language for creating relational factor graphs estimating parameters and performing inference. com archive p encog cpp Fido https github. REEMtree http cran. ANN https github. com jkomiyama banditlib A simple Multi armed Bandit library. Optunity is written in Python but interfaces seamlessly to R. This is the successor of PyBrain. LogicReg http cran. Julia Data https github. Montague https github. org VLFeat is an open and portable library of computer vision algorithms which has Matlab toolbox. General purpose NLP library for Python. Detectron https github. LingPipe http alias i. pandas cookbook https github. nz ml weka Weka is a collection of machine learning algorithms for data mining tasks. mexopencv http kyamagu. io are the main packages for managing analyzing and visualizing textual data. machine learning https github. ncvreg http cran. com lutzroeder netron Visualizer for machine learning models. penalizedLDA http cran. natural https github. Mahout https github. com CamDavidsonPilon decision weights Sarah Palin LDA https github. rattle http cran. com clementfarabet videograph A video graph library for Torch. Evaluate accuracyNext compare how the model performs on the test dataset Often times the accuracy on the test dataset is a little less than the accuracy on the training dataset. ClearTK https code. Brainstorm https github. org a machine learning based toolkit for the processing of natural language text. PredictionBuilder https github. com ryanbressler CloudForest Ensembles of decision trees in Go Golang. Python Programming for the Humanities http www. io Retina an API performing complex NLP operations disambiguation classification streaming text filtering etc. io mexopencv Collection and a development kit of MATLAB mex functions for OpenCV library. com nilearn nilearn Machine learning for NeuroImaging in Python. html GAMBoost Generalized linear and additive models by likelihood based boosting. org dimple http dimplejs. editdistance https pypi. It s utilize LNU Linear Neural Unit QNU Quadratic Neural Unit RBF Radial Basis Function MLP Multi Layer Perceptron MLP ELM Multi Layer Perceptron Extreme Learning Machine neural networks learned with Gradient descent or LeLevenberg Marquardt algorithm. RapidMiner https rapidminer. Sentiment Analysis https www. org Apache clinical Text Analysis and Knowledge Extraction System cTAKES is an open source natural language processing system for information extraction from electronic medical record clinical free text. Ruby Machine Learning https github. com JuliaStats Distance. html A suite of ML tools designed to be easy to imbed in other applications. prophet https facebookincubator. html sda Shrinkage Discriminant Analysis and CAT Score Variable Selection. com arunkumarramanan data science with r awesome tutorials Data Science and Machine Learning Cheetcheets https www. com sergey tihon Stanford. medley https www. It is written in Python and powered by the Caffe2 deep learning framework. net Eblearn is an object oriented C library that implements various machine learning models OpenCV http opencv. com NervanaSystems neon Nervana s high performance https github. com scalanlp breeze Breeze is a numerical processing library for Scala. com zenogantner PDL ML. It s written in C programming language and comes with Python programming language bindings. com kastnerkyle kaggle dogs vs cats Code for Kaggle Dogs vs. com kendricktan suiron Machine Learning for RC Cars. Wrapper for D3xterjs easily render charts in browser. com arunkumarramanan machine learning engineer s toolkit with roadmap Hands on ML with scikit learn and TensorFlow https www. com andersbll deeppy Deep Learning In Python. While the output layer values add 1 to one these do not reflect well calibrated measures of uncertainty. DyNet https github. edu hinton MatlabForSciencePaper. Factory Miner https www. com deepmind lab DeepMind Lab is a 3D learning environment based on id Software s Quake III Arena via ioquake3 and other open source software. GoNN https github. Ruffus http www. Natural Language Processing Stanford. MLKit https github. HDBScan https github. RusticSOM https github. CRFsuite http www. lbfgs https github. com NaturalNode natural General natural language facilities for node. com goml gobrain Neural Networks written in Go. kaggle insults https github. com glean glean A data management tool for humans. Feed the training data to the model in this example the train_images and train_labels arrays. com bensadeghi DecisionTree. BayesPy https github. org packages tm and quanteda https quanteda. unsupervised clustering outlier detection etc. html ROCR Visualizing the performance of scoring classifiers. Allen Downey s Think Complexity Code https github. jl Kernel density estimators for julia. neuropredict https github. org packages encog dotnet core An advanced neural network and machine learning framework. Knet https github. NET and also available precompiled as a NuGet package. org guide keras is the simplest way to build and train neural network models in TensorFlow. org pypi bllipparser Python bindings for the BLLIP Natural Language Parser also known as the Charniak Johnson parser. Awesome Machine Learning ML Frameworks and Classification of MNIST Dreams from MIT Deep Learning This kernel has a curated list of awesome machine learning frameworks libraries and software by language and Classification of MNIST Dreams with Convolutional Neural Networks from MIT Deep Learning. com mathieulaporte machine Simple machine learning algorithm. com clojurewerkz statistiker Basic Machine Learning algorithms in Clojure. com emilbayes clustering. com mljs ml Machine learning and numerical analysis tools for Node. University Edition https www. Kernel Density https github. com arunkumarramanan awesome computer vision resources to be updated Machine Learning and Deep Learning Awesome Tutorials https www. com lindahua Regression. com JuliaStats KernelDensity. com slycoder TopicModels. org web packages lasso2 index. Currently features Simple Linear Regression Polynomial Regression and Ridge Regression. html LiblineaR Linear Predictive Models Based On The Liblinear C C Library. Java Natural Language Processing Cortical. com sparklingpandas sparklingpandas Pandas on PySpark POPS. jl MCMC tools for Julia. org pod Paws MachineLearning a pluggable architecture for data and image processing which canbe used for machine learning https github. Surprise http surpriselib. jl Basic functions for clustering data k means dp means etc. com yandex rep an IPython based environment for conducting data driven research in a consistent and reproducible way. Several machine learning and artificial intelligence models are included in the AI https metacpan. cutorch https github. com fukatani rgf_python Python bindings for Regularized Greedy Forest Tree Library. Spider http people. com fulldecent 19 questions A machine learning bayesian inference assigning attributes to objects. scikit plot https github. cl libsvm https github. net An open source implementation of methods for multi label classification and evaluation extension to Weka. com clab dynet A dynamic neural network library working well with networks that have dynamic structures that change for every training instance. com dmlc xgboost Python bindings for eXtreme Gradient Boosting Tree Library. Stanford Temporal Tagger http nlp. com AllenDowney ThinkOS Text and supporting code for Think OS A Brief Introduction to Operating Systems. com neptune ml steppy Lightweight Python library for fast and reproducible machine learning experimentation. Elixir General Purpose Machine Learning Simple Bayes https github. yase https github. org web packages glmnet index. com transcranial keras js Run Keras models in the browser with GPU support provided by WebGL 2. com flennerhag mlens A high performance memory efficient maximally parallelized ensemble learning integrated with scikit learn. html randomForest Breiman and Cutler s random forests for classification and regression. com duanhongyi genius A Chinese segment base on Conditional Random Field. edu software tmt tmt 0. scikit learn http scikit learn. org web packages party index. com thoj go galib Genetic Algorithms library written in Go Golang. It is primarily intended for research in machine visual learning and deep reinforcement learning in particular. bioscala https github. rgenoud http cran. js Bayesian bandit implementation for Node and the browser. Golden TensorFlow https golden. org amCharts https www. Misc stdlib https github. ManifoldLearning https github. pytessarct https github. com kengz SLM Lab Modular Deep Reinforcement Learning framework in PyTorch. kalman https github. com topics deep learning License CC0 http mirrors. Timbl https languagemachines. SimpleCV http simplecv. Data Analysis Data Visualization numl http www. com dib lab 2012 paper diginorm A gallery of interesting IPython notebooks https github. html lasso2 L1 constrained estimation aka lasso. html hda Heteroscedastic Discriminant Analysis. Shogun https github. PyStanfordDependencies https github. html maptree Mapping pruning and graphing tree models. Natural Language Processing BLLIP Parser https github. com yandongliu learningjs Javascript implementation of logistic regression c4. com FusionCharts http www. Matlab Computer Vision Contourlets http www. pos tagging lemmatisation dependency parsing NER python zpar https github. com bigdatagenomics adam A genomics processing engine and specialized file format built using Apache Avro Apache Spark and Parquet. MCMC https github. com dmlc mxnet tree master perl package also released in CPAN https metacpan. html mvpart Multivariate partitioning. com padreati rapaio statistics data mining and machine learning toolbox in Java. Machine Learning Module https github. Paws MachineLearning https metacpan. GreatCircle https github. net projects raspell raspell is an interface binding for ruby. optim https github. SnowNLP https github. org A deep learning framework developed with cleanliness readability and speed in mind. org A probabilistic programming language implementing full Bayesian statistical inference with Hamiltonian Monte Carlo sampling. com tebeka snowball Snowball Stemmer for Go. com twitter algebird Abstract Algebra for Scala. Rosetta https github. com facebookresearch wav2letter a simple and efficient end to end Automatic Speech Recognition ASR system from Facebook AI Research. 68 on the training data. Pattern http www. shtml Tokenization of raw text is a standard pre processing step for many NLP tasks. com sepandhaghighi pycm PyCM is a multi class confusion matrix library written in Python that supports both input data vectors and direct matrix and a proper tool for post classification model evaluation that supports most classes and overall statistics parameters Dash https github. com MLWave kaggle_acquire valued shoppers challenge Code for the Kaggle acquire valued shoppers challenge. org is a C Data Sciences Toolkit that facilitates mining big text data. com IllinoisCogComp saul Flexible Declarative Learning Based Programming. Data Frames Meta https github. DL4CLJ https github. ROCAnalysis https github. pycascading https github. ml neptune ml Santander Value Prediction Challenge for Santander Value Prediction Challenge https www. html Multi algorithm ensemble learning packages. Crystal General Purpose Machine Learning machine https github. org web packages quantregForest index. Encog https github. com p cuda convnet This is a fast C CUDA implementation of convolutional DEEP LEARNING CXXNET https github. com aria42 infer Inference and machine learning in Clojure. org web packages grplasso index. jl A Julia package for fitting statistical mixed effects models. org Open source platform for distributed stream and batch data processing. Distributed Machine learning Tool Kit DMTK http www. Credits Reference Lex Fridman s MIT Deep Learning https github. WebDNN https github. com Microsoft CNTK The Computational Network Toolkit CNTK by Microsoft Research is a unified deep learning toolkit that describes neural networks as a series of computational steps via a directed graph. Datamaps http datamaps. com JohnLangford vowpal_wabbit wiki A fast out of core learning system. py Rendering beautiful SVG maps in Python. com aboSamoor polyglot Multilingual text NLP processing toolkit. shtml Stanford CoreNLP provides a set of natural language analysis tools which can take raw English language text input and give the base forms of words. com snipsco snips nlu Natural Language Understanding library for intent classification and entity extraction NeuroNER https github. cl online learning https github. com harthur org brain. com zygmuntz kaggle bestbuy_small Kaggle Dogs vs. com reiinakano scikit plot A visualization library for quick and easy generation of common plots in data analysis and machine learning. org A library for probabilistic modeling inference and criticism. be pattern A web mining module for the Python programming language. party http cran. com NathanEpstein Z3d Easily make interactive 3d plots built on Three. com apple turicreate Machine learning from Apple. com ericjang tdb TensorDebugger TDB is a visual debugger for deep learning. Deprecated https medium. com mnielsen neural networks and deep learning Code samples for my book Neural Networks and Deep Learning DEEP LEARNING. Optunity examples http optunity. org web packages bigrf index. com apache hadoop mapreduce Hadoop HDFS. com 01org daal A high performance software library developed by Intel and optimized for Intel s architectures. Data Analysis Data Visualization MLlib in Apache Spark http spark. com jesolem PCV Open source Python module for computer vision. com vollmerm fungp A genetic programming library for Clojure. Data Analysis Data Visualization go graph https github. html nnet Feed forward Neural Networks and Multinomial Log Linear Models. com projects ruby plot gnuplot wrapper for Ruby especially for plotting ROC curves into SVG files. com neptune ml open solution googleai object detection source code and experiments results https app. PyBrain https github. org web packages bmrm index. edu people karpathy convnetjs ConvNetJS is a Javascript library for training Deep Learning models DEEP LEARNING Clusterfck http harthur. python frog https github. com brian j smith Mamba. org pypi editdistance fast implementation of edit distance. com wrobstory vincent A Python to Vega translator. com johnmyleswhite ML_for_Hackers maptree http cran. liblinear java https github. jl Julia package for Regularized Discriminant Analysis. com cardmagic classifier A general classifier module to allow Bayesian and other types of classifications. html klaR Classification and visualization. com eriklindernoren ML From Scratch Implementations of Machine Learning models from scratch in Python with a focus on transparency. UEA Stemmer https github. PyNLPl https github. js A Natural Language Processor in JS. shtml Tregex is a utility for matching patterns in trees based on tree relationships and regular expression matches on nodes the name is short for tree regular expressions. I am open to have your feedback for improving this kernel Hope you enjoyed this kernel Thanks for visiting my Kernel and please UPVOTE to stay connected and follow up the further updates TensorFlow and tf. com dmlc xgboost A parallelized optimized general purpose gradient boosting library. com twitter summingbird Streaming MapReduce with Scalding and Storm. bigrf http cran. com daviddengcn go pr Pattern recognition package in Go lang. com kartograph kartograph. This project is under the Apache 2 license. jl Large scale Gaussian Mixture Models. dp https github. org Lua Numerical Algorithms https bitbucket. org A python visualization library based on matplotlib. html forecastHybrid Automatic ensemble and cross validation of ARIMA ETS STLM TBATS and neural network models from the forecast package. Datumbox https github. com sjwhitworth golearn Machine Learning for Go. com fukuball fuku ml Simple machine learning library including Perceptron Regression Support Vector Machine Decision Tree and more it s easy to use and easy to learn for beginners. Awesome CoreML https github. org r binding to igraph library General purpose graph library. com p practical xgboost in python comprehensive online course about using XGBoost in Python. com onyx platform onyx Distributed masterless high performance fault tolerant data processing. Textbox https godoc. com melisgl mgl gpr Evolutionary algorithms. com pyqtgraph pyqtgraph A pure python graphics and GUI library built on PyQt4 PySide and NumPy. Often the network is overly confident about the top choice that does not reflect a learned measure of probability. shtml A natural language parser is a program that works out the grammatical structure of sentences. datakit https github. org software crfsuite CRFsuite is an implementation of Conditional Random Fields CRFs for labeling sequential data. org projects Linguistics Linguistics is a framework for building linguistic utilities for Ruby objects in any language. com johnmyleswhite TextAnalysis. BPN NeuralNetwork https github. python ucto https github. org web packages Boruta index. com sassoftware enlighten apply Example code and materials that illustrate applications of SAS machine learning techniques. ch cephes https github. com mil tokyo List of several machine learning libraries. com kevincobain2000 listof Community based data collection packed in gem. com highcharter and several others. html relaxo Relaxed Lasso. io MLPleaseHelp https jgreenemi. html Distributed machine learning library in Spark Hydrosphere Mist https github. TPOT https github. org A library providing high performance easy to use data structures and data analysis tools. leaf https github. com h2oai sparkling water H2O and Spark interoperability. com jinyeom neat Plug and play parallel Go framework for NeuroEvolution of Augmenting Topologies NEAT. com cazala synaptic Architecture free neural network library for Node. Image to Image Translation with Conditional Adversarial Networks https github. It is easy to install well documented and supports CPU and GPU even multi GPU computation. Vowpal Wabbit VW https github. wav2letter https github. It is able to explain any black box classifier with two or more classes. edu A Java based package for statistical natural language processing document classification clustering topic modeling information extraction and other machine learning applications to text. org A Python package for Korean natural language processing. com Microsoft CNTK Microsoft Cognitive Toolkit CNTK an open source deep learning toolkit. Impala https github. com nathanepstein dora Tools for exploratory data analysis in Python. com omphalos bayesian bandit. com apache incubator systemml flexible scalable machine learning ML language. html Training a deep autoencoder or a classifieron MNIST digits DEEP LEARNING. NET to solve many different kinds of machine learning problems from standard problems like classification recommendation or clustering through to customised solutions to domain specific problems. com proycon pynlpl Python Natural Language Processing Library. com beniz deepdetect A machine learning API and server written in C 11. pyhsmm https github. Machine Learning For Hackers https github. com D3xterjs pydexter Simple plotting for Python. xLearn https github. com zuhao plotrb A plotting library in Ruby built on top of Vega and D3. You can use this search engine right now at https jgreenemi. plotly https plot. io python course Course for Python programming for the Humanities assuming no prior knowledge. html t Distributed Stochastic Neighbor Embedding t SNE is a prize winning technique for dimensionality reduction that is particularly well suited for the visualization of high dimensional datasets. PigPen https github. Awesome Machine Learning ML Frameworks Table of Contents Frameworks and Libraries APL apl General Purpose Machine Learning apl general purpose C c General Purpose Machine Learning c general purpose Computer Vision c cv C cpp Computer Vision cpp cv General Purpose Machine Learning cpp general purpose Natural Language Processing cpp nlp Speech Recognition speech recognition 1 Sequence Analysis cpp sequence Gesture Recognition cpp gestures Common Lisp common lisp General Purpose Machine Learning common lisp general purpose Clojure clojure Natural Language Processing clojure nlp General Purpose Machine Learning clojure general purpose Data Analysis Data Visualization clojure data analysis Crystal crystal General Purpose Machine Learning crystal general purpose Elixir elixir General Purpose Machine Learning elixir general purpose Natural Language Processing elixir nlp Erlang erlang General Purpose Machine Learning erlang general purpose Go go Natural Language Processing go nlp General Purpose Machine Learning go general purpose Data Analysis Data Visualization go data analysis Facial Detection and Recognition go facial recognition Image Classification go image classification Haskell haskell General Purpose Machine Learning haskell general purpose Java java Natural Language Processing java nlp General Purpose Machine Learning java general purpose Speech Recognition java speech recognition Data Analysis Data Visualization java data analysis Deep Learning java deep learning Javascript javascript Natural Language Processing javascript nlp Data Analysis Data Visualization javascript data analysis General Purpose Machine Learning javascript general purpose Misc javascript misc Demos and Scripts javascript demos Julia julia General Purpose Machine Learning julia general purpose Natural Language Processing julia nlp Data Analysis Data Visualization julia data analysis Misc Stuff Presentations julia misc Lua lua General Purpose Machine Learning lua general purpose Demos and Scripts lua demos Matlab matlab Computer Vision matlab cv Natural Language Processing matlab nlp General Purpose Machine Learning matlab general purpose Data Analysis Data Visualization matlab data analysis. com facebookresearch Detectron FAIR s software system that implements state of the art object detection algorithms including Mask R CNN. CRF https taku910. org web packages relaxo index. com c data science bowl 2018. CogcompNLP https github. com machinebox sdk go facebox Facial detection and recognition SDK with one shot teaching from Machine Box Image Classification Tagbox https godoc. PyCM https github. org A Python Framework for Wind Energy Analysis and Prediction. Make predictionsWith the model trained we can use it to make predictions about some images. This model reaches an accuracy of about 98. partykit http cran. Turi Create https github. org web packages mlr index. Demos and Scripts ML_Tables https github. 19 Questions https github. com ynqa word embedding Word Embeddings the full implementation of word2vec GloVe in Go. Figaro https github. sentences https github. jl Julia artificial neural networks. com JuliaStats DataArrays. com framework Open source C framework for developers and researchers in the fields of Computer Vision and Artificial Intelligence. This package is part of the Accord. This is aimed at absorbing the much of the ML workflow unlike other packages like nilearn and pymvpa which require you to learn their API and code to produce anything useful. PyDexter https github. It provides all the functionalities needed to deal with big data processing statistical analysis visualization and storage. com forums f 15 kaggle forum t 3661 medley a new r package for blending regression models forumMessageId 21278 medley Blending regression models using a greedy stepwise approach. The labels are an array of integers ranging from 0 to 9. com zygmuntz kaggle accelerometer Code for Accelerometer Biometric Competition at Kaggle. org 2011 papers 34 SVGo_a_Go_Library_for_SVG_generation The Go Language library for SVG generation. Infer https github. Sampling https github. com deeplearning4j deeplearning4j Scalable deep learning for industry with parallel GPUs. com kevincobain2000 jProcessing Kanji Hiragana Katakana to Romaji Converter. com en_us software factory miner. edu software patternslearning. com ealdent uea stemmer Ruby port of UEALite Stemmer a conservative stemmer for search and indexing. uk Computation Pipeline library for python. html penalizedLDA Penalized classification using Fisher s linear discriminant. Clever Algorithms For Machine Learning https github. WebDNN uses next generation JavaScript API WebGPU for GPU execution and WebAssembly for CPU execution. nngraph https github. io timbl A software package C library implementing several memory based learning algorithms among which IB1 IG an implementation of k nearest neighbor classification and IGTree a decision tree approximation of IB1 IG. The images are 28x28 NumPy arrays with pixel values ranging between 0 and 255. Machine Learning in MatLab Octave https github. com jeff1evesque machine learning web interface and set of programmatic interface https github. com Microsoft CNTK and Theano https github. Allen Downey s Data Science Course https github. Featuretools https github. Includes support for NLP XGBoost CatBoost LightGBM and soon deep learning. go mxnet predictor https github. grpreg http cran. com NilStack awesome CoreML models A curated list of pretrained CoreML models. com JasperSnoek spearmint Spearmint is a package to perform Bayesian optimization according to the algorithms outlined in the paper Practical Bayesian Optimization of Machine Learning Algorithms. org web packages nnet index. Emgu CV http www. RDataSets https github. skflow https github. com lmcinnes hdbscan implementation of the hdbscan algorithm in Python used for clustering visualize_ML https github. net Neuroph is lightweight Java neural network framework ORYX https github. org web packages bigRR index. com discoproject disco Map Reduce in Erlang. com neurosnap sentences Golang implementation of Punkt sentence tokenizer. com matlabcentral fileexchange 24134 gaimc graph algorithms in matlab code Efficient pure Matlab implementations of graph algorithms to complement MatlabBGL s mex functions. NET Numerics http www. io dygraphs highcharter http jkunst. Conjecture https github. frog https github. nnx https github. com htm community comportex Functionally composable Machine Learning library using Numenta s Cortical Learning Algorithm. com clementfarabet lbfgs FFI Wrapper for liblbfgs. io Customizable SVG map geo visualizations using D3. com ClimbsRocks machineJS Automated machine learning data formatting ensembling and hyperparameter optimization for competitions and exploration just give it a. Numeric Lua http numlua. com en_us software university edition. breze https github. For a list of free to attend meetups and local events go here https github. com jwkvam bowtie A dashboard library for interactive visualizations using flask socketio and react. SuperLearner https github. com D3xter https github. group lasso https github. Fungp https github. html bst Gradient Boosting. org web packages svmpath index. com neptune ml open solution value prediction source code and experiments results https app. com rosejn torch datasets Scripts to load several popular datasets including BSR 500 CIFAR 10 COIL Street View House Numbers MNIST NORB Atari2600 https github. com rigtorp statkit Statistics kit for JavaScript. com Microsoft LightGBM Microsoft s fast distributed high performance gradient boosting GBDT GBRT GBM or MART framework based on decision tree algorithms used for ranking classification and many other machine learning tasks. It is built on top of the Apple s Accelerate Framework using vectorized operations and hardware acceleration if available. emel https github. RNNs LSTMs GRUs BRNNs BLSTMs etc. html caretEnsemble Framework for fitting multiple caret models as well as creating ensembles of such models. com pjreddie darknet Darknet is an open source neural network framework written in C and CUDA. com fxsjy gonn GoNN is an implementation of Neural Network in Go Language which includes BPNN RBF PCN. com archive p sofia ml Suite of fast incremental algorithms. html bigRR Generalized Ridge Regression with special advantage for p n cases. keras Commonly used modules Images plots display and visualization Set common constants reshape images to specify that it s a single channel should work for both a single image and multiple images make sure images are 28x28 and single channel grayscale 32 convolution filters used each of size 3x3 64 convolution filters used each of size 3x3 choose the best features via pooling randomly turn neurons on and off to improve convergence flatten since too many dimensions we only want a classification output fully connected to get all relevant data one more dropout output a softmax to squash the matrix into output probabilities download the video if running in Colab counter for debugging mostly 0 indexed go through all the frames and run our classifier on the high res MNIST images as they morph from number to number should 481 frames should be a square preprocess the image for prediction inverse since training dataset is white text with black background expand dimension to specify batch size of 1 expand dimension to specify number of channels if you don t want to save the output as a video set this to False 15 fps above doesn t work robustly so we right frame twice at 30 fps scale down image for display. DataMelt http jwork. jl Read files from Stata SAS and SPSS. Inspired by the original Python version. Crab https github. It could be used in data mining and image compression. com en_us software analytics stat. com LanguageMachines frog Memory based NLP suite developed for Dutch PoS tagger lemmatiser dependency parser NER shallow parser morphological analyzer. shtml A tokenizer divides text into a sequence of tokens which roughly correspond to words. Stanford POS Tagger http nlp. com sta ger HalfBeer Beer glass classifier created with Synaptic https github. org publicdomain zero 1. Stanford Name Entity Recognizer http nlp. com rlidwka node fann FANN Fast Artificial Neural Network Library bindings for Node. com featuretools featuretools A library for automated feature engineering. H2O Sparkling Water https github. python timbl https github. gobrain https github. html ipred Improved Predictors. Optunity is written in Python but interfaces seamlessly with MATLAB. com blaze blaze NumPy and Pandas interface to Big Data. com JuliaStats DimensionalityReduction. com EducationalTestingService python zpar Python bindings for ZPar https github. jl Julia package for loading many of the data sets available in R. Samoa https samoa. org web packages gamboostLSS index. Kaggle Galaxy Challenge https github. com soumith galaxyzoo Music Tagging https github. com donnemartin data science ipython notebooks Continually updated Data Science Python Notebooks Spark Hadoop MapReduce HDFS AWS Kaggle scikit learn matplotlib pandas NumPy SciPy and various command lines. html FREE Includes all SAS packages necessary for data analysis and visualization and includes online SAS courses. com albu albumentations А fast and framework agnostic image augmentation library that implements a diverse set of augmentation techniques. org web packages penalizedSVM index. com prodicus spammy A library for email Spam filtering built on top of nltk loso https github. DeepLearningKit http deeplearningkit. html biglasso Extending Lasso Model Fitting to Big Data in R. html randomForestSRC Random Forests for Survival Regression and Classification RF SRC. org web packages tree index. com nikolaypavlov MLPNeuralNet Fast multilayer perceptron neural network library for iOS and Mac OS X. Encog trains using multithreaded resilient propagation. Bayesian Methods for Hackers https github. hebel https github. html Text mining using a GUI or code in an MPP environment including Hadoop. html kernlab Kernel based Machine Learning Lab. Lasagne https github. html RXshrink Maximum Likelihood Shrinkage via Generalized Ridge or Least Angle Regression. Encog can also make use of a GPU to further speed processing time. com c google ai open images object detection track. com molcik python neuron Neuron is simple class for time series predictions. TensorFlow https github. jl A Julia framework for probabilistic graphical models. 19 This is in part due to successful regularization accomplished with the Dropout layers. For a list of blogs on data science and machine learning go here https github. com fukuball jieba php Chinese Words Segmentation Utilities. shtml Learning entities from unlabeled text starting with seed sets using patterns in an iterative fashion. org SAMOA is a framework that includes distributed machine learning for data streams with an interface to plug in different stream processing platforms. com tensorflow tensorflow CNTK https github. wine quality https github. html partykit A Toolkit for Recursive Partytioning. com NathanEpstein D3xter Straight forward plotting built on D3. com simpleai team simpleai Python implementation of many of the artificial intelligence algorithms described on the book Artificial Intelligence a Modern Approach. The project started at the Center for Computational Language and EducAtion Research and is currently developed by the Center for Language and Information Research at Emory University. com GHamrouni Recommender A C library for product recommendations suggestions using collaborative filtering CF. jl Koç University Deep Learning Framework. org customizable library based on D3. com marcoscoffier lua sfm A bundle adjustment structure from motion package. deap https github. com pybrain pybrain Another Python Machine Learning Library. astroML http www. com machinalis quepy A python framework to transform natural language questions to queries in a database query language. org web packages evtree index. io folia MeTA https github. com titsuki p6 Algorithm NaiveBayes Data Analysis Data Visualization Perl Data Language https metacpan. com Franck Dernoncourt NeuroNER Named entity recognition using neural networks providing state of the art results General Purpose Machine Learning steppy https github. org web packages bst index. com 2Fen us 2Fprojects 2Fsho 2F Sho is an interactive environment for data analysis and scientific computing that lets you seamlessly connect scripts in IronPython with compiled code in. html mboost Model Based Boosting. html RSNNS Neural Networks in R using the Stuttgart Neural Network Simulator SNNS. html quantregForest Quantile Regression Forests. com luccastera shaman Node. com etsy Conjecture Scalable Machine Learning in Scalding. com gianlucabertani MAChineLearning An Objective C multilayer perceptron library with full support for training through backpropagation. com en_us software analytics sentiment analysis. Gaussian Mixture Model https github. com ukoethe vigra VIGRA is a generic cross platform C computer vision and machine learning library for volumes of arbitrary dimensionality with Python bindings. Learn JS Data http learnjsdata. In our case the accuracy is better at 99. edu software classifier. NET net Computer Vision net cv Natural Language Processing net nlp General Purpose Machine Learning net general purpose Data Analysis Data Visualization net data analysis Objective C objectivec General Purpose Machine Learning objectivec general purpose OCaml ocaml General Purpose Machine Learning ocaml general purpose Perl perl Data Analysis Data Visualization perl data General Purpose Machine Learning perl ml Perl 6 perl6 PHP php Natural Language Processing php nlp General Purpose Machine Learning php general purpose Python python Computer Vision python cv Natural Language Processing python nlp General Purpose Machine Learning python general purpose Data Analysis Data Visualization python data analysis Misc Scripts iPython Notebooks Codebases python misc Kaggle Competition Source Code python kaggle Neural Networks python neural networks Reinforcement Learning python reinforcement learning Ruby ruby Natural Language Processing ruby nlp General Purpose Machine Learning ruby general purpose Data Analysis Data Visualization ruby data analysis Misc ruby misc Rust rust General Purpose Machine Learning rust general purpose R r General Purpose Machine Learning r general purpose Data Analysis Data Visualization r data analysis SAS sas General Purpose Machine Learning sas general purpose Data Analysis Data Visualization sas data analysis High Performance Machine Learning MPP sas mpp Natural Language Processing sas nlp 写个脚本把它们爬下来 Demos and Scripts sas demos Scala scala Natural Language Processing scala nlp Data Analysis Data Visualization scala data analysis General Purpose Machine Learning scala general purpose Swift swift General Purpose Machine Learning swift general purpose TensorFlow tensor General Purpose Machine Learning tensor general purpose Tools Misc tools misc Credits credits APL General Purpose Machine Learning naive apl https github. html elasticnet Elastic Net for Sparse Estimation and Sparse PCA. com nathanepstein datakit A lightweight framework for data analysis in JavaScript science. com Nivo http nivo. edu software lex parser. MachineLearning Support Vector Machines Decision Trees Naive Bayesian models K means Gaussian Mixture models and general algorithms such as Ransac Cross validation and Grid Search for machine learning applications. com josephmisiti awesome machine learning GitHub Awesome Lists Topic https github. com melisgl mgl Neural networks boltzmann machines feed forward and recurrent nets Gaussian Processes. com mil tokyo webdnn Fast Deep Neural Network Javascript Framework. com neptune ml open solution salt identification source code and experiments results https app. com machinebox sdk go textbox Natural language processing SDK from Machine Box go ngram https github. com JuliaGraphs LightGraphs. org JavaScript library dedicated to graph drawing. Decision Trees https github. com dakrone clojure opennlp Natural Language Processing in Clojure opennlp. Misc Stuff Presentations DSP https github. Local Regression https github. com openai roboschool Open source software for robot simulation integrated with OpenAI Gym. com compressed BackpropNeuralNet. com alonsovidales go_ml Linear Logistic regression Neural Networks Collaborative Filtering and Gaussian Multivariate Distribution. varSelRF http cran. pgmpy https github. org web packages klaR index. Merlin https github. DEEP LEARNING Restricted Boltzmann Machines https github. jl Hypothesis tests for Julia. Quepy https github. com torch nn Neural Network package for Torch. YAlign https github. com deepmind torch randomkit Numpy s randomkit wrapped for Torch. gif The above shows the prediction of the network by choosing the neuron with the highest output. com mrdimosthenis emel A simple and functional machine learning library written in Elixir. org projects flink flink docs master apis batch libs ml index. Saul https github. com clementfarabet manifold A package to manipulate manifolds. Sentence Similarity between two JP Sentences. LKYDeepNN https github. com Theano Theano Optimizing GPU meta programming code generating array oriented optimizing math compiler in Python. Gaussian Processes https github. cerebro2 https github. com cloudkj lambda ml Simple concise implementations of machine learning techniques and utilities in Clojure. It features interactive node by node debugging and visualization for TensorFlow. NMF https github. com denissimon prediction builder A library for machine learning that builds predictions using a linear regression. org web packages LogicReg index. t Distributed Stochastic Neighbor Embedding http homepage. Vigranumpy https github. com archive p opencvdotnet A wrapper for the OpenCV project to be used with. com alexgutteridge rsruby Ruby R bridge. shark http image. Kaggle Competition Source Code open solution home credit https github. org Machine Learning and Data Mining for Astronomy. Data Analysis Data Visualization Flink http flink. com sevamoo SOMPY Self Organizing Map written in Python Uses neural networks for data analysis. io modAL A modular active learning framework for Python built on top of scikit learn. com mizoR machine learning ruby jRuby Mahout https github. thinking bayes https github. com omimo xRBM A library for Restricted Boltzmann Machine RBM and its conditional variants in Tensorflow. C Computer Vision DLib http dlib. edu minhdo software contourlet_toolbox. Written in C with bindings in Python. kaggle cifar https github. Gesture Detection grt https github. org web packages elasticnet index. com marcoscoffier torch saliency code and tools around integral images. General Purpose Machine Learning aerosolve https github. Some components are also available for Java and Android. kaggle blackbox https github. net Lunatic Python http labix. MLDB https mldb. html CORElearn Classification regression feature evaluation and ordinal evaluation. html A beautiful graphing toolkit for Ruby. com mit nlp MITIE C C and Python tools for named entity recognition and relation extraction ucto https github. rasa_nlu https github. RXshrink http cran. com antoniogarrote clj ml A machine learning library for Clojure built on top of Weka and friends. csv file mil tokyo https github. kaggle amazon https github. com asafschers random_forester Creates Random Forest classifiers from PMML files. PyTorchCV https github. shaman https github. caretEnsemble http cran. Synaptic https github. html Rmalschains Continuous Optimization using Memetic Algorithms with Local Search Chains MA LS Chains in R. Gadfly https github. cunn https github. html pamr Pam prediction analysis for microarrays. com lindahua Sampling. SwiftLearner https github. com PerfectlySoft Perfect TensorFlow Swift Language Bindings of TensorFlow. com neptune ml open solution toxic comments source code for Toxic Comment Classification Challenge https www. Perl 6 Support Vector Machines https github. html bmrm Bundle Methods for Regularized Risk Minimization Package. org web packages grpreg index. Corresponding dataset s are stored into a SQL database then generated model s used for prediction s are stored into a NoSQL datastore. fuku ml https github. Introduces very simple interface that enables clean machine learning pipeline design. fex https github. NuPIC Studio https github. com JuliaCon presentations Presentations for JuliaCon. com lspector Clojush The Push programming language and the PushGP genetic programming system implemented in Clojure. com pgmpy pgmpy A python library for working with Probabilistic Graphical Models. com c tgs salt identification challenge. com proycon python timbl A Python extension module wrapping the full TiMBL C programming interface. com liuliu ccv C based Cached Core Computer Vision Library A Modern Computer Vision Library. com arunkumarramanan awesome machine learning ml frameworks Classification of MNIST Dreams with Convolutional Neural Networks from MIT Deep Learning Let s build a convolutional neural network CNN classifier to classify images of handwritten digits in the MNIST dataset with a twist where we test our classifier on high resolution hand written digits from outside the dataset. Jasper Snoek Hugo Larochelle and Ryan P. SVM Explorer https github. com benhamner MachineLearning. Simple MCMC https github. com Lasagne Lasagne Lightweight library to build and train neural networks in Theano. com louismullie treat Text REtrieval and Annotation Toolkit definitely the most comprehensive toolkit I ve encountered so far for Ruby. com NervanaSystems coach Reinforcement Learning Coach by Intel AI Lab enables easy experimentation with state of the art Reinforcement Learning algorithms Ruby Natural Language Processing Awesome NLP with Ruby https github. Facial Detection and Recognition Facebox https godoc. statkit https github. Also contains some specific modules for parsing common NLP formats most notably for FoLiA http proycon. vispy https github. io listof Rust General Purpose Machine Learning deeplearn rs https github. org web packages e1071 index. com clementfarabet lua opengm OpenGM is a C library for graphical modeling and inference. com arunkumarramanan tensorflow tutorial and examples Data Scientist s Toolkits Awesome Data Science Resources https www. org pod AI NaiveBayes. Stanford Phrasal A Phrase Based Translation System http nlp. For both researchers and hobbyists. com topics awesome GitHub Deep Learning Topic https github. html GMMBoost Likelihood based Boosting for Generalized mixed models. Commonly used for NLP. html frbs Fuzzy Rule based Systems for Classification and Regression Tasks. VLFeat http www. SmileMiner https github. com amueller introduction_to_ml_with_python Notebooks and code for the book Introduction to Machine Learning with Python Pydata book https github. com jamesturk jellyfish a python library for doing approximate and phonetic matching of strings. com A scikit for building and analyzing recommender systems. ClearNLP https github. textacy https github. Python Computer Vision Scikit Image https github. mlpack http www. Common Lisp General Purpose Machine Learning mgl https github. These are added during the model s compile step Loss function measures how accurate the model is during training we want to minimize this with the optimizer. jl Digital Signal Processing filtering periodograms spectrograms window functions. gif AcknowledgementsThe contents of this tutorial is based on and inspired by the work of TensorFlow team https www. html rgp R genetic programming framework. go Random forests implementation in Go. js chartjs http www. php Main Convolutional RecursiveDeepLearningFor3DObjectClassification Convolutional Recursive Deep Learning for 3D Object Classification DEEP LEARNING. Pandas http pandas. org Platform for data visualization and analysis using the visualizer https github. com lexfridman mit deep learning Joseph Misiti https github. com wooorm retext Extensible system for analyzing and manipulating natural language. Half Beer https github. jl Julia Machine Learning library. KRHebbian Algorithm https github. com raamana neuropredict Aimed at novice machine learners and non expert programmers this package offers easy no coding needed and comprehensive machine learning evaluation and full report of predictive performance WITHOUT requiring you to code in Python for NeuroImaging and any other type of features. forecastHybrid http cran. jl An image library for Julia. html RWeka R Weka interface. LightGBM https github. io folia but also ARPA language models Moses phrasetables GIZA alignments. com r0man inflections clj Rails like inflection library for Clojure and ClojureScript. js and the Browser ml5 https github. LightGraphs https github. com JuliaStats TimeSeries. org web packages penalized index. com WalnutiQ wAlnut object oriented model of the human brain. com scikit image scikit image A collection of algorithms for image processing in Python. LBJava https github. open solution googleai object detection https github. JuliaCon Presentations https github. Aims to showcase the nuts and bolts of ML in an accessible way. com apache spark Spark is a fast and general engine for large scale data processing. com is the basis for truly interactive displays and dashboards in R. com tensorflow tensorflow Open source software library for numerical computation using data flow graphs. Twitter Text Java https github. imgraph https github. Text Analysis https github. Multi Perceptron NeuralNetwork https github. PyQtGraph https github. io openface Free and open source face recognition with deep neural networks. com c santander value prediction challenge. org projects Ruby WordNet This library is a Ruby interface to WordNet. Reinforcement Learning DeepMind Lab https github. mlxtend https github. com titsuki p6 Algorithm LibSVM Naïve Bayes https github. com NVIDIA DIGITS The Deep Learning GPU Training System DIGITS is a web application for training deep learning models. Pattern Recognition Toolbox https github. jl GLMNet https github. com fredwu stemmer An English Porter2 stemming implementation in Elixir. FlinkML in Apache Flink https ci. BioPy https github. colibri core https github. simple statistics https github. General Purpose Machine Learning Training a deep autoencoder or a classifieron MNIST digits http www. AI is a game agent framework that allows you to turn any video game you own into a sandbox to develop AI and machine learning experiments. Dimensionality Reduction https github. Shearlets http www. com pfnet chainer Flexible neural network framework. com picnicml doddle model An in memory machine learning library built on top of Breeze. html Cubist Rule and Instance Based Regression Modeling. com AtheMathmo rusty machine a pure rust machine learning library. com dfm emcee The Python ensemble sampling toolkit for affine invariant MCMC. Note that there s tf. com pytorch pytorch Tensors and Dynamic neural networks in Python with strong GPU acceleration ML From Scratch https github. shtml Stanford NER is a Java implementation of a Named Entity Recognizer. sylvester https github. com factorie factorie FACTORIE is a toolkit for deployable probabilistic modeling implemented as a software library in Scala. Numerics Numerical foundation of the Math. dpnn https github. pygal http pygal. js Brain https github. io en latest A library dedicated to automated hyperparameter optimization with a simple lightweight API to facilitate drop in replacement of grid search. com jeff1evesque machine learning programmatic interface API for support vector machines. zipline https github. com sassoftware dm flow Library of SAS Enterprise Miner process flow diagrams to help you learn by example about specific data mining topics. ly r dygraphs http rstudio. Blaze https github. com jvns pandas cookbook Recipes for using Python s pandas library. DynaML https github. PredictionIO https github. org presskit buttons 88x31 svg cc zero. com jrosebr1 imutils A library containg Convenience functions to make basic image processing operations such as translation rotation resizing skeletonization and displaying Matplotlib images easier with OpenCV and Python. com denissimon prediction builder swift A library for machine learning that builds predictions using a linear regression. kaggle accelerometer https github. org web packages penalizedLDA index. com Rookii paicehusk Golang implementation of the Paice Husk Stemming Algorithm. vowpalwabbit https github. com apache mahout Distributed machine learning. MLPNeuralNet predicts new examples by trained neural network. General Purpose Machine Learning Accord Framework http accord framework. com clips pattern Web mining module for Python. html ElemStatLearn Data sets functions and examples from the book The Elements of Statistical Learning Data Mining Inference and Prediction by Trevor Hastie Robert Tibshirani and Jerome Friedman Prediction by Trevor Hastie Robert Tibshirani and Jerome Friedman. Enables training models on large data sets across multiple machines. Stemmer https github. de spider The spider is intended to be a complete object orientated environment for machine learning in Matlab. Cogitare https github. jProcessing https github. jl Julia module for Distance evaluation. com serendipious nodejs decision tree id3 NodeJS Implementation of Decision Tree using ID3 Algorithm. It emphasizes flexibility through the elegant use of object oriented design patterns. com mbhenaff MusicTagging Music Tagging scripts for torch7. milk https github. org web packages forecast index. Retro https github. jl Metaprogramming tools for DataFrames. school Creating statically typed dynamic neural networks from object oriented functional programming constructs. Gym https github. Boruta http cran. MLBase https github. General Purpose Machine Learning eaopt https github. org web packages RoughSets index. Low dependency native traditional chinese document. doddle model https github. Computer Vision CCV https github. com bioscala bioscala Bioinformatics for the Scala programming language BIDMach https github. com ocelma python recsys A Python library for implementing a Recommender System. org web packages GAMBoost index. Provides SIFT and dSIFT modules. com JuliaStats DataFramesMeta. io s http cortical. RoughSets http cran. org web packages GMMBoost index. Optimizer how the model is updated based on the data it sees and its loss function. xerial https github. com zygmuntz kaggle amazon Amazon access control challenge. SystemML https github. io leaflet for interactive maps tm https www. spammy https github. Regression https github. html forecast Timeseries forecasting using ARIMA ETS STLM TBATS and neural network models. stitch https github. ml neptune ml Salt Detection for TGS Salt Identification Challenge https www. php Main_Page Cross platform wrapper of OpenCV which can be compiled in Mono to be run on Windows Linus Mac OS X iOS and Android. html Add structure to unstructured text using a GUI. org A fundamental package for scientific computing with Python. Node fann https github. go ml https github. html RoughSets Data Analysis Using Rough Set and Fuzzy Rough Set Theories. Pattern Recognition and Machine Learning https github. Lyric https github. High Performance Text Mining https www. rminer http cran. com isnowfy snownlp A library for processing Chinese text. NuPIC https github. yahmm https github. Hybrid Recommender System https github. It makes state of the art machine learning easy to work with and integrate into existing applications. word embedding https github. Natural Language Processing Contextual Analysis https www. NET was originally developed in Microsoft Research and evolved into a significant framework over the last decade and is used across many product groups in Microsoft like Windows Bing PowerPoint Excel and more. Allen Downey s Think OS Code https github. com openai gym OpenAI Gym is a toolkit for developing and comparing reinforcement learning algorithms. forecast http cran. jl Crafty statistical graphics for Julia. com keras team keras High level neural networks frontend for TensorFlow https github. com bokeh bokeh Interactive Web Plotting for Python. org Storm is a distributed realtime computation system. jl Flexible Deep Learning Framework in Julia. com hammer wikichallenge An implementation of Dell Zhang s solution to Wikipedia s Participation Challenge on Kaggle. com neptune ml open solution data science bowl 2018 source code and experiments results https app. html e1071 Misc Functions of the Department of Statistics e1071 TU Wien earth http cran. org web packages randomForest index. org web packages rminer index. com marcotcr lime Lime is about explaining what machine learning classifiers or models are doing. tw cjlin libsvm matlab A Library for Support Vector Machines. Stanford SPIED http nlp. com Kalvar ios Multi Perceptron NeuralNetwork it implemented multi perceptrons neural network ニューラルネットワーク based on Back Propagation Neural Network BPN and designed unlimited hidden layers. Library provides algorithmic building blocks for all stages of data analytics and allows to process data in batch online and distributed modes. shtml Stanford Phrasal is a state of the art statistical phrase based machine translation system written in Java. Speech Recognition CMU Sphinx http cmusphinx. rnn https github. KoNLPy http konlpy. html penalized L1 lasso and fused lasso and L2 ridge penalized estimation in GLMs and in the Cox model. Using native TensorFlow models on both macOS Linux. Practical XGBoost in Python http education. SOMPY https github. com clementfarabet lua imgraph An image graph library for Torch. svm https github. ch torch signal signal A signal processing toolbox for Torch 7. Dive into Machine Learning with Python Jupyter notebook and scikit learn https github. It makes ML projects reproducible and shareable. d3py https github. However some measure of interactivity can be achieved with htmlwidgets https www. com zygmuntz kaggle gender A Kaggle competition discriminate gender based on handwriting. Twitter text rb https github. It has advantage on large dataset and multi threaded training. Bowtie https github. org web packages earth index. com zueve neurolab https github. jl A Julia package for probability distributions and associated functions. cl random forest https github. Data Analysis Data Visualization Graph Layout https github. com all umass metric learn A Python module for metric learning. org A community Python library for Astronomy. org web packages forecastHybrid index. Random Forester https github. com fredwu simple_bayes A Simple Bayes Naive Bayes implementation in Elixir. GPR http mmottl. If this is your style join me in getting a bit ahead of yourself. ggplot https github. High Performance Machine Learning High Performance Data Mining https www. Demos and Scripts The Bot https github. com nicholas leonard dp A deep learning library designed for streamlining research and development using the Torch7 distribution. org web packages oblique. Flink http flink. emcee https github. Build the modelBuilding the neural network requires configuring the layers of the model then compiling the model. com NathanEpstein kNear JavaScript implementation of the k nearest neighbors algorithm for supervised learning. com lukapopijac gaussian mixture model Unsupervised machine learning with multivariate Gaussian mixture model. com arunkumarramanan awesome deep learning resources Data Science with R Awesome Tutorials https www. relaxo http cran. com sympy sympy A Python library for symbolic mathematics. com RapidMiner integration into Java code. js library with support for both simple and multiple linear regression. com stripe brushfire Distributed decision tree ensemble learning in Scala. shtml A Part Of Speech Tagger POS Tagger. General Purpose Machine Learning PHP ML https github. jieba https github. com arunkumarramanan data science and machine learning cheatsheets Awesome Data Science for Beginners with Titanic Exploration https kaggle. com sinhrks ggfortify Unified interface to ggplot2 popular R packages. autograd https github. com products create docs A library with various machine learning models regression clustering recommender systems graph analytics etc. org see their Colab notebooks https www. You don t have to be a machine learning expert to add recommendations object detection image classification image similarity or activity classification to your app. com h2oai h2o 3 ML engine that supports distributed learning on Hadoop Spark or your laptop via APIs in R Python Scala REST JSON. com soumith convnet benchmarks Python based Deep Learning framework DEEP LEARNING. org A Python 2D plotting library. steppy toolkit https github. com tensorflow skflow Simplified interface for TensorFlow mimicking Scikit Learn. mvpart http cran. DN2A https github. SAS General Purpose Machine Learning Visual Data Mining and Machine Learning https www. unsup https github. s0a3uy4cc RustNN https github. Spark Notebook http spark notebook. OCaml General Purpose Machine Learning Oml https github. e1071 http cran. com jbrukh bayesian Naive Bayesian Classification for Golang. MachineLearning http www. com nfoti JuliaData library for working with tabular data in Julia. com AmazaspShumik sklearn bayes Python package for Bayesian Machine Learning with scikit learn API. net Open Source Toolkit For Speech Recognition purely based on Java speech recognition library. Neuroph http neuroph. CardMagic Classifier https github. edu software tokenizer. edu software segmenter. com dedupeio dedupe A python library for accurate and scalable fuzzy matching record deduplication and entity resolution. Current tools bundled with it include LightLDA and Distributed Multisense Word Embedding. TFLearn https github. jl Data structures that allow missing values. com antinucleon cxxnet Yet another deep learning framework with less than 1000 lines core code DEEP LEARNING DeepDetect https github. NetworkX https networkx. Natural Language Processing NLP https amplab. com lendle OnlineLearning. com NervanaSystems neon_course IPython notebooks for a complete course around understanding Nervana s Neon. html mlr Machine Learning in R. neurolab https github. topik https github. The task is to take one of these images as input and predict the most likely digit contained in the image along with a relative confidence in this prediction Now we load the dataset. com jackm321 RustNN RustNN is a feedforward neural network library. com cstjean ScikitLearn. Free trial available. com Kalvar ios BPN NeuralNetwork It implemented 3 layers neural network Input Layer Hidden Layer and Output Layer and it named Back Propagation Neural Network BPN. Neuron https github. CNTK https github. com A library that contacts external servers. org web packages Rmalschains index. hopfield networks https github. com Wavelets ThinkStats2 hyperopt https github. Algorithms Cross Validation Neural Network Preprocessing Feature Extraction and much more in one library. com htm community nupic. That is it will recognize and read the text embedded in images. with code examples and mathematics behind them being explained. face_recognition https github. com avinashshenoy97 RusticSOM A Rust library for Self Organising Maps SOM. ai The Machine Learning Database is a database designed for machine learning. Written entirely in Clojure. PyTorch https github. com arunkumarramanan awesome data science ipython notebooks Machine Learning Engineer s Toolkit with Roadmap https www. io en dev Providing a consistent API for diving into common natural language processing NLP tasks. The environment includes powerful and efficient libraries for linear algebra as well as data visualization that can be used from any. Michael Thomas Flanagan s Java Scientific Library http www. 4 Topic modeling tools to social scientists and others who wish to perform analysis on datasets. Go Learn https github. Lets you focus on the fun parts of ML while outputting production ready code and detailed analytics of your dataset and results. Pylearn2 https github. genius https github. net 2016 04 01 generating large images from latent vectors for the source data and a description of how these morphed animations are generated MNIST dream https i. com Wavelets scipy tutorials SciPy tutorials. com proycon colibri core C library command line tools and Python binding for extracting and working with basic linguistic constructions such as n grams and skipgrams in a quick and memory efficient way. com pymc devs pymc Markov Chain Monte Carlo sampling toolkit. com zygmuntz kaggle advertised salaries Predicting job salaries from ads a Kaggle competition. TDB https github. com en_us software analytics high performance data mining. com clementfarabet lua nnx A completely unstable and experimental package that extends Torch s builtin nn library. org nato yanni overview ANN neural networks using Erlangs leightweight processes. Swift General Purpose Machine Learning Bender https github. com KevinCoble AIToolbox A toolbox framework of AI modules written in Swift Graphs Trees Linear Regression Support Vector Machines Neural Networks PCA KMeans Genetic Algorithms MDP Mixture of Gaussians. com arbox machine learning with ruby Curated list of ML related resources for Ruby. Further resources For a list of free machine learning books available for download go here https github. OverFeat https github. html tgp Bayesian treed Gaussian process models. 0 Please UPVOTE my kernel if you like it or wanna fork it. com IDSIA brainstorm Fast flexible and fun neural networks. com arbox nlp with ruby Curated link list for practical natural language processing in Ruby. com mjhirn tensorflow wins 89b78b29aafb. imbalanced learn http contrib. xgboost node https github. com madmaze pytesseract Python tesseract is an optical character recognition OCR tool for python. torch datasets https github. com arunkumarramanan awesome deep learning ml tutorials Data Science with Python Awesome Tutorials https www. com wesm pydata book Materials and IPython notebooks for Python for Data Analysis by Wes McKinney published by O Reilly Media Neural Networks NeuralTalk https github. Clojure Natural Language Processing Clojure openNLP https github. It currently allows using deep convolutional neural network models trained in Caffe on Apple operating systems. org ScalaNLP is a suite of machine learning and numerical computing libraries. proNet core https github. com cltk cltk The Classical Language Toolkit. RSNNS http cran. net Together with AForge. Run Cabocha ISO 8859 1 configured in Python. com ajtulloch dnngraph A DSL for deep neural networks. com cognitive toolkit. com zeyiwen thundersvm An Open Source SVM Library on GPUs and CPUs LibLinear http www. com torch nngraph This package provides graphical computation for nn library in Torch7. This project includes algorithms focused on Bayes theorem neural networks SVMs Matrices etc. com josephmisiti awesome machine learning blob master blogs. com Workday upshot montague Montague is a semantic parsing library for Scala with an easy to use DSL. html A framework for fast parallel and distributed machine learning algorithms at scale Deeplearning Random forests GBM KMeans PCA GLM. Neon Course https github. org web packages sda index. com josephmisiti awesome machine learning blob master books. io gpr Efficient Gaussian Process Regression in OCaml. Dedupe https github. svmpath http cran. com FidoProject Fido A highly modular C machine learning library for embedded electronics and robotics. Stanford Classifier http nlp. Convolutional Recursive Deep Learning for 3D Object Classification http www. js Clustering algorithms implemented in Javascript for Node. js for easy chart drawing. penalized http cran. OpenGM https github. jl basic mcmc sampler implemented in Julia. It focuses on providing an easy to use well documented and tested library. Onyx https github. somoclu https github. com en us research project sho the net playground for data from http 3A 2F 2Fresearch. BrainCore https github. com totemstech neuraln C Neural Network library for Node. lasso2 http cran. org web packages ipred index. com tresata ganitha Scalding powered machine learning. com dmcc PyStanfordDependencies Python interface for converting Penn Treebank trees to Stanford Dependencies. html DLib has C and Python interfaces for face detection and training general object detectors. com jgreenemi MLPleaseHelp MLPleaseHelp is a simple ML resource search engine. Development has now shifted to GitHub. Netron https github. com SerpentAI SerpentAI Serpent. WalnutiQ https github. TextBlob http textblob. Pebl https github. NET has been used in a wide variety of domains including information retrieval bioinformatics epidemiology vision and many others. org web packages ahaz index. open solution data science bowl 2018 https github. RF https github. penalizedSVM http cran. com mwydmuch ViZDoom ViZDoom allows developing AI bots that play Doom using only the visual information the screen buffer. com LaurentMazare tensorflow ocaml OCaml bindings for TensorFlow. com dmlc mxnet Lightweight Portable Flexible Distributed Mobile Deep Learning with Dynamic Mutation aware Dataflow Dep Scheduler for Python R Julia Go Javascript and more. com jcoglan sylvester Vector and Matrix math for JavaScript. com GiovineItalia Gadfly. Operations can be nested to any level meaning that you can compute exact higher order derivatives and differentiate functions that are internally making use of differentiation for applications such as hyperparameter optimization. modAL https cosmic cortex. org An open source computer vision framework that gives access to several high powered computer vision libraries such as OpenCV. jl A set of functions to support the development of machine learning algorithms. com openai retro Retro Games in Gym SLM Lab https github. Data Read https github. com sta ger TheBot Example of how the neural network learns to predict the angle between two points created with Synaptic https github. com vdmml Interactive automated and programmatic modeling with the latest machine learning algorithms in and end to end analytics environment from data prep to deployment. com en_us software enterprise miner. So that s what we ll stick with in this tutorial unless the models neccessitate a lower level API. com torchnet torchnet framework for torch which provides a set of abstractions aiming at encouraging code re use as well as encouraging modular programming. com project machine_learning Machine learning library for Node. com flurry Lyric Linear Regression library. edu gareth ISL ipred http cran. For a list of mostly free machine learning courses available online go here https github. org guide keras comes with TensorFlow and there s Keras https keras. enlighten integration https github. Advances in Neural Information Processing Systems 2012. REP is not trying to substitute scikit learn but extends it and provides better user experience. html rattle Graphical user interface for data mining in R. Data Driven Code https github. com twitter twitter text java A Java implementation of Twitter s text processing library. com davidavdav SignalProcessing. ml neptune ml Ships for Airbus Ship Detection Challenge https www. Thampi https github. com perone Pyevolve Genetic algorithm framework. Bayesian Bandit https github. saliency https github. We scale these values to a range of 0 to 1 before feeding to the neural network model. open solution salt identification https github. org High Charts http www. com engagor dl4clj Clojure wrapper for Deeplearning4j. DSSTNE https github. com mwgg GreatCircle Library for calculating great circle distance. brushfire https github. Credits Thanks to Lex Fridman s MIT Deep Learning Joseph Misiti and other contributers for such wonderful work Here are some of my kernel notebooks for Machine Learning and Data Science as follows Upvote them if you like them Awesome Deep Learning Basics and Resources https www. Suiron https github. com proycon colibri core Python binding to C library for extracting and working with with basic linguistic constructions such as n grams and skipgrams in a quick and memory efficient way. jl Julia implementation of the scikit learn API. torchnet https github. net p lemur wiki RankLib RankLib is a library of learning to rank algorithms. linear regression and logistic regression. com JuliaStats DataFrames. Decision Tree https github. io crfpp Open source implementation of Conditional Random Fields CRFs for segmenting labeling sequential data other Natural Language Processing tasks. Orange http orange. com CVBox PyTorchCV A PyTorch Based Framework for Deep Learning in Computer Vision. SignalProcessing https github. AMIDST Toolbox http www. com sassoftware enlighten integration Example code and materials that illustrate techniques for integrating SAS with other analytics technologies in Java PMML Python and R. Edward http edwardlib. HLearn https github. org web packages CORElearn index. com fredo dedup SimpleMCMC. ggfortify https github. org packages numl numl is a machine learning library intended to ease the use of using standard modeling techniques for both prediction and clustering. com dmbates MixedModels. Parris https github. com jasonshin kalimdorjs Machine Learning library for the web Node. lime https github. go galib https github. org web packages varSelRF index. com Azure Azure TDSP Utilities Two data science utilities in R from Microsoft 1 Interactive Data Exploration Analysis and Reporting IDEAR 2 Automated Modeling and Reporting AMR. Mocha https github. com frcchang zpar a statistical part of speech tagger constiuency parser and dependency parser for English. com josephmisiti awesome machine learning blob master courses. com infochimps labs big_data_for_chimps Listof https github. Online Learning https github. Perfect TensorFlow https github. org tutorials our MIT Human Centered AI team https hcai. html Extract sentiment from text using a GUI. kaggle bestbuy_small https github. NET Computer Vision OpenCVDotNet https code. html rda Shrunken Centroids Regularized Discriminant Analysis. ZingChart https www. com jtoy awesome tensorflow A list of all things related to TensorFlow. org A Python module for machine learning built on top of SciPy. ScikitLearn https github. html tree Classification and regression trees. Stanford Parser http nlp. ViZDoom https github. js machineJS https github. open solution toxic comments https github. org web packages hda index. decision weights https github. com iterative dvc Data Science Version Control is an open source version control system for machine learning projects with pipelines support. org web packages subsemble index. com xerial xerial Data management utilities for Scala. com breze no salt breze Theano based library for deep and recurrent neural networks. The designer application is developed using WPF and is a user interface which allows you to design your neural network query the network create and configure chat bots that are capable of asking questions and learning from your feed back. com giacomelli GeneticSharp Multi platform genetic algorithm library for. jl eXtreme Gradient Boosting Package in Julia. com RaRe Technologies gensim Topic Modelling for Humans. com covartech PRT A complete object oriented environment for machine learning in Matlab. See great blog post by hardmaru http blog. kaggle_acquire valued shoppers challenge https github. edu homes dgleich packages matlab_bgl MatlabBGL is a Matlab package for working with graphs. Let s step outside the MNIST dataset for that and go with the beautiful high resolution images generated by a mixture of CPPN GAN VAE. com fidlej aledataset Scripts to generate a dataset with static frames from the Arcade Learning Environment. Z3d https github. ThunderSVM https github. Heavy focus on text processing NLP. com scalanlp chalk Chalk is a natural language processing library. com stdlib js stdlib A standard library for JavaScript and Node. com josephmisiti awesome machine learning blob master meetups. IRIS https github. randomForestSRC http cran. encog cpp https code. com ecpolley SuperLearner and subsemble http cran. com jsmlt jsmlt Machine learning toolkit with classification and clustering for Node. com dasmith stanford corenlp python Python wrapper for Stanford CoreNLP https github. MLlib in Apache Spark http spark. html for visualizing geospatial data with static maps and leaflet https rstudio. neonrvm https github. kernlab http cran. shiny https shiny. html The Curvelet transform is a higher dimensional generalization of the Wavelet transform designed to represent images at different scales and different angles. Glot https github. html Data mining and machine learning that creates deployable models using a GUI or code in an MPP environment including Hadoop. com AllenDowney ThinkBayes Book on Bayesian Analysis. org web packages RPMM index. org A data visualization package based on the grammar of graphics. com ml5js ml5 library Friendly machine learning for the web Pavlov. Supports classification segmentation detection out of the box. paicehusk https github. Objective C General Purpose Machine Learning YCML https github. uk The Hidden Markov Model Toolkit HTK is a portable toolkit for building and manipulating hidden Markov models. html For conducting advanced statistical analysis. kdtree nilearn https github. org A WebGL accelerated browser based JavaScript library for training and deploying ML models. ml neptune ml Google AI Object Detection Challenge for Google AI Open Images Object Detection Track https www. Snips NLU https github. org docs latest mllib guide. linear regression logistic regression face detector training and detection as separate demos mst based segmenter train a digit classifier train autoencoder optical flow demo train on housenumbers train on cifar tracking with deep nets kinect demo filter bank visualization saliency networks Training a Convnet for the Galaxy Zoo Kaggle challenge CUDA demo https github. com rewonc pastalog Simple realtime visualization of neural network training performance. com bwaldvogel liblinear java Java version of liblinear. enlighten apply https github. com trekhleb machine learning octave examples of popular machine learning algorithms neural networks linear logistic regressions K Means etc. org search size 20 q AI namespace. Data Analysis Data Visualization Incanter http incanter. glmnet http cran. html fpc Flexible procedures for clustering. com Hydrospheredata mist a service for deployment Apache Spark MLLib machine learning models as realtime batch or reactive web services. Its primary purpose is to act as a testbed for research in artificial intelligence especially deep reinforcement learning. Roboschool https github. studio An all in one NuPIC Hierarchical Temporal Memory visualization and debugging super tool SparklingPandas https github. html Distributed machine learning library in Flink. com ukoethe vigra Python bindings for the VIGRA C computer vision library. com rhiever tpot Tool that automatically creates and optimizes machine learning pipelines using genetic programming. com JuliaStats Clustering. and self contained algorithms k means PCA. com jimpil enclog Clojure wrapper for Encog v3 Machine Learning framework that specializes in neural nets. Stanford Tokens Regex http nlp. com watch v CsF4pd7fGF0. This package provides routines to construct graphs on images segment them build trees out of them and convert them back to images. sentiment analyzer https github. com IllinoisCogComp illinois cogcomp nlp This project collects a number of core libraries for Natural Language Processing NLP developed in the University of Illinois Cognitive Computation Group for example illinois core utilities which provides a set of NLP friendly data structures and a number of NLP related utilities that support writing NLP applications running experiments etc illinois edison a library for feature extraction from illinois core utilities data structures and many other packages. html rminer Simpler use of data mining methods e. tree Oblique Trees for Classification Data. edu phrasal Stanford English Tokenizer http nlp. randomkit https github. com transcendent ai labs DynaML Scala Library REPL for Machine Learning Research. com atmb4u data driven code Very simple implementation of neural networks for dummies in python without using any libraries with detailed comments. The model learns to associate images and labels. com ClimbsRocks auto_ml Automated machine learning for production and analytics. com zygmuntz kaggle bestbuy_big Code for the Best Buy competition at Kaggle. org web packages frbs index. Scalding https github. com deeplearning4j deeplearning4j Distributed Deep Learning Platform for Java Clojure Scala. bokeh https github. Cloudforest https github. rb libsvm https github. com muricoca crab A flexible fast recommender engine. com zygmuntz kaggle cifar Code for the CIFAR 10 competition at Kaggle uses cuda convnet. MIT Information Extraction Toolkit https github. Vulpes https github. org A generic approach that allows to mimic most factorization models by feature engineering. cheminfo http www. Erlang General Purpose Machine Learning Disco https github. General Purpose Machine Learning MXnet for Deep Learning in Perl https github. SimpleAI https github. com lisa lab pylearn2 A Machine Learning library based on Theano https github. Caffe http caffe. com valdanylchuk swiftlearner Simply written algorithms to help study ML or write your own implementations. com facebookresearch DrQA Reading Wikipedia to answer open domain questions. org web packages rpart index. GaussianMixtures https github. com zygmuntz wine quality Predicting wine quality. rusty machine https github. net projects nnd DBMS management system and designer for neural networks. Sentiment Analysis of Japanese Text. jl Julia wrapper for fitting Lasso ElasticNet GLM models using glmnet. com stanfordnlp CoreNLP CLTK https github. js An NLP library built in node over Natural with entity extraction sentiment analysis automatic language identify and so more Data Analysis Data Visualization D3. de software pycuda Python interface to CUDA ROOT https root. com nkallen arel Misc Big Data For Chimps https github. signal http soumith. Metrics used to monitor the training and testing steps. pastalog https github. com neptune ml steppy toolkit Curated collection of the neural networks transformers and models that make your machine learning work faster and more effective. Storm http storm. com jaredthecoder BioPy Biologically Inspired and Machine Learning Algorithms in Python. Kaggle Merck https github. MALLET http mallet. org web packages biglasso index. com vasinov jruby_mahout JRuby Mahout is a gem that unleashes the power of Apache Mahout in the world of JRuby. Scala Natural Language Processing ScalaNLP http www. com p2t2 figaro a Scala library for constructing probabilistic models. rapaio https github. caravel https github. VIGRA https github. Recommender https github. Tools Misc DVC https github. SKLL https github. com kaldi asr kaldi Kaldi is a toolkit for speech recognition written in C and licensed under the Apache License v2. com rlowrance kernel smoothers KNN kernel weighted average local linear regression smoothers. skbayes https github. com columbia applied data science rosetta Text processing tools and wrappers e. Speech Recognition Kaldi https github. Pyevolve https github. TDSP Utilities https github. com en_us software analytics contextual analysis. Data Analysis Data Visualization rsruby https github. com numenta nupic Numenta Platform for Intelligent Computing. com amznlabs amazon dsstne A software library created by Amazon for training and deploying deep neural networks using GPUs which emphasizes speed and scale over experimental flexibility. com arunkumarramanan awesome data science for beginners Tensorflow Tutorial and House Price Prediction https www. jl A Julia package for non negative matrix factorization. org web packages randomForestSRC index. com GaelVaroquaux scikit learn tutorial Series of notebooks for learning scikit learn. com nuanio xgboost node Run XGBoost model and make predictions in Node. This is a project for AI algorithms in Swift for iOS and OS X development. Ruby Linguistics https deveiate. com simple statistics simple statistics A JavaScript implementation of descriptive regression and inference statistics. ly python Collaborative web plotting for Python and matplotlib. com victorlin loso Another Chinese segmentation library. si Open source data visualization and data analysis for novices and experts. xLearn is especially useful for solving machine learning problems on large scale sparse data which is very common in Internet services such as online advertisement and recommender systems. com PPACI yase Transcode sentence or other sequence to list of word vector. Bioruby https github. gamboostLSS http cran. Swift Brain https github. edu and individual pieces referenced in the MIT Deep Learning https deeplearning. jellyfish https github. com cnclabs proNet core A general purpose network embedding framework pair wise representations optimization Network Edit. It is used among many other places at the heart of SciPy. com datumbox datumbox framework Machine Learning framework for rapid development of Machine Learning and Statistical applications. org web packages glmpath index. com catboost catboost General purpose gradient boosting on decision trees library with categorical features support out of the box. JSMLT https github. jl Simple Naive Bayes implementation in Julia. com MaxHalford eaopt An evolutionary optimization library. com twitter twitter text A JavaScript implementation of Twitter s text processing library. com neptune ml open solution home credit source code and experiments results https app. html arules Mining Association Rules and Frequent Itemsets biglasso https cran. com jzrake lunum Demos and Scripts Core torch7 demos repository https github. com bioruby bioruby Arel https github. org web packages RWeka index. Chainer https github. H2O https github. jl Julia package for Gaussian processes. manifold https github. Featureforge https github. For this we divide the values by 255. Clojush https github. lambda ml https github. com hannes brt hebel GPU Accelerated Deep Learning Library in Python. OpenFace https cmusatyalab. astropy http www. org web packages SDDA index. org Python JIT just in time compiler to LLVM aimed at scientific Python by the developers of Cython and NumPy. com clir clearnlp The ClearNLP project provides software and resources for natural language processing. com JuliaStats HypothesisTests. Bandlets http www. BigML https bigml. org web packages Cubist index. com masatoi cl online learning Online learning algorithms Perceptron AROW SCW Logistic Regression. com haifengl smile Statistical Machine Intelligence Learning Engine. ch A modular scientific software framework. Lua General Purpose Machine Learning Torch7 http torch. These include plotly https plot. com ayoshiaki tops This is an objected oriented framework that facilitates the integration of probabilistic models for sequences over a user defined alphabet. Natural Language Processing Stemmer https github. OpenNLP https opennlp. org web packages LiblineaR index. I wanted to do this with Machine Learning. enlighten deep https github. Mamba https github. html A fast modular feature rich open source C machine learning library. com cogitare ai cogitare A Modern Fast and Modular Deep Learning and Machine Learning framework for Python. io A distributed machine learning parameter server framework by Microsoft. edu software tokensregex. jl Decision Tree Classifier and Regressor. org lunatic python SciLua http scilua. org Short for Python Dynamics used to assist with workflow in the modeling of dynamic motion based around NumPy SciPy IPython and matplotlib. jl Markov chain Monte Carlo MCMC for Bayesian analysis in Julia. io Interactive and Reactive Data Science using Scala and Spark. EBLearn http eblearn. ELKI https elki project. com scoremedia thampi Machine Learning Prediction System on AWS Lambda Data Analysis Data Visualization SciPy http www. Raspel https sourceforge. The library has several implementations of GA operators like selection crossover mutation reinsertion and termination. com EducationalTestingService skll A wrapper around scikit learn that makes it simpler to conduct experiments. com Element Research dpnn Many useful features that aren t part of the main nn package. com thinktopic cortex Neural networks regression and feature learning in Clojure. com justmarkham scikit learn videos IPython notebooks from Data School s video tutorials on scikit learn. Distributions https github. cerebro2 A web based visualization and debugging platform for NuPIC. Provides modules that are compatible with nn LinearPsd ConvPsd AutoEncoder. com proycon python frog Python binding to Frog an NLP suite for Dutch. Written on Python and runs on Mac Windows and Ubuntu Linux. com deepmind torch cephes Cephes mathematical functions library wrapped for Torch. CoxBoost http cran. html grpreg Regularization paths for regression models with grouped covariates. snowball https github. com arunkumarramanan hands on ml with scikit learn and tensorflow Practical Machine Learning with PyTorch https www. General Purpose Machine Learning PHP Natural Language Processing jieba php https github. Hypothesis Tests https github. html REEMtree Regression Trees with Random Effects for Longitudinal Panel Data. DrQA https github. vincent https github. tmap https cran. com twitter torch autograd Autograd automatically differentiates native Torch code. Algorithm SVMLight https metacpan. com songtianyi go mxnet predictor Go binding for MXNet c_predict_api to do inference with pre trained model. Javascript Natural Language Processing Twitter text https github. com kevincobain2000 sentiment_classifier Sentiment classifier using word sense disambiguation. jl Local regression so smooooth. Sequence Analysis ToPS https github. org c General purpose graph library. statsmodels https github. io smile Statistical Machine Intelligence and Learning Engine. python recsys https github. com reiinakano xcessiv A web based application for quick scalable and automated hyperparameter tuning and stacked ensembling. com fabianp group_lasso Some experiments with the coordinate descent algorithm used in the Sparse Group Lasso model. It is fast easy to install and supports CPU and GPU computation. com htm community clortex General Machine Learning library using Numenta s Cortical Learning Algorithm. org web packages ElemStatLearn index. LiblineaR http cran. html SDDA Stepwise Diagonal Discriminant Analysis. com koraykv unsup A package for unsupervised learning in Torch. org web packages ROCR index. com quantopian zipline A Pythonic algorithmic trading library. com arunkumarramanan practical machine learning with pytorch Awesome ML Frameworks and MNIST Classification https www. com openai universe Universe is a software platform for measuring and training an AI s general intelligence across the world s supply of games websites and other applications. Train the modelTraining the neural network model requires the following steps 1. com febeling rb libsvm Ruby language bindings for LIBSVM which is a Library for Support Vector Machines. com johnmyleswhite RDatasets. Supports FoLiA format. bayesian https github. html Data mining and machine learning that creates deployable models using a GUI or code. Scipy Tutorials https github. com luispedro milk Machine learning toolkit focused on supervised classification. com mikeizbicki HLearn a suite of libraries for interpreting machine learning models according to their algebraic structure. com echen restricted boltzmann machines Restricted Boltzmann Machines in Python. com Kalvar ios KRKmeans Algorithm It implemented K Means the clustering and classification algorithm. Data Analysis Data Visualization matlab_gbl https www. com koraykv torch svm Torch SVM library. js Scientific and statistical computing in JavaScript. nut https github. caffegraph https github. io FREE NLP Retina API Analysis Tool written in JavaFX See the Tutorial Video https www. com e lab torch7 demos. html gbm Generalized Boosted Regression Models. html penalizedSVM Feature Selection SVM using penalty functions. com amueller kaggle_insults Kaggle Submission for Detecting Insults in Social Commentary. kaggle bestbuy_big https github. com NathanEpstein Pavlov. com PRML PRMLT This package contains the matlab implementation of the algorithms described in the book Pattern Recognition and Machine Learning by C. com fxsjy jieba jieba 1 Chinese Words Segmentation Utilities. org web packages REEMtree index. Universe https github. org web packages rgenoud index. ElemStatLearn http cran. Libra Tk http libra. GMMBoost http cran. We ask the model to make predictions about a test set in this example the test_images array. com BIDData BIDMat CPU and GPU accelerated matrix library intended to support large scale exploratory data analysis. Warp CTC https github. rocks built on top of the awesome d3 and Reactjs libraries General Purpose Machine Learning Convnet. It has tools for natural language processing machine learning among others. DataFrames https github. Xcessiv https github. Was used to win a number of Deep Learning competitions at Kaggle Topcoder and those that were a part of the CVPR workshops. com stsievert swix A bare bones library that includes a general matrix language and wraps some OpenCV for iOS development. dm flow https github. General Purpose Machine Learning Touchstone https github. com patvarilly CoverTree Python implementation of cover trees near drop in replacement for scipy. quantregForest http cran. This is outdated check out scipy lecture notes. wiki challenge https github. io prophet Fast and automated time series forecasting framework by Facebook. com ajtulloch hopfield networks Hopfield Networks for unsupervised learning in Haskell. html rdetools Relevant Dimension Estimation RDE in Feature Spaces. Diffusion Segmentation https github. org OpenCV has C C Python Java and MATLAB interfaces and supports Windows Linux Android and Mac OS. fr peyre download MATLAB code for bandlet transform. SGD Adagrad Conjugate Gradient LBFGS RProp and more. com ipython ipython wiki A gallery of interesting IPython Notebooks ipython notebooks https github. com baidu research warp ctc A fast parallel implementation of Connectionist Temporal Classification CTC on both CPU and GPU. com Wavelets diffusion segmentation A collection of image segmentation algorithms based on diffusion methods. com c airbus ship detection. org pod Paws MachineLearning using AWS machine learning platform from Perl. com AllenDowney DataScience Code for Data Science at Olin College Spring 2014. Algebird https github. com benanne kaggle galaxies Winning solution for the Galaxy Challenge on Kaggle. org A scalable C machine learning library. Feedback If you have any ideas or you want any other content to be added to this curated list please feel free to make any comments to make it better. html Examples demonstrating how to use Optunity in synergy with machine learning libraries. com clojurewerkz envision Clojure Data Visualisation library based on Statistiker and D3. com honnibal spaCy Industrial strength NLP with Python and Cython. com Glean https github. xRBM https github. The chat bots can even scrape the internet for information to return in their output as well as to use for learning. jl Time series toolkit for Julia. videograph https github. jl Algorithms for regression analysis e. com wiki TensorFlow A page of content on TensorFlow including academic papers and links to related topics. com IainNZ GraphLayout. com Tom Alexander regression js A javascript library containing a collection of least squares fitting methods for finding a trend in a set of data. Time Series https github. LibSVM http www. 5 and Mono on Windows Linux and Mac Silverlight 5 WindowsPhone SL 8 WindowsPhone 8. com davidavdav ROCAnalysis. com LanguageMachines ucto Unicode aware regular expression based tokenizer for various languages. org web packages CoxBoost index. js Reinforcement learning using Markov Decision Processes. com MichaelMathieu lua spaghetti Spaghetti sparse linear module for torch7 by MichaelMathieu LuaSHKit https github. com marcoscoffier lua stitch allows us to use hugin to stitch images and apply same stitching to a video sequence. org web packages C50 index. Seaborn http seaborn. CoreNLP http nlp. org web packages RXshrink index. SVM https github. keras https github. org software MATLAB code for shearlet transform. Open Mining https github. Neural Networks and Deep Learning https github. com jgreenemi Parris Parris the automated infrastructure setup tool for machine learning algorithms. js supports visualization see visualml. adam https github. com tsycho ruby machine learning Some Machine Learning algorithms implemented in Ruby. Spark https github. com hammerlab oml A general statistics and machine learning library. jl library for working with tabular data in Julia. glmpath http cran. jl Generalized linear models in Julia. NET this library can provide image processing and computer vision algorithms to Windows Windows RT and Windows Phone. jl TopicModels for Julia. swix https github. com nicolaspanel node svm Support Vector Machine for Node. com sermanet OverFeat A state of the art generic dense feature extractor. org web packages pamr index. com ptaoussanis touchstone Clojure A B testing library. org A Python based ecosystem of open source software for mathematics science and engineering. Hadoop https github. crystal fann https github. com mosdeo LKYDeepNN A header only C 11 Neural Network library. org en stable A Python SVG Charts Creator. NET project aiming to provide methods and algorithms for numerical computations in science engineering and every day use. NET Framework is a complete framework for building machine learning computer vision computer audition signal processing and statistical applications. NET A full port of Stanford NLP packages to. html LogicReg Logic Regression. com archive p cleartk ClearTK provides a framework for developing statistical natural language processing NLP components in Java and is built on top of Apache UIMA. com primaryobjects lda LDA topic modeling for Node. KRKmeans Algorithm https github. 1 and Windows 8 with PCL Portable Profiles 47 and 344 Android iOS with Xamarin. html grplasso Fitting user specified models with Group Lasso penalty. org web packages rattle index. com xmartlabs Bender Fast Neural Networks framework built on top of Metal. com melisgl cl libsvm Wrapper for the libsvm support vector machine library. html RPMM Recursively Partitioned Mixture Model. DEEP LEARNING CatBoost https github. io clusterfck Agglomerative hierarchical clustering implemented in Javascript for Node. as quickly and intuitively as the brain. Treat https github. com aksnzhy xlearn A high performance easy to use and scalable machine learning package which can be used to solve large scale machine learning problems. CatBoost https github. Swift AI https github. com davidavdav GaussianMixtures. Julia General Purpose Machine Learning MachineLearning https github. TensorFlow General Purpose Machine Learning Awesome TensorFlow https github. com StepLg go graph Graph library for Go Golang language. Turi Create simplifies the development of custom machine learning models. CUDA https code. jl SVM s for Julia. Allen Downey s Think Bayes Code https github. DA https github. Demo Search for a list http kevincobain2000. mgl gpr https github. Polyglot https github. Data Analysis Data Visualization ggplot2 http ggplot2. Built on top of TensorFlow. R General Purpose Machine Learning ahaz http cran. com jbarrow LambdaNet Configurable Neural Networks in Haskell. Ruby Wordnet https deveiate. This gap between training accuracy and test accuracy is an example of overfitting. org web packages RSNNS index. java General Machine Learning library using Numenta s Cortical Learning Algorithm. com rasbt pattern_classification thinking stats 2 https github. html Text mining using a GUI or code. PyCUDA https mathema. regression js https github. org web packages partykit index. com zueve neurolab Spearmint https github. implemented on top of a disk backed DataFrame. com en_us software analytics text miner. cortex https github. Documentation can be found here https docs. com Yannael BigDataAnalytics_INFOH515 Jupyter notebooks that cover how to implement from scratch different ML algorithms ordinary least squares gradient descent k means alternating least squares using Python NumPy and how to then make these implementations scalable using Map Reduce and Spark. com shogun toolbox shogun The Shogun Machine Learning Toolbox. graph https github. BIDMat https github. neat https github. bqplot https github. org lucashnegri lna Lunum https github. In many cases this can be reduced to simply stacking together layers Before the model is ready for training it needs a few more settings. Awesome Core ML Models https github. html bigrf Big Random Forests Classification and Regression Forests for Large Data Sets. com ocallaco LuaSHkit A lua wrapper around the Locality sensitive hashing library SHKit kernel smoothing https github. html glmnet Lasso and elastic net regularized generalized linear models. com fukatani stacked_generalization Implementation of machine learning stacking technic as handy library in Python. NET is a framework for running Bayesian inference in graphical models. com apache incubator mxnet Lightweight Portable Flexible Distributed Mobile Deep Learning with Dynamic Mutation aware Dataflow Dep Scheduler for Python R Julia Go Javascript and more. Stanford Word Segmenter http nlp. org web packages rda index. com twitter pycascading Petrel https github. io A high productivity software for complex networks. io Java toolkit for data mining. Smile http haifengl. com torch graph Graph package for Torch. com BLLIP bllip parser BLLIP Natural Language Parser also known as the Charniak Johnson parser. stanford corenlp python https github. scruffy http www. js Neural networks in JavaScript continued community fork of Brain https github. spaghetti https github. org web packages lars index. RWeka http cran. com ajtulloch haskell ml Haskell implementations of various ML algorithms. Clj ML https github. com arunkumarramanan awesome tensorflow and pytorch resources Awesome Data Science IPython Notebooks https www. NET to enable fast and flexible prototyping. com cloudera impala Real time Query for Hadoop. org imbalanced learn Python module to perform under sampling and over sampling with various techniques. The MNIST dataset containss 70 000 grayscale images of handwritten digits at a resolution of 28 by 28 pixels. metric learn https github. NET is a cross platform open source machine learning framework which makes machine learning accessible to. data visualization ruby https github. com php ai php ml Machine Learning library for PHP. NET http accord framework. Coach https github. Introduction to Machine Learning with Python https github. com mattcunningham naive apl Naive Bayesian Classifier implementation in APL. org web packages mvpart index. com CamDavidsonPilon Probabilistic Programming and Bayesian Methods for Hackers Book iPython notebooks on Probabilistic Programming in Python. html evtree Evolutionary Learning of Globally Optimal Trees. com tedsta deeplearn rs deeplearn rs provides simple networks that use matrix multiplication addition and ReLU under the MIT license. org Classification and Regression Training Unified interface to 150 ML algorithms in R. jl Statistical tests for Julia. com trthatcher DiscriminantAnalysis. Available under the MIT license. Provides and wraps the 180 special mathematical functions from the Cephes mathematical library developed by Stephen L. html rgenoud R version of GENetic Optimization Using Derivatives rgp http cran. MXNet https github. com airbnb superset A data exploration platform designed to be visual intuitive and interactive. We verify that the predictions match the labels from the test_labels array. com ogrisel notebooks data science ipython notebooks https github. Introduction to Statistical Learning http www bcf. Stands on the giant shoulders of NLTK and Pattern and plays nicely with both. org dmelt Mathematics software for numeric computation statistics symbolic calculations data analysis and data visualization. Summing Bird https github. org A leading platform for building Python programs to work with human language data. 0 Decision Trees and Rule Based Models. NET language as well as a feature rich interactive shell for rapid development. com machinebox sdk go nudebox Nudity detection from Machine Box Haskell General Purpose Machine Learning haskell ml https github. com yhat ggpy Same API as ggplot2 for R. MAChineLearning https github. Neural https github. org web packages maptree index. com masatoi cl random forest Implementation of Random Forest in Common Lisp. It includes a generic language independent front end a module for mapping language codes into language names and a module which contains various English language utilities. Speech Recognition HTK http htk. ml neptune ml Data Science Bowl 2018 for 2018 Data Science Bowl https www. org web packages mboost index. com torch cutorch Torch CUDA Implementation. spaCy https github. A library for finding interest points based on fast integral histograms. svg https creativecommons. Includes sample code for use from Swift. windML http www. com twitter twitter text rb A library that does auto linking and extraction of usernames lists and hashtags in tweets. org web packages tgp index. scala http deeplearning. html earth Multivariate Adaptive Regression Spline Models elasticnet http cran. SciRuby http sciruby. rgf_python https github. Enterprise Miner https www. com BIDData BIDMach CPU and GPU accelerated Machine Learning Library. jl Graph layout algorithms in pure Julia. com marcelcaraciolo crab A recommendation engine library for Python. DIGITS https github. java deeplearning https github. com machinalis yalign A sentence aligner a friendly tool for extracting parallel sentences from comparable corpora. org HNN Haskell Neural Network library. REP https github. Tool and C library. com siavashserver neonrvm neonrvm is an open source machine learning library based on RVM technique. com karpathy neuraltalk NeuralTalk is a Python numpy project for learning Multimodal Recurrent Neural Networks that describe images with sentences. It s important that the training set and the testing set are preprocessed in the same way Display the first 5 images from the training set and display the class name below each image. com aurelian ruby stemmer Expose libstemmer_c to Ruby. html varSelRF Variable selection using random forests. com machinebox sdk go tagbox Image classification SDK with one shot teaching from Machine Box Nudebox https godoc. com bararchy crystal fann FANN Fast Artificial Neural Network binding. Theano https github. com AirSage Petrel Tools for writing submitting debugging and monitoring Storm topologies in pure Python. DiffSharp http diffsharp. com statsmodels statsmodels Statistical modeling and econometrics in Python. LambdaNet https github. html gamboostLSS Boosting Methods for GAMLSS. com abhik pebl Python Environment for Bayesian Learning. com collinhundley Swift AI Highly optimized artificial intelligence and machine learning library written in Swift. rdetools http cran. SymPy https github. com airbnb aerosolve A machine learning library by Airbnb designed from the ground up to be human friendly. uk mflanaga java Deep Learning Deeplearning4j https github. Data Arrays https github. org web packages h2o index. Data Analysis Data Visualization SAS STAT https www. Clustering https github. dk shark sphinx_pages build html index. Stan http mc stan. Statistiker https github. open solution ship detection https github. com zygmuntz kaggle stackoverflow Predicting closed questions on Stack Overflow. General Purpose Machine Learning Awesome Machine Learning with Ruby https github. edu Algorithms for learning and inference with discrete probabilistic models. html Boruta A wrapper algorithm for all relevant feature selection. com vlall Swift Brain The first neural network machine learning library written in Swift. com golastmile rasa_nlu turn natural language into structured data. js and developers Machine Learning http joonku. com mikedewar d3py A plotting library for Python based on D3. com AllenDowney ThinkBayes Code repository for Think Bayes. org web packages rgp index. html ahaz Regularization for semiparametric additive hazards regression. com arunkumarramanan data science with python awesome tutorials Awesome TensorFlow and PyTorch Resources https www. org web packages kernlab index. org an Open Source Deep Learning Framework for Apple s iOS OS X and tvOS. The Lua bindings provide a simple way of describing graphs from Lua and then optimizing them with OpenGM. com encog encog java core An advanced neural network and machine learning framework. org web packages fpc index. tw cjlin liblinear download A Library for Large Linear Classification. scikit learn tutorials https github. Yanni https bitbucket. com arafatk glot Glot is a plotting library for Golang built on top of gnuplot. com koraykv fex A package for feature extraction in Torch. com dotnet machinelearning ML. Kaggle Gender https github. Text Miner https www. jl Graph modeling and analysis. pydeep https github. shtml A classifier is a machine learning tool that will take data items and place them into one of k classes. com doukremt distance Levenshtein and Hamming distance computation. Tregex Tsurgeon and Semgrex http nlp. com plotly dash svm Interactive SVM Explorer using Dash and scikit learn pattern_classification https github. com jasondavies science. com hyperopt hyperopt sklearn numpic https github. jl Basic sampling algorithms for Julia. com en_us software analytics high performance text mining. Verify that the data is in the correct format and we re ready to build and train the network. org pod Algorithm SVMLight implementation of Support Vector Machines with SVMLight under it. Natural Language Processing NLTK http www. com harthur brain Neural networks in JavaScript Deprecated Brain. Perl Data Analysis Data Visualization Perl Data Language https metacpan. Stats https github. shtml SUTime is a library for recognizing and normalizing time expressions. mne python notebooks https github. org python binding to igraph library General purpose graph library. com mattjj pyhsmm library for approximate unsupervised inference in Bayesian Hidden Markov Models HMMs and explicit duration Hidden semi Markov Models HSMMs focusing on the Bayesian Nonparametric extensions the HDP HMM and HDP HSMM mostly with weak limit approximations. com hangtwenty dive into machine learning I learned Python by hacking first and getting serious later. As the model trains the loss and accuracy metrics are displayed. Dora https github. It excels at transforming transactional and relational datasets into feature matrices for machine learning using reusable feature engineering primitives. com likedan Awesome CoreML Models A curated list of machine learning models in CoreML format. imutils https github. plot rb https github. html party A Laboratory for Recursive Partytioning. com AnyChart http www. Apache cTAKES http ctakes. jl Julia package for text analysis. com Kalvar ios KRHebbian Algorithm It is a non supervisor and self learning algorithm adjust the weights in neural network of Machine Learning. com STOR i GaussianProcesses. ", "id": "arunkumarramanan/awesome-ml-frameworks-and-mnist-classification", "size": "144644", "language": "python", "html_url": "https://www.kaggle.com/code/arunkumarramanan/awesome-ml-frameworks-and-mnist-classification", "git_url": "https://www.kaggle.com/code/arunkumarramanan/awesome-ml-frameworks-and-mnist-classification", "script": "cv2_imshow MaxPooling2D seaborn preprocess_images Dropout tensorflow matplotlib.pyplot Dense keras six.moves tensorflow.keras.layers urllib pandas Flatten Conv2D numpy ", "entities": "(('Edict Dictionary', 'parallel Search'), 'sentence') (('that', 'nn'), 'rnn') (('It', 'design object oriented patterns'), 'emphasize') (('com WalnutiQ wAlnut', 'human brain'), 'object') (('NET', 'Windows Bing PowerPoint Excel'), 'develop') (('org Short', 'NumPy SciPy IPython'), 'use') (('fuzzy', 'Machine Learning'), 'com') (('model', 'about 98'), 'reach') (('com peterwittek', 'python API'), 'somoclu') (('Stanford Name Entity Recognizer', 'nlp'), 'http') (('Stanford Topic Modeling Toolbox', 'nlp'), 'http') (('html lasso2 L1', 'estimation'), 'constrain') (('It', 'API'), 'provide') (('html Fitting user', 'Group Lasso penalty'), 'grplasso') (('org A WebGL', 'ML models'), 'accelerate') (('that', 'linear regression'), 'library') (('automatic language', 'entity extraction sentiment analysis'), 'js') (('org projects Linguistics Linguistics', 'language'), 'be') (('org generic that', 'feature engineering'), 'approach') (('testing set', 'image'), 's') (('HDFS AWS Kaggle scikit', 'matplotlib pandas'), 'update') (('Data Analysis Data Visualization Incanter', 'incanter'), 'http') (('Optunity', 'seamlessly R.'), 'write') (('Hierarchical Temporal Memory visualization', 'one NuPIC'), 'studio') (('you', 'machine AI experiments'), 'be') (('K', 'c fuzzy means'), 'com') (('It', 'large dataset threaded training'), 'have') (('Misc Scripts iPython Notebooks Codebases React Map', 'ML algorithms https common github'), 'js') (('NET', 'information retrieval bioinformatics epidemiology vision'), 'use') (('which', 'roughly words'), 'divide') (('org A Python module', 'SciPy'), 'build') (('that', 'SAS'), 'enlighten') (('text', 'NLP operations disambiguation complex classification'), 'io') (('R General Purpose Machine Learning ahaz', 'cran'), 'http') (('solution open googleai', 'detection https github'), 'object') (('WebDNN', 'CPU execution'), 'use') (('com deepmind lab DeepMind Lab', 'd Quake III ioquake3'), 'be') (('which', 'anything'), 'aim') (('that', 'such OpenCV'), 'org') (('com ajtulloch', 'Haskell ML various algorithms'), 'haskell') (('com sassoftware enlighten', 'best practices'), 'apply') (('com snipsco snips nlu Natural Language Understanding library', 'intent classification'), 'github') (('com apache spark Spark', 'scale data fast large processing'), 'be') (('machine learning that', 'k classes'), 'be') (('which', 'such online advertisement'), 'be') (('KRHebbian It', 'Machine Learning'), 'com') (('org projects', 'docs master apis batch libs ml index'), 'flink') (('jl Julia implementation', 'API'), 'learn') (('org', 'Go Language SVG 2011 34 generation'), 'paper') (('predictions', 'test_labels array'), 'verify') (('that', 'Java PMML Python'), 'integration') (('Dive', 'https github'), 'learn') (('com rasbt pattern_classification', 'https 2 github'), 'stat') (('state', 'existing applications'), 'make') (('com thoj', 'Go Golang'), 'go') (('jl Digital Processing filtering periodograms', 'window functions'), 'Signal') (('jtoy awesome', 'related TensorFlow'), 'com') (('com neat jinyeom Plug', 'Augmenting Topologies'), 'NEAT') (('NET full port', 'Stanford NLP'), 'package') (('com facebookresearch', 'Facebook AI Research'), 'wav2letter') (('NLP Retina API Analysis io FREE Tool', 'Tutorial Video https www'), 'See') (('org clinical Text Apache Analysis', 'clinical free text'), 'be') (('source 2018 code', 'https app'), 'ml') (('Turi Create', 'custom machine learning models'), 'simplify') (('com maciejkula', 'regression support vector machines decision logistic trees'), 'rustlearn') (('shtml Stanford NER', 'Java Entity Named Recognizer'), 'be') (('com nilearn Machine', 'Python'), 'nilearn') (('library', 'Windows Windows RT'), 'provide') (('I', 'Machine Learning'), 'want') (('Kaldi', 'speech recognition researchers'), 'intend') (('shtml Tregex', 'tree regular expressions'), 'be') (('It', 'inference'), 'provide') (('com neptune', 'https app'), 'ml') (('scikit', 'user better experience'), 'try') (('Often times accuracy', 'training dataset'), 'compare') (('Stanford Phrasal Phrase Based Translation System', 'nlp'), 'http') (('It', 'Apple operating systems'), 'allow') (('org', 'machine learning'), 'be') (('that', 'nn'), 'provide') (('which', 'words'), 'provide') (('org', 'MIT Human Centered AI team https hcai'), 'tutorial') (('MatlabBGL', 'Matlab graphs'), 'dgleich') (('com rasbt', 'data science'), 'mlxtend') (('OpenCV', 'opencv'), 'be') (('you', 'Naïve Bayes https metacpan'), 'find') (('rocks', 'General Purpose Machine Learning Convnet'), 'librarie') (('com simpleai team', 'book'), 'simpleai') (('data as well that', 'any'), 'include') (('Hydrospheredata mist', 'realtime batch'), 'com') (('io', 'main textual data'), 'be') (('It', 'Python programming language bindings'), 'write') (('com sjwhitworth', 'Go'), 'golearn') (('ml neptune', 'Airbus Ship Detection Challenge https www'), 'ml') (('mxnet predictor', 'trained model'), 'go') (('network neural model', 'following steps'), 'train') (('com torch', 'Torch'), 'optim') (('PDF lectures Caffe', 'caffe'), 'machine') (('developing reinforcement', 'algorithms'), 'be') (('that', 'Hadoop'), 'learning') (('that', 'sentences'), 'neuraltalk') (('Free source', 'deep neural networks'), 'openface') (('which', 'experimental flexibility'), 'dsstne') (('this', 'bit ahead yourself'), 'join') (('org', 'tm'), 'package') (('com fredwu stemmer', 'Elixir'), 'stem') (('com nlp compromise', 'browser'), 'compromise') (('org guide keras', 'TensorFlow'), 'be') (('them', 'back images'), 'provide') (('Further resources', 'available download'), 'go') (('accuracy', '99'), 'be') (('Library', 'batch online modes'), 'provide') (('you', 'compiled code'), 'com') (('agnostic image augmentation fast that', 'augmentation techniques'), 'library') (('Neural networks', 'Brain https github'), 'js') (('school Creating', 'programming functional constructs'), 'type') (('html', 'Shrinkage Discriminant Analysis'), 'sda') (('com r0man', 'Clojure'), 'inflection') (('com clementfarabet nnx completely unstable that', 'builtin nn library'), 'lua') (('com', 'Node'), 'rlidwka') (('com clojurewerkz', 'Statistiker'), 'envision') (('html rda Shrunken Centroids', 'Discriminant Analysis'), 'Regularized') (('com zygmuntz kaggle Kaggle competition', 'handwriting'), 'gender') (('Matlab Computer Vision Contourlets', 'www'), 'http') (('com machinalis set', 'compatible API'), 'featureforge') (('C Data Sciences that', 'text big data'), 'be') (('gap', 'test overfitting'), 'be') (('learning unified deep that', 'directed graph'), 'com') (('learning modAL modular active framework', 'scikit'), 'learn') (('html', 'customer GUI'), 'create') (('I', 'Python'), 'dive') (('com factorie factorie FACTORIE', 'Scala'), 'be') (('Data Analysis Data Visualization MLlib', 'spark'), 'http') (('com arunkumarramanan', 'R Awesome Tutorials https www'), 'awesome') (('com columbia', 'data science rosetta Text processing tools'), 'apply') (('PRML package', 'Pattern Machine C.'), 'com') (('which', 'as well modular programming'), 'framework') (('Kalvar Multi Perceptron it', 'unlimited hidden layers'), 'com') (('it', 'machine learning'), 'consider') (('html maptree Mapping', 'tree models'), 'pruning') (('library', 'mathematics statistics streams utilities'), 'provide') (('com', 'objects'), 'fulldecent') (('com isnowfy', 'Chinese text'), 'snownlp') (('it', 'curated list'), 'feedback') (('I', 'so far Ruby'), 'treat') (('that', 'Dash https overall github'), 'com') (('Current tools', 'Word Embedding'), 'include') (('that', 'high dimensional datasets'), 'be') (('io', 'OCaml'), 'gpr') (('that', 'genetic programming'), 'com') (('Python program', 'Hadoop'), 'mrjob') (('Python Programming', 'www'), 'http') (('com MichaelMathieu lua', 'MichaelMathieu LuaSHKit https github'), 'spaghetti') (('correctly you', 'MNIST dream predictions https i.'), 'get') (('nudebox Nudity detection', 'ml https github'), 'go') (('com p cuda This', 'C CUDA DEEP LEARNING CXXNET https fast convolutional github'), 'convnet') (('Hidden Markov Model Toolkit HTK', 'Markov hidden models'), 'uk') (('com', 'neighbours annoy Approximate nearest implementation'), 'spotify') (('Run Cabocha ISO', '8859 1 Python'), 'configure') (('com marcelcaraciolo', 'Python'), 'crab') (('network', 'products recommendation user behavior data analysis mining analysis'), 'use') (('Statistics', 'JavaScript'), 'statkit') (('Encog', 'neural networks'), 'contain') (('html', 'Recursive Partytioning'), 'partykit') (('Michael Thomas Java Scientific Library', 'www'), 'http') (('html gamboostLSS', 'GAMLSS'), 'Boosting') (('com Microsoft', 'classification'), 'Microsoft') (('it', 'a few more settings'), 'reduce') (('AcknowledgementsThe contents', 'TensorFlow team https www'), 'base') (('com', 'R.'), 'be') (('generating array', 'Python'), 'com') (('Convolutional Recursive Deep Learning', 'www'), 'http') (('com clementfarabet lua opengm OpenGM', 'C graphical modeling'), 'be') (('s', 'NoSQL datastore'), 'store') (('com', 'cuda convnet'), 'use') (('KNN kernel', 'linear regression average local smoothers'), 'weight') (('Data Interactive Science', 'Scala'), 'io') (('html earth Multivariate Adaptive Regression Spline Models elasticnet', 'cran'), 'http') (('labels', '9'), 'be') (('K', 'clustering algorithm'), 'com') (('running experiments', 'illinois core utilities data structures'), 'illinois') (('com neptune', 'Toxic Comment Classification Challenge https www'), 'ml') (('Lazin', 'compression'), 'com') (('that', 'probability'), 'be') (('com goml', 'Go'), 'gobrain') (('Dataflow Dep Scheduler', 'Javascript'), 'aware') (('com scalanlp breeze Breeze', 'processing numerical Scala'), 'be') (('It', 'machine visual learning'), 'intend') (('com IDSIA', 'Fast flexible neural networks'), 'brainstorm') (('solution detection source ml open code', 'https app'), 'object') (('machine Several learning', 'intelligence AI https artificial metacpan'), 'include') (('com chartbeat labs level textacy higher NLP', 'Spacy'), 'build') (('io ARPA language also Moses', 'GIZA alignments'), 'folia') (('com kaldi asr kaldi Kaldi', 'Apache License v2'), 'be') (('machine learning easy scalable which', 'scale machine learning large problems'), 'xlearn') (('LNU Linear Neural Unit QNU Quadratic Neural Unit RBF Radial Basis Function Multi Layer Perceptron ELM Multi Layer Perceptron Extreme Learning MLP Machine neural networks', 'Gradient descent'), 's') (('shtml Stanford Phrasal', 'machine translation based Java'), 'be') (('kernel', 'MIT Deep Learning'), 'Frameworks') (('shtml Tokenization', 'processing NLP standard pre many tasks'), 'be') (('NathanEpstein Z3d', 'Three'), 'com') (('com pjreddie darknet Darknet', 'source neural network open C'), 'be') (('you', 'them'), 'credit') (('where we', 'dataset'), 'com') (('html', 'Cox model'), 'penalize') (('com', 'pattern_classification https github'), 'learn') (('com johnmyleswhite ML_for_Hackers maptree', 'cran'), 'http') (('Generalized', 'Regression Models'), 'Boosted') (('building complete machine', 'computer vision computer signal audition processing'), 'be') (('you', 'wanna it'), '0') (('com jvns pandas', 'pandas library'), 'cookbook') (('This', 'scipy lecture notes'), 'outdated') (('com BIDData BIDMach CPU', 'Machine Learning Library'), 'accelerate') (('com BIDData BIDMat CPU', 'scale data large exploratory analysis'), 'accelerate') (('It', 'well documented library'), 'focus') (('it', 'APIs'), 'send') (('org guide keras', 'TensorFlow'), 'come') (('NET', 'graphical models'), 'be') (('com melisgl mgl', 'Evolutionary algorithms'), 'gpr') (('p cleartk archive ClearTK', 'Apache UIMA'), 'com') (('library', 'Ruby WordNet'), 'project') (('com dasmith stanford', 'python Python Stanford'), 'corenlp') (('com primaryobjects lda LDA topic', 'Node'), 'modeling') (('com zygmuntz kaggle Predicting', 'Stack Overflow'), 'stackoverflow') (('Rust General Purpose Machine io listof Learning', 'https github'), 'deeplearn') (('canbe', 'machine learning https github'), 'MachineLearning') (('semi Markov explicit Hidden Models', 'HDP limit mostly weak approximations'), 'library') (('However measure', 'htmlwidgets https www'), 'achieve') (('com MaxHalford', 'optimization evolutionary library'), 'eaopt') (('Encog', 'processing further time'), 'make') (('We', 'test_images array'), 'ask') (('that', 'images'), 'be') (('these', 'uncertainty'), 'reflect') (('com deepmind torch Cephes functions mathematical library', 'Torch'), 'cephes') (('Learning Based Java', 'application'), 'com') (('DEEP LEARNING', 'Boltzmann Machines https github'), 'Restricted') (('Python package', 'API'), 'sklearn') (('model', 'images'), 'learn') (('Faster R deep CNN', 'docker container'), 'dockerface') (('dvc Data Science Version iterative Control', 'pipelines support'), 'com') (('Hydrosphere Mist https', 'Spark'), 'github') (('com neurosnap', 'Punkt sentence tokenizer'), 'sentence') (('html FREE', 'SAS online courses'), 'include') (('differentiate that', 'hyperparameter such optimization'), 'nest') (('Metrics', 'training steps'), 'use') (('JasperSnoek spearmint Spearmint', 'Practical Bayesian Machine Learning Algorithms'), 'com') (('com stdlib js', 'JavaScript'), 'stdlib') (('MLPNeuralNet', 'trained neural network'), 'predict') (('ai open images', 'detection track'), 'object') (('com reiver', 'algorithm'), 'go') (('that', 'neural nets'), 'wrapper') (('com machinebox sdk', 'Machine Box Image Classification Tagbox https godoc'), 'go') (('models', 'level lower API'), 's') (('library', 'selection crossover mutation reinsertion'), 'have') (('html', 'Flexible procedures'), 'fpc') (('com zygmuntz kaggle merck Merck', 'Kaggle'), 'challenge') (('Open Source SVM Library', 'CPUs www'), 'com') (('automated hyperparameter', 'ensembling'), 'xcessiv') (('com madmaze Python tesseract', 'character recognition OCR optical python'), 'pytesseract') (('High level neural networks', 'TensorFlow https github'), 'frontend') (('html Multi', 'learning ensemble packages'), 'algorithm') (('General Purpose Machine Learning scala general', 'Purpose purpose TensorFlow General Purpose Machine purpose Tools Misc misc General Purpose apl https purpose Swift swift General Machine Learning swift general Learning tensor general APL Machine Learning naive github'), 'ml') (('Python', 'NLP Dutch'), 'frog') (('com stsievert bones bare that', 'iOS development'), 'swix') (('pos tagging lemmatisation dependency', 'NER python zpar https github'), 'parse') (('General Purpose Machine Learning PHP Natural Language Processing jieba', 'https github'), 'php') (('com machinebox sdk', 'Machine Box Nudebox https godoc'), 'go') (('com', 'Clojure'), 'infer') (('You', 'https right now jgreenemi'), 'use') (('that', 'stream processing different platforms'), 'be') (('org OpenCV', 'Windows Linux Android'), 'have') (('com tflearn', 'TensorFlow'), 'tflearn') (('you', 'detailed dataset'), 'let') (('com clementfarabet lua', 'Torch'), 'imgraph') (('scikit', 'notebooks'), 'learn') (('com reiinakano scikit', 'data analysis'), 'plot') (('com montague Workday upshot Montague', 'DSL'), 'be') (('html suite', 'other applications'), 'design') (('Layer Hidden Output it', 'Propagation Neural Network Back BPN'), 'com') (('com beniz', 'C'), 'deepdetect') (('machine', 'descent LBFGS rmsprop gradient adadelta'), 'focus') (('Allen Downey', 'OS Code https github'), 'think') (('k', 'PCA'), 'mean') (('ClearNLP project', 'language natural processing'), 'clearnlp') (('them', 'back videos'), 'provide') (('com jwkvam', 'flask socketio'), 'bowtie') (('tar MATLAB source that', 'contourlet transform'), 'code') (('information', 'as well learning'), 'scrape') (('com NervanaSystems coach Reinforcement Learning Coach', 'Ruby Natural Language Processing Awesome Ruby https github'), 'enable') (('algorithms', 'theorem neural networks'), 'include') (('that', 'GUI'), 'learning') (('Natural Language Processing', 'porterstemmer https github'), 'go') (('recommender trainner hybrid system', 'algorithms'), 'learn') (('com twitter torch autograd Autograd', 'Torch automatically native code'), 'differentiate') (('that', 'screen buffer'), 'mwydmuch') (('Machine Learning Somnibyte simple Framework', 'Swift'), 'com') (('it', 'data'), 'optimizer') (('com LanguageMachines', 'PoS tagger lemmatiser dependency Dutch parser'), 'frog') (('com proycon colibri core C library command line tools', 'quick efficient way'), 'bind') (('that', 'MIT license'), 'deeplearn') (('com LanguageMachines', 'aware regular expression based various languages'), 'ucto') (('differentiation AD automatic library', 'vector matrix free Hessian machine learning applications'), 'io') (('com luispedro milk Machine learning toolkit', 'supervised classification'), 'focus') (('that', 'tweets'), 'twitter') (('code examples', 'them'), 'explain') (('com cogitare ai', 'Python'), 'cogitare') (('com transcendent ai labs DynaML Scala Library', 'Machine Learning Research'), 'REPL') (('e1071 TU Wien earth', 'cran'), 'http') (('com encog encog java', 'advanced neural network'), 'core') (('com scikit image scikit', 'Python'), 'image') (('which', 'Windows Linus Mac OS iOS'), 'wrapper') (('com lmcinnes hdbscan implementation', 'https github'), 'use') (('com fukuball jieba', 'Words Segmentation Chinese Utilities'), 'php') (('False 15 fps doesn', 'display'), 'work') (('Lua bindings', 'OpenGM'), 'provide') (('p lemur wiki RankLib net RankLib', 'algorithms'), 'be') (('com fukatani stacked_generalization Implementation', 'Python'), 'stack') (('com facebookresearch Detectron software that', 'Mask R CNN'), 'system') (('It', 'TensorFlow'), 'feature') (('MNIST dataset', '28 pixels'), 'containss') (('com antoniogarrote machine learning library', 'Weka'), 'clj') (('html penalizedSVM Feature Selection SVM', 'penalty functions'), 'use') (('ClimbsRocks learning machineJS Automated machine data', 'just a.'), 'give') (('primary purpose', 'artificial intelligence'), 'be') (('com molcik python neuron', 'time series simple predictions'), 'be') (('data kevincobain2000 listof Community based collection', 'gem'), 'com') (('It', 'vectorized operations'), 'build') (('us', 'video sequence'), 'allow') (('This', 'OS X iOS development'), 'be') (('com LanguageMachines libfolia C library', 'proycon'), 'http') (('com deap', 'algorithm Evolutionary framework'), 'deap') (('Optunity', 'seamlessly MATLAB'), 'write') (('that', 'sentences'), 'be') (('com blaze blaze NumPy', 'Big Data'), 'interface') (('above', 'highest output'), 'gif') (('jl Data that', 'missing values'), 'structure') (('com', 'ruby 194'), 'scruffy') (('de software Python', 'CUDA ROOT https root'), 'pycuda') (('Data Analysis Data Visualization', 'graph https github'), 'go') (('that', 'feed'), 'develop') (('that', 'CVPR workshops'), 'use') (('don t', 'app'), 'have') (('DIGITS', 'web learning deep models'), 'NVIDIA') (('This', 'Dropout layers'), '19') (('SHKit kernel', 'https github'), 'LuaSHkit') (('html ElemStatLearn Data', 'Jerome Friedman Trevor Hastie Robert Tibshirani'), 'function') (('who', 'datasets'), 'tool') (('GUI based workbench', 'neural networks'), 'provide') (('Lisp General Purpose Common Machine', 'https mgl github'), 'Learning') (('shtml SUTime', 'recognizing'), 'be') (('performance memory high efficient maximally parallelized ensemble learning', 'scikit'), 'mlens') (('com siavashserver neonrvm neonrvm', 'source machine learning RVM open technique'), 'be') (('com prodicus library', 'loso https nltk github'), 'spammy') (('com cardmagic classifier', 'other classifications'), 'module') (('com scoremedia', 'www'), 'http') (('that', 'SAS machine learning techniques'), 'apply') (('Data Analysis Data Visualization numl', 'www'), 'http') (('com zygmuntz kaggle', 'Kaggle competition'), 'salary') (('how then implementations', 'Map Reduce'), 'square') (('that', 'linear regression'), 'builder') (('com zuhao plotting library', 'Vega'), 'plotrb') (('com JuliaCon presentations', 'JuliaCon'), 'Presentations') (('com ageitgey face_recognition Face recognition that', 'command line'), 'library') (('com arafatk glot Glot', 'gnuplot'), 'be') (('NET', 'NuGet also package'), 'precompile') (('html forecast Timeseries', 'ETS STLM ARIMA TBATS'), 'forecast') (('Introduction', 'www bcf'), 'http') (('that', 'JRuby'), 'be') (('more it', 'beginners'), 'fuku') (('components', 'also Java'), 'be') (('It', 'others'), 'have') (('ml weka Weka', 'data mining tasks'), 'be') (('that', 'R Python Scala'), 'com') (('linear logistic regression regression', 'Galaxy Zoo Kaggle challenge CUDA demo https github'), 'face') (('com arunkumarramanan', 'Python Awesome Tutorials https www'), 'awesome') (('com mining mining Business Intelligence BI', 'Python'), 'github') (('Simple Javascript implementation', 'node'), 'mean') (('Practical XGBoost', 'education'), 'http') (('com machinebox sdk', 'ngram https github'), 'go') (('loss metrics', 'training data'), 'be') (('com lexfridman', 'Joseph Misiti https deep github'), 'mit') (('project', 'Emory University'), 'start') (('It', 'learning Caffe2 deep framework'), 'write') (('you', 'data mining specific topics'), 'flow') (('It', 'two classes'), 'be') (('html GMMBoost Likelihood', 'Generalized mixed models'), 'base') (('com alonsovidales', 'Linear Logistic regression'), 'go_ml') (('com golastmile rasa_nlu', 'structured data'), 'turn') (('com machinalis sentence aligner', 'comparable corpora'), 'yalign') (('com rosejn torch', 'COIL Street View House Numbers MNIST NORB Atari2600 https BSR 500 CIFAR 10 github'), 'dataset') (('Training', 'classifieron MNIST www'), 'http') (('com stripe decision brushfire Distributed tree', 'ensemble Scala'), 'learning') (('com', 'Plotly'), 'dash') (('Misc Stuff Presentations julia lua General Purpose Machine lua demos Matlab matlab Computer Vision misc Lua Learning lua general purpose Demos matlab', 'Data Analysis Data Visualization julia data analysis'), 'table') (('that', 'training instance'), 'dynet') (('General Purpose Machine Learning', 'https github'), 'aerosolve') (('images', '0'), 'be') (('com products', 'recommender systems graph analytics etc'), 'create') (('ConvNetJS', 'harthur'), 'convnetjs') (('it', 'images'), 'be') (('we', 'images'), 'make') (('com', 'ground'), 'aerosolve') (('which', 'Matlab toolbox'), 'be') (('com dmlc mxnet tree master perl package', 'CPAN https also metacpan'), 'release') (('com pgmpy', 'python Probabilistic Graphical Models'), 'pgmpy') (('com valdanylchuk swiftlearner', 'own implementations'), 'write') (('com arbox', 'Ruby'), 'nlp') (('Data Analysis Data Visualization Flink', 'flink'), 'http') (('It', 'analysis statistical visualization'), 'provide') (('com proycon python', 'various languages'), 'ucto') (('com Vulpes Deep belief', 'Alea'), 'fsproject') (('which', 'language various English utilities'), 'include') (('StepLg', 'Go Golang language'), 'com') (('we', 'network'), 'verify') (('com daviddengcn', 'Go lang'), 'go') (('It', 'GPU even computation'), 'be') (('dp', 'etc'), 'function') (('project', 'Apache 2 license'), 'be') (('python course Course', 'prior knowledge'), 'io') (('com hammer', 'Kaggle'), 'wikichallenge') (('com data arunkumarramanan learning', 'Titanic Exploration https kaggle'), 'cheatsheet') (('objected oriented that', 'user defined alphabet'), 'top') (('org CRFsuite', 'sequential data'), 'software') (('Distributed Machine', 'www'), 'http') (('Many useful that', 't nn main package'), 'feature') (('which', 'Support Vector Machines'), 'binding') (('com benanne kaggle galaxies', 'Kaggle'), 'win') (('anything', 'txt json'), 'get') (('Wavelets', 'scipy SciPy tutorials'), 'com') (('com echen', 'Python'), 'restrict') (('com apache incubator predictionio', 'software developers'), 'PredictionIO') (('Python tesseract', 'Tesseract OCR Engine'), 'be') (('Now we', 'dataset'), 'load') (('cjlin liblinear', 'Large Linear Classification'), 'download') (('com pymc', 'Markov Chain Monte Carlo sampling pymc toolkit'), 'dev') (('Gesture Recognition Toolkit GRT', 'source C learning time gesture cross platform open machine real recognition'), 'grt') (('EducationalTestingService python', 'Python ZPar https github'), 'com') (('We', 'network neural model'), 'scale') (('Curvelet html transform', 'different scales'), 'be') (('edu Stanford English Tokenizer', 'nlp'), 'phrasal') (('html glmnet Lasso', 'linear elastic generalized models'), 'regularize') (('vecLib it', 'Java 20 times faster equivalent'), 'implement') (('It', 'SciPy'), 'use') (('expert non package', 'other features'), 'neuropredict') (('org', 'various techniques'), 'learn') (('com statsmodels', 'Python'), 'statsmodel') (('It', 'fast CPU'), 'be') (('io', 'Statistical Machine Intelligence Engine'), 'smile') (('com featuretools', 'feature automated engineering'), 'featuretool') (('com dakrone clojure opennlp', 'Natural Language Clojure'), 'opennlp') (('C', 'object general detectors'), 'have') (('com openai', 'OpenAI Gym'), 'roboschool') (('neural network', 'then model'), 'build') (('com neptune', 'solution salt identification source open code'), 'ml') (('com pyqtgraph', 'python GUI PyQt4 pure PySide'), 'pyqtgraph') (('shoppers', 'Kaggle acquire'), 'com') (('work', 'networks neural transformers'), 'curate') (('Natural Language Processing NLTK', 'www'), 'http') (('Wrapper', 'browser'), 'render') (('com torch package', 'Torch7'), 'nngraph') (('com', 'etc'), 'linear') (('Data Analysis Data Visualization ggplot2', 'ggplot2'), 'http') (('de spider', 'Matlab'), 'spider') (('jl mcmc basic sampler', 'Julia'), 'implement') (('you', 'further updates'), 'be') (('com random_forester', 'PMML files'), 'asafscher') (('It', 'feature engineering reusable primitives'), 'excel') (('which', 'BPNN RBF PCN'), 'fxsjy') (('competing Cubist', 'cran'), 'model') (('io MLPleaseHelp', 'Github Pages'), 'provide') (('com mrdimosthenis', 'simple machine learning Elixir'), 'emel') (('we', 'optimizer'), 'add') (('com ukoethe vigra VIGRA', 'Python bindings'), 'be') (('networks boltzmann Neural machines', 'nets Gaussian forward Processes'), 'feed') (('videos IPython notebooks', 'Data video tutorials'), 'learn') (('html', 'Globally Optimal Trees'), 'evtree') (('org packages numl numl', 'prediction'), 'be') (('com dmcc Python', 'Stanford Dependencies'), 'PyStanfordDependencies') (('General Purpose Machine Learning Accord Framework', 'accord framework'), 'http') (('how morphed animations', 'source data'), 'net') (('com Netflix PigPen Map', 'Clojure'), 'Reduce') (('s', 'CPPN GAN VAE'), 'let') (('MachineLearning Support Vector Machines Decision Naive Bayesian K', 'Grid machine learning applications'), 'tree') (('shoppers', 'https github'), 'value') (('it', 'experiments'), 'com') (('that', 'machine pipeline clean design'), 'introduce') (('raspell', 'interface ruby'), 'be') (('how neural network', 'Synaptic https github'), 'sta') (('org Incanter', 'statistical computing'), 'be') (('com openai universe Universe', 'games websites'), 'be') (('com vollmerm', 'Clojure'), 'fungp') (('that', 'external servers'), 'com') (('Demo Search', 'kevincobain2000'), 'http') (('Introduction', 'https github'), 'learn') (('Scala Natural Language Processing', 'www'), 'http') (('Machine Learning Database', 'machine learning'), 'ai') (('TensorDebugger TDB', 'visual deep learning'), 'com') (('com cloudkj lambda', 'Clojure'), 'ml') (('It', 'data mining compression'), 'use') "}