{"name": "baseline lstm with keras 0 7 ", "full_name": " h1 Data Prepration for LSTM h1 LSTM Model with Keras h1 Submission File Creation h1 Future Improvements ", "stargazers_count": 0, "forks_count": 0, "description": "But I could not find a way how to deal with them. Multi step LSTM can be used for prediction of more than one day for example 28 days at once or 14 days 7 days 2 days etc. Maybe lag features sell prices can be included. In addition outliers can be handled if any especially if sell prices data is used. calendar won t be used anymore. The model is trained using past sales values for each 30490 item and a feature which represents if there exists an event at the following day. Since event_name_2 is rare it was not added. For y_train we are predicting one day sales of 30490 items therefore one element of y_train s shape is 1 30490 Creation of X_train and y_train resim. if first day was an event this row will cause an exception because x 1. I could not find a proper way to add those kind of features. 12 days from input data 2 days from our prediction to predict 1917th day 11 days from input data 3 days from our prediction to predict 1918th day. png LSTM Model with Keras Take last days 14 for this notebook timestep parameter in order to predict firts unknown day s sales. The shape of the data is not exactly what we want. We want to have each day as row and 30490 items sales as columns features Therefore take the transpose of dt Remove the first six colums id item_id dept_id cat_id store_id state_id columns to end up only days as rows Here a dataframe is created to store the knowledge if an event exist in the next day Firstly fill with zeros the dataframe Now 1 is assigned the day before an event exist. More feature can be added. In order to predict 1916th day 13 days from our input data and 1 day from our prediction are used. Before using values for prediction again use min max transformation Here is again an important part. I did not add seed value but may be this can be added. 14 days our prediction to predict last 1941th day sales. Before concatanation with our main data dt indexes are made same and column name is changed to oneDayBeforeEvent Feature Scaling Scale the features using min max scaler in range 0 1 İmportant if extra features are added like oneDayBeforeEvent use only sales values for predictions we only predict sales this is why 0 30490 columns are choosen Convert to np array to be able to feed the LSTM model Importing the Keras libraries and packages Initialising the RNN Adding the first LSTM layer and some Dropout regularisation Adding a third LSTM layer and some Dropout regularisation Adding a third LSTM layer and some Dropout regularisation Adding the output layer Compiling the RNN Fitting the RNN to the Training set. read_csv To reduce memory usage Reduce memory usage and compare with the previous one to be sure Take the transpose so that we have one day for each row and 30490 items sales as columns Remove id item_id dept_id cat_id store_id state_id columns Create dataframe with zeros for 1969 days in the calendar 1 is assigned to the days before the event_name_1. Since it is not i did not consider for now. Below timesteps is set to 14 to use past 14 days sales. Since there are lots of zero values in first days startDay parameter can be used ignore unwanted days from the beginning. png Submission File Creation Here the submission file creation is done. For each X_train item 14 past days sales and 14 daysBeforeEvent feature are included. Data Prepration for LSTM In this notebook LSTM is used for forecasting future sales. Future Improvements Here only sales of past days and oneDayBeforeEvent feature are used for prediction. Any ideas for feature addition are very welcome. After that we slide the window one by one. There are lots of zero values especially in the first year. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. png attachment resim. Past days is a parameter which can be set to see the effect. Each run can create different results. So one element of X_train s shape is 14 30491. Choosing correct neuron sizes batch size and layer size can be achieved. daysBeforeEventTest will be used as input for predicting We will forecast the days 1913 1941 daysBeforeEvent will be used for training as a feature. We are using last 14 days in order to predict day 1915 sales. The type of the LSTM can be regarded as Multivariate and Multiple Input Series Multi step is not used. Other days will remain as 0. X_train and y_train data is created. Data preprocessing may be applied. I have wanted to see how much the result differs You can share any ideas for improvement as a comment we can discuss more detail This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. Since the daysBeforeEvent feature is used for predicting after the model trained as input we seperate the 28 days as daysBeforeEventTest For training the first 1914 days if startDay is zero otherwise 1913 startDay will be used. For this notebook sales of past 14 days and event feature are used for predicting 15th day sales. Concatenate daysBeforeEvent feature with our main dataframe dt Here is the important part. But including those features for each item can increase the column size from 30491 to 60981 maybe more. ", "id": "bountyhunters/baseline-lstm-with-keras-0-7", "size": "3746", "language": "python", "html_url": "https://www.kaggle.com/code/bountyhunters/baseline-lstm-with-keras-0-7", "git_url": "https://www.kaggle.com/code/bountyhunters/baseline-lstm-with-keras-0-7", "script": "LSTM numpy Dropout keras.layers downcast_dtypes keras.models Dense MinMaxScaler Sequential pandas sklearn.preprocessing ", "entities": "(('we', 'exactly what'), 'be') (('timesteps', 'days past 14 sales'), 'set') (('we', 'one one'), 'slide') (('days 14 past sales', 'X_train item'), 'include') (('columns Create dataframe', 'event_name_1'), 'reduce') (('row', 'exception'), 'be') (('this', 'seed value'), 'add') (('Choosing', 'neuron sizes batch correct size'), 'achieve') (('therefore one element', '1 30490 X_train resim'), 'predict') (('I', 'features'), 'find') (('which', 'following day'), 'train') (('1 day', 'prediction'), 'in') (('Here only sales', 'oneDayBeforeEvent prediction'), 'use') (('14 prediction', 'day last 1941th sales'), 'day') (('So one element', 'shape'), 'be') (('It', 'kaggle python Docker image https github'), 'want') (('otherwise 1913 startDay', 'input'), 'seperate') (('Multi step', 'example'), 'use') (('day event', 'dataframe'), 'want') (('png LSTM Model', 'firts unknown sales'), 'take') (('startDay parameter', 'unwanted days beginning'), 'use') (('event feature', 'day 15th sales'), 'use') (('ideas', 'feature addition'), 'be') (('We', 'day 1915 sales'), 'use') (('which', 'effect'), 'be') (('why 0 30490 columns', 'Training set'), 'make') (('prices especially data', 'addition'), 'handle') (('1941 daysBeforeEvent', 'feature'), 'use') (('LSTM', 'future sales'), 'Prepration') (('Concatenate daysBeforeEvent', 'dataframe main dt'), 'feature') (('I', 'how them'), 'find') (('Multiple Input Series Multi step', 'Multivariate'), 'regard') "}