{"name": "better image tiles removing white spaces ", "full_name": " h1 Better image tiles Simple heuristic to suppress blank regions h1 Contents h2 Importing dependencies h2 Compute statistics h2 Select k best regions h2 Slide over the image h2 Show the results h3 Window size 200 stride 128 h3 Window size 128 stride 64 h2 Glue to one picture ", "stargazers_count": 0, "forks_count": 0, "description": "One of the key aspects that I show in my previous notebook https www. Actually one need to zoom enough in the biopsy image to make sure there is as little white as possible. Window size 200 stride 128 Window size 128 stride 64 Glue to one picture Note A 3 channel white pixel has RGB 255 255 255. The order does not matter actually. Select k best regionsThen we need a function to sort a list of tuples where one component of the tuple is the proportion of white pixels in the regions. Show the resultsNow we will show some results. Slide over the image 5. Window size 128 stride 64 5. Compute statistics 3. The algorithm is pretty simple actually having a sliding window moving across the images and calculating for each region the proporition of white color in the image. Importing dependencies 2. Then you select the region compute the statistics of that region sort the array and select the k best regions. A too small window size might harm the performance of the model since you might select only a tiny portion of the biopsy. We are sorting in ascending order. png attachment image. Slide over the imageThe main function the two while loops slide over the image the first one from top to bottom the second from left to right. Show the results 5. To counter this introducing a random choice might be worth trying. Then select k regions with the lowest proportion of white. Window size 512 stride 256 Importing dependencies Compute statisticsFirst we need to write a function to compute the proportion of white pixels in the region. The smaller the window size the more precise but the longer. This is why in this notebook we will code a simple heuristic to generate better images that have no more blank parts. Window size 200 stride 128 5. I would say that a window size of around 200 is a good choice. Better image tiles Simple heuristic to suppress blank regions image. png As you might know for this competition it is critical to come up with an efficient way to pre process the images. com rftexas gradcam comparing resnet and se resnext is that as expected white regions don t convey any information hence the need to get rid of them. We will define the algorithm as follows Define a sliding window of a fixed size Slide the window with a certain stride For each region on which we slide compute the amount of white pixels Do this for all the regions in the image Select the top k results where k is a hyperparameter If you like those kinds of tutorials upvote this notebook It encourages me to keep writing some V5 I ll try to tackle pen markers now Stay tuned Contents 1. Since we will only store the coordinates of the top left pixel we need a way to retrieve the k best regions hence the function hereafter. Select k best regions 4. It is a good trade off between generality having enough of the biopsy structure captured as well as enough details. ", "id": "rftexas/better-image-tiles-removing-white-spaces", "size": "3144", "language": "python", "html_url": "https://www.kaggle.com/code/rftexas/better-image-tiles-removing-white-spaces", "git_url": "https://www.kaggle.com/code/rftexas/better-image-tiles-removing-white-spaces", "script": "seaborn select_k_best_regions generate_patches glue_to_one_picture compute_statistics display_images matplotlib.pyplot display IPython.display Image pandas get_k_best_regions numpy ", "entities": "(('3 channel white pixel', '255 255 255'), 'size') (('statistics', 'k best regions'), 'select') (('that', 'more blank parts'), 'be') (('it', 'images'), 'png') (('Actually one', 'biopsy image'), 'need') (('I', 'now tuned Contents'), 'define') (('loops', 'right'), 'slide') (('you', 'biopsy'), 'harm') (('pretty actually sliding window', 'image'), 'be') (('window size', 'around 200'), 'say') (('hence function', 'k best regions'), 'store') (('It', 'biopsy structure'), 'be') (('I', 'notebook https previous www'), 'one') (('where one component', 'regions'), 'need') (('we', 'results'), 'show') (('regions don expected white t', 'them'), 'be') (('Window Importing Compute 512 256 we', 'region'), 'size') "}