{"name": "big gan 128 lb 12 ", "full_name": " h1 Pretrained Big GAN 128 Scores LB 12 h1 Load Pretrained Big GAN 128 h1 Fun Latent Walk h1 Generate 10000 Dog Images h1 Display Examples h1 Calculate LB Score ", "stargazers_count": 0, "forks_count": 0, "description": "You can read a blog about Big GAN here 1. Display Examples Calculate LB Score LOAD PRETRAINED BIGGAN DEEP 128 CHANGE THE FOLLOWING TWO LINES TO CONTROL WHAT CLASS MORPHS TO WHAT CLASS DOGS ARE CLASSES 151 THRU 281 CATS ARE 281 THRU 294 CATEGORY LIST HERE https gist. Furthermore you can do latent walks between different classes. sum features1 axis 1 0 print rows of zeros in features2 sum np. 5 then the dog images will look photo realistic but they will also have less variation in the background and pose. trace sigma2 2 tr_covmean In production we don t resize input images. Pretrained Big GAN 128 Scores LB 12In this kernel we load Pretrained Big GAN 128 and have fun generating some dog images. com huggingface pytorch pretrained BigGAN 3 https openreview. A full list is here 4. com yrevar 942d3a0ac09ec9e5eb3a Load Pretrained Big GAN 128 Fun Latent WalkBelow are latent walks from dogs to cats. It s amazing how accurate Big GAN generated dogs appear. There is a complete list of classes here 1. shape return np. The competition metric rewards variation more than quality. clean up memory check for image size COMPUTE LB SCORE. The smooth transistions of the latent walks below demonstrate that Big GAN 128 is not a memorizer GAN. Big GAN 128 was trained on the same set of dogs that we are using in Kaggle s Dog Competition. Big GAN 128 can produce 1000 different classes of images. com yrevar 942d3a0ac09ec9e5eb3a START CLASS END CLASS All in tensors If you have a GPU put everything on cuda Generate an image If you have a GPU put back on CPU DISPLAY LATENT WALK GENERATE SAMPLES TRUNCATION VARIABLE AFFECTS QUALITY AND DIVERSITY 281 294 are cats CATEGORY LIST HERE https gist. fit features2 d _ neigh. mean d print rows of zeros in features1 sum np. If we were allowed more than 9 hours to train we could train Big GAN 128 in a Kaggle notebook kernel and submit it as our competition solution Big GAN 128 scores an amazing LB 12 Since we need to turn on internet to download pretrained network weights the outputted images from this notebook kernel cannot be submitted. layername Pretrained_Net final_layer Mean 0 def calculate_memorization_distance features1 features2 neigh NearestNeighbors n_neighbors 1 algorithm kd_tree metric euclidean neigh. Big GAN recognizes 1000 different category classes. For example Labrador retriever is class 208 and Tiger is class 292. com yrevar 942d3a0ac09ec9e5eb3a Generate 10000 Dog ImagesIf we set the variable truncation below to 0. By changing the start class and end class for class_vector below you can control what you would like to see morph into what. In the latent walks above we used truncation 0. 5 and you can see the image quality difference. sum features2 axis 1 0 product might be almost singular covmean linalg. Try changing the code below to see images besides dogs. com syncedreview biggan a new state of the art in image synthesis cf2ec5694024 2 https github. A paper descibing Big GAN is here 3. kneighbors features1 return_distance True print d. Stanford Dogs are a subset of ImageNet Dogs. com yrevar 942d3a0ac09ec9e5eb3a All in tensors If you have a GPU put everything on cuda Generate an image If you have a GPU put back on CPU DISPLAY GENERATED DOGS CLEAR GPU MEMORY Creates graph from saved graph_def. sqrtm sigma1 offset. matmul sigma1 sigma2 tr_covmean tf. dot sigma2 offset numerical error might give slight imaginary component covmean tf. trace covmean return diff. net forum id B1xsqj09Fm 4 https gist. 0 yields LB 12 even though the latter are less photo realistic. We download Big GAN from GitHub here 2 1 https medium. As an example I morph dogs into cats below. This is just for demo purpose. Dogs are classes 151 thru 280 and cats are 281 thru 293. Therefore truncation 0. For example class 472 is a canoe and class 71 is a scorpion. 5 yields LB 34 whereas trucation 1. ", "id": "cdeotte/big-gan-128-lb-12", "size": "2491", "language": "python", "html_url": "https://www.kaggle.com/code/cdeotte/big-gan-128-lb-12", "git_url": "https://www.kaggle.com/code/cdeotte/big-gan-128-lb-12", "script": "pytorch_pretrained_biggan calculate_memorization_distance calculate_activation_statistics normalize_rows get_activations truncated_noise_sample numpy Image linalg calculate_kid_given_paths cosine_distance img_read_checks KernelEvalException(Exception) _get_model_layer tqdm create_model_graph scipy tensorflow division matplotlib.pyplot PIL calculate_frechet_distance print_function __future__ _handle_path_memorization = tf.GraphDef BigGAN distance_thresholding absolute_import ", "entities": "(('they', 'background'), 'look') (('472 class', 'example'), 'be') (('you', 'what'), 'control') (('I', 'cats'), 'morph') (('208 Tiger', 'example'), 'be') (('Fun Latent 128 WalkBelow', 'cats'), 'com') (('Stanford Dogs', 'ImageNet Dogs'), 'be') (('you', 'image quality difference'), '5') (('Furthermore you', 'different classes'), 'do') (('cats', '293'), 'be') (('you', '281 294'), 'com') (('WHAT CLASS DOGS', '151 281 CATS'), 'LOAD') (('com syncedreview', 'image synthesis'), 'biggan') (('we', 'Dog Competition'), 'train') (('Big GAN', 'images'), 'produce') (('We', '2 https here 1 medium'), 'download') (('com 942d3a0ac09ec9e5eb3a Dog 10000 we', 'below 0'), 'yrevar') (('Scores LB Big GAN 128 kernel we', 'dog images'), 'pretrained') (('we', 'truncation'), 'in') (('sum features1', 'sum features2 np'), 'axis') (('You', 'here 1'), 'read') (('we', 't input images'), 'trace') (('Big below GAN', 'latent'), 'walk') (('dot sigma2', 'component slight imaginary covmean'), 'offset') (('outputted images', 'notebook kernel'), 'allow') (('12 even latter', 'LB'), 'yield') (('GENERATED GPU MEMORY', 'graph_def'), 'com') (('com huggingface pytorch', 'https BigGAN 3 openreview'), 'pretraine') (('Big GAN', 'category 1000 different classes'), 'recognize') "}