{"name": "birdclef2021 exploring the data ", "full_name": " h1 Training data Short audio h2 1 Primary species h2 2 Background species h2 3 Location location location h2 4 Rating h1 Training data Soundscapes h1 Test data ", "stargazers_count": 0, "forks_count": 0, "description": "Again you need to predict audible species for 5 second chunks of the audio data. the Western Bluebird wesblu a West coast species. Let s look at the most common entries for birds Nocall seems to be the most common which is no surprise Birds only vocalize occasionally during a recording. com shahules bird watch complete eda fe Again make sure to check out the entire notebook. A value of 85 would mean that this particular segment starts at 00 01 20 and lasts until 00 01 25 of the audio file. It is important to note that these lists might be incomplete and you might be able to hear background species although none are specified in the metadata. The data field seconday_labels contains lists of eBird codes i. Most species have less than 500 recordings available on Xeno canto 1. RatingXeno canto has a rating system for the quality of each recording. Excluding or including recordings of certain call types might help to diversify training data. According to the recording locations the House Sparrow houspa has occurrences around the globe the Northern Cardinal norcar appears to be a typical East coast species of the U. Why is it important Not all birds occur at all locations at all times Let s look at a few examples As we can see different species occur over different spatial scales. Location data can help us to create subsets of the training data for each of the four test data recording locations which we will explore later. These 20 recordings represent 2 of the 4 test recording locations. Use this create the submission file entry. Let s look at the number of different species. Let s look at some values We can see that the majority of recordings does not have an annotation of background species. birds primary label i. Other data fields of the metadata might be of value at some point during development here is a brief description for each of them type Represents the type of the vocalization with song and call as the most common. Test dataIf you re already familiar with the training soundscapes the hidden test set should not be a surprise. Let s look at one example When analyzing file 1234_SSW_20170101. One of the core challenges of this competition is to reduce the number of false positives precision without losing too many true positives recall. Whenever we had to limit the amount of recordings per species for the training data we used the 500 top rated samples. nocall references a segment without any bird vocalization. through loss masking for background species. seconds End time of the 5 second segment for which this entry states the label. Yet some recordings contain very dense acoustic scenes with multiple birds vocalizing at the same time. We limited the number of recordings to 500 for each species but that only affected a dozen species. SHP file Coordinate reference system Lat and Long need to be of type float not object Create geometry Geo Dataframe Create ID for species Add ID to geo_df PLOT Code adapted from https www. The submission file needs to contain the ID of the processed audio chunk fileID_site_time and all audible species as a list of space delimited eBird codes. eBird code of the audible species of this segment. soundscapes is often not possible somebody has to annotate the data for each new deployment for each new recording location. ogg that s a mock filename the audio chunk ending at second 00 00 35 of the entire file would have the unique ID 1234_SSW_35. There is a distinct shift in acoustic domains between the two and it can be very challenging to train classifiers that generalize well enough to bridge the gap. test recordings that can be used for validation or even for training. The primary species annotation consists of three data fields primary_label scientific_name and common_name http. All labels have to be considered as weak labels since we do know which species is audible in the recording but we do not know the exact timestamps of the vocalizations. org about terms we strongly discourage doing so. org species with a species code from the primary_label columns of the metadata. Please note secondary lables only contain labels of species that are actually represented in the data set. Each recording comes with metadata specifying things like recording date recording location and of course the bird species that was recorded. Yet training with target samples i. com shahules bird watch complete eda fe Make sure to check out the entire notebook. A value of 0 means that this particular recording does not have a rating and it is by that the fallback value. Learn more about how and why birds vocalize here https academy. Training data Soundscapes One of the major obstacles in this competition is the significant gap between training and test recordings. However we decided to include some examples of soundscape recordings i. Data fields latitude and longitude contain GPS coordinates as provided by the recordist. Therefore lists of secondary labels are not very reliable but they might still be useful for multi label training e. Training soundscapes only represent two of the four locations COR and SSW. To get a better understanding of the metadata let s look at a few entries. If your classifier thinks that species bluwa1 and redwa2 again mock codes vocalize during this time the final submission entry should look like this 1234_SSW_35 bluwa1 redwa2 A submission for this file should include ALL segments starting at 5 seconds. Training with weakly labeled data is one of the core challenges of this competition. org species gockin Red winged Blackbird https ebird. If you want to know more about the range of a certain species please take a look at the associated eBird entry. Just as Xeno canto is a digital platform that collects audio recordings eBird https ebird. The Bananaquit banana seems to only occur in Central and South America. eBird uses unique species codes to reference birds. com andradaolteanu birdcall recognition eda and audio fe Make sure to ckeck out the entire nootebook. Can be used to diversify the training data. org one of the largest digital archives for bird sounds. Yet recording locations are a good starting point. Training data Short audio The training data for this competition consists of a collection of so called focal recordings. nocall can never appear together with other codes. Let s see how rating values are distributed across the training data Overall the training data contains high quality recordings and the majority of samples is rated with 3. It is important to note that the training data contains more classes than there are species annotated in the test data. Might be of value to distinguish between birds that vocalize during the day and those which only vocalize during the night. license All recordings have an open source license which is noted in this field. Location location locationEach recording comes with a recording location specified in the metadata. But be aware The range of certain species may not be fully reflected by recording location data and the actual range may differ from what we can see in the data. These recordings were made using semi professional equipment often using highly directional microphones and primarily focus on one single species. Background speciesThe metadata for each recording lists the number of audible background species. You can access additional information on each bird species by combining the base URL https ebird. time Time of recording as stated by the recordist. But be aware Training with soundscape data for a few species might introduce unwanted biases when overfitting to one recording site. 0 the latter being the best possible rating and reflect the overall quality assigned by users and the number of background species. The data also shows us that the Red winged Blackbird rewbla American Robin amerob House Sparrow houspa and Northern Cardinal norcar appear to be some of the most common background species. org species amegfiLet s take a look at the number of recordings for each species in the training data We can clearly see that we re facing a so called long tail classification problem with highly imbalanced training data. However the training data only contains species that are likely to occur at the test data recordings sites. It is up to you if you use training soundscapes for validation since they represent the hidden test set or if you use annotated segments for training to cope with the shift in acoustic domains. In our case ratings range from 0. All recordings were contributed by Xeno canto https www. Make sure to respect the license when sharing the data. site Recording site of the soundscape data. We can see a few data fields and here s a brief description for each of them row_id Unique identifier of a 5 second segment of each soundscape file. Make yourself familiar with the training and test data also make sure to check out our other notebooks let us know if you have any comments and of course don t hesitate to start a forum thread if you have any questions. Sub sampling training data based on user rating might help to extract high quality training samples. Segments can have more than one bird in that case eBird codes are separated by space. url A link to the original recording on Xeno canto. Code adapted from https www. 1 Xeno canto uses open data licenses but some of them do not allow derivatives CC ND so we excluded them. Why is nocall important There s a simple reason Your classifier should be able to suppress false positives for these segments which is important for ornithologists when confronted with the detections. Please note that the training data only contains species that are likely to occur at the recording locations of the test data even though sometimes the majority of the recordings were made in Europe. Let s take a look at the label data for this set of recordings. filename A reference to the sound file in the training data. primary labels that recordists annotated. Some recordists focus on a specific subsets of species so there might be some value in these data. Make sure to take a look at the test_soundscape_metadata which contains more information on each location. Like this 1234_SSW_5 nocall 1234_SSW_10 bluwa1 1234_SSW_15 nocall 1234_SSW_20 bluwa1 redwa2 1234_SSW_25 nocall 1234_SSW_30 nocall And so on. But they should nonetheless provide a good overview of what to expect in the hidden test data. Ratings are assigned by users and we adapted this rating scheme for the training data. Filenames contain the file ID recording site and recording date yyyymmdd. org species rewbla American Goldfinch https ebird. Unique eBird codes Make bar chart Show chart Code adapted from https www. org is a citizen science project that collects observations of birds. Yet they might not be 100 representative some species might be missing and only audible in the hidden test set recording equipment might differ. Yet it is highly likely that most of them actually contain one or more additional species. Our dataset contains recordings for 397 different primary species all of them defined by their eBird code the codes that we use as primary label. Crawling Xeno canto for more samples will not be necessary this year and in light of the API limitations imposed by Xeno canto https www. It contains 20 soundscape recordings of 10 minute duration for each of the four recording sites. In combination with the recording data data field date this information can be very useful to map distribution and migration patterns. org birdsong author Acknowledgement to the recordists who contributed the recording. audio_id Identifier used to reference audio recordings. In this competition we included recordings from 4 different sites COL Colombia COR Costa Rica SNE Sierra Nevada SSW Sapsucker Woods. Primary speciesMost importantly the metadata specifies the audible species for each recording. Here are a few examples Golden crowned Kinglet https ebird. ", "id": "stefankahl/birdclef2021-exploring-the-data", "size": "11910", "language": "python", "html_url": "https://www.kaggle.com/code/stefankahl/birdclef2021-exploring-the-data", "git_url": "https://www.kaggle.com/code/stefankahl/birdclef2021-exploring-the-data", "script": "seaborn plotly.graph_objects shapely.geometry matplotlib.pyplot Polygon geopandas Point pandas ", "entities": "(('train very that', 'well enough gap'), 'be') (('you', 'eBird associated entry'), 'take') (('Training data Soundscapes', 'significant training'), 'be') (('Primary speciesMost importantly metadata', 'recording'), 'specify') (('digital that', 'eBird https ebird'), 'be') (('Training soundscapes', 'locations four COR'), 'represent') (('RatingXeno canto', 'recording'), 'have') (('it', 'that'), 'mean') (('audible species', 'eBird codes'), 'need') (('org species', 'Blackbird https ebird'), 'gockin') (('entry', 'label'), 'second') (('eda complete fe', 'entire notebook'), 'watch') (('that', 'data actually set'), 'note') (('you', 'acoustic domains'), 'be') (('how why birds', 'https here academy'), 'learn') (('majority', '3'), 'let') (('different species', 'different spatial scales'), 'be') (('00 00 35', 'unique ID'), 'ogg') (('eBird codes', 'space'), 'have') (('However we', 'soundscape recordings i.'), 'decide') (('s', 'recordings'), 'let') (('we', 'data'), 'differ') (('Sub sampling', 'quality training high samples'), 'help') (('very they', 'label training still multi e.'), 'be') (('particular segment', 'audio file'), 'mean') (('we', 'primary label'), 'contain') (('com andradaolteanu birdcall recognition eda', 'audio entire nootebook'), 'make') (('Excluding', 'training data'), 'help') (('Crawling', 'Xeno canto https www'), 'be') (('which', 'location'), 'make') (('Birds', 'only occasionally recording'), 'vocalize') (('clearly we', 'training highly imbalanced data'), 'take') (('we', 'which'), 'help') (('s', 'When file'), 'let') (('Most species', 'Xeno available canto'), 'have') (('we', 'vocalizations'), 'have') (('100 species', 'recording equipment'), 'be') (('org species', 'American Goldfinch https ebird'), 'rewbla') (('Blackbird rewbla American Robin amerob House Sparrow houspa', 'Northern Cardinal background most common species'), 'show') (('we', 'terms'), 'discourage') (('seconday_labels', 'codes eBird i.'), 'contain') (('20 recordings', 'test recording 4 locations'), 'represent') (('eda complete fe', 'Again entire notebook'), 'watch') (('Northern Cardinal norcar', 'East coast typical U.'), 'have') (('Add PLOT Code', 'https www'), 'object') (('this', 'submission file entry'), 'use') (('which', 'field'), 'license') (('One', 'positives too many true recall'), 'be') (('you', 'questions'), 'make') (('we', '4 different sites'), 'include') (('highly most', 'actually one additional species'), 'be') (('latter', 'background species'), '0') (('Background speciesThe metadata', 'background audible species'), 'list') (('who', 'recording'), 'author') (('information', 'very distribution'), 'be') (('we', 'training data'), 'assign') (('You', 'base URL https ebird'), 'access') (('Bananaquit banana', 'only Central America'), 'seem') (('nocall', 'together other codes'), 'appear') (('recordings', 'primarily one single species'), 'make') (('nocall', 'bird vocalization'), 'reference') (('species primary annotation', 'data three fields'), 'consist') (('that', 'only a dozen species'), 'limit') (('We', 'soundscape file'), 'see') (('which', 'only night'), 'be') (('data Other fields', 'most common'), 'be') (('unique species', 'birds'), 'use') (('multiple birds', 'same time'), 'contain') (('latitude', 'recordist'), 'contain') (('s', 'few entries'), 'let') (('recordings', 'Xeno canto https www'), 'contribute') (('Identifier', 'audio recordings'), 'audio_id') (('It', 'recording four sites'), 'contain') (('Filenames', 'date yyyymmdd'), 'contain') (('which', 'when detections'), 'be') (('recording', 'metadata'), 'come') (('bar chart chart Code', 'https www'), 'make') (('Training data Short training data', 'so called focal recordings'), 'audio') (('Again you', 'audio data'), 'need') (('bird that', 'course'), 'come') (('they', 'test hidden data'), 'provide') (('citizen science that', 'birds'), 'be') (('Training', 'competition'), 'be') (('training data', 'test data'), 'be') (('Golden', 'Kinglet https ebird'), 'be') (('we', '500 top rated samples'), 'have') (('often somebody', 'recording new location'), 'be') (('that', 'test data recordings sites'), 'contain') (('derivatives CC so we', 'them'), 'use') (('s', 'different species'), 'let') (('test that', 'even training'), 'recording') (('majority', 'background species'), 'let') (('even sometimes majority', 'Europe'), 'note') (('1234_SSW_35 submission', '5 seconds'), 'look') (('none', 'metadata'), 'be') (('recordists', 'data'), 'focus') "}