{"name": "bitcoin dogecoin on rapids and elon musk ", "full_name": " h1 Bitcoin Dogecoin Prices Elon Musk and RAPIDS h1 Introduction h3 Libraries Functions h3 Read in Data h1 1 Elon Musk s personality h2 I Tweet Count Evolution h2 II Popularity h2 III Most Frequent Words h2 IV Let s talk about Bitcoin and Dogecoin h1 2 Predict Future Bitcoin Price using RAPIDS h2 I Analyse Bitcoin Evolution h2 II Testing Stationarity h3 Why is Stationarity Important h2 III From non stationarity to stationarity h2 IV What tipe of ARIMA should I choose h3 ARIMA h3 Auto Regressive Model h3 Moving Average Model h3 Auto Regressive Integrated Moving Average h2 V Predicting Bitcoin Price h3 Use ARIMA to forecast the Future h1 3 Is there correlation between Bitcoin and Elon Musk s Tweets h2 Overall View h2 Closer Look h1 4 Is there correlation between Dogecoin and Elon Musk s Tweets h2 Closer Look h3 TODO h1 Work in Progress h1 Specs on how I trained using RAPIDS h3 on my local machine ", "stargazers_count": 0, "forks_count": 0, "description": "18 Libraries Color palette Set Style W B Secrets emoticons symbols pictographs transport map symbols flags iOS chinese char dingbats Extract emoji Remove emoji from text Remove n t xa0 Remove pic. Analyse Bitcoin Evolution The W B Dashboard https wandb. Closer LookLet s use a magnifying glass and look closer to our points in time. Hence we ll try to tweak these parameters and get ourselves the best model. Why is Stationarity Important For data to be stationary the statistical properties of a system do not change over time. if you want you can find a correlation anywhere you look. Popularity Note It seems that his popularity grew with the number of tweets. We could have noticed that by only using our naked eye but we always need to double check. The W B Dashboard https wandb. apply lambda x clean_emoji x Strip of whitespaces Remove punctuation Make lowercase Tweets Create new features Clean Tweets Bitcoin Dogecoin Prints There are many missing values in Bitcoin data Hence we ll drop them Save Tweets data to W B Artifacts Yearly evolution Plot Picture Save Graph in W B Dashboard as well Get Popularity Information Plot ax. He was already known before but 2015 got him on a whole new level by announcing Tesla s Powerwall battery and putting out his personal life through his biography. if you re really deeply paying attention. He increased gradually in likes with the peak in 2020 and I bet he ll continue in 2021 as well but the replies reached a peak as well he s communicating more with a broader audience who s speaking back. We can do that by applying a natural log to our series. Auto Regressive Integrated Moving Average Explains a given time series based on its own past values that is its own lags and the lagged forecast errors so that equation can be used to forecast future values. If the data is non stationary meaning it has a trend we need to remove it in order to proceed with the analysis. Is there correlation between Dogecoin and Elon Musk s Tweets Is there Closer Look TODO Import W B overlapped graphs Work in Progress Specs on how I trained using RAPIDS on my local machine Z8 G4 Workstation 2 CPUs 96GB Memory NVIDIA Quadro RTX 8000 RAPIDS version 0. It s used for forecasting when there is some correlation between values in a time series and the values that precede and succeed them. Let s talk about Bitcoin and. Choosing data that is closer This is how the logs look now in our Dashboard Pro Tip If you would like to change something in the W B Graph and you want it to show in the Dashboard simply click Detach at the top after you ve made your changes Use ARIMA to forecast the Future The W B Dashboard https wandb. Tweet Count Evolution Note At the beginning of his tweeting journey he was barely using the platform a few times in a year. Libraries Functions You can learn more about W B in this great kernel right here https www. The steps will be Selecting only a small portion of data test we don t have to train on all 3 mil rows of data. Let s see how that s done IV. com ayuraj experiment tracking with weights and biases. twitter and http https links Remove mentions and hashtags Extract Emojis and Remove from Tweet df tweet_emojis df tweet_emojis. To be observed that the wording sounds super positive yes yeah good thank people sure. Overall View It doesn t really look like there is any strong correlation or that the tweets drive peaks. Let s see how the tweets look his progression over time and get an overall feel of how what when he tweets. Dogecoin I wanted to throw Dogecoin in there for fun. From non stationarity to stationarityNow that we now our series has a trend we need to remove it in order to proceed with the models. Predicting Bitcoin PriceNow let s predict Bitcoin Prices by using an ARIMA 1 1 2 model. Is there correlation between Bitcoin and Elon Musk s Tweets Let s find out In order to do this I ve decided to look at the points in time when Elon tweeted about Bitcoin. Elon Musk s personalityOk let s have a bit of fun first. Bitcoin Dogecoin Prices Elon Musk and RAPIDS IntroductionWhat does a virtual coin that people like or hate an excentric person that wants to get old on Mars and the suite of software libraries on GPUs all have in common Well you know what they say. com rapidsai cuml tree branch 0. It s also the year when Elon became. 2015 was his breaking point when he started tweeting more and more every year. It is of the utmost importance to determine how the series is behaving before applying any model to it. Predict Future Bitcoin Price using RAPIDS We ll use the RAPIDS distribution for this experiment as our data is extremely large more than 3 million observations. set_text n Save Graph in W B Dashboard as well Create W B Barplots Make worldcloud Plot Save image to W B Retrieve only Bitcoin Information Information Log to W B Log to W B Perform Dickey Fuller test Determing rolling statistics Plot rolling statistics Log to W B Adjust by applying natural log over the series Save the price with no trend into a new variable Fit an ARI model AR 1 I 1 Print Information on the model Fit an MA model I 1 MA 1 Print Information on the model Fit an MARIMA model AR 1 I 1 MA 2 Print Information on the model Convert from array to list Append new value Convert back to array VARIABLES Select only a small portion of the data Split into Train and Test data For each value in the 100 prices in test set Fit the arima model onto train data Predict next value Append the original value to training data Compute the error of model Append information Log to W B Prepare info to be plotted Plot Log to W B Get bitcoin info Convert date to number Get only latest bitcoin data as Elon never tweeted before 2018 Get intersection Plot Get bitcoin info Convert date to number Get only latest bitcoin data as Elon never tweeted before 2018 Get intersection Plot Get bitcoin info Convert date to number Get intersection Plot Get bitcoin info Convert date to number Get intersection Plot. Augmented Dicky Fuller test it determines how strongly a time series is defined by a trend. Goal This notebook has the purpose of analysing and predicting bitcoin prices using RAPIDS as well as identifying if there is any impact from Elon Musk s tweets on the fluctuation of the bitcoin prices. Testing StationarityOur time series data can have a trend or not. You can find out more about RAPIDS and cuml here https github. This will help us understand a bit of his behavior as well as address and analyse the tweets that mention Bitcoin. ai andrada bitcoin musk workspace user andrada II. com bitcoin price prediction using time series forecasting 9f468f7174d3 And surprise surprise The series has a trend is non stationary. Moving Average Model The moving average model specifies that the output variable depends linearly on the current and various past values of a stochastic imperfectly predictable term. My Reference Bitcoin Price Prediction https towardsdatascience. This does not mean that the values for each data point have to be the same but the overall behavior of the data should remain constant. What tipe of ARIMA should I choose ARIMA AR Auto Regressive model I Integrated MA Moving AverageLet s take them step by step Auto Regressive Model An autoregressive AR model predicts future behavior based on past behavior. Alternative Hypothesis H1 Alternative Hypothesis of the test is that the time series is stationary. The less information lost the better the model. Link to your own key in W B https wandb. You can observe some sudden peaks within a few days 1 do 4 days of the making of the tweet. I like that a lot he s always super positive and enthusiastin in his messages. well he became the rockstar we know now. ai authorize Read in Data 1. ai andrada bitcoin musk workspace user andrada 2. Criterias Log Likelihood Akaike and Bayesian Information Criterion are indicators that tell us how well our model is performing meaning how much information it s lost. Null Hypothesis H0 Null hypothesis of the test is that the time series can be represented by a unit root that is not stationary. ai andrada bitcoin musk workspace user andrada 3. Most Frequent Words Note alot of talk about Tesla rocket Mars starship launch. ", "id": "andradaolteanu/bitcoin-dogecoin-on-rapids-and-elon-musk", "size": "7751", "language": "python", "html_url": "https://www.kaggle.com/code/andradaolteanu/bitcoin-dogecoin-on-rapids-and-elon-musk", "git_url": "https://www.kaggle.com/code/andradaolteanu/bitcoin-dogecoin-on-rapids-and-elon-musk", "script": "emoji_extractor clean_emoji plot_prediction STOPWORDS as stopwords_wc OffsetImage ARIMA numpy test_stationarity seaborn _show_on_single_plot create_wandb_barplot STOPWORDS show_values_on_bars adfuller       ### Augmented Dickey Fuller create_wandb_lineplot matplotlib.offsetbox clean_tweets matplotlib.pyplot kaggle_secrets AnnotationBbox ImageColorGenerator pandas statsmodels.tsa.stattools datetime color append matplotlib WordCloud UserSecretsClient cuml.tsa.arima offset_png wordcloud ", "entities": "(('really strong tweets', 'peaks'), 'View') (('it', 'how much information'), 'Log') (('that', 'unit root'), 'be') (('that', 'Bitcoin'), 'help') (('anywhere you', 'correlation'), 'want') (('Hence we', 'best model'), 'try') (('trend', '9f468f7174d3'), 'prediction') (('time how strongly series', 'trend'), 'test') (('changes', 'W B Dashboard https wandb'), 'be') (('Remove', 'text Remove t xa0 Remove n pic'), 'ios') (('Closer LookLet', 'time'), 'use') (('when he', 'how what'), 'let') (('breaking when he', 'more'), 'be') (('they', 'what'), 'Prices') (('We', 'series'), 'do') (('You', 'RAPIDS'), 'find') (('Libraries You', 'https right here www'), 'function') (('notebook', 'bitcoin prices'), 'Goal') (('lot he', 'always super messages'), 'like') (('Dogecoin I', 'in there fun'), 'want') (('we', 'models'), 'from') (('You', 'tweet'), 'observe') (('we', 'analysis'), 'have') (('he', 'a few times year'), 'Note') (('s', 'fun'), 'let') (('popularity', 'tweets'), 'Note') (('data', 'experiment'), 'Price') (('forecast own lagged equation', 'future values'), 'explain') (('Auto Regressive AR autoregressive model', 'past behavior'), 'choose') (('statistical properties', 'time'), 'be') (('Hence we', 'Popularity Information Plot as well ax'), 'apply') (('machine GB Memory NVIDIA local Z8 G4 Workstation 2 CPUs 96 Quadro', 'RAPIDS RTX 8000 version'), 'be') (('that', 'them'), 'use') (('less information', 'better model'), 'lose') (('we', 'always check'), 'notice') (('you', 'really deeply attention'), 'pay') (('overall behavior', 'data'), 'mean') (('wording', 'super good people'), 'observe') (('time series data', 'trend'), 'have') (('who', 'broader audience'), 'increase') (('how series', 'it'), 'be') (('time series', 'test'), 'be') (('when Elon', 'Bitcoin'), 'be') (('s', '1 ARIMA 1 2 model'), 'let') (('output variable', 'stochastic imperfectly predictable term'), 'move') (('already 2015', 'biography'), 'know') (('Plot', 'intersection Plot'), 'n') (('we', 'data'), 'select') "}