{"name": "brain tumor detection using cnn ", "full_name": " h1 Brain tumor h3 About h3 Statistics h3 Diagnosis h1 What a brain tumor looks like h1 Types of Brain tumor h4 Glioma Occurs at the base of the brain h4 Pituitary tumors occur in pituitary gland responsible for growth of the body h4 Meningioma tumor grows from meninges layers of tissue covering the brain and the spinal cord h1 Image Processing h1 Convert Images to Numpy arrays h1 Scale the arrays h1 Plots of some training samples h1 Class frequency distribution h1 Synthetic Minority Oversampling h1 Images of test samples h1 Model creation and training h1 Use ImageDataGenerator for image data augmentation h2 Model implementation h1 Prediction ", "stargazers_count": 0, "forks_count": 0, "description": "Images of test samples Model creation and training Use ImageDataGenerator for image data augmentation Model implementation Prediction create arrays. Brain tumor AboutA brain tumor is a collection or mass of abnormal cells in your brain. But the label no_tumor has only 395 samples. The skull which encloses the brain is very rigid and hence when the tumors grow inside the brain they put pressure on the skull and can lead serious damages. The 5 year survival rate with a cancerous brain tumor is approximately 34 in men and 36 in women. 826 822 and 827 respectively. Pituitary tumors occur in pituitary gland responsible for growth of the body. DiagnosisAccurate diagnosis should be done for detecting brain tumor to start proper treatment early so as to improve the life expectancy of the patient. What a brain tumor looks like Types of Brain tumor Glioma Occurs at the base of the brain. Meningioma tumor grows from meninges layers of tissue covering the brain and the spinal cord. Since the number of samples for no_tumor class is less let s oversample that class using SMOTE from imblearn package. Best technique to diagnose for brain tumor is Magnetic Resource Imaging MRI. It accounts for 85 90 of all Central Nervous System tumors. Image Processing Convert Images to Numpy arrays Scale the arrays Plots of some training samples Class frequency distribution Synthetic Minority Oversampling Glioma tumor Meningioma tumor and Pituitary tumor almost same number of datasets ie. StatisticsA brain tumor is considered one of the most aggresive diseases among children and adults. Every year about 11 700 people are diagnosed with brain tumor. ", "id": "shiratorizawa/brain-tumor-detection-using-cnn", "size": "1964", "language": "python", "html_url": "https://www.kaggle.com/code/shiratorizawa/brain-tumor-detection-using-cnn", "git_url": "https://www.kaggle.com/code/shiratorizawa/brain-tumor-detection-using-cnn", "script": "classification_report keras.layers keras.models train_test_split keras SMOTE keras.preprocessing.image Image numpy MaxPooling2D accuracy_score img_to_array Dropout ImageDataGenerator BatchNormalization imblearn.over_sampling Dense keras.callbacks tensorflow KFold matplotlib.pyplot ModelCheckpoint conv_layer Sequential PIL sklearn.model_selection Conv2D load_model Input get_array dens_layer RandomizedSearchCV display sklearn.metrics cnn Flatten ", "entities": "(('Pituitary tumors', 'body'), 'occur') (('label', 'only 395 samples'), 'have') (('Meningioma tumor', 'brain'), 'grow') (('It', 'Nervous System Central tumors'), 'account') (('they', 'serious damages'), 'be') (('frequency Class distribution', 'Synthetic Minority Oversampling Glioma tumor Meningioma Pituitary almost same datasets'), 'Images') (('brain StatisticsA tumor', 'children'), 'consider') (('less s', 'imblearn package'), 'be') (('Use ImageDataGenerator', 'arrays'), 'image') (('Glioma', 'brain'), 'look') (('11 year about 700 people', 'brain tumor'), 'diagnose') (('Best technique', 'brain tumor'), 'be') (('year survival 5 rate', 'women'), 'be') (('DiagnosisAccurate diagnosis', 'patient'), 'do') (('Brain tumor AboutA brain tumor', 'brain'), 'be') "}