{"name": "breast cancer interpretation knn and logreg ", "full_name": " h1 Data Science OSEMN h1 OSEMN Scrubbing Cleaning our data h1 After thinking what would be the best way to handle Missing data h1 OSEMN E Exploring Visualizing our data h1 OSEMN M h3 Conclusion h2 Logistical Regression h2 KNN seems to have a better performance however I would consider the fact that we have ", "stargazers_count": 0, "forks_count": 0, "description": "gov pmc articles PMC6004076 OSEMN M Modeling our data will give us our predictive power as a wizard Applying Maching Learning 1. shape are equal to those missing Value3. CHECK HERE https www. Crucial for their organization and function is a highly specialized network of cell which reveals an important contribution of polarity proteins to the initiation and progression of cancer please cheeck this link for the references CHECK HERE https www. com cancer research articles cancer cells vs normal cells 3073663. I am using OSEMN methodology Obtain Scrub Explore Model iNterpret to standardized my data analysis process3. If you Know any other way of Doing that Please let me know Conclusion KNN seems to be a good model to predict the breast Cancer because 1. The best K_neigh number is 3 Logistical Regression KNN seems to have a better performance however I would consider the fact that we have1. Logistical Regression KNN 1. Between KKN and Logistical Regressiion KNN predicts better with a f1 score of 96 vs 95. Shape Same cases of Cl. gov pmc articles PMC3678677 Conclusion 1. Size in this cases the data shows most 0 benign tumor happened to have cell size 1 I would say the bigger the cel is the higher chances of having malignant tumor here we have a possible reason Cancer is a complex genetic disease that is caused by specific changes to the genes in one cell or group of cells. and it seems that this cells gradually transform to form the cancer cells CHECK HERE https www. The Challenge in KNN it is to find K that fits the best in order to do that I First evaluated K from a range 0 50 and stimate the Error This is my First KNN 2. com science article abs pii S092777651930178X2. In this Kernel I am using a breast cancer databases was obtained from the University of Wisconsin Hospitals Madison from Dr. gov pmc articles PMC5564663 2. one of the reason could be this is one of the most common cancers occurring in the female population world wide. k nearest neighbors KNN 2. Cell shape Cell Size and nucleolus are the most significante varaiable based on the correlation 3. Any feedback it is more than welcome Data Science OSEMN Obtaining Our Data OSEMN Scrubbing Cleaning our data After thinking what would be the best way to handle Missing data I concluded that filling the data with mean or mode it wouldbe great however after taking a look of the Corre cell size Cell. nuclei one more time the bigger it is the higher chances are. Then I will used the KNN that has less error I read on the Web that this method it is called the Elbow Method 3. Eptih size The greater the Marge Adhension values is the higher chances of having malignant tumor also increase one of the reason coud be because according to this study Most cancers arise in epithelia the tissue type that lines all body cavities. The organization of epithelia enables them to act as a barrier and perform transport of molecules between body compartments. CHECK THIS https www. I would find the index of the missing Value2. cromatin In My understanding it is a mechanical and chemical signalling pathways It this study https pubmed. To predict benign or malignant Cancer2. I will find the mode My assumption is if they share same size and shape they just have something in common OSEMN E Exploring Visualizing our data Finding any Patterns and Trends As mentioned Before Cell. gov pmc articles PMC6267422 text A 20nucleolus 20as 20an 20opponent 20of 20cancer 20cells 20via 20p53 or 20transformed 20cells 20from 20spreading. Mitoses After reading I understood that mitosis it is a natural process of the cell reproduce divide etc but sometime there are some mistakes I guess in this study they were measuring form a sample perfect cell Vs mutants if it is like that I would say the More perfec cells you have it is a good sight the yout body is copying and pasting new cel properly https www. 0 458 benign and 1 241 malignant and this might affect the model bias 2. These changes disrupt normal cell function specifically affecting how a cell grows and divides. the acurrance is 96 2. Thickness It is intersting to notice that having really thick plasma membrane is not guarantee of benign or malignant tumor of course no one can guaratee it but no matter the thickness 1 or 10 cases has been reported and this study suggest The magnitude of the sensed stiffness can either promote or inhibit the migration of cancer cells out of the primary tumor into surrounding tissue CHECK THIS https www. gov 10546890 they mentioned that tit is measured from 1 to 10 no idea what the chances of having a maling tumor increase whrn it is above 32. Adhension The greater the Marg. In response to stress some of this anti cancer body friends participate in preventing impaired or transformed cells from spreading the more that you have The less chances of having malignant cancer I like this cells https www. gov pmc articles PMC3927155 3. nucleolus in this study mentioned nucleolus as an opponent of cancer cells. I would match other ID people Who cell size Cell. Nuclei have strong relation It is evident that most of the mean are between 0 2 this might be because it is from microscopic view Conclusion 1. Adhension values is the higher chances of having malignant tumor also increase one reason could has been explained in this study they affirmed that a group of cell adhesion molecules have been discovered with a wide spectrum of responsibilities including recruiting activating elongating and maintaining. KNN and Logistica Regression 1. I am using KNN and Logistical Regression to predict benign or malignant Cancer4. ", "id": "megr25/breast-cancer-interpretation-knn-and-logreg", "size": "6070", "language": "python", "html_url": "https://www.kaggle.com/code/megr25/breast-cancer-interpretation-knn-and-logreg", "git_url": "https://www.kaggle.com/code/megr25/breast-cancer-interpretation-knn-and-logreg", "script": "IPython.display confusion_matrix KNeighborsClassifier  # Algorithm numpy Image seaborn cufflinks f1_score sklearn.neighbors train_test_split #train and split sklearn.linear_model StandardScaler #scaler to 0-1 matplotlib.pyplot PIL sklearn.model_selection pandas classification_report # metrics LogisticRegression display sklearn.metrics sklearn.preprocessing ", "entities": "(('Cell shape Cell Size', 'most significante correlation'), 'be') (('they', 'Cell'), 'find') (('which', 'references'), 'be') (('them', 'body compartments'), 'enable') (('data', 'wizard Applying Maching Learning'), 'article') (('Logistical Regressiion KNN', '95'), 'predict') (('method it', 'Web'), 'use') (('I', 'Obtain Scrub Explore Model data analysis'), 'use') (('nucleolus', 'cancer cells'), 'mention') (('yout good body', 'https new cel properly www'), 'mitose') (('group', 'elongating'), 'be') (('I', 'cells https www'), 'in') (('Who', 'cell size Cell'), 'match') (('breast cancer databases', 'Dr.'), 'use') (('we', 'fact'), 'be') (('it', 'microscopic view'), 'have') (('cells', 'cancer gradually cells'), 'seem') (('I', 'missing Value2'), 'find') (('study https', 'mechanical signalling It'), 'cromatin') (('magnitude', 'https CHECK www'), 'interste') (('filling', 'Corre cell size'), 'feedback') (('that', 'body cavities'), 'size') (('This', '0 50 Error'), 'be') (('I', 'Logistical benign Cancer4'), 'use') (('it', '32'), 'mention') (('1 458 this', 'model bias'), 'benign') (('specifically how cell', 'cell normal function'), 'disrupt') (('this', 'population female world'), 'be') (('Conclusion KNN', 'breast good Cancer'), 'know') (('complex genetic that', 'cells'), 'show') "}