{"name": "breast cancer gene data ", "full_name": " h1 BREAST CANCER GENE DATA h1 About Breast Cancer h1 Import necessary packages h1 Reading the data h1 Checking for null values h1 Basic Analysis of Features h1 Numerical Features h1 Categorical Features h1 Parallel Categories h1 Model h1 Accuracy 82 ", "stargazers_count": 0, "forks_count": 0, "description": "Substantial support for breast cancer awareness and research funding has helped created advances in the diagnosis and treatment of breast cancer. com dharineeshk Accuracy 82 fixing custom colors based on the aesthetic of this notebook Prediction Scores. After skin cancer breast cancer is the most common cancer diagnosed in women in the United States. Breast cancer survival rates have increased and the number of deaths associated with this disease is steadily declining largely due to factors such as earlier detection a new personalized approach to treatment and a better understanding of the disease. The relative heights of the rectangles reflect the relative frequency of occurrence of the corresponding value. Each variable in the data set is represented by a column of rectangles where each rectangle corresponds to a discrete value taken on by that variable. BREAST CANCER GENE DATA cancer cancer https www. Combinations of category rectangles across dimensions are connected by ribbons where the height of the ribbon corresponds to the relative frequency of occurrence of the combination of categories in the data set. Breast cancer can occur in both men and women but it s far more common in women. org sites main files styles uicc_news_main_image public thumbnails image BCAM2016_FA. Import necessary packagesReading the data Checking for null values Basic Analysis of Features Numerical Features Categorical Features Parallel Categories The parallel categories diagram also known as parallel sets or alluvial diagram is a visualization of multi dimensional categorical data sets. Model Code Contributor https www. png Picture of cancer awareness About Breast Cancer Breast cancer is cancer that forms in the cells of the breasts. ", "id": "varshinipj/breast-cancer-gene-data", "size": "2592", "language": "python", "html_url": "https://www.kaggle.com/code/varshinipj/breast-cancer-gene-data", "git_url": "https://www.kaggle.com/code/varshinipj/breast-cancer-gene-data", "script": "train_test_split model_function plot_importance plotly.express confusion_matrix xgboost sklearn.svm numpy XGBClassifier accuracy_score seaborn SGDClassifier MLPClassifier preprocessing plot_tree SVC XGBRFClassifier GaussianNB sklearn.neighbors sklearn.naive_bayes sklearn.tree sklearn.neural_network sklearn.linear_model sklearn DecisionTreeClassifier sklearn.model_selection pandas RandomForestClassifier LogisticRegression plotly.figure_factory KNeighborsClassifier LabelEncoder sklearn.metrics sklearn.ensemble sklearn.preprocessing ", "entities": "(('Substantial support', 'breast cancer'), 'help') (('org sites', 'files thumbnails main public image'), 'style') (('where rectangle', 'variable'), 'represent') (('that', 'breasts'), 'be') (('where height', 'data set'), 'connect') (('skin cancer breast cancer', 'United States'), 'be') (('also known', 'data alluvial multi dimensional categorical sets'), 'import') (('it', 'far more women'), 'occur') (('number', 'better disease'), 'increase') (('relative heights', 'corresponding value'), 'reflect') "}