{"name": "breast cancer images classification ", "full_name": " h1 CHECK OUT ALL MY WORK HERE h1 YOU CAN FIND BREAST CANCER CLASSIFICATION WITH 98 HERE h2 Inspiration h2 Content h2 Introduction h1 1 data preparation h2 A import library and packages h2 B Exploring the data h4 We have a total number of about 280 sub folders let s take a peak into the folder and try and understand what those sub folders are h4 Each subfolder seems to be the ID of the corresponding patient h4 Each file has 2 sub folders labeled 1 and 0 h2 conclusion h1 What do we know about our data h1 NEXT STEP h2 Storing the image path patient id target and x y coordinates h1 Data Analysis h3 Now that we have set up our data let s create a visual summary to help us draw some insights from our data h3 Healthy Tissue Patches Vs Cancerous Tissue Patches h3 A Cancerous Patches h3 B Non Cancerous Patches h3 Visualizing the Breast Tissue h3 Insights h3 Repatching the Actual Breast Tissue Image h3 1 Splitting Data to Cancerous and non Cancerous data h3 2 Creating New Training Testing Dataset h3 3 Shuffling Our Data h1 RGB PCA ", "stargazers_count": 0, "forks_count": 0, "description": "And that is the range of pixel. From that 277 524 patches of size 50 x 50 were extracted 198 738 IDC negative and 78 786 IDC positive. It would be interesting to plot a heatmap of the most common areas where the cancer appears. uint8 is used unsigned 8 bit integer. We will split our data as follows 1. Training Data Data that we will use to train our model2. Storing the image_path patient_id target and x y coordinates Data Analysis Now that we have set up our data let s create a visual summary to help us draw some insights from our data. Which of them are IDC patches and which are Non IDC In order to train our model we need to feed our model each patch individually therefore each patch will act as an input. Out of Sample Data Data that we will use to further validate our testing. Each subfolder seems to be the ID of the corresponding patient Each file has 2 sub folders labeled 1 and 01. IntroductionCancer is a serious public health issue worldwide and the second leading cause of death in the United States. This paper introduces a histopathological microscopy image dataset of 922 images related to 124 patients with IDC. Folder 1 Invasive Ductal Carcinoma IDC conclusion What do we know about our data 1. jpg 504px Lobules_and_ducts_of_the_breast. The dataset has been published and is accessible through the web at http databiox. 0 S2352914820300757 gr1. Testing Data Data that we will use to test our model3. Splitting Data to Cancerous and non Cancerous data 2. The distinctive feature of this dataset as compared to similar ones is that it contains an equal number of specimens from each of three grades of IDC which leads to approximately 50 specimens for each grade. Folder 0 Non Invasive Ductal Carcinoma IDC 2. org wikipedia commons thumb 4 47 Lobules_and_ducts_of_the_breast. com midouazerty breast cancer prediction 99 InspirationAbstractBreast cancer is a common cancer in women and one of the major causes of death among women around the world. Each patient has a batch of patches that were extracted therefore the total number of patches is likely much greater than 280. If position of the crop has significance then perhaps we can use it as an input feature for our model. Whereas double is used to handle very big numbers. jpg 1 data preparation A import library and packages B Exploring the data We have a total number of about 280 sub folders let s take a peak into the folder and try and understand what those sub folders are. 1 million diagnosed cases in 2018. com content image 1 s2. This will help us visualize how the cancerous tissue looks like from a macro perspective. Usually this is taken before preprocessing the data. Shuffling Our Data RGB PCA data processing and linear algebra Data Visualiation Machine learning algorithme note that we loop through the classes after looping through the patient ids so that we avoid splitting our data into all class 0 then all class 1 Extracting Image Paths Extracting Image Coordinates We create a new dataframe using the list of dicts that we generated above default theme Plotting Frequency of Patches per Patient Plotting Percentage of an image that is covered by Invasive Ductile Carcinoma Plotting number of patches that show IDC below is a counter to cycle through the image indexes below is a counter to cycle through the image indices Plotting Settings Get patient dataframe Get the dimensions of the breast tissue image Allocate an array to fill image pixels in use uint8 type as you don t need an int over 255 Replace array values with values of the image Replace array values with cropped image values Check if target is cancerous or not If the target is cancerous then replace array values with the color blue if prediction is not specifies then show the image normally if prediction is specified then apply a mask to the areas that contain predicted cancerous cells Specify the desired alpha value This is step is very important adding 2 numpy arrays sets the values to float64 which is why convert them back to uint8 Set the patient ids as indices for the dataframe Select all columns except the target column and store it in X Select the target column and store it in y OS stands for Out of Sample We split it even further and obtain the training and testing dataframes Dataframe containing cancerous images Dataframe containing normal images get the total number of images initialize counter that keeps track of position of image being loaded initialize empty array in order fill in the image values Read the image into a numpy array reshape the image to such that the rgb values are the columns of the matrix replace the empty array with the values inside the image update position counter initialize pca to reduce rgb scale to a single dimensional scale fit pca object to the contents within the grid delete grid to free up sum memory. Creating New Training Testing Dataset 3. Where u is the patient ID 10253idx5 X is the x coordinate of where this patch was cropped from Y is the y coordinate of where this patch was cropped from and C indicates the class where 0 is non IDC and 1 is IDC. According to the International Agency for Research on Cancer IARC about 18. An appropriate dataset is the first essential step to achieve such a goal. png example 10253idx5x1351y1101class0. Sometimes we don t have the full tissue information. A Cancerous Patches B Non Cancerous Patches Visualizing the Breast TissueEarlier we extracted the coordinates of the cropped tissue cells we can use those coordinates to reconstruct the whole breast tissue of the patient. com midouazerty code YOU CAN FIND BREAST CANCER CLASSIFICATION WITH 98 HERE https www. Therefore for images uint8 type is used. CHECK OUT ALL MY WORK HERE https www. We need to implement our model in such a way that it maximizes generalization. Repatching the Actual Breast Tissue ImageNow it s time to go one step deeper with our EDA. Early accurate diagnosis plays an important role in choosing the right treatment plan and improving survival rate among the patients. Now that we have a good understanding of the file structure let s try and understand how much data we are about to process. Healthy Tissue Patches Vs Cancerous Tissue PatchesLet us now explore the visual differences between cancerous tissue cells and healthy tissue cells. This way we can explore how the diseased tissue looks when compared to the healthy tissue. We can also explore the most common places that the cancer tends to occur in. Cancerous Tissue tends to appear in clusters rather than being dispersed all over the place. jpg ContentThe original dataset consisted of 162 whole mount slide images of Breast Cancer BCa specimens scanned at 40x. 1 breast cancer is a common cancer and one of the major causes of death worldwide with 627 000 deaths among 2. This sample size is relatively small therefore we have to be careful not to overfit our model. How many patches do we have in total 2. 6 million deaths caused by cancer were reported in 2018. Instead of plotting the target values using the x y coordinates we now plot the images themselves on their respective x y coordinates. How many patients do we have It seems that we have a total number of 280 patients. The snippet below loops through the entire file structure and extracts the total number of crops for each of the classes. Each patch s file name is of the format uxXyYclassC. let s split our data into training and testing sets. Invasive ductal carcinoma IDC is the most widespread type of breast cancer with about 80 of all diagnosed cases. 1 million new cases and 9. In recent years efforts have been made to predict and detect all types of cancers by employing artificial intelligence. It seems that tissue patches have been discarded or lost during preparation. Let s now visualize what some of the reconstructed tissue cells look like by using the function above. We can t have pixel value more than 2 8 1. To simplify things we will create a function that slices our existing dataframe and retrieves the values associated with a patient id. Usually partnering with a specialist is a good idea so that they can point the exact points of interest that differentiate the 2 from each other. ", "id": "midouazerty/breast-cancer-images-classification", "size": "6430", "language": "python", "html_url": "https://www.kaggle.com/code/midouazerty/breast-cancer-images-classification", "git_url": "https://www.kaggle.com/code/midouazerty/breast-cancer-images-classification", "script": "get_patient_df train_test_split os listdir numpy njit seaborn skimage ListedColormap glob cv2 io IncrementalPCA tqdm rgb_to_grayscale sklearn PCA StratifiedKFold matplotlib.pyplot matplotlib.colors svm numba pandas sklearn.model_selection shuffle_patients tqdm.notebook get_classes_split pprint visualise_breast_tissue sklearn.decomposition ", "entities": "(('that', 'other'), 'be') (('where cancer', 'most common areas'), 'be') (('Vs Cancerous Tissue PatchesLet us', 'tissue cancerous cells'), 'healthy') (('that', 'patient i d'), 'create') (('double', 'very big numbers'), 'use') (('efforts', 'artificial intelligence'), 'make') (('we', 'patient'), 'patch') (('relatively therefore we', 'model'), 'have') (('we', '280 patients'), 'have') (('InspirationAbstractBreast 99 cancer', 'world'), 'be') (('individually therefore patch', 'input'), 'be') (('breast 1 cancer', '2'), 'be') (('some', 'function'), 'let') (('ductal carcinoma Invasive IDC', 'diagnosed cases'), 'be') (('file', 'sub 2 folders'), 'seem') (('how much we', 'file structure'), 'let') (('we', 'model2'), 'Training') (('cancer', 'that'), 'explore') (('how diseased tissue', 'when healthy tissue'), 'explore') (('appropriate dataset', 'first essential goal'), 'be') (('rgb values', 'sum memory'), 'shuffle') (('sub folders', 'folder'), 'preparation') (('paper', 'IDC'), 'introduce') (('Early accurate diagnosis', 'patients'), 'play') (('6 million deaths', '2018'), 'report') (('Usually this', 'data'), 'take') (('IntroductionCancer', 'United States'), 'be') (('dataset', 'http databiox'), 'publish') (('file name', 'format'), 'be') (('which', 'grade'), 'be') (('how cancerous tissue', 'macro perspective'), 'help') (('s', 'training sets'), 'let') (('we', 'data'), 'conclusion') (('we', 'model3'), 'Testing') (('it', 'one step deeper EDA'), 'repatche') (('then perhaps we', 'model'), 'use') (('t', 'pixel value'), 'have') (('non 1', 'class'), 'be') (('we', 'respective coordinates'), 'plot') (('it', 'generalization'), 'need') (('Cancerous Tissue', 'rather all place'), 'tend') (('50 50', 'size'), 'extract') (('Sometimes we', 'don tissue full information'), 'have') (('we', 'further testing'), 'use') (('jpg ContentThe original dataset', '40x'), 'consist') (('YOU', 'HERE https 98 www'), 'find') (('us', 'data'), 'store') (('tissue patches', 'preparation'), 'seem') (('therefore total number', 'likely much 280'), 'have') "}