{"name": "cancer benign malignant svm ", "full_name": " h1 SVM Support Vector Machines h2 Objectives h1 Table of contents h2 Load the Cancer data h1 Click here and press Shift Enter h3 Load Data From CSV File h2 Data pre processing and selection h2 Train Test dataset h2 Modeling SVM with Scikit learn h2 Evaluation h4 THANKU FOR READING MY NOTEBOOK ", "stargazers_count": 0, "forks_count": 0, "description": "A separator between the categories is found then the data is transformed in such a way that the separator could be drawn as a hyperplane. Train Test datasetOkay we split our dataset into train and test set Modeling SVM with Scikit learn The SVM algorithm offers a choice of kernel functions for performing its processing. The characteristics of the cell samples from each patient are contained in fields Clump to Mit. Following this characteristics of new data can be used to predict the group to which a new record should belong. SVM Support Vector Machines Objectives Use scikit learn to Support Vector Machine to classifyIn this notebook you will use SVM Support Vector Machines to build and train a model using human cell records and classify cells to whether the samples are benign or malignant. csv https cf courses data. The fields in each record are Field name Description ID Clump thickness Clump Clump thickness UnifSize Uniformity of cell size UnifShape Uniformity of cell shape MargAdh Marginal adhesion SingEpiSize Single epithelial cell size BareNuc Bare nuclei BlandChrom Bland chromatin NormNucl Normal nucleoli Mit Mitoses Class Benign or malignant For the purposes of this example we re using a dataset that has a relatively small number of predictors in each record. Click here and press Shift Enter wget O cell_samples. Let s just use the default RBF Radial Basis Function for this lab. Sigmoid Each of these functions has its characteristics its pros and cons and its equation but as there s no easy way of knowing which function performs best with any given dataset we usually choose different functions in turn and compare the results. png attachment new01. After being fitted the model can then be used to predict new values EvaluationYou can also easily use the f1_score from sklearn library Lets try jaccard index for accuracy THANKU FOR READING MY NOTEBOOK Compute confusion matrix Plot non normalized confusion matrix. Basically mapping data into a higher dimensional space is called kernelling. To download the data we will use wget to download it from IBM Object Storage. Lets look at the distribution of the classes based on Clump thickness and Uniformity of cell size Data pre processing and selectionLets first look at columns data types It looks like the BareNuc column includes some values that are not numerical. The Class field contains the diagnosis as confirmed by separate medical procedures as to whether the samples are benign value 2 or malignant value 4. Table of contents Load the Cancer data Modeling Evaluation Practice Load the Cancer dataThe example is based on a dataset that is publicly available from the UCI Machine Learning Repository Asuncion and Newman 2007 http mlearn. Radial basis function RBF 4. png SVM works by mapping data to a high dimensional feature space so that data points can be categorized even when the data are not otherwise linearly separable. As this field can have one of only two possible values we need to change its measurement level to reflect this. cloud IBMDeveloperSkillsNetwork ML0101EN SkillsNetwork labs Module 203 data cell_samples. We can drop those rows We want the model to predict the value of Class that is benign 2 or malignant 4. The values are graded from 1 to 10 with 1 being the closest to benign. The mathematical function used for the transformation is known as the kernel function and can be of different types such as 1. The dataset consists of several hundred human cell sample records each of which contains the values of a set of cell characteristics. csv Load Data From CSV FileThe ID field contains the patient identifiers. ", "id": "zohaib123/cancer-benign-malignant-svm", "size": "4453", "language": "python", "html_url": "https://www.kaggle.com/code/zohaib123/cancer-benign-malignant-svm", "git_url": "https://www.kaggle.com/code/zohaib123/cancer-benign-malignant-svm", "script": "sklearn preprocessing classification_report scipy.optimize train_test_split pylab matplotlib.pyplot f1_score svm sklearn.model_selection pandas sklearn.metrics confusion_matrix jaccard_score plot_confusion_matrix numpy ", "entities": "(('samples', 'cells'), 'learn') (('Lets', 'NOTEBOOK confusion matrix MY Compute Plot'), 'use') (('characteristics', 'Mit'), 'contain') (('values', '1'), 'grade') (('that', 'UCI Machine Learning Repository publicly Asuncion'), 'Load') (('we', 'results'), 'have') (('mathematical function', 'such 1'), 'know') (('csv Load Data', 'patient identifiers'), 'contain') (('SVM algorithm', 'processing'), 'Test') (('press here Shift', 'wget cell_samples'), 'click') (('even when data', 'feature high dimensional space'), 'work') (('we', 'this'), 'have') (('that separator', 'hyperplane'), 'find') (('Basically mapping', 'higher dimensional space'), 'call') (('that', 'Class'), 'drop') (('that', 'values'), 'look') (('we', 'IBM Object Storage'), 'download') (('each', 'cell characteristics'), 'consist') (('that', 'record'), 'be') (('s', 'lab'), 'let') (('samples', 'separate medical procedures'), 'contain') (('new record', 'which'), 'use') "}