{"name": "cassava simple visualization ", "full_name": " h1 Label Distribution h1 Visualization h2 Cassava Bacterial Blight CBB h3 What is Cassava Bacterial Blight CBB h2 Cassava Brown Streak Disease CBSD h3 What is Brown Streak Disease CBSD h2 Cassava Green Mottle CGM h3 What is Cassava Green Mottle CGM h2 Cassava Mosaic Disease CMD h3 What is Cassava Mosaic Disease CMD h2 Healthy ", "stargazers_count": 0, "forks_count": 0, "description": "As the disease progresses the diseased shoots die so that the plants show the characteristic dieback symptoms with bare leafless stems pointing upward Photo CBB 6. De topping is sometimes adopted to enhance expression in screening clones for resistance Jennings 1960. Seed is not used for growing cassava so spread on Choiseul is most likely in diseased cuttings. The earliest symptoms visible on cassava leaves are dark greenish water soaked areas limited by the leaf veins and which show gummy exudation on the water soaked areas Photo CBB 8. Symptoms tend to reappear on the axillary growth after the shoot tips are removed. They consist of a characteristic yellow or necrotic vein banding which may enlarge and coalesce to form comparatively large yellow patches. Thirty percent of the seed of infected tobacco plants was infected. In a trial on Choiseul 4 of plants grown from cuttings taken from Guadalcanal became diseased within 250 days from planting. Variation in symptoms may be due to differences in virus strain the sensitivity of the host genotype plant age and environmental factors such as soil fertility soil moisture availability radiation and particularly temperature. These were the first symptoms of the disease to be recognised however stem lesions are not the most characteristic symptom of infection and occur only infrequently. When large numbers of adjacent plants exhibit the dieback symptoms the crop appears as a forest of leafless stems which gives rise to the name in French of la maladie des cierges or candle disease Photo CBB 7. Cassava brown streak viruses CABI https www. The virus species UCBSV and CBSV cannot be differentiated according to symptoms induced in cassava. However symptoms may recur on recovered plants when environmental conditions again favour symptom expression Gibson and Otim Nape 1997. Leaf and or stem symptoms can occur without the development of tuber symptoms thus of plants with above ground symptoms surveyed in southern Tanzania 21 failed to develop root necrosis Hillocks et al. The vascular bundles of infected petioles and stems are also necrotic appearing as brown or black bands. The bacterium lies dormant in the seed embryo with dormancy breaking shortly after theseeds begin germination. Unlike symptoms induced by the majority of plant viruses those of CBSD in cassava normally affect mature or nearly mature leaves but not expanding immature leaves. org fact_sheets cassava_green_mottle_068. Symptoms vary from leaf to leaf shoot to shoot and plant to plant even of the same variety and virus strain in the same locality. No symptoms of CBB have been recorded on or in cassava roots. Some leaves situated between affected ones may seem normal and give the appearance of recovery. The lesions enlarge and eventually coalesce along the veins or edges of the leaf killing the leaf. Fact sheet Cassava green mottle 068 pestnet. The first few leaves produced by an infected cutting are sometimes symptomless and are subsequently followed by severely affected leaves but there is a tendency for symptom severity to diminish as plants age especially in resistant varieties. Changes have also been observed in the peroxidase isoenzyme components of CMD affected plants Bates and Chant 1970 Chant et al. Cassava Bacterial Blight Plantvillage https plantvillage. The symptoms of the disease vary greatly with variety and environmental conditions making diagnosis difficult particularly when plants are infected both with CBSD and cassava mosaic disease. Leaf chlorosis may be pale yellow or nearly white with only a tinge of green or just discernibly paler than normal. The chlorotic areas are usually clearly demarcated and vary in size from that of a whole leaflet to small flecks or spots. However several cassava cultivars are not susceptible to UCBSV Winter et al. Cassava mosaic disease African cassava mosaic CABI https www. Tuberous root symptoms may also be present these consist of dark brown necrotic areas within the tuber and reduction in root size lesions in roots can result in post harvest spoilage of the crop. How this infection occurred is unknown but there are several possibilities. This behaviour is influenced by the ambient temperature and host plant resistance. Plants touching each other in the wind may have transferred sap between those infected and healthy. Usually the shoots recover from symptoms and appear healthy. org isc datasheet 2747 Healthy. htm Cassava Mosaic Disease CMD What is Cassava Mosaic Disease CMD The symptoms of CMD first described fully by Storey and Nichols 1938 occur as characteristic leaf mosaic patterns that affect discrete areas and are determined at an early stage of leaf development. The leaf wilting is accompanied by a viscous amber to orange coloured exudation from the leaf stalks petioles and young stems Photos CBB 3 5. In the lab the virus can be passed between plants in sap and also in seed. However there are other possibilities. There have been reports that seeds from CBB diseased plants that carry a high load of the pathogen are sometimes deformed and necrotic but the consensus is that CBB infected seeds are asymptomatic carriers and that there are no diagnostic symptoms of CBB on cassava seeds. Label Distribution Visualization Cassava Bacterial Blight CBB What is Cassava Bacterial Blight CBB The first sign of the disease is wilting and dying of leaves Photo CBB 1 2. Leaves of plants affected by CMD have marked reductions and distortions of the chloroplasts increased respiration and peroxidase activity and decreased total carbohydrate and rates of photosynthesis. edu diseases cassava bacterial blight Cassava Brown Streak Disease CBSD What is Brown Streak Disease CBSD The name brown streak was given to the disease from the brown lesions which sometimes appear on young green stems. org isc datasheet 17107 Cassava Green Mottle CGM What is Cassava Green Mottle CGM Young leaves are puckered with faint to distinct yellow spots Photo 1 green patterns mosaics and twisted margins Photo 2. Distortion reduction in leaflet size and general stunting appear to be secondary effects associated with symptom severity. The virus is thought to be a member of the nepovirus group and members of this group are spread in these ways. There is also the possibility of spread by nematodes and pollen. Leaflets may show a uniform mosaic pattern or the mosaic pattern is localised to a few areas which are often at the bases. Whether it also spreads in seed of cassava is unknown. Occasionally plants become severely stunted edible roots are absent or if present they are small and woody when cooked. Physiological and histological examinations reveal that infected leaves have palisade cells that are either short or undifferentiated from those of the spongy mesophyll tissues Chant and Beck 1959. ", "id": "fyuta24/cassava-simple-visualization", "size": "7080", "language": "python", "html_url": "https://www.kaggle.com/code/fyuta24/cassava-simple-visualization", "git_url": "https://www.kaggle.com/code/fyuta24/cassava-simple-visualization", "script": "seaborn matplotlib.pyplot PIL pandas Image ", "entities": "(('Cassava Green Mottle CGM Young leaves', 'distinct yellow spots'), 'datasheet') (('stem however lesions', 'most characteristic infection'), 'be') (('Leaves', 'photosynthesis'), 'mark') (('particularly when plants', 'CBSD'), 'vary') (('that', 'leaf development'), 'CMD') (('which', 'often bases'), 'show') (('which', 'sometimes young green stems'), 'disease') (('De topping', 'resistance Jennings'), 'adopt') (('Usually shoots', 'symptoms'), 'recover') (('African cassava', 'CABI https www'), 'mosaic') (('cassava However several cultivars', 'Winter et UCBSV al'), 'be') (('which', 'maladie des cierges'), 'stem') (('root size lesions', 'crop'), 'be') (('Changes', 'plants CMD affected Bates'), 'observe') (('Symptoms', 'same locality'), 'vary') (('Thirty percent', 'tobacco infected plants'), 'infect') (('young Photos', '3 5'), 'accompany') (('Leaf symptoms', 'root necrosis Hillocks et 21 al'), 'occur') (('CBSV', 'cassava'), 'UCBSV') (('which', 'water soaked areas'), 'be') (('also spreads', 'cassava'), 'be') (('vascular bundles', 'also brown bands'), 'be') (('shortly theseeds', 'germination'), 'lie') (('chlorotic areas', 'small flecks'), 'demarcate') (('virus', 'ways'), 'think') (('leaves', 'recovery'), 'seem') (('dieback characteristic symptoms', 'Photo upward CBB'), 'die') (('seeds', 'cassava seeds'), 'be') (('Fact sheet', 'Cassava green 068 pestnet'), 'mottle') (('Plants', 'those'), 'transfer') (('that', 'mesophyll spongy tissues'), 'reveal') (('Seed', 'most diseased cuttings'), 'use') (('symptom severity', 'especially resistant varieties'), 'be') (('differences', 'soil fertility soil moisture availability environmental such radiation'), 'be') (('lesions', 'leaf'), 'enlarge') (('Distortion reduction', 'symptom general secondary severity'), 'appear') (('symptoms', 'cassava roots'), 'record') (('those', 'immature leaves'), 'virus') (('behaviour', 'host plant ambient temperature resistance'), 'influence') (('when environmental conditions', 'symptom again expression'), 'recur') (('first sign', 'Photo CBB'), 'cbb') (('shoot tips', 'axillary growth'), 'tend') (('which', 'comparatively large yellow patches'), 'consist') (('Leaf chlorosis', 'green discernibly paler'), 'be') (('virus', 'also seed'), 'pass') "}