{"name": "cnn tensorflow 2 0 f score 97 recall 98 ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "io Preprocessing the imagesVisualizing some imagesLoading the Images and Labels togetherReshaping dimensions before feeding them to the neural networkIf we go through the dataset we see that there are a lot more Pneumonia images than Normal images. So we load the images from train and test set together and split them using the train_test_split https scikit learn. org tutorialsKeras Documentation https keras. We will be using Tensorflow 2. org tutorials images data_augmentationPlotting the LossesLoading model to try and improve further Loading Final Model for predictions Predictions Setting all predictions above 0. The diagnoses for the images were then graded by two expert physicians before being cleared for training the AI system. com a comprehensive guide to convolutional neural networks the eli5 way 3bd2b1164a53Compiling and viewing the model summary Data Augmentation Data augmentation https www. com cell fulltext S0092 8674 18 30154 5 Importing the libraries We will design a Deep Learning Model to classify the images. All chest X ray imaging was performed as part of patients routine clinical care. There are 5 863 X Ray images JPEG and 2 categories Pneumonia Normal. org stable modules generated sklearn. Tensorflow Documentation https www. Chest X Ray Pneumonia Classification The dataset is organized into 3 folders train test val and contains subfolders for each image category Pneumonia Normal. We will use 20 of the images for testing and the remaining 80 for training the Neural network. Dataset Link https www. In order to account for any grading errors the evaluation set was also checked by a third expert. com paultimothymooney chest xray pneumoniaAcknowledgements Data https data. The Validation images val will not be shown to the neural network and will be used later to see on how the neural network performs on predicting images that it has never seen before. 0Citation http www. For the analysis of chest x ray images all chest radiographs were initially screened for quality control by removing all low quality or unreadable scans. Creating the CNN Model Convolutional Neural Network CNN Detailed description https towardsdatascience. com datasets rscbjbr9sj 2License CC BY 4. 5 to 1 Confusion Matrix resize all images to 256 256 labels from the folders creating the training data going through all the images in different folders and resizing them appending all images appending all labels normalizing Input Layer Convolution Batch Normalization Max Pooling Flatten Fully Connected layer Output Layer to save the model epochs with best validation loss loading model to train further Get the confusion matrix. Chest X ray images anterior posterior were selected from retrospective cohorts of pediatric patients of one to five years old from Guangzhou Women and Children s Medical Center Guangzhou. 0 for the Pneumonia Classification. ", "id": "arjunsarkar/cnn-tensorflow-2-0-f-score-97-recall-98", "size": "2622", "language": "python", "html_url": "https://www.kaggle.com/code/arjunsarkar/cnn-tensorflow-2-0-f-score-97-recall-98", "git_url": "https://www.kaggle.com/code/arjunsarkar/cnn-tensorflow-2-0-f-score-97-recall-98", "script": "mlxtend.plotting train_test_split tensorflow.keras.layers confusion_matrix perf_measure numpy tensorflow.keras.models MaxPooling2D Adam Dropout ImageDataGenerator BatchNormalization Dense cv2 plot_confusion_matrix create_training_data tensorflow tensorflow.keras.preprocessing.image tensorflow.keras.callbacks ModelCheckpoint matplotlib.pyplot sklearn.model_selection Conv2D Model Input SimpleITK tensorflow.keras.optimizers sklearn.metrics Flatten ", "entities": "(('Chest X Ray Pneumonia dataset', 'image category'), 'Classification') (('We', 'Neural remaining network'), 'use') (('chest radiographs', 'low quality'), 'screen') (('Predictions', '0'), 'try') (('com paultimothymooney', 'xray pneumoniaAcknowledgements Data https data'), 'chest') (('it', 'that'), 'show') (('We', 'images'), 'fulltext') (('So we', 'https train_test_split scikit'), 'load') (('chest X ray imaging', 'clinical care'), 'perform') (('com', '4'), 'dataset') (('evaluation set', 'also third expert'), 'in') (('diagnoses', 'AI system'), 'grade') (('Chest X ray images anterior posterior', 'Guangzhou one to five years old Women'), 'select') (('Confusion 5 to 1 Matrix', 'confusion further matrix'), 'resize') (('we', 'Pneumonia lot more Normal images'), 'io') "}