{"name": "commonlit readability prize eda baseline ", "full_name": " h1 Introduction h1 Import libraries h1 Missing values h1 Pre processing excerpt h1 EDA h1 Part of Speech tagging h1 Readability tests h1 Baseline model h1 Submission file ", "stargazers_count": 0, "forks_count": 0, "description": "append lins text_standard. Next use secrets to use API Keys more securely Missing values Here I have used a viz module called missingno https pypi. Data train. append flr flesch_kg. Score Notes 90 100 very easy to read easily understood by an average 11 year old student 80 90 easy to read 70 80 fairly easy to read 60 70 easily understood by 13 to 15 year old students 50 60 fairly difficult to read 30 50 difficult to read best understood by college graduates 0 30 very difficult to read best understood by university graduates Logging a custom histogram for the distribution of Flesch Reading Ease scores More than 70 of excerpts can be easily understood by 13 15 year olds. Introduction Goal To build algorithms to rate the complexity of reading passages for grade 3 12 classroom use. csv the training and testing set id unique ID for excerpt url_legal URL of source license license of source material excerpt text to predict reading ease of target reading ease standard_error measure of spread of scores among multiple raters for each excerpt Note url_legal license and standard error are blank in the test set. append cole linsear. excerpt target and standard_error Pre processing excerpt It s important to preprocess the excerpt before we proceed further Logging the preprocessed dataset as an artifact Using the saved artifact EDA Logging custom histograms for target and standard error distribution Logging a dictionary of custom objects Logging a custom bar chart for license distribution Logging custom bar charts for unigrams bigrams and trigrams sentence_count and target are very highly correlated since extremely long sentences can be complex to read and understand. to_csv train_excerpt_preprocessed. append ar coleman. Evaluation metric Root Mean Squared Error RMSE RMSE sqrt frac 1 n Sigma_ i 1 n Big frac y_i hat y_i sigma_i Big 2 where y_i original value hat y_i predicted value n number of rows in the test data Import libraries I will be integrating W B for visualizations and logging artifacts CommonLit Project on W B Dashboard https wandb. append flkg fog_scale. org wiki Automated_readability_index coleman The Coleman Liau Index https en. Artifact train_excerpt_preprocessed type dataset artifact. init project commonlit name text_props_readability artifact wandb. add_file text_props_readability. to_csv test_excerpt_preprocessed. edu grishman jet guide PennPOS. org project textstat is a library used to calculate statistics from text. ai ruchi798 commonlit workspace user ruchi798 Illustrations tools Canva https www. gunning_fog train_df excerpt i ar textstat. flesch_reading_ease train_df excerpt i flkg textstat. flesch_kincaid_grade train_df excerpt i fs textstat. org wiki Coleman E2 80 93Liau_index linsear Linsear Write Formula https en. add_file test_excerpt_preprocessed. org project missingno to visualize missing values in the training set. html Logging a custom bar chart for POS distribution Readability tests textstat https pypi. It came in super handy for calculating scores of various readability tests flesch_re The Flesch Reading Ease formula https en. finish Function to plot wandb bar chart Function to plot wandb histogram maximum target minimum target maximum standard error minimum standard error color function for the wordcloud flesch_re flesch_kg fog_scale automated_r coleman linsear text_standard for i in range 7 for i in range len text_props flr textstat. Artifact text_props_readability type dataset artifact. Let s see which excerpts have the highest and lowest Target and Flesch Reading Ease Score Baseline model Submission file Here s a snapshot of my project https wandb. ai ruchi798 commonlit workspace user ruchi798 To get the API key an account is to be created on the website https wandb. Artifact test_excerpt_preprocessed type dataset artifact. text_standard train_df excerpt i flesch_re. org wiki Linsear_Write text_standard Readability Consensus based upon all the above testsLogging the text properties dataset as an artifact This helps me to save on time since I can directly use the saved artifact for my workflow A snapshot of the newly created artifacts Since I have already logged the artifact I can directly use it in this manner There is a strong correlation between our target variable and the Flesch Readability Ease test values. log_artifact artifact run. automated_readability_index train_df excerpt i cole textstat. to_csv text_props_readability. linsear_write_formula train_df excerpt i ts textstat. add_file train_excerpt_preprocessed. Let s explore the distribution of test values for Flesch Readability Ease. We don t have any missing values in the columns of our interest i. com Preprocessing function find alphabets convert to lower case tokenize words remove stopwords lemmatization train_df excerpt_preprocessed preprocess train_df test_df excerpt_preprocessed preprocess test_df train_df. init project commonlit name excerpt_preprocessed artifact wandb. csv run wandb. coleman_liau_index train_df excerpt i lins textstat. org wiki Flesch E2 80 93Kincaid_readability_tests Flesch_reading_ease fog_scale The Fog Scale Gunning FOG Formula https en. append ts text_props flesch_re flesch_re text_props flesch_kg flesch_kg text_props fog_scale fog_scale text_props automated_r automated_r text_props coleman coleman text_props linsear linsear text_props text_standard text_standard text_props. Logging custom histograms for the distribution of character count word count average word length and sentence count Part of Speech tagging Abbreviation Meaning CC coordinating conjunction CD cardinal digit DT determiner EX existential there FW foreign word IN preposition subordinating conjunction JJ adjective large JJR adjective comparative larger JJS adjective superlative largest LS list item marker MD modal could will NN noun singular NNS noun plural NNP proper noun singular NNPS proper noun plural PDT predeterminer POS possessive ending parent s PRP personal pronoun hers herself him himself PRP dollar sign possessive pronoun her his mine my our RB adverb occasionally swiftly RBR adverb comparative greater RBS adverb superlative biggest RP particle about SYM symbol TO infinite marker to UH interjection goodbye VB verb ask VBG verb gerund judging VBD verb past tense pleaded VBN verb past participle reunified VBP verb present tense not 3rd person singular wrap VBZ verb present tense with 3rd person singular bases WDT wh determiner that what WP wh pronoun who WP dollar sign possessive wh pronoun WRB wh adverb how Higher the grade more the complexity of grammar Penn Part of Speech Tags https cs. org wiki Gunning_fog_index automated_r Automated Readability Index https en. append fs automated_r. org wiki Flesch E2 80 93Kincaid_readability_tests Flesch_reading_ease flesch_kg The Flesch Kincaid Grade Level https en. ", "id": "ruchi798/commonlit-readability-prize-eda-baseline", "size": "8354", "language": "python", "html_url": "https://www.kaggle.com/code/ruchi798/commonlit-readability-prize-eda-baseline", "git_url": "https://www.kaggle.com/code/ruchi798/commonlit-readability-prize-eda-baseline", "script": "Counter preprocess train_test_split LinearRegression plot_wb_bar Ridge nltk.tokenize spacy Line2D numpy CountVectorizer seaborn make_pipeline TfidfVectorizer STOPWORDS CountVectorizer as CV sklearn.feature_extraction.text color_wc plot_bt Theme training rich get_top_n_bigram Console sklearn.linear_model print matplotlib.pyplot rich.theme avg_word_len kaggle_secrets nltk plot_distribution training_all displacy sklearn.model_selection pandas get_top_n_trigram stopwords missingno sklearn.pipeline nltk.corpus count_tags matplotlib.lines mean_squared_error WordCloud mean_squared_error as mse get_top_n_words sent_tokenize UserSecretsClient pos_tag word_tokenize sklearn.metrics custom_palette collections wordcloud rich.console plot_wb_hist DataFrame ", "entities": "(('ai', 'workspace ruchi798 Illustrations tools Canva https user www'), 'commonlit') (('More than 70', 'year easily 13 15 olds'), 'note') (('linsear', 'text_props'), 'flesch_re') (('fog_scale automated_r coleman', 'range len text_props flr textstat'), 'finish') (('s', 'Flesch Readability Ease'), 'let') (('how grade', 'Speech Tags https cs'), 'log') (('Here snapshot', 'project https wandb'), 'let') (('excerpt i', 'textstat'), 'coleman_liau_index') (('case lower words', 'stopwords lemmatization'), 'com') (('html Logging', 'textstat https pypi'), 'test') (('url_legal URL', 'test set'), 'csv') (('trigrams very highly extremely long sentences', 'unigrams bigrams'), 'processing') (('init project', 'name text_props_readability artifact wandb'), 'commonlit') (('I', 'target strong variable'), 'help') (('Here I', 'viz module'), 'use') (('org project textstat', 'text'), 'be') (('It', 'readability various tests'), 'come') (('Import I', 'logging CommonLit W B Dashboard https wandb'), 'metric') (('We', 'interest'), 'don') (('init project', 'name'), 'commonlit') (('account', 'website https wandb'), 'commonlit') "}