{"name": "compx310 labtwo ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "All the import statements required for the assignment ignore the warnings Loading the data filling in blank columns with 0 and showing the first 5 data entries Showing the information about each column in the data Split the data to train and test in a stratified way 80 20 Both the trains should be 80 of the data 559. 95 as indicated by the variable value. What is the best accuracy of this subset on the test data The accuracy of this subset on the data is 0. 8 140 My results are fairly close to these values Initialising a SGD Classifier on the train dataset Random state is my ID number function to determine output all the possible subsets for the 9 input features add the means of the validation cross of the fitted model onto the array display highest stats information including highest possible accuracy and the subset and location index it s located in print out all the subsets commented loop through all the subsets and fit the model using the trained data predict the test accuracy using the fitted model add all the accuracy scores onto the array fit the model on the index and predict the result print the accuracy of the prediction display highest stats information including highest possible accuracy and the subset and location index it s located in scatter plot of cross validation and test accuracy fit a random forest classifier on the x_train and y_train add the means of the validation cross of the fitted model onto the array display highest stats information including highest possible accuracy and the subset and location index it s located in loop through all the subsets and fit the model using the trained data predict the test accuracy using the fitted model add all the accuracy scores onto the array fit the model on the index and predict the result print the accuracy of the prediction display highest stats information including highest possible accuracy and the subset and location index it s located in creating a scatter plot for the accuracy distribution of the test and cross validation fit a Gaussian NB classifier on the x_train and y_train add the means of the validation cross of the fitted model onto the array display highest stats information including highest possible accuracy and the subset and location index it s located in loop through all the subsets and fit the model using the trained data predict the test accuracy using the fitted model add all the accuracy scores onto the array fit the model on the index and predict the result print the accuracy of the prediction display highest stats information including highest possible accuracy and the subset and location index it s located in creating a scatter plot for the accuracy distribution of the test and cross validation all the imports required for a roc_curve function and plotting RANDOM FOREST CLASSIFIER GAUSSIAN NB SGD CLASSIFIER PLOTTING THE ROC_CURVE WITH THE THREE LABELS See the array values of y_probas_forest y_probas_gauss and y_scores. Is that the best possible test data accuracy No the best possible test data accuracy on this particular set is 0. What is the best accuracy of this subset on the test data The best accuracy of this subset on the test data is 0. p What is the best accuracy of this subset on the test data The best accuracy of this subset on the test data is 0. 2 559 Both the tests should be 20 of the data 139. This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. p as shown by the accuracy score. For example running this by clicking run or pressing Shift Enter will list the files in the input directory Any results you write to the current directory are saved as output. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. NOTE A LARGE MAJORITY OF CODE IN THIS ASSIGNMENT IS REPEATED WITH A FEW CHANGES Author Jeffrey Jose ID 1313512 Which subset looks best given the cross validation score The subset that looks the best given the cross validation score is one that consists of size nuclei single shape thickness. The cross validation for this subset is 0. The cross validation score of this particular subset is 0. However accuracy of the test data can be dependent on the train and test size and the number of splits the data goes through. This can differ with each run Is that the best possible test data accuracy No I believe that the best test data accuracy possible on this subset is 0. This belongs to the subset shape thickness nucleoli which is located on index 175. dp as shown by the accuracy score. read_csv Input data files are available in the. Which subset looks best given the cross validation score The subset containing size nuclei single shape thickness looks the best given the cross validation. This belongs to the subset of shape thickness nucleoli which is located on index 175 Which subset looks best given the cross validation score The subset containing size nuclei thickness gives the best cross validation score of 0. ", "id": "jeffreyjose29/compx310-labtwo", "size": "2177", "language": "python", "html_url": "https://www.kaggle.com/code/jeffreyjose29/compx310-labtwo", "git_url": "https://www.kaggle.com/code/jeffreyjose29/compx310-labtwo", "script": "train_test_split LinearRegression cross_val_predict pyplot recieve_ss accuracy_score cross_val_score numpy SGDClassifier seaborn statements required for the GaussianNB sklearn.naive_bayes roc_auc_score sklearn.linear_model StratifiedKFold clone KFold sklearn.model_selection pandas sklearn.base roc_curve RandomForestClassifier matplotlib sklearn.metrics sklearn.ensemble ", "entities": "(('cross validation', 'subset'), 'be') (('2 tests', 'data'), '559') (('which', 'index'), 'belong') (('subset it', 'y_probas_forest y_probas_gauss'), '140') (('best accuracy', 'test data'), 'p') (('best accuracy', 'test data'), 'be') (('test data best accuracy', 'possible subset'), 'be') (('test data test data best possible best possible accuracy', 'particular set'), 'be') (('80 20 trains', 'data'), 'ignore') (('It', 'python docker image https kaggle github'), 'come') (('that', 'size nuclei shape single thickness'), 'MAJORITY') (('size nuclei subset containing thickness', '0'), 'belong') (('cross validation score', 'particular subset'), 'be') (('you', 'output'), 'list') (('data', 'splits'), 'be') (('subset containing size', 'nuclei shape cross single validation'), 'look') (('read_csv Input data files', 'the'), 'be') (('accuracy', 'data'), 'be') "}