{"name": "coref by mlp cnn coattention ", "full_name": " h1 Import Data h1 Explore Features for Building Mention Pair Distributed Representation h2 Embedding Features h3 Parse Text h3 Generate Embedding Features h3 Generate Training Validation and Testing Data h1 Define DL Models h2 Baseline Model MLP h2 Multi Channel CNN h2 Coattention Model h4 Define Co attention Layer h4 Define Inter Mention Pair Coattention Model h4 Intra Mention Pair Coattention Model h1 Build and Train Model h2 Baseline Model MLP h3 Build Model h3 Train Model h2 Multi Channel CNN h3 Build Model h3 Train Model h2 Inter Mention Pair Coattention Model h3 Build Model h3 Train Model h2 Intra Mention Pair Coattention Model h3 Build Model h3 Train Model h3 Make Prediction ", "stargazers_count": 0, "forks_count": 0, "description": "edu pubs clark2016improving. Concatenate name concated_layer pooled_outputs else x conv MLP Layers attention compare inputs define feature map layers MLP Layers From mention pair embeddings pooled_outputs for i in range len filter_sizes conv layers. floatx inputs define feature map layers MLP Layers From mention pair embeddings attention compare pooled_outputs for i in range len filter_sizes conv layers. This kernel implements 4 DL models for coreference resolution. Conv1D num_filters i kernel_size filter_sizes i padding padding activation relu x if pooling max conv layers. Average word embeding of the five preceding words five following words all words in the mention all words in the sentences. t char offset to token offset mention_word token offset to sentence offset mention sentence dependency parent last word and first word two preceding words and two following words five preceding words and five following words sentence words char offset to token offset token offset to sentence offset buckets relative distance buckets absolute position in the sentence inputs define feature map layers MLP Layers MLP Layers inputs define feature map layers CNN Layers MLP Layers todo check that this is correct pass the mask to the next layers u Wx b u Activation Wx b atten exp u1 u2 T don t pass the mask to the next layers apply mask after the exp. Import Data Explore Features for Building Mention Pair Distributed Representation Embedding FeaturesFollow the idea from the work by Clark and Manning extract word embedding of head word dependency parent first word last word two preceding words and two following words of the mention. All the model in this kernel are Non RNN Based DL models. com keyit92 end2end coref resolution by attention rnn. GlobalMaxPooling1D name global_pooling_layer str i conv else conv layers. GlobalAveragePooling1D name global_pooling_layer str i conv pooled_outputs. For example running this by clicking run or pressing Shift Enter will list the files in the input directory Any results you write to the current directory are saved as output. Features extraction used in this kernel follows Clark and Mannings work https nlp. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. Parse TextExample Generate Embedding Features Position FeaturesEncode the absolute positions in the sentence and the relative position between the pronoun and the entities. Concatenate name concated_layer pooled_outputs else x conv MLP Layers. A workaround is to add a very small positive number ε to the sum. will be re normalized next Cast the mask to floatX to avoid float64 upcasting in theano in some cases especially in the early stages of training the sum may be almost zero and this results in NaN s. Generate Training Validation and Testing Data Define DL Models Baseline Model MLP Multi Channel CNN Coattention Model Define Co attention Layer Define Inter Mention Pair Coattention Model Intra Mention Pair Coattention Model Build and Train Model Baseline Model MLP Build Model Train Model Multi Channel CNN Build Model Train Model Inter Mention Pair Coattention Model Build Model Train Model Intra Mention Pair Coattention Model Build Model Train Model Make Prediction This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. append conv if len pooled_outputs 1 x layers. sum a axis 1 keepdims True K. pdfIf you are interested in RNN based End2End coreference solution model please check this kernel https www. read_csv Input data files are available in the. ", "id": "keyit92/coref-by-mlp-cnn-coattention", "size": "1558", "language": "python", "html_url": "https://www.kaggle.com/code/keyit92/coref-by-mlp-cnn-coattention", "git_url": "https://www.kaggle.com/code/keyit92/coref-by-mlp-cnn-coattention", "script": "keras.engine RemappedCoAttentionWeight(merge._Merge) optimizers spacy.pipeline DependencyParser to_nltk_tree extrac_positional_features keras.layers extrac_embed_features_tokens create_dist_features optimizers as ko IPython.display keras _mlp_channel1 callbacks build compute_output_shape bs_ numpy initializers _dot_product Tree create_embedding_features SVG ohe_dist _get_preceding_words regularizers build_multi_channel_cnn_model layers models keras.backend build_inter_coattention_cnn_model Layer callbacks as kc bs build_mlp_model matplotlib.pyplot nltk backend spacy.lang.en English pandas call activations _get_following_words constraints merge FeatureNormalization(Layer) compute_mask __init__ get_config _merge_function coatten_compare _mlp_channel2 _row_to_y build_intra_coattention_cnn_model ", "entities": "(('Wx b u Activation Wx atten exp u1 u2 T don u b t', 'exp'), 'offset') (('you', 'kernel https www'), 'be') (('workaround', 'sum'), 'be') (('name global_pooling_layer GlobalMaxPooling1D i', 'conv else layers'), 'str') (('compare inputs', 'range len filter_sizes conv layers'), 'pooled_outputs') (('Embedding idea', 'mention'), 'feature') (('kernel', 'coreference resolution'), 'implement') (('It', 'python docker image https kaggle github'), 'Generate') (('floatx inputs', 'range len filter_sizes conv layers'), 'define') (('you', 'output'), 'list') (('Parse TextExample', 'relative pronoun'), 'Generate') (('Features extraction', 'work https Clark nlp'), 'follow') (('model', 'kernel'), 'be') (('read_csv Input data files', 'the'), 'be') (('GlobalAveragePooling1D name global_pooling_layer i', 'pooled_outputs'), 'str') (('i', 'max conv layers'), 'num_filters') "}