{"name": "covid 19 literature clustering ", "full_name": " h1 COVID 19 Literature Clustering h4 t SNE Scatter Plot from CORD 19 h2 The full version of the interactive plot h2 https maksimekin github io COVID19 Literature Clustering plots t sne covid 19 interactive html h2 GitHub h2 https github com MaksimEkin COVID19 Literature Clustering h2 Link to the paper h2 https www maksimeren com publication eren doceng2020 h2 How to Cite This Work h1 Goal h4 We welcome feedback so that we can continue to improve this project h1 Approach h1 Table of Contents h1 Loading the Data h4 Cite Dataset Parsing Code Kaggle COVID EDA Initial Exploration Tool h3 Loading Metadata h3 Fetch All of JSON File Path h3 Helper Functions h3 Load the Data into DataFrame h2 Take a Look at the Data h1 Data Pre processing h3 Handling multiple languages h3 Stopwords h4 Cite Custom Stop Words Topic Modeling Finding Related Articles h3 Next let s create a function that will process the text data for us h1 Vectorization h1 PCA Clustering h3 How many clusters h3 Run k means h1 Dimensionality Reduction with t SNE h1 Topic Modeling on Each Cluster h3 Save current outputs to file h1 Plotting the data h2 Load the Keywords per Cluster h2 Setup h2 Widgets h2 Style h2 SHOW h1 Conclusion h1 Citation Sources ", "stargazers_count": 0, "forks_count": 0, "description": "html linear algebra data processing CSV file I O e. PNG attachment kmeans. With this increase in the scientific literature there arose a need for organizing those documents. jpg First we will create 20 vectorizers one for each of our cluster labelsNow we will vectorize the data from each of our clustersTopic modeling will be performed through the use of Latent Dirichlet Allocation LDA. Topic Modeling on Each Cluster7. VectorizationNow that we have pre processed the data it is time to convert it into a format that can be handled by our algorithms. Given the number of clusters k k means will categorize each vector by taking the mean distance to a randomly initialized centroid. This will reduce the complexity of our dimensionality reduction step and filter noise. Dimensionality Reduction with t SNE6. Papers written on highly similar topics are typically near each other on the plot and bear the same k means label. In this notebook all of the algorithms are set to random state 42 the meaning of life to ensure reproducible results Citation SourcesKaggle Submission COVID 19 Literature Clustering Kaggle https www. We believe that health professionals can use this tool to find real links in the texts. The maximum number of features will be the maximum number of unique words out of all of the papers PCA ClusteringLet s see how much we can reduce the dimensions while still keeping 95 variance. Attempting to translate foreign texts gave the following problems 1. This shows that structure within the literature can be observed and measured to some extent. Apply Topic Modeling on X using Latent Dirichlet Allocation LDA to discover keywords from each cluster. Not all of the sources are English and the language needs to be identified so that we know how to handle these instancesWe will be dropping any language that is not English. read_csv Abstract Body text invalid paper format skip add break every length characters invalid paper format skip get metadata information no metadata skip this paper also create a column for the summary of abstract to be used in a plot no abstract provided abstract provided is too long for plot take first 300 words append with. Through topic modeling we will find out what the most important terms for each cluster are. Plotting the dataThe previous steps have given us clustering labels and a dataset of papers reduced to two dimensions. 13046 year 2020 misc Kaggle author Kaggle title COVID 19 Open Research Dataset Challenge CORD 19 year 2020 month March note Allen Institute for AI in partnership with the Chan Zuckerberg Initiative Georgetown University s Center for Security and Emerging Technology Microsoft Research and the National Library of Medicine National Institutes of Health in coordination with The White House Office of Science and Technology Policy. As k means simply split the data into clusters topic modeling through LDA was performed to identify keywords. We will now fit_transform all the LDA models on their respective cluster vectorsExtracts the keywords from each clusterAppend list of keywords for a single cluster to 2D list of length NUM_TOPICS_PER_CLUSTER Save current outputs to fileRe running some parts of the notebook especially vectorization and t SNE are time intensive tasks. We describe an approach to organize and visualize the scientific literature on or related to COVID 19 using machine learning techniques so that papers on similar topics are grouped together. The clustering of the data was done through k means on a pre processed vectorized version of the literature s body text. Hovering over points on the plot will give basic information like title author journal and abstract. Search can be performed inside of a selected cluster or the entire dataset if preferred. Research papers will often use words that don t contribute to the meaning and are not considered everyday stopwords. com max 1276 0 Sj65xR38wDwuxhtr. This gave the topics that were prevalent in each of the clusters. https towardsdatascience. K means clustered the articles but did not label the topics. K means and t SNE were able to independently find clusters showing that relationships between papers can be identified and measured. On this plot publications of highly similar topics will share a label and will be plotted near each other. com danielwolffram topic modeling finding related articles Let s take a look at the language distribution in the dataset Next let s create a function that will process the text data for us. Shakespeare Meet Mr. This leads to the loss of experience from different geographic locations in dealing with COVID 19 The algorithms used in this notebook are stochastic so the results may vary depending on the random state. A surface level examination of the plot showed some very interesting organization of the data. This is a model for processing biomedical scientific or clinical text. htmlGitHub https github. Research in the subject matter was fast tracked to such a point that scientists were struggling to keep up with new findings. For this purpose we will be using tf idf. Instead of having to manually search for related work every publication is connected to a larger topic cluster. Use Principal Component Analysis PCA to project down the dimensions of X to several dimensions that will keep. booktitle Proceedings of the ACM Symposium on Document Engineering 2020 articleno 15 numpages 4 keywords clustering document visualization COVID 19 dimensionality reduction location Virtual Event CA USA series DocEng 20 GoalGiven the large number of literature and the rapid spread of COVID 19 it is difficult for health professionals to keep up with new information on the virus. Now the above stopwords are used in everyday English text. Fetch All of JSON File PathGet path to all JSON files Helper Functions File Reader ClassHelper function adds a break after every word when the character length reaches a certain amount. This is a generative statistical model that allows sets of words to be explained by a shared topicFor each cluster we had created a corresponding LDA model in the previous step. Tucker booktitle High Performance Computing and Data Analytics Workshop year 2019 month September location Linthicum Heights MD USA inproceedings raff_lzjd_2017 author Raff Edward and Nicholas Charles title An Alternative to NCD for Large Sequences Lempel Ziv Jaccard Distance booktitle Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining series KDD 17 year 2017 isbn 978 1 4503 4887 4 location Halifax NS Canada pages 1007 1015 numpages 9 url http doi. Approach Parse the text from the body of each document using Natural Language Processing NLP. Some areas we thought were great pros The tool is saved as an HTML file. In order to find meaning in the clusters topic modeling will be performed to find the keywords of each cluster. The labeled plot gives better insight into how the papers are grouped. com MaksimEkin COVID19 Literature ClusteringLink to the paper https www. let s try to label it through the abstract then get the language Parser run kmeans with many different k Plot the elbow Changed perplexity from 100 to 50 per FAQ sns settings colors plot sns settings colors plot Creating a vectorizer number of topics per cluster Latent Dirichlet Allocation Model Functions for printing keywords for each topic save the COVID 19 DataFrame save the final t SNE save the labels generate with k means 20 required libraries for plot show on notebook target labels data sources hover over information map colors prepare the figure plot settings Keywords currently selected article WIDGETS pass call back arguments column widgetbox keyword widgetbox slider notes cite cite2 cite3 plot STYLE LAYOUT OF THE PAGE show. Sitting at home has given us time to try to help in our own way. API calls were limited2. Investigate the clusters visually on the plot zooming down to specific articles as needed and via classification using Stochastic Gradient Descent SGD. t SNE will attempt to preserve the relations of the higher dimensional data as closely as possible when shrunk to 2D. However due to the complexity of the dataset k means and t SNE will sometimes arrive at different decisions. Clicking on a point will bring up a menu with a URL that can be used to access the full publication. This is the desired number of clusters. We implemented this approach using the widely recognized CORD 19 dataset to present a publicly available proof of concept. This has allowed for an interactive scatter plot of papers related to COVID 19 in which material of similar themes is grouped. com allen institute for ai CORD 19 research challenge inproceedings Shakespeare author Nicholas Charles title Mr. Can clustering similar research articles together simplify the search for related publications How can the content of the clusters be qualified By using clustering for labeling in combination with dimensionality reduction for visualization the collection of literature can be represented by a scatter plot. COVID 19 Literature Clusteringt SNE Scatter Plot from CORD 19The full version of the interactive plot https maksimekin. 95 variance while removing noise and outliers in embedding Y2. title and journal attributes may be useful later when we cluster the articles to see what kinds of articles cluster together. com publication eren_doceng2020 How to Cite This Work inproceedings 10. First lets download our scripts from the repository that contains the plot settings and text Load the Keywords per Cluster Setup Widgets Style SHOW ConclusionIn this project we have attempted to cluster published literature on COVID 19 and reduce the dimensionality of the dataset for visualization purposes. PNG source https en. The full plot is available is at https maksimekin. The topics of much of the given literature are continuous and will not have a concrete decision boundary. So that step took a while Let s take a look at what our data looks like when compressed into 2 dimensions. No in between clustering either looks ok or is very wrong Loss of foreign language papers. Let s use the clusters found by k means as labels. This project can further be improved by abstracting the underlying data analysis techniques as described in this notebook to develop a user interface tool that presents the related articles in a user friendly manner. This looks pretty bland. We hope that our work will have some impact on the fight against COVID 19. Run k means Dimensionality Reduction with t SNEUsing t SNE https lvdmaaten. By pairing this with Bokeh we can create an interactive plot of the literature. org wiki K means_clustering How many clusters To find the best k value for k means we ll look at the distortion at different k values. The papers are all up on the plot and can be quickly examined by hovering over them. By using the 2 dimensions as x y coordinates the body_text can be plotted. This work can be easily replicated and modified as needed serving as a foundation for future projects. If a narrower scope is required the plot will also have a search function that will limit the output to only papers containing the search term. This will add more meaning to the cluster by giving keywords to quickly identify the themes of the cluster. 3419591 abstract The world has faced the devastating outbreak of Severe Acute Respiratory Syndrome Coronavirus 2 SARS CoV 2 or COVID 19 in 2020. In Kaggle we will limit the dataframe to 10 000 instancesNow that we have our dataset loaded we need to clean up the text to improve any clustering or classification efforts. The similar article will thus be in closer proximity to each other. Interestingly both k means and t SNE can find independent clusters even though they were run independently. Topic Modeling on Each ClusterNow we will attempt to find the most significant words in each cluster. If the abstract seems interesting the user can click on the point to bring up a text box with more information that will contain a link to the full paper Patterns in the data found through clustering dimensionality reduction may not be readily apparent to researchers. This is a difficult time in which health care workers sanitation staff and much other essential personnel are out there keeping the world afloat. For example one subcluster consisted of papers that tried to determine the efficacy of masks in preventing the spread of COVID 19. Future thoughts to consider cons Possible false positives difficult to draw an exact line between subjects K means and t SNE are unsupervised approaches that will not necessarily predictably group instances. This is for the interactive plot so that the hover tool fits the screen. com light on math machine learning intuitive guide to latent dirichlet allocation 437c81220158 source https miro. It is portable mobile easily deployable and failover safe the risk of denial of service in the case of emergencies such as the loss of network connection is mitigated Dimensionality reduction allows for the whole dataset to be easily accessible. How to Use the Plot 10. Distortion computes the sum of squared distances from each point to its assigned center. We will apply Principle Component Analysis PCA to our vectorized data. It should be noted however that we are not epidemiologists and it is not our place to gauge the importance of these papers. To try to understand what the similarities may be we have also performed topic modeling on each cluster of papers to pick out the key terms. The topics of these papers often intersect so it was hard to cleanly separate them. It can be downloaded and used locally offline. Due to their unsupervised nature this is not an exact science Not labeled data no certainty. For the parser we will use en_core_sci_lg. howpublished url https www. For this purpose we will be using the spacy library. t SNE was able to reduce the dimensionality of the texts but now clustering is required. We welcome feedback so that we can continue to improve this project. Now there are other cases where the colored labels are spread out on the plot. Turn each document instance di into a feature vector Xi using Term Frequency Inverse Document Frequency TF IDF. Thank you Daniel Wolffram for the idea. By using Bokeh the plot will be interactive. In these conditions our approach performs quite well to organize the literature by similarity. com maksimeren covid 19 literature clustering Unsupervised Learning Clustering with K Means inproceedings Raff2020 author Raff Edward and Nicholas Charles and McLean Mark booktitle The Thirty Fourth AAAI Conference on Artificial Intelligence title A New Burrows Wheeler Transform Markov Distance url http arxiv. This will convert our string formatted data into a measure of how important each word is to the instance out of the literature as a whole. By doing so the navigation of topics and related papers is simplified. We greatly appreciate tips suggestions and upvotes If you would like to check out the interactive plot with the full dataset please visit https maksimekin. These unsupervised techniques can show humans hidden connections in the literature If the topics clusters are not narrow enough for the user a search for a key term will only bring up papers that contain the search term. 3419591 author Eren Maksim Ekin and Solovyev Nick and Raff Edward and Nicholas Charles and Johnson Ben title COVID 19 Kaggle Literature Organization year 2020 isbn 9781450380003 publisher Association for Computing Machinery address New York NY USA url https doi. We will be clustering based on the content of the body text. For topic modeling we will use LDA Latent Dirichlet Allocation. com ivanegapratama covid eda initial exploration tool Loading MetadataLet s load the metadata of the dateset. abstract is short enough get metadata information if more than one author more than 2 authors may be problem when plotting so take first 2 append with. Citation Sources Loading the DataLoad the data following the notebook by Ivan Ega Pratama from Kaggle. Cite Dataset Parsing Code Kaggle COVID EDA Initial Exploration Tool https www. io tsne we can reduce our high dimensional features vector to 2 dimensions. Grouping the literature in this way allows for professionals to quickly find material related to a central topic. Users will have the option of seeing the plot as a whole or filtering the data by cluster. Even so it was apparent that articles on key topics could be easily found near each other. This function will convert text to lower case remove punctuation and find and remove stopwords. To separate the literature k means will be run on the vectorized text. 3098111 acmid 3098111 publisher ACM address New York NY USA keywords cyber security jaccard similarity lempel ziv malware classification normalized compression distance Thank you for looking at our notebook. This will help visually separate different concentrations of topics. authors will fit in plot if only one author or Null valie add the title information add breaks when needed if title was not provided add the journal information add doi set seed hold label language go through each text split by space into list take the first x intex join with space ught. First let s drop Null values Handling multiple languagesNext we are going to determine the language of each paper in the data frame. When distortion is plotted against k there will be a k value after which decreases in distortion are minimal. Apply Dimensionality Reduction to each feature vector Xi using t Distributed Stochastic Neighbor Embedding t SNE to cluster similar research articles in the two dimensional plane X embedding Y1. Load the Data into DataFrameUsing the helper functions let s read the articles into a DataFrame that can be used easily Take a Look at the Data Data Pre processingUnfortunately running the next steps of the notebook is not possible on the full dataset within Kaggle. For example MASK CLUSTER EXAMPLE FROM FINAL PLOT. In LDA each document can be described by a distribution of topics and each topic can be described by a distribution of words. Translating the language may not carry over the true semantic meaning of the textDownload the spacy bio parser StopwordsPart of the preprocessing will be finding and removing stopwords common words that will act as noise in the clustering step. The centroids are updated iteratively. Applying the text processing function on the body_text. Apply k means clustering on Y2 where k is 20 to label each cluster on Y1. io COVID19 Literature Clustering plots t sne_covid 19_interactive. This tool was created to help make it easier for trained professionals to sift through many many publications related to the virus and find their own determinations. beginning of the document was not in a good format what let s see if we can find any text in abstract. Cite Custom Stop Words Topic Modeling Finding Related Articles https www. This is a result of t SNE and k means finding different connections in the higher dimensional data. Look at clusters Look at titles abstract to see that they are similar Use classification to see if k means found effective decisionsAs neither of the authors is qualified to assess the meaning of the literature the analysis by inspection was performed solely on the titles. We want to make sure that the important outputs for generating the bokeh plot are saved for future use. By organizing the literature qualified people can quickly find related publications that answer the task questions. This should organize the papers such that related publications are nearby. ", "id": "maksimeren/covid-19-literature-clustering", "size": "19478", "language": "python", "html_url": "https://www.kaggle.com/code/maksimeren/covid-19-literature-clustering", "git_url": "https://www.kaggle.com/code/maksimeren/covid-19-literature-clustering", "script": "bokeh.layouts pyplot spacy_tokenizer LinearColorMapper description bokeh.io matplotlib.pyplot Category20 vectorize column metrics bokeh.models cite TSNE DetectorFactory selected_topics description_search CountVectorizer sklearn.cluster output_file sklearn.manifold TapTool sklearn scipy.spatial.distance bokeh.plotting output_notebook ColumnDataSource pandas linear_cmap langdetect row MiniBatchKMeans matplotlib toolbox_header bokeh.palettes spacy.lang.en.stop_words detect lib.call_backs lib.plot_text IPython.display LatentDirichletAllocation Image numpy selected_code description_slider layout __repr__ Slider notes bokeh.transform STOP_WORDS description2 dataset_description pyplot as plt Div show cdist seaborn TfidfVectorizer sklearn.feature_extraction.text Paragraph tqdm FileReader CustomJS figure PCA transform get_breaks RadioButtonGroup TextInput KMeans header widgetbox pprint input_callback __init__ sklearn.decomposition HoverTool ", "entities": "(('all', 'reproducible results'), 'set') (('that', 'several dimensions'), 'Use') (('we', 'Latent Dirichlet Allocation LDA'), 'create') (('body_text', 'coordinates'), 'plot') (('that', 't approaches'), 'unsupervise') (('publisher ACM New York NY USA keywords cyber security jaccard similarity lempel ziv malware classification compression acmid 3098111 normalized distance', 'notebook'), '3098111') (('We', 'concept'), 'implement') (('health care workers sanitation staff', 'much other essential out there world'), 'be') (('kinds', 'articles'), 'be') (('It', 'locally offline'), 'download') (('we', 'idf'), 'use') (('t SNE', 'higher dimensional data'), 'be') (('This', 'dimensionality reduction step'), 'reduce') (('whole dataset', 'network connection'), 'be') (('Distortion', 'assigned center'), 'compute') (('we', 'spacy library'), 'use') (('k means', 'keywords'), 'perform') (('provided abstract too plot', 'words first 300 append'), 'add') (('you', 'https maksimekin'), 'appreciate') (('Attempting', 'following problems'), 'give') (('approach', 'similarity'), 'perform') (('articles', 'easily other'), 'be') (('Run k', 't t SNE https SNEUsing lvdmaaten'), 'mean') (('relationships', 'papers'), 'means') (('this', 'unsupervised nature'), 'be') (('Nicholas McLean Thirty Fourth AAAI Conference', 'url arxiv'), 'maksimeren') (('more than 2 when plotting', 'so first 2 append'), 'be') (('trained professionals', 'own determinations'), 'create') (('we', 'data frame'), 'let') (('we', 'en_core_sci_lg'), 'use') (('This', 'biomedical scientific text'), 'be') (('structure', 'extent'), 'show') (('we', 'LDA Latent Dirichlet Allocation'), 'use') (('professionals', 'central topic'), 'allow') (('most important terms', 'cluster'), 'find') (('that', 'language'), 'be') (('SHOW project we', 'visualization purposes'), 'download') (('papers', 'similar topics'), 'describe') (('such related publications', 'papers'), 'organize') (('often it', 'separate them'), 'intersect') (('clustering', 'body text'), 'do') (('analysis', 'solely titles'), 'look') (('Now above stopwords', 'everyday English text'), 'use') (('we', 'k different values'), 'means_clustere') (('topic modeling', 'cluster'), 'perform') (('that', 'COVID'), 'consist') (('health professionals', 'texts'), 'believe') (('Search', 'inside selected cluster'), 'perform') (('data', 'when 2 dimensions'), 'take') (('k means', 'randomly initialized centroid'), 'categorize') (('io we', '2 dimensions'), 'tsne') (('we', 'project'), 'welcome') (('results', 'random state'), 'lead') (('means', 'vectorized text'), 'run') (('don t', 'meaning'), 'use') (('that', 'readily researchers'), 'be') (('hover tool', 'screen'), 'be') (('we', 'clustering efforts'), 'limit') (('similar article', 'other'), 'be') (('that', 'search term'), 'have') (('Sitting', 'own way'), 'give') (('surface level examination', 'data'), 'show') (('t SNE', 'sometimes different decisions'), 'arrive') (('health professionals', 'virus'), 'Proceedings') (('topic', 'words'), 'describe') (('we', 'abstract'), 'be') (('how papers', 'better insight'), 'give') (('that', 'Kaggle'), 'be') (('was', 'texts'), 'require') (('collection', 'scatter plot'), 'cluster') (('work', 'future projects'), 'replicate') (('we', 'key terms'), 'perform') (('that', 'task questions'), 'find') (('Cite Custom', 'Topic Modeling Related Articles https Words www'), 'stop') (('t SNE', 'as closely possible when 2D.'), 'attempt') (('is', 'https maksimekin'), 'be') (('it', 'papers'), 'note') (('character when length', 'certain amount'), 'fetch') (('work', 'COVID'), 'hope') (('We', 'body text'), 'cluster') (('Hovering', 'title author journal'), 'give') (('cluster we', 'previous step'), 'be') (('we', 'cluster'), 'attempt') (('PCA how much we', 'still 95 variance'), 'be') (('first intex', 'space'), 'fit') (('This', 'topics'), 'help') (('we', 'literature'), 'create') (('3419591 world', '2 19 2020'), 'abstract') (('that', 'us'), 'let') (('This', 'cluster'), 'add') (('how word', 'whole'), 'convert') (('com exploration tool Loading ivanegapratama covid eda initial MetadataLet', 'dateset'), 'load') (('so navigation', 'topics'), 'simplify') (('K', 'topics'), 'mean') (('even they', 't independent clusters'), 'find') (('publication', 'topic larger cluster'), 'connect') (('where k', 'Y1'), 'apply') (('t especially SNE', 'notebook'), 'fit_transform') (('scientists', 'new findings'), 'track') (('that', 'algorithms'), 'process') (('that', 'full publication'), 'bring') (('plane two dimensional X', 'embedding Y1'), 'apply') (('s', 'labels'), 'let') (('that', 'clustering step'), 'carry') (('decreases', 'distortion'), 'be') (('Halifax NS 17 2017 4503 4 Canada', 'url http 1007 1015 numpages 9 doi'), 'booktitle') (('that', 'clusters'), 'give') (('function', 'stopwords'), 'convert') (('column widgetbox keyword widgetbox slider notes', 'PAGE show'), 'let') (('We', 'vectorized data'), 'apply') (('great tool', 'HTML file'), 'be') (('Users', 'cluster'), 'have') (('Papers', 'label'), 'write') (('important outputs', 'future use'), 'want') (('papers', 'quickly them'), 'be') (('previous steps', 'two dimensions'), 'give') (('that', 'search term'), 'show') (('19 material', 'similar themes'), 'allow') (('Now other where colored labels', 'plot'), 'be') (('that', 'user friendly manner'), 'improve') (('topics', 'decision concrete boundary'), 'be') "}