{"name": "data science glossary on kaggle ", "full_name": " h1 Data Science Glossary on Kaggle h2 Contents h2 1 Regression Algorithms h2 2 Regularization Algorithms h2 3 Tree Based Models h2 4 Neural Networks and Deep Learning Models h2 5 Clustering Algorithms h2 6 Misc Models h2 7 Important Data Science Techniques h3 7 1 Preprocessing h3 7 2 Dimentionality Reduction h3 7 3 Post Modelling Techniques h3 7 4 Ensemblling h2 8 Text Data h2 9 Data Science Tools h2 10 Data Visualization h2 11 Time Series h2 12 Misc Materials h3 12 1 Some of the Best Tutorials on Kaggle h3 12 2 Data Leak h3 12 3 Adversarial Validation h3 12 4 Generative Adversarial Networks ", "stargazers_count": 0, "forks_count": 0, "description": "One can use this kernel as the one place to find other great kernels shared by great authors. Clustering Algorithms 6. Suggest the list of items which can be added to the list. Feature Engineering c. 3 Adversarial Validation 12. com kaggle meta kaggle database to create a glossary of data science models techniques and tools shared on kaggle kernels. 1 Some of the Best Tutorials on Kaggle 12. 2 Data Science Techniques Dimentionality Reduction a. Regularization Algorithms 3. Hope you like this kernel. Kaggle Kernels are one of the best resources on internet to understand the practical implementation of algorithms. Feature Selection d. Data Science Tools 9. 1 Neural Networks 4. Data Science Glossary on Kaggle Kaggle is the place to do data science projects. Neural Networks and Deep Learning Models 5. Regression Algorithms 1. Generative Adversarial Networks 1. 1 Ridge Regression Regression 2. There are so many algorithms and concepts to learn. 5 Recurrent Neural Networks RNN 4. Regression Algorithms 2. Clustering Algorithms 5. 2 Logistic Regression 2. Neural Networks and Deep Learning 4. 1 K Means Clustering 5. 4 Recommendation Engine 7. 1 Data Science Techniques Preprocessing a. Anomaly Detection f. Cross Validation b. Data Science Tools 10. 18 Object Detection 4. 1 Linear Regression 1. 6 Gradient Boosting 4. 2 Hierarchial Clustering 5. Data Visualizations 10. Important Data Science Techniques 7. 3 Data Science Techniques Post Modelling a. 17 Transfer Learning 4. 15 Inception Nets 4. Data Visualization 11. 4 Convolutional Neural Networks CNN 4. 2 Dimentionality Reduction 7. I have used the Meta Kaggle https www. 19 Object Detection 4. Regularization Algorithms 2. If you liked this kernel please upvote. 4 Generative Adversarial NetworksThanks for viewing. 4 Data Science Techniques Ensemblling a. Time Series Analysis 11. 2 Lasso Regression 2. Dataset Decomposition b. 16 Computer Vision 4. EDA Exploration b. Best Tutorials on Kaggle 12. Tree Based Models 3. Misc Materials 12. Outlier Treatment e. 4 Unsupervised Learning 6. Adversarial Validation 12. Tree Based Models 4. There are almost 200 000 kernels published on kaggle and sometimes it becomes diffcult to search for the right implementation. 3 Post Modelling Techniques 7. ", "id": "shivamb/data-science-glossary-on-kaggle", "size": "6840", "language": "python", "html_url": "https://www.kaggle.com/code/shivamb/data-science-glossary-on-kaggle", "git_url": "https://www.kaggle.com/code/shivamb/data-science-glossary-on-kaggle", "script": "get_latest best_kernels pressence_check HTML IPython.core.display get_kernels pandas ", "entities": "(('which', 'list'), 'suggest') (('sometimes it', 'right implementation'), 'be') (('One', 'great authors'), 'use') (('Kaggle Kernels', 'algorithms'), 'be') (('Data Science Glossary', 'data science projects'), 'be') "}