{"name": "data examination and cleaning ", "full_name": " h1 Data Examination and Cleaning h2 Shape and Nature of data h2 Checking missing values for each feature h2 Dividing Categorical and Numerical Data h2 Removing and Filling Missing Values in Numerical and Categorical Data h2 Converting Categorical Data to Numerical and Merging Them h2 Inspecting Correlation between various Features and Outcome h2 1 Packed Cell Volume Outcome h2 2 Pulse Outcome ", "stargazers_count": 0, "forks_count": 0, "description": "For columns with less than 40 NAN Value For Numerical Data Replace NAN values with median value of that particular column For Categorical Data Replace NAN values with mode value of that particular column Converting Categorical Data to Numerical and Merging ThemIt shall be noted that numeric 0 1 2 are equivalent to died euthanized lived for outcome. edu ml datasets Horse Colic Reading data from CSV file and saving as Pandas Dataframe Shape and Nature of data Inspecting nature of data it can be seen that data consists of 17 categorical features and rest numerical out of 28. 3 0 Weakly correlated Removing unwanted very less correlated featuresTo better understand how two features are correlated. We will be checking correlation of each column with outcome. Data Examination and CleaningTutorial Level Beginner Data Cleaning is detection fillup or removal of incomplete inaccurate or vague data. And after 150 the probability of died being the outcome is highest. 7 Hight correlated 0. Checking missing values for each featureThe graph shows the number of Missing values in each feature most of the features have less than 40 missing values. com uciml horse colic 2. If correlation value is negative feature is negatively correlated to outcome. Dividing Categorical and Numerical Data Removing and Filling Missing Values in Numerical and Categorical Data 1. Let us plot two most correlated to outcome features as histogram and kde plot. If correlation value is 0 two columns are not correlated. Inspecting Correlation between various Features and OutcomeCorrelation shows how strongly features are related to each other. For columns with more than 40 NAN Value Remove Columns2. Kaggle http www. Data is available via following links. UCI Machine Learning Repository http archive. The tutorial below discuss the examination of data and performing necessary steps to clean data including Dealing with Missing Data Removal and Filling of Missing Data for Numerical and Categorical Features Dividing Numerical and Categorical Data and Converting Categorical Data to Numeric Form Inspecting Feature Correlation to study important features Removal of less Corrlated Features Plotting histogram and kde plots to get a butter understanding of dataImporting required librariesData being used here for data examination is Horse Colic Dataset which predicts whether a horse can survive or not based on past medical conditions. Packed Cell Volume OutcomeThe plots show that after approx 50 outcome is most likely to be euthanized and after 60 it is likely to be died. Pulse OutcomeThe plots show that after approx 60 outcome is likely to be died which is then replaced by euthanized after 100. If correlation value is positive fetaure is positively correlated to outcome. 3 Moderately correlated 0. ", "id": "sabasiddiqi/data-examination-and-cleaning", "size": "3113", "language": "python", "html_url": "https://www.kaggle.com/code/sabasiddiqi/data-examination-and-cleaning", "git_url": "https://www.kaggle.com/code/sabasiddiqi/data-examination-and-cleaning", "script": "seaborn pandas matplotlib.pyplot numpy ", "entities": "(('data', 'rest 28'), 'dataset') (('horse', 'past medical conditions'), 'discuss') (('We', 'outcome'), 'check') (('how strongly features', 'other'), 'show') (('us', 'histogram plot'), 'correlate') (('Data Examination', 'CleaningTutorial Level Beginner Data detection incomplete inaccurate data'), 'be') (('which', 'then 100'), 'Pulse') (('numeric 0 1 2', 'outcome'), 'note') (('it', 'most 60'), 'Volume') (('probability', '150'), 'be') (('number', 'less than 40 missing values'), 'show') "}