{"name": "data visualization and analysis ", "full_name": " h1 Data visualization kernel h2 Content h2 First images in train and test datasets h2 Random item access h2 Explore categories h2 Category count vs Image count ", "stargazers_count": 0, "forks_count": 0, "description": "Each dictionary contains product id key _id the category id of the product key category_id 1 4 images stored in a list key imgs. beekeeping SPORT BASEBALL BLOUSON DE BASEBALL VESTE DE BASEBALL. category_id has 3 category tags of different levelsUsing category_id field we can associate image to 3 levels of category tags labels. It takes around 3 mins to execute. See this https datascience. Category_count vs Image_countWe can display a relationship between numbers of categories that are presented by an amount of images i. Data visualization kernelHere is a new image based competition hosted by a french e commerce company Cdiscount. com inversion processing bson files and this https www. 1000010653 by an image. We need to predict a number e. Let s display some of these most frequent category items MUSIQUE CD CD POP ROCK CD ROCK INDE Let s display some of these 31 less frequent categories Here is a plot of sorted category counts The goal of the competition is to predict category_id by image. com bguberfain just showing a few images very helpful kernels First images in train and test datasetsAs it is said in data description page TRAIN_DB contains a list of 7 069 896 dictionaries one per product. Display for example a item with _id 1234 Explore categoriesLet s inspect categories and their relationship to images. Dataset announced features Almost 9 million products half of the current catalogue More than 15 million images at 180x180 resolution More than 5000 categories yes this is quite an extreme multi class classification Let s explore this in details Content First images in train and test datasets Random item access Explore categoriesPS. com questions 11777 what is the distribution of categories in imagenet training set ilsvrc2012 for more details. We have 5270 unique categories 49 unique level 1 categories 483 unique level 2 categories 5263 unique level 3 categoriesSo as it was asked in comments by microland we can observe that there are items with different category_id but the same category_level3 Here is the histogram of level 1 categoriesLevel 2 and 3 categories are distributed as follows Now let s create training data table _id category_id We have in training datasets 5270 unique categories in 7069896 entries 1 most frequent category found 79640 times MUSIQUE en. Now let s quickly take a look to test products Random item accessLet s make a random access to products by maping each product byte offset and length. linear algebra data processing CSV file I O e. Thus previous image is characterized as Let s see some more images So in train dataset we have products indexed by _id belong to a category_id and described by 1 4 images. Following code creates a dictionary with key indexing item _id and values offset length. childcare APICULTURE en. 10 categories are presented in the training dataset by 100 images. Let s look at the first item Table CATEGORY_NAMES_DF shows the hierarchy of product classification. read_csv Method to compose a single image from 1 4 images according to data page Decode item length Check if we can decode according to data page. Thanks to this https www. music 31 less frequent categories found 12 times PUERICULTURE en. ", "id": "vfdev5/data-visualization-and-analysis", "size": "3238", "language": "python", "html_url": "https://www.kaggle.com/code/vfdev5/data-visualization-and-analysis", "git_url": "https://www.kaggle.com/code/vfdev5/data-visualization-and-analysis", "script": "seaborn decode get_item matplotlib.pyplot tqdm_notebook PIL Image pandas decode_images decode_pil tqdm numpy ", "entities": "(('10 categories', '100 images'), 'present') (('Data kernelHere', 'e commerce company new image based french Cdiscount'), 'visualization') (('products', '1 4 images'), 'characterize') (('TRAIN_DB', 'product'), 'bguberfain') (('key i', '1 list key category_id 4 key imgs'), 'contain') (('Content First images', 'item access Explore Random categoriesPS'), 'announce') (('goal', 'image'), 'let') (('that', 'images i.'), 'display') (('11777 distribution', 'more details'), 'com') (('79640 times', '1 most frequent category'), 'have') (('we', 'category tags labels'), 'have') (('product byte', 'products'), 'let') (('Table CATEGORY_NAMES_DF', 'product classification'), 'let') (('we', 'data page'), 'Method') "}