{"name": "data sciencetutorial for beginners ", "full_name": " h1 DATA SCIENTIST h3 As a summary we will learn python to be data scientist h1 1 INTRODUCTION TO PYTHON h3 MATPLOTLIB h3 DICTIONARY h3 PANDAS h3 WHILE and FOR LOOPS h1 2 PYTHON DATA SCIENCE TOOLBOX h3 USER DEFINED FUNCTION h3 SCOPE h3 NESTED FUNCTION h3 DEFAULT and FLEXIBLE ARGUMENTS h3 LAMBDA FUNCTION h3 ANONYMOUS FUNCTİON h3 ITERATORS h3 LIST COMPREHENSİON h1 3 CLEANING DATA h3 DIAGNOSE DATA for CLEANING h3 EXPLORATORY DATA ANALYSIS h3 VISUAL EXPLORATORY DATA ANALYSIS h3 TIDY DATA h3 PIVOTING DATA h3 CONCATENATING DATA h3 DATA TYPES h3 MISSING DATA and TESTING WITH ASSERT h1 4 PANDAS FOUNDATION h3 REVİEW of PANDAS h3 BUILDING DATA FRAMES FROM SCRATCH h3 VISUAL EXPLORATORY DATA ANALYSIS h3 STATISTICAL EXPLORATORY DATA ANALYSIS h3 INDEXING PANDAS TIME SERIES h3 RESAMPLING PANDAS TIME SERIES h1 MANIPULATING DATA FRAMES WITH PANDAS h3 INDEXING DATA FRAMES h3 SLICING DATA FRAME h3 FILTERING DATA FRAMES h3 TRANSFORMING DATA h3 INDEX OBJECTS AND LABELED DATA h3 HIERARCHICAL INDEXING h3 PIVOTING DATA FRAMES h3 STACKING and UNSTACKING DATAFRAME h3 MELTING DATA FRAMES h3 CATEGORICALS AND GROUPBY h1 CONCLUSION ", "stargazers_count": 0, "forks_count": 0, "description": "Introduction to Python 1 1. csv yolunu koymanız gerekli resimde olduğu gibi. PANDASWhat do we need to know about pandas CSV comma separated values Before continuing with pandas we need to learn logic control flow and filtering. Pivoting data 21 1. We can make it one line code that is list comprehension. html MANIPULATING DATA FRAMES WITH PANDAS INDEXING DATA FRAMES Indexing using square brackets Using column attribute and row label Using loc accessor Selecting only some columns SLICING DATA FRAME Difference between selecting columns Series and data frames Slicing and indexing series Reverse slicing From something to end FILTERING DATA FRAMESCreating boolean seriesCombining filtersFiltering column based others TRANSFORMING DATA Plain python functions Lambda function to apply arbitrary python function to every element Defining column using other columns INDEX OBJECTS AND LABELED DATAindex sequence of label HIERARCHICAL INDEXING Setting indexing PIVOTING DATA FRAMES pivoting reshape tool STACKING and UNSTACKING DATAFRAME deal with multi label indexes level position of unstacked index swaplevel change inner and outer level index position MELTING DATA FRAMES Reverse of pivoting CATEGORICALS AND GROUPBY CONCLUSIONThank you for your votes and comments MACHINE LEARNING https www. Data types 23 1. As a summary we will learn python to be data scientist Content 1. Visual exploratory data analysis 19 1. Mesela eğer yukarı bulunan kodu çalıştırdığınızda resimdeki gibi bir output veriyorsa pd. This can be done with for loop. Statistical explatory data analysis 29 1. cant modify valuestuple uses paranthesis like tuble 1 2 3 unpack tuple into several variables like a b c tuple SCOPEWhat we need to know about scope global defined main body in script local defined in a function built in scope names in predefined built in scope module such as print lenLets make some basic examples NESTED FUNCTION function inside function. com kanncaa1 machine learning tutorial for beginners DEEP LEARNING https www. Changes automatically assigned to data So does it work Lets check with assert statement Assert statement return nothing because it is true In order to run all code we need to make this line comment assert 1 2 return error because it is false returns nothing because we drop nan values returns nothing because we do not have nan values assert data. csv dosyaları yazılmalı. You do not need to know everything. read_csv içerisine yukarıda çıkan. count number of entries mean average of entries std standart deviation min minimum entry 25 first quantile 50 median or second quantile 75 third quantile max maximum entry INDEXING PANDAS TIME SERIES datetime object parse_dates boolean Transform date to ISO 8601 yyyy mm dd hh mm ss format RESAMPLING PANDAS TIME SERIES Resampling statistical method over different time intervals Needs string to specify frequency like M month or A year Downsampling reduce date time rows to slower frequency like from daily to weekly Upsampling increase date time rows to faster frequency like from daily to hourly Interpolate Interpolate values according to different methods like linear time or index https pandas. Like a inconsistent date and string formatting. Example dictionary spain madrid Key is spain. Therefore lets make example to understand it. Scatter is better when there is correlation between two variables Histogram is better when we need to see distribution of numerical data. This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. com kanncaa1 machine learning tutorial for beginners 1. correlation map Line Plot color color label label linewidth width of line alpha opacity grid grid linestyle sytle of line legend puts label into plot label name of label title title of plot Scatter Plot x attack y defense label name of label title title of plot Histogram bins number of bar in figure clf cleans it up again you can start a fresh We cannot see plot due to clf create dictionary and look its keys and values Keys have to be immutable objects like string boolean float integer or tubles List is not immutable Keys are unique update existing entry Add new entry remove entry with key spain check include or not remove all entries in dict In order to run all code you need to take comment this line it gives error because dictionary is deleted data Defense series data Defense data frame Comparison operator Boolean operators 1 Filtering Pandas data frame There are only 3 pokemons who have higher defense value than 200 2 Filtering pandas with logical_and There are only 2 pokemons who have higher defence value than 2oo and higher attack value than 100 This is also same with previous code line. How can we learn what is built in scope nested function default arguments what if we want to change default arguments flexible arguments args flexible arguments kwargs that is dictionary If you do not understand this part turn for loop part and look at dictionary in for loop lambda function where x is name of argument where x y z are names of arguments iteration example print next iteration print remaining iteration zip example unzip returns tuple Example of list comprehension Conditionals on iterable lets return pokemon csv and make one more list comprehension example lets classify pokemons whether they have high or low speed. Lambda function 12 1. Indexing data frames 33 1. com kanncaa1 interactive bokeh tutorial part 1 1. The easiest and most basic plots are line scatter and histogram plots. PYTHON DATA SCIENCE TOOLBOX USER DEFINED FUNCTIONWhat do we need to know about functions docstrings documentation for functions. Tidy data 20 1. Describing melt is confusing. What you only need is to learn how to use python 1. User defined function 8 1. The lower quartile is the median in between the smallest number and the median i. Melting data frames 41 1. Adding new column Broadcasting Create new column and assign a value to entire column VISUAL EXPLORATORY DATA ANALYSIS Plot Subplot Histogram bins number of bins range tuble min and max values of bins normed boolean normalize or not cumulative boolean compute cumulative distribution STATISTICAL EXPLORATORY DATA ANALYSISI already explained it at previous parts. We will visualize the data with python like matplot and seaborn libraries. CONCATENATING DATAWe can concatenate two dataframe DATA TYPESThere are 5 basic data types object string boolean integer float and categorical. Dictionaries 3 1. loc Fire Flying howw to use indexes pivoting lets unstack it level determines indexes change inner and outer level index position df. Resampling pandas time series 31 1. Unclean data Column name inconsistency like upper lower case letter or space between words missing data different language We will use head tail columns shape and info methods to diagnose data EXPLORATORY DATA ANALYSISvalue_counts Frequency countsoutliers the value that is considerably higher or lower from rest of the data Lets say value at 75 is Q3 and value at 25 is Q1. Cleaning Data 16 1. Although we learn some basics of pandas we will go deeper in pandas. You only need is understanding basics of machine learning and learning how to implement it while using python. Indexing pandas time series 30 1. Yukarıda kod bloğunu run edince ne çıkıyorsa onu yazmanız lazım mesela aşağıdaki gibi. Slicing data frames 34 1. 5 Q3 Q1 and bigger than Q3 1. Anonymous function 13 1. DATA SCIENTIST In this tutorial I only explain you what you need to be a data scientist neither more nor less. com kanncaa1 basic statistic tutorial for beginners1. Customization Colors labels thickness of line title opacity grid figsize ticks of axis and linestyle DICTIONARYWhy do we need dictionary It has key and value Faster than listsWhat is key and value. Basic Tools Like python R or SQL. Q3 Q1 IQRWe will use describe method. we will learn loc more detailed later head shows first 5 rows tail shows last 5 rows columns gives column names of features shape gives number of rows and columns in a tuble info gives data type like dataframe number of sample or row number of feature or column feature types and memory usage For example lets look frequency of pokemom types if there are nan values that also be counted As it can be seen below there are 112 water pokemon or 70 grass pokemon For example max HP is 255 or min defense is 5 ignore null entries For example compare attack of pokemons that are legendary or not Black line at top is max Blue line at top is 75 Green line is median 50 Blue line at bottom is 25 Black line at bottom is min There are no outliers Firstly I create new data from pokemons data to explain melt nore easily. PANDAS FOUNDATION REVİEW of PANDASAs you notice I do not give all idea in a same time. Therefore we can also use for filtering. I actually did it at the beginning of manipulating data frames with pandas section It was like this data data. i 1 for i in num1 list of comprehension i 1 list comprehension syntax for i in num1 for loop syntax i iterator num1 iterable objectUp to now you learn User defined function Scope Nested function Default and flexible arguments Lambda function Anonymous function Iterators List comprehension 3. values numpy BUILDING DATA FRAMES FROM SCRATCH We can build data frames from csv as we did earlier. For example running this by clicking run or pressing Shift Enter will list the files in the input directory Any results you write to the current directory are saved as output. VISUAL EXPLORATORY DATA ANALYSIS Box plots visualize basic statistics like outliers min max or quantiles TIDY DATAWe tidy data with melt. Review of pandas 26 1. PIVOTING DATAReverse of melting. Lets chech Type 2 As you can see there are 386 NAN value Lets drop nan values also we will use data to fill missing value so I assign it to data1 variable inplace True means we do not assign it to new variable. Data Visualization Title is actually explanatory. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. However it is unnecessarily long. Basic Statistics Like mean median or standart deviation. Time Series Prediction 1. Recurrent Neural Network https www. Example for f This is docstring for documentation of function f tuple sequence of immutable python objects. Filtering data frames 35 1. com kanncaa1 statistical learning tutorial for beginners If you have any question or suggest I will be happy to hear it. Artificial Neural Network https www. Exploratory data analysis 18 1. Stacking and unstacking data frames 40 1. com kanncaa1 recurrent neural network with pytorch WARNING UYARI If you run the code above if it outputs like in the picture you need to put the. com kanncaa1 deep learning tutorial for beginners1. As you guess python helps us. com kanncaa1 deep learning tutorial for beginners STATISTICAL LEARNING https www. Rare Visualization https www. map func seq applies a function to all the items in a list ITERATORS iterable is an object that can return an iterator iterable an object with an associated iter method example list strings and dictionaries iterator produces next value with next methodzip zip lists LIST COMPREHENSİON One of the most important topic of this kernel We use list comprehension for data analysis often. Matplotlib 2 1. Missing data and testing with assert 24 1. Concatenating data 22 1. Stay in loop if condition i is not equal 5 is true Stay in loop if condition i is not equal 5 is true Enumerate index and value of list index value 0 1 1 2 2 3 3 4 4 5 For dictionaries We can use for loop to achive key and value of dictionary. Our threshold is average speed. com kanncaa1 time series prediction tutorial with eda1. in between 1 and 11 which is 6. com kanncaa1 rare visualization tools 1. Visual exploratory data analysis 28 1. For pandas we can achieve index and value example of what we learn above guess prints what x 2 global scope x 3 local scope What if there is no local scope there is no local scope x it uses global scope x First local scope searched then global scope searched if two of them cannot be found lastly built in scope searched. Pivoting data frames 39 1. Machine Learning 1. Because categorical data uses less memory speed up operations like groupby. set_index also you can use data. Loop data structures 6 1. single column series NaN not a number dataframe. Bokeh 1 https www. Transforming data frames 36 1. Also we can build dataframe from dictionaries zip method This function returns a list of tuples where the i th tuple contains the i th element from each of the argument sequences or iterables. We learnt key and value at dictionary part. Iterators 14 1. columns 1 Name assert data. Not created from us like data2 we can solve this problem with interpolate We can interpolete from first value Or we can interpolate with mean read data indexing using square brackets using column attribute and row label using loc accessor Selecting only some columns Difference between selecting columns series and dataframes series data frames Slicing and indexing series 10 and Defense are inclusive Reverse slicing From something to end Creating boolean series Combining filters Filtering column based others Plain python functions Or we can use lambda function Defining column using other columns our index name is this lets change it Overwrite index if we want to modify index we need to change all of them. Outlier are smaller than Q1 1. I only take 5 rows into new data lets melt id_vars what we do not wish to melt value_vars what we want to melt Index is name I want to make that columns are variable Finally values in columns are value Firstly lets create 2 data frame axis 0 adds dataframes in row axis 1 adds dataframes in column lets convert object str to categorical and int to float. DEFAULT and FLEXIBLE ARGUMENTS Default argument example def f a b 1 b 1 is default argument Flexible argument example def f args args can be one or more def f kwargs kwargs is a dictionary lets write some code to practice LAMBDA FUNCTIONFaster way of writing function ANONYMOUS FUNCTİONLike lambda function but it can take more than one arguments. It is not remarkable change but it is just example We can make one of the column as index. int data frames from dictionary Add new columns Broadcasting Broadcasting entire column Plotting all data it is confusing subplots scatter plot hist plot histogram subplot with non cumulative and cumulative As you can see date is string however we want it to be datetime object close warning In order to practice lets take head of pokemon data and add it a time list lets make date as index Now we can select according to our date index We will use data2 that we create at previous part Lets resample with month As you can see there are a lot of nan because data2 does not include all months In real life data is real. Data Visualization 1. Data Munging Working with messy and difficult data. Nested function 10 1. INTRODUCTION TO PYTHON MATPLOTLIBMatplot is a python library that help us to plot data. The upper quartile you find the median between the median and the largest number i. List comprehension 15 1. We can make conversion data types like from str to categorical or from int to float Why is category important make dataframe smaller in memory can be utilized for anlaysis especially for sklearn we will learn later MISSING DATA and TESTING WITH ASSERTIf we encounter with missing data what we can do leave as is drop them with dropna fill missing value with fillna fill missing values with test statistics like meanAssert statement check that you can turn on or turn off when you are done with your testing of the programIn this part you learn Diagnose data for cleaning Exploratory data analysis Visual exploratory data analysis Tidy data Pivoting data Concatenating data Data types Missing data and testing with assert 4. There is a LEGB rule that is search local scope enclosing function global and built in scopes respectively. As you can see Type 1 is converted from object to categorical And Speed s converted from int to float Lets look at does pokemon data have nan value As you can see there are 800 entries. Diagnose data for cleaning 17 1. In this case it would be 11. pivot index treatment columns gender values response We will use df according to treatment take means of other features mean is aggregation reduction method there are other methods like sum std max or min we can only choose one of the feature Or we can choose multiple features as you can see gender is object However if we use groupby we can convert it categorical data. Building data frames from scratch 27 1. Hierarchical indexing 38 1. Index objects and labeled data 37 1. Deep Learning with Pytorch 1. However Type 2 has 414 non null object so it has 386 null object. com kanncaa1 pytorch tutorial for deep learning lovers 1. CLEANING DATA DIAGNOSE DATA for CLEANINGWe need to diagnose and clean data before exploring. index data lets read data frame one more time to start from beginning As you can see there is index. read_csv as in the picture. Pandas Foundation 25 1. Categoricals and groupby 42 1. list comprehension collapse for loops for building lists into a single lineEx num1 1 2 3 and we want to make it num2 2 3 4. Describe method includes count number of entries mean average of entries std standart deviation min minimum entry 25 first quantile 50 median or second quantile 75 third quantile max maximum entry What is quantile 1 4 5 6 8 9 11 12 13 14 15 16 17 The median is the number that is in middle of the sequence. Yukarıdaki kod bloğunu run edince sonuç ne veriyorsa read_csv içerisine onu yazmanız gerekli. first copy of our data to data3 then change index lets make index start from 100. between 11 and 17 which will be 14 according to the question above. read_csv visualization tool Input data files are available in the. Machine Learning You do not need to understand math behind the machine learning technique. Data scientist need to have these skills 1. Logic control flow and filtering 5 1. Seaborn https www. Manipulating Data Frames with Pandas 32 1. Convolutional Neural Network https www. If you know basic statistics you can use python easily. Python Data Science Toolbox 7 1. However lets look at one more time. Lets practice some other properties like keys values update add check remove key remove all entries and remove dicrionary. Comparison operator Boolean operators and or not Filtering pandas WHILE and FOR LOOPSWe will learn the most basic while and for loopsIn this part you learn how to import csv file plotting line scatter and histogram basic dictionary features basic pandas features like filtering that is actually something always used and main for being data scientist While and for loops 2. com kanncaa1 plotly tutorial for beginners1. org pandas docs stable generated pandas. Line plot is better when x axis is time. However we want to set one or more column to be index Setting index type 1 is outer type 2 is inner index data1. com kanncaa1 seaborn for beginners 1. read_csv içerisine resimdeki. Default and flexible arguments 11 1. ", "id": "kanncaa1/data-sciencetutorial-for-beginners", "size": "14571", "language": "python", "html_url": "https://www.kaggle.com/code/kanncaa1/data-sciencetutorial-for-beginners", "git_url": "https://www.kaggle.com/code/kanncaa1/data-sciencetutorial-for-beginners", "script": "add seaborn div subprocess matplotlib.pyplot tuple_ex check_output pandas square numpy ", "entities": "(('we', 'deeper pandas'), 'go') (('I', 'it'), 'com') (('Yukarıda kod bloğunu', 'onu yazmanız lazım mesela aşağıdaki ne çıkıyorsa gibi'), 'run') (('lower quartile', 'smallest number'), 'be') (('only need', 'how python'), 'be') (('This', 'python immutable objects'), 'example') (('Lambda', 'votes'), 'frame') (('that', 'sequence'), 'include') (('However we', 'one column'), 'want') (('This', 'code also previous line'), 'map') (('life real data', 'months'), 'frame') (('we', 'categorical data'), 'column') (('Data Munging', 'messy data'), 'work') (('we', 'nan values assert data'), 'change') (('index', '100'), 'change') (('we', 'python'), 'learn') (('example', 'it'), 'make') (('they', 'high speed'), 'learn') (('we', 'them'), 'interpolete') (('we', 'logic control flow'), 'need') (('Mesela eğer yukarı bulunan kodu resimdeki gibi bir çalıştırdığınızda output', 'pd'), 'veriyorsa') (('we', 'csv'), 'numpy') (('1 2 3 we', 'it'), 'collapse') (('read_csv visualization tool Input data files', 'the'), 'be') (('STATISTICAL EXPLORATORY DATA cumulative boolean compute cumulative ANALYSISI', 'previous parts'), 'add') (('you', 'the'), 'com') (('Data scientist', '1'), 'need') (('other properties', 'dicrionary'), 'practice') (('python that', 'data'), 'be') (('just We', 'index'), 'be') (('VISUAL EXPLORATORY DATA ANALYSIS Box plots', 'melt'), 'visualize') (('one more time you', 'data frame'), 'read') (('level index inner position', 'df'), 'Flying') (('We', 'dictionary part'), 'learn') (('LEGB that', 'scopes'), 'be') (('adds axis 1 dataframes', 'categorical'), 'take') (('it', '386 null object'), 'have') (('value', '25'), 'inconsistency') (('you', 'python'), 'use') (('You', 'python'), 'need') (('Firstly I', 'melt'), 'learn') (('data 5 basic types', 'integer boolean float'), 'concatenate') (('Yukarıdaki kod bloğunu', 'onu içerisine yazmanız'), 'run') (('We', 'matplot'), 'visualize') (('which', 'question'), 'between') (('It', 'Faster listsWhat'), 'label') (('It', 'data data'), 'do') (('It', 'python docker image https kaggle github'), 'come') (('USER we', 'functions'), 'toolbox') (('two', 'lastly scope'), 'achieve') (('categorical data', 'groupby'), 'use') (('you', 'nan value'), 'convert') (('you', 'output'), 'list') (('I', 'same time'), 'revi̇ew') (('CLEANING DATA DIAGNOSE DATA', 'CLEANINGWe'), 'need') (('Machine You', 'machine learning technique'), 'Learning') (('it', 'more than one arguments'), 'be') (('We', 'data analysis'), 'be') (('part you', 'assert'), 'make') (('function Iterators Anonymous List', '3'), 'i') (('where i', 'argument sequences'), 'build') (('we', 'new variable'), 'Type') (('Downsampling', 'linear time'), 'mean') (('when we', 'numerical data'), 'be') (('We', 'dictionary'), 'stay') (('upper you', 'largest i.'), 'quartile') (('that', 'loops'), 'learn') (('NESTED FUNCTION', 'function'), 'modify') (('you', 'what'), 'SCIENTIST') "}