{"name": "deciding diamond prices ", "full_name": " h1 Diamonds h1 Exploring About Diamonds h2 Characterstics of Diamond h2 Exploring the data h2 Feature Analysis Univariate and Bivariate h3 Categorical Features h3 Numerical Features h3 Multivariate Analysis h3 Mass Volume and Density h2 Data Preprocessing h1 Deciding the Diamond Prices h2 Linear Regression Baseline h2 Decision Tree ", "stargazers_count": 0, "forks_count": 0, "description": "One carat is defined as 200 milligrams. The next grade has a very slight trace of color These are graded as E color or F color diamonds. Exploring About Diamonds Characterstics of DiamondColumn Description price Price in US dollarscarat The mass of a diamond. Other characteristics such as presence or lack of fluorescence also affect the desirability and thus the value of a diamond used for jewelry. clarity Clarity is a measure of internal defects of a diamond called inclusions. jpg Exploring the data The minimum values of x y z are 0 which is not possible hence removing those data Checking Missing Data ___ Price Distribution ___ Feature Analysis Univariate and Bivariate Categorical Features Numerical Features Multivariate Analysis Mass Volume and Density Density is almost constant and mass and volume are highly correlated Data Preprocessing Missing Treatment Not Required in this case Numerical data Median Imputation Categorical data Constant Imputation Preprocessing Numerical data Scaling Categorical data One Hot Encoding Deciding the Diamond Prices Linear Regression Baseline Decision Tree LightGBM works best with this data Lets explore it further The key deciding factors for the price of a diamond are Its weight carat Its Dimensions y z depth x table. They have been used as decorative items since ancient times. com max 4000 0 6WLqebrITTPNHwu7. Diamonds are such a highly traded commodity that multiple organizations have been created for grading and certifying them based on the four Cs which are color cut clarity and carat. com images q tbn 3AANd9GcTSvEgoy9XcJ3itQ4B6i0IJTqwO4KR8zZ2dKQ usqp CAU Color Grading Scale img https i. com originals 23 c4 6a 23c46a456f285489c5893ab719cb611f. jpg Clarity Grading img https edipson. The price per carat increases with carat weight since larger diamonds are both rarer and more desirable for use as gemstones but it does not increase linearly with increasing size. The cut of a diamond describes the quality of workmanship and the angles to which a diamond is cut Fair Good Very Good Premium Ideal color Diamond colour from J worst to D best. The number size color relative location orientation and visibility of inclusions can all affect the relative clarity of a diamond I1 worst SI2 SI1 VS2 VS1 VVS2 VVS1 IF best x Length of the diamond in mmy Width of the diamond in mmz Depth of the diamond in mmdepth Total depth percentage z mean x y 2 z x y table Width of top of diamond relative to widest point Measurements of a Diamond img https encrypted tbn0. Diamonds img https miro. gif Diamond is one of the best known and most sought after gemstones. Instead there are sharp jumps around milestone carat weightscut quality of the cut The cut of a diamond describes the manner in which a diamond has been shaped and polished from its beginning form as a rough stone to its final gem proportions. Inclusions may be crystals of a foreign material or another diamond crystal or structural imperfections such as tiny cracks that can appear whitish or cloudy. com wp content uploads 2019 07 clarity chart. Slightly colored diamonds are graded as I or J or K color. The finest quality as per color grading is totally colorless which is graded as D color diamond across the globe. The hardness of diamond and its high dispersion of light giving the diamond its characteristic fire make it useful for industrial applications and desirable as jewellery. Diamonds which show very little traces of color are graded as G or H color diamonds. ", "id": "ritvik1909/deciding-diamond-prices", "size": "3776", "language": "python", "html_url": "https://www.kaggle.com/code/ritvik1909/deciding-diamond-prices", "git_url": "https://www.kaggle.com/code/ritvik1909/deciding-diamond-prices", "script": "OneHotEncoder lightgbm LinearRegression StandardScaler SimpleImputer xgboost RandomForestRegressor numpy seaborn make_pipeline make_column_transformer sklearn.compose sklearn.tree XGBRegressor GradientBoostingRegressor sklearn.linear_model transform KFold LGBMRegressor matplotlib.pyplot ExtraTreesRegressor DecisionTreeRegressor pandas sklearn.model_selection get_column_names sklearn.pipeline fit mean_squared_error sklearn.impute Pipeline Preprocessor() __init__ GridSearchCV sklearn.metrics fit_transform sklearn.ensemble make_column_selector XGBRFRegressor sklearn.preprocessing ", "entities": "(('which', 'color'), 'grade') (('Other characteristics', 'jewelry'), 'affect') (('clarity Clarity', 'diamond'), 'be') (('diamond', 'gem final proportions'), 'be') (('that', 'diamond such tiny cracks'), 'be') (('These', 'E color'), 'have') (('gif Diamond', 'most gemstones'), 'be') (('further key deciding factors', 'weight y z'), 'jpg') (('They', 'ancient times'), 'use') (('it', 'linearly increasing size'), 'be') (('Slightly colored diamonds', 'I'), 'grade') (('which', 'four Cs'), 'be') (('it', 'jewellery'), 'make') (('Total depth table 2 Width', 'tbn0'), 'affect') (('totally which', 'globe'), 'be') (('diamond', 'worst D'), 'describe') "}