{"name": "deepfake starter kit ", "full_name": " h1 DeepFake Starter Kit h1 Content h1 Introduction h1 Preliminary data exploration h2 Load packages h2 Load data h2 Check files type h1 Meta data exploration h2 Missing data h2 Unique values h2 Most frequent originals h1 Video data exploration h2 Missing video or meta data h2 Few fake videos h2 Few real videos h2 Videos with same original h2 Test video files h1 Face detection h2 Play video files h1 Resources h1 References ", "stargazers_count": 0, "forks_count": 0, "description": "com analytics vidhya gans a brief introduction to generative adversarial networks f06216c7200e Tutorials A nice tutorial for GAN using Pytorch DCGAN Faces Tutorial https pytorch. We pick one of the originals with largest number of samples. We also define a function for detection and display of all these specific objects. The phenomen invades rapidly the film industry and threatens to compromise news agencies. org tutorials generative dcgan A tutorial for video and image colorization and resolution improvement using fast. Important note The data we analyze here is just a very small sample of data. Video data explorationIn the following we will explore some of the video data. We observe that original label has the same pattern for uniques values. 25 in train sample videos with the FAKE s acounting for 80. The function detect uses a method of the CascadeClassifier to detect objects into images in this case the face eye smile or profile face. In the Resources section I provide a short list of various resources for GAN and DeepFake with blog posts Kaggle Kernels and Github repos. Preliminary data exploration Load packages Load dataWe also added a face detection resource. Let s visualize now the data. org tutorials beginner dcgan_faces_tutorial. For each object we are using a different shape and color as following Frontal face green rectangle Eye red circle Smile red rectangle Profile face blue rectangle. Resources This resources list is not exhaustive it provides just a starting point for Kagglers that would like to join this competition in order to learn like myself. com serkanpeldek face detection with opencv by serkanpeldek https www. com jesucristo gan introduction A GAN developed for Dog face generation competition by cdeotte http kaggle cdeotte Dog Memorizer GAN https www. As we can see the REAL are only 19. Aparently here is a metadata file. Let s check this hypothesis. com brassmonkey381 a quick look at the first frame of each video 4 Basic EDA Face Detection split video ROI https www. We suspect that actually the real data has missing original if we generalize from the data we glimpsed. com hamditarek play video and processing we only show images extracted from the first 6 videos Frontal face profile eye and smile haar cascade loaded Detector object created frontal face eye profile face smile detected eyes shown in color image deactivated due to many false positive smiles sd. There are missing data 19. GANs that generate DeepFakes becomes better every day and of course if you include in a new GAN model all the information we collected until now how to combat various existent models we create a model that cannot be beatten by the existing ones. Large companies like Google invest very much in fighting the DeepFake this including release of large datasets to help training models to counter this threat 2. html Kaggle Kernels A very good intro to GAN by nanashi http kaggle nanashi GAN Introduction https www. Unique valuesLet s check into more details the unique values. Most of the files looks to have mp4 extension let s check if there is other extension as well. com serkanpeldek Face Detection with OpenCV https www. Let s explore this JSON file. com hamditarek https www. com marcovasquez basic eda face detection split video roi we modified a function for displaying a selected image from a video. com topics A Github project using Pytorch Faceswap Deepfake Pytorch https github. Check files typeHere we check the train data files extensions. com Shwetago Generative model using PyTorch References 1 Deepfake Wikipedia https en. Then we are also playing few videos. Let s look to some more videos from test set. Training of models should pe performed offline using the data provided by Kaggle as archives models should be loaded max 1GB memory in a Kernel where inference should be performed submission sample file provided and prediction should be prepared as an output file from the Kernel. We load the resources for frontal face eye smile and profile face detection. com hamditarek play video and processing Github repos Github topic for DeeFakes deepfakes https github. Few fake videosFrom 4 Basic EDA Face Detection split video ROI https www. With code in PyTorch and TensorFlow https medium. com ai society gans from scratch 1 a deep introduction with code in pytorch and tensorflow cb03cdcdba0f A cGAN introduction from Mastering Data Science with code How to Develop a Conditional GAN cGAN From Scratch https machinelearningmastery. Let s look to few fake videos. Large digital companies including content providers and social platforms are in the frontrun of fighting Deep Fakes. The class ObjectDetector initialize the cascade classifier using the imported resource. org wiki Deepfake 2 Google DeepFake Database Endgadget https www. From visual inspection of these fakes videos in some cases is very easy to spot the anomalies created when engineering the deep fake in some cases is more difficult. ai 2019 05 03 decrappify A tutorial from OpenCV for face detection using Cascade Classifiers Cascade Classifier https docs. com serkanpeldek face detection with opencv Play video and processing by hamditarek https www. com 2019 09 25 google deepfake database 3 A quick look at the first frame of each video https www. Let s do now some data distribution visualizations. Let s look to a small collection of samples from test videos. com Oldpan Faceswap Deepfake Pytorch A Github project for GAN with PyTorch PyTorch GAN https github. com shwetagoyal4 Generative model using PyTorch https github. Let s repeat the same process for test videos folder. com marcovasquez basic eda face detection split video roi 5 Face Detection with OpenCV https www. 4 db d28 tutorial_cascade_classifier. Then we initialize the ObjectDetector objects defined above with the respective resources to use CascadeClassfier for each specific task. The competition specifies that the train data is provided as archived chunks. The function call the detect method of the ObjectDetector object. com init27 Decrappification DeOldification and Super Resolution https www. Missing dataWe start by checking for any missing values. We also modify our visualization function to work with multiple images. com deepfakes the ugly and the good 49115643d8dd Introduction to GAN from Towards Data Science with code GANs from Scratch 1 A deep introduction. Due to a large amount of false positive we deactivated for now the smile detector. com serkanpeldek we got and slightly modified the functions to extract face profile face eyes and smile. We select first a list of fake videos. Note due to a huge amount of false positive we deactivate for now the smile detector. com hamditarek we learned how to play video files in a Kaggle Kernel. com tagged deepfakes An introduction to DeepFakes from Towards Data Science Deepfakes The Ugly and The Good https towardsdatascience. We know that we have 77 missing data that s why total is only 323 and we observe that we do have 209 unique examples. I provide here technical articles links small blog articles links to Github projects and some inspirational Kaggle Kernels about DeepFake DCGANs and GANs. We apply the function for face detection for a selection of images from train sample videos. More precisely we are using OpenCV Haar Cascade resources to identify frontal face eyes smile and profile face from still images in the videos. com serkanpeldek face detection with opencv 6 Play video and processing https www. Let s try now the same for few of the images that are real. com hamditarek play video and processing Kernel by hamditarek https www. Few real videos Videos with same originalLet s look now to set of samples with the same original. detect image_gray scale_factor scale_factor min_neighbors min_neighbors min_size int min_size 0 2 int min_size 1 2 for x y w h in smiles cv. Let s look now to a different selection of videos with the same original. Then we move to explore video files by looking first to a sample of fake videos then to real videos. We can observe that in some cases when the subject is not looking frontaly or when the luminosity is low the algorithm for face detection is not detecting the face or eyes correctly. We are visualizing one frame extracted from the video for both real and fake videos. Most frequent originalsLet s look now to the most frequent originals uniques in train sample data. We see that most frequent label is FAKE 80. Missing video or meta dataWe check first if the list of files in the meta info and the list from the folder are the same. html A tutorial for GANs A Beginner s Guide to Generative Adversarial Networks GANs https pathmind. Let s visualize now one of the videos. The following function extracts an image from a video and then call the function that extracts the face rectangle from the image and display the rectangle above the image. com how to develop a conditional generative adversarial network from scratch An introduction to GANs on Analytics Vidhya GANs A Brief Introduction to Generative Adversarial Networks https medium. Then we move to perform face and other objects from the persons in the videos extraction. Let s count how many files with each extensions there are. rectangle image x y x w y h 0 0 255 3 detected profiles shown in color image detected faces shown in color image image. After that we are also exploring few of the videos with the same origin. com cdeotte dog memorizer gan A Kernel for Face detection using OpenCV with Haarcascade by serkanpeldek https www. In the Data Exploration section we perform a partial Exploratory Data Analysis EDA on the training and testing data. 25 of the samples or 77. Meta data explorationLet s explore now the meta data in train sample. Face detection From 5 Face Detection using OpenCV https www. Blogs Technical Articles Towards Data Science DeepFakes subject selection DeepFakes https towardsdatascience. com eriklindernoren PyTorch GAN A Github recommended by shwetagoyal4 https www. mp4 is the most frequent original 6 samples. Play video files From Play video and processing https www. Let s check the json file first. After we are checking the files types we are focusing first on the metadata files which we are exploring in details after we are importing in dataframes. Indeed all missing original data are the one associated with REAL label. ai and PyTorch recommended by init27 https www. com wiki generative adversarial network gan Deep Convolutional Generative Adversial Networks Tensorflow DCGAN https www. DeepFake Starter Kit Content Introduction Preliminary data exploration Load the packages Load the data Check files type Meta data exploration Missing data Unique values Most frequent originals Video data exploration Missing video or meta data Few fake videos Few real videos Videos with same original Test video files Play video files Face detection Resources References IntroductionDeepFake is composed from Deep Learning and Fake and means taking one person from an image or video and replacing with someone elselikeness using technology such as Deep Artificial Neural Networks 1. Test video filesLet s also look to few of the test data files. ", "id": "gpreda/deepfake-starter-kit", "size": "11859", "language": "python", "html_url": "https://www.kaggle.com/code/gpreda/deepfake-starter-kit", "git_url": "https://www.kaggle.com/code/gpreda/deepfake-starter-kit", "script": "IPython.display unique_values ObjectDetector() extract_image_objects numpy seaborn b64encode display_image_from_video_list plot_count cv2 tqdm_notebook tqdm missing_data display_image_from_video matplotlib.pyplot play_video detect_objects most_frequent_values pandas base64 get_meta_from_json HTML __init__ detect ", "entities": "(('we', 'dataframes'), 'check') (('Few real videos', 'same original'), 'look') (('that', 'existing ones'), 'become') (('com serkanpeldek', 'hamditarek https www'), 'face') (('Most frequent originalsLet', 'train sample data'), 'look') (('train data', 'archived chunks'), 'specify') (('FAKE s', '80'), '25') (('We', 'specific objects'), 'define') (('com serkanpeldek', 'serkanpeldek https www'), 'face') (('we', 'smile detector'), 'due') (('face', 'image'), 'extract') (('I', 'blog posts Kaggle Kernels'), 'provide') (('com', 'Scratch'), 'deepfake') (('phenomen', 'news agencies'), 'invade') (('we', 'here just very small data'), 'note') (('we', 'blue rectangle'), 'use') (('typeHere we', 'train data files extensions'), 'check') (('com serkanpeldek', 'OpenCV https www'), 'face') (('ai', 'Cascade Classifiers Cascade Classifier https docs'), 'decrappify') (('We', 'real videos'), 'visualize') (('s', 'test set'), 'let') (('Indeed missing', 'REAL label'), 'be') (('Test video filesLet', 'test data files'), 'look') (('we', '209 unique examples'), 'know') (('Then we', 'then real videos'), 'move') (('Video explorationIn following we', 'video data'), 'datum') (('submission sample prediction', 'Kernel'), 'perform') (('Then we', 'videos extraction'), 'move') (('video files Face detection Resources References IntroductionDeepFake', 'Deep Artificial Neural such Networks'), 'load') (('we', 'video'), 'face') (('function detect', 'face'), 'use') (('Unique valuesLet', 'unique values'), 'check') (('function', 'ObjectDetector object'), 'call') (('that', 'myself'), 'be') (('EDA Face Basic Detection', 'video ROI https www'), 'brassmonkey381') (('we', 'data'), 'suspect') (('We', 'face detection'), 'load') (('s', 'data distribution now visualizations'), 'let') (('We', 'multiple images'), 'modify') (('image_gray scale_factor scale_factor min_neighbors min_neighbors int 1 y w 0 2 2 h', 'smiles'), 'detect') (('s', 'test videos folder'), 'let') (('s', 'same original'), 'let') (('s', 'how many extensions'), 'let') (('ObjectDetector', 'imported resource'), 'class') (('data Meta explorationLet', 'train sample'), 'explore') (('we', 'training data'), 'perform') (('com hamditarek', 'hamditarek https www'), 'play') (('com analytics vidhya', 'Pytorch DCGAN Faces Tutorial https pytorch'), 'gan') (('s', 'test videos'), 'let') (('s', 'files'), 'look') (('com we', 'eyes'), 'serkanpeldek') (('algorithm', 'face'), 'observe') (('We', 'samples'), 'pick') (('Github repos Github video topic', 'https github'), 'play') (('original label', 'uniques values'), 'observe') (('Large digital companies', 'Deep Fakes'), 'be') (('EDA Face Few fake videosFrom 4 Basic Detection', 'video ROI https www'), 'split') (('eda com marcovasquez basic detection', 'OpenCV https www'), 'face') (('blog small articles', 'Kaggle DeepFake inspirational DCGANs'), 'provide') (('first list', 'folder'), 'miss') (('org tutorials generative', 'video colorization'), 'dcgan') (('We', 'train sample videos'), 'apply') (('we', 'smile detector'), 'note') (('Large companies', 'threat'), 'invest') (('face frontal eyes', 'videos'), 'use') (('we', 'smiles many false positive sd'), 'play') (('that', 'images'), 'let') (('we', 'same origin'), 'explore') (('Then we', 'specific task'), 'initialize') (('Load', 'face detection dataWe also resource'), 'add') (('com serkanpeldek', 'Play opencv 6 video'), 'face') (('com hamditarek we', 'Kaggle Kernel'), 'learn') (('com jesucristo gan GAN', 'cdeotte http kaggle cdeotte Dog Memorizer GAN https www'), 'introduction') "}