{"name": "densenet169 with wsi split and focalloss ", "full_name": " h1 Count per WSI id h2 Take only Ids of which we know the WSI h2 extract all images we dont know the WSI id of will go into validation set h2 Get 20 of the WSIs as validation set maybe later make sure its stratified h2 get the integer index for all the images with WSIs of the validation set h3 Warm up with frozen weight is done on a subset so we dont have to waste an entire epoch h3 Predit the validation data using TTA h3 Now predict on test set h3 prepare submission h2 I add the score to the name of the file so I can later plot the leaderboard score versus my validation score ", "stargazers_count": 0, "forks_count": 0, "description": "com sermakarevich for the WSI set and Idea and Taylor https www. For now only the diherdral and rotations are used. This is a Fork of my Densenet169 https www. since fname_clean is the id we can just use that as index when adding the correct label in our dataframe. My first submission had a 50 score so I somewhere messed up the order oder the matching of id to label. Thanks to SM https www. I also test if mean or max is better to use on the image and its augments but it can t conclude anything yet. The only thing new is I included the WSI ids https www. Sometimes its important in which order the ids in the submissions are so to make sure I don t mess up I put them in the same order. We can then compare the predictions on for example the image and the image flipped roated slightly different crop lighting stretched etc. THis gives a nice extra percent or two when compared to the auc above after training where not TTA is used. I add the score to the name of the file so I can later plot the leaderboard score versus my validation scoreIn the fastai course Jeremy mentions that if you have a monotonic relation between validation and LB score the way you set up your validation set matches what the test set consists of. Apprently 2 cpus per kaggle node so 4 threads I think. com tywangty for uploading it on kaggleDefining a metric so after epoch I get the validation ROC AUC scoreIn Case I want to run quick tests use a subsample Count per WSI id Take only Ids of which we know the WSI extract all images we dont know the WSI id of will go into validation set Get 20 of the WSIs as validation set maybe later make sure its stratified get the integer index for all the images with WSIs of the validation set Warm up with frozen weight is done on a subset so we dont have to waste an entire epoch Predit the validation data using TTAHere for every image we want to predict on n_augs images are augmented form the original image. Now predict on test set prepare submissionI now load in the sample submission and put my predictions in the label column and save to a new file. com tywangty histopathologiccancerwsi from this discussion https www. com c histopathologic cancer detection discussion 83760 to reduce overfitting and correlations between validation and training set. com guntherthepenguin fastai v1 densenet169 kernel. ", "id": "guntherthepenguin/densenet169-with-wsi-split-and-focalloss", "size": "2380", "language": "python", "html_url": "https://www.kaggle.com/code/guntherthepenguin/densenet169-with-wsi-split-and-focalloss", "git_url": "https://www.kaggle.com/code/guntherthepenguin/densenet169-with-wsi-split-and-focalloss", "script": "fastai.vision torchvision.models pathlib train_test_split numpy Path f1_score skmultilearn.model_selection FocalLoss(nn.Module) torch.nn MultiLabelBinarizer tqdm roc_auc_score fastai auc_score matplotlib.pyplot forward sklearn.model_selection pandas __init__ sklearn.metrics iterative_train_test_split sklearn.preprocessing ", "entities": "(('This', 'Densenet169 https www'), 'be') (('i', 'label'), 'have') (('it', 't anything'), 'test') (('new I', 'WSI ids https www'), 'be') (('i we', 'dataframe'), 'use') (('where TTA', 'above training'), 'give') (('test set', 'what'), 'add') (('I', 'same order'), 'sometimes') (('image crop slightly different lighting', 'etc'), 'compare') (('we', 'augmented original image'), 'com') (('I', 'so 4 threads'), 'think') "}