{"name": "detailed eda and vizualizations tps january 2022 ", "full_name": " h3 The data is equally distributed for every country product and store per date h2 Date preprocessing h2 Exploratory Data Analysis h2 1 Which countries buys most h3 Norway clearly has the best sales and Finland has the worst h2 2 Let s Check the sales distribution h2 3 Which Store has the most sales h3 3 1 Exploring overall Store Sales h3 3 2 Which is the Best Selling Store in each country h3 Almost similar trends in all countries as Overall trend h2 4 Exploring Product Sales h3 4 1 Overall Product sales h3 4 2 Product Sales per Country h3 4 3 Product Sales per Store h2 5 What is the seasonaity Trend h3 5 1 Yearly Sales Trend h3 5 2 Let s explore Average Sales Per Month trend h3 5 3 Seasonal trend in Products h2 6 Monthly Trends in Sales h3 6 1 Over all trend of every month h2 7 Adding new Feature Day of the weak h3 7 1 Exploring weakly trends h3 7 2 Weekly trends of Various Products h3 7 3 Weakly trends in Countries h3 7 4 Weakly trends in Different Stores h2 Model Training h2 1 Preparing Data for training h2 2 Training baseline XGBoost regressor h3 Model tuning selection is loading h3 Don t forget to upvote ", "stargazers_count": 0, "forks_count": 0, "description": "Mugs Peak in December and the sales dips in July August. There are 3 products in order every 3 rows i. 2 Let s explore Average Sales Per Month trend Sales follow same trends every year in all countries. Sweden And Finland trends are mores similar than that of Norway. We can see some local peaks that can be weekend sales 5. Which countries buys most Norway clearly has the best sales and Finland has the worst. row_id is just an unique id refering to each row. 2 Product Sales per Country 4. 1 Yearly Sales Trend Can t really interpret clearly but we can see sales shoot up in mid April May and in Holidays season of December. Stickers follow almost same sales through out the Year irrespective of country store etc. Adding new Feature Day of the weak 7. 3 Seasonal trend in Products All years have similar trends in products. Monthly Trends in Sales 6. date column spans from 1st jan 2015 to 31st Dec 2018. 2 Which is the Best Selling Store in each country Almost similar trends in all countries as Overall trend 4. Hats Peak in April and December and has minmum sales in September October. of sales the trend is same. 3 Weakly trends in Countries Same weakly trend in every Country Country doesn t impact on weakend sales. There are 3 countries namely Norway Sweden Finland num_sold is our dependent variable The data is equally distributed for every country product and store per date. Only 2 numerical columns. What is the seasonaity Trend 5. Storewise Product Sales Ratio is similar to Global Sales ratio. Which Store has the most sales 3. Just varying 1 month forward or backward sometime. Store doesn t impacts the weakly trend. Exploring Product Sales 4. Don t forget to upvote. e Saturday and Sunday 7. Training baseline XGBoost regressor Model tuning selection is loading. Let s Check the sales distribution Sales distribution is slightly right skewed in all 3 countries Like number of sales Norway has the highest median here too 3. 1 Exploring overall Store Sales 3. 2 Weekly trends of Various Products Similar trend for all products Constant on Monday to Thursday Little Growth on Friday Peak on Saturday Sunday 7. 1 Overall Product sales Kaggle Hat is the most popular and Sticker is least. Model Training 1. Mug Hat Sticker. 4 Weakly trends in Different Stores No Difference at all other than no. Date preprocessing Exploratory Data Analysis 1. Global peaks come at the end of year December new year and in April 5. There is a great chance that during weekends the sales go up and vice versa 7. Preparing Data for training 2. Dominating More than half of sales Countrywise Product Sales Ratio is similar to Global Sales ratio. There are 2 stores namely KaggleMart and KaggleRama. 1 Exploring weakly trends Clearly we can see that there s a significant difference in average sales at 5 6 i. 3 Product Sales per Store Hat is the most dominant product irrespective of store or region. 1 Over all trend of every month There is a similar trend but different peaks that means the weakdays are affecting trends. ", "id": "nishantdhingra/detailed-eda-and-vizualizations-tps-january-2022", "size": "3368", "language": "python", "html_url": "https://www.kaggle.com/code/nishantdhingra/detailed-eda-and-vizualizations-tps-january-2022", "git_url": "https://www.kaggle.com/code/nishantdhingra/detailed-eda-and-vizualizations-tps-january-2022", "script": "seaborn matplotlib.pyplot train_test_split smape sklearn.model_selection pandas xgboost XGBRegressor numpy ", "entities": "(('Finland trends', 'Norway'), 'be') (('that', 'local peaks'), 'see') (('3 Seasonal trend', 'products'), 'have') (('sales', 'December'), '1') (('Product Sales', 'most dominant irrespective store'), 'be') (('Stickers', 'country store Year irrespective etc'), 'follow') (('Sales distribution', 'here too 3'), 'let') (('Clearly we', '5 6 i.'), 'explore') (('Which', 'Overall trend'), '2') (('Storewise Product Sales Ratio', 'Global Sales ratio'), 'be') (('Dominating', 'Global Sales ratio'), 'be') (('weakdays', 'trends'), '1') (('Global peaks', 'December new year April'), 'come') (('Sales', 'year countries'), 'let') (('Similar trend', 'Saturday'), 'constant') (('dependent data', 'date'), 'be') (('sales', 'vice 7'), 'be') (('clearly best sales', 'worst'), 'have') "}