{"name": "digit recognizer using cnn top 9 ", "full_name": " h2 Digit Recognizer h3 Data Exploration h3 Data Augmentation h3 Modelling h3 Result Generation ", "stargazers_count": 0, "forks_count": 0, "description": "com gauthampughazh digit recognition using knn Data ExplorationLoading the datasets into dataframesKnowing about the features in the datasetsConverting the train and test dataframes into numpy arraysVisualizing a digit from the training data as a 28 X 28 image Data AugmentationEach image in the training set is shifted down up left and right by one pixel rotated clockwise and anti clockwise clipped and zoomed at two different rangesgenerating eight different images. I also used Data Augmentation or Artificial Data Synthesis technique to synthesize images in addition to the training data to boost the model s performance on the test data. com cdeotte how to choose cnn architecture mnist to recognize the hand written digits. You can find my other notebooks below Disaster Tweets Classification https www. com gauthampughazh titanic survival prediction pandas plotly keras Digit Recognition using KNN https www. Using the classification report and confusion matrix to understand the model s performance on each fold. com gauthampughazh disaster or not plotly use tfidf h2o ai automl House Sales Price Prediction https www. Please upvote this notebook if you like the implementation and share your valuable feedback to improve. com gauthampughazh house sales price prediction svr Titanic Survival Classification https www. Combining the original images and the synthesized images to form a new dataset ModellingBuilding a custom transformer to reshape the scaled images as required by the KerasClassifierFunction to build a model based on LeNet 5 architectureFunction to build a model based on a modified LeNet 5 architecture from the above mentioned notebookUsing StratifiedKFold to ensure that the test data represents samples from all classes digits and for cross validating the model. Digit RecognizerIn this notebook I used an ensemble of Convolutional Neural Network models based on the LeNet 5 architecture and the architecture inspired from this notebook https www. The image is clipped before zooming to preserve the image size. 7 Leaderboard on the test data by using the images in the Kaggle s training set and not on the entire MNIST dataset externally available. Fitting models to the combined dataset with custom pipelines Result GenerationCombining the model resultsGenerating the submission file Linear algebra For data manipulation For visualization For evaluation and hyperparameter tuning For evaluation For data augmentation For downloading the output file Adding layers to the model Specifying the loss function and optimizer Adding layers to the model Specifying the loss function and optimizer Creating datasets for training and testing the model Getting the estimated probabilities for each class Getting the estimated probabilities for each class. Achieved an accuracy of 99. ", "id": "gauthampughazh/digit-recognizer-using-cnn-top-9", "size": "2473", "language": "python", "html_url": "https://www.kaggle.com/code/gauthampughazh/digit-recognizer-using-cnn-top-9", "git_url": "https://www.kaggle.com/code/gauthampughazh/digit-recognizer-using-cnn-top-9", "script": "clipped_zoom FileLink # For downloading the output file keras.layers keras.wrappers.scikit_learn shift_in_all_directions shift_in_one_direction IPython.display keras confusion_matrix zoom # For data augmentation numpy MaxPooling2D Dropout build_custom_lenet5_model scipy.ndimage BatchNormalization Dense rotate_in_all_directions ImageReshaper(BaseEstimator classification_report # For evaluation transform matplotlib.pyplot KerasClassifier MinMaxScaler TransformerMixin) Sequential StratifiedKFold # For evaluation and hyperparameter tuning sklearn.model_selection pandas sklearn.base Conv2D BaseEstimator sklearn.pipeline fit Pipeline TransformerMixin build_lenet5_model __init__ rotate alter_image sklearn.metrics Flatten shift sklearn.preprocessing ", "entities": "(('estimated probabilities', 'class'), 'model') (('you', 'valuable feedback'), 'upvote') (('You', 'Disaster Tweets Classification https www'), 'find') (('test data', 'model'), 'combine') (('image', 'image size'), 'clip') (('I', 'test data'), 'use') (('Digit notebook I', 'notebook https www'), 'RecognizerIn') (('com gauthampughazh digit recognition', 'eight different images'), 'shift') "}