{"name": "dutch electricity eda fs clustering maps ", "full_name": " h1 Analysis items h2 1 Introduction Country wide picture h2 2 Transition to the smart grid h2 3 Non centralized electricity production by households h2 4 Some individual city stats h2 5 Global analysis feature selection and dimensional reduction h2 6 Geographical projections h2 7 Conclusions h1 1 Introduction h1 2 Transition to the smart grid h1 3 Non centralized electricity production by households h1 4 City stats h1 5 Global analysis feature selection and dimensional reduction h1 6 Geographical projections h1 7 Conclusions ", "stargazers_count": 0, "forks_count": 0, "description": "By looking at the data per provider we can get an idea of how different regions of the Netherlands are performing with respect to one another. This can be an active influence the amount of effort put into smartmeter implementation or passive the geographic location that is fixed and some areas just being more amenable to self production than others. There are other exciting developments unfolding now such as transition to a smart grid as well as the emergence of a significant fraction of self production of electricity by households. divide 1e3 20 Sets NAs to 0 in rank 2018 median df for regression in log space set the cities with zero inf to arbitrary dropout value this includes dropout values intended not to be included in the regression but for plotting purposes only 0. Squinting at the data one can see that on average connection to the smartgrid is positively correlated with the percentage of lowtarif consumption. Of the three providers Enexis seems to be leading these transitions this might be due to the different makeup of the Enexis territory compared to that of Liander and Stedin the latter two cover the more densely populated randstad. However the rate at which the slope increases is slowing down and it seems like this slope of slopes might be asymtotic at a negative value. colorbar mapper shrink 0. color per province like such Now comes the hard part aggregating the information from the 2469 unique cities in the dataset into the 491 municipalities. We see that in absolute terms Almere is the biggest producer of energy. Fitting the data shows that the number of smartmeters should reach the total number of connections in mid 2018. It turns out Zeeland is not part of the electricity dataset. These other parameters are of course the features we used to perform our dimensional reduction on the percentages of lowtarif consumption self production active connections and smartmeters. a flat in a high rise building will not have the option to place solar panels. For these maps this gives a more qualitative than a quantitative expression but insightful nonetheless. It s hard for me to assess what factors put a cap on or speed up this trend at the moment. Lowtarif consumption bottom left panel we see the approximate Enexis non Enexis divide again but splitting one of the 4 major clusters down the middle hence I think it is justified to call 5 clusters of large cities here. But I ll leave it as is for now. At this rate a median of 50 is expected to be reached by 2041. We see now that the cities cluster less by size than in the first round and still largely cluster by provider and more specifically by Enexis vs. But let s look at the current top 20 and how they ranked over the past years We see that the early adopters in self production of electricity like Amersfoort The Hague Rotterdam Zoetermeer are still in the top absolute energy producers of 2018 but we also see several other big cities Eindhoven something is wrong with pre 2017 data Tilburg Zwolle Maastricht catch up starting around 2012. This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. If we take the actual top 20 cities with the highest average electricity production per household we expect this ranking to be dominated by small towns in windy rural places These mostly seem to be rural places in the north east. What we have at hand is the polygon structure of the 491 municipalities of the Netherlands which we can project onto a map and e. in the limit of 100 urbanization which might mean 100 high rise buildings it is likely impossible for each apartment building to produce its own electricity with current technologies at hand that is. Without going into a manual adding of geolocation and municipality each city belongs to of course. Also in a way more informative to see the aggregate information of a municipality instead of for every town and village. Non centralized electricity production by households Let s look at electricity production per city for a bit now. 4 ax ax 1 la join all poly_dfs at the hip there is a smarter way but im getting tired. As delivery 100 self production these graphs have a bit of redundancy in them. Exellent documentation on how to determine wheter a point falls within a polygon can be found here http https automating gis processes. Self production became a thing roughly in 2012. io package like so code commented out below https i. One could also normalize other data to visualize it in this manner of course. Transition to the smart gridLet s look into the evolution of smartmeters per city for a bit first. As self production is a nation wide trend it is also logical that the slope of the fit becomes less negative as the larger places catch up as the years pass. com comics cell_phones. The larger cities in the randstad move down the ladder. This involves determining which postal codes belong to which polygon. Though the percentage of active connections seems to decrease as well as we see in the last map directly above. Top right shows that two groups have a high fraction of smartmeters compared to the rest. The easiest way of doing this I found was by using the 4 digit postal codes. First of all we see that the distribution is bimodal 2018 shown here a population of early adopters and a lagging population. Let me know what you think Analysis items 1. But this is just a back of the envelope calculation of course. Leaders in the self production transition are smaller places in rural areas especially in Groningen but the large cities at the top of the list in absolute terms with many of them having been in the top 10 absolute self producers since the beginning of this revolution in 2012. Here I chose to display only those parameters that are on the percentage scale mainly out of laziness. gif By fitting the lagging population with a single gaussian and plotting the normalized amplitude vs. count city add geolocation make geopandas df pc2018. It is interesting to look into this as in what type of city can be typically found in one or the other further below. That being said correlation needs not imply causation as we all know https imgs. adding columns of interest make pivot tables of relevant parameter such that we have total per city per year o specs o specs exponential fit this doesn t seem to work well since we re working with large numbers here. Some individual city stats cityviolins 5. Another observation would be that of the three large electricity providers Enexis is leading the transition to the smart grid. lin fit in lin log space does the trick for here although this is not the most elegant solution linear fit linewidth 3 linewidth 3 this is the mean of the mean per city this is the median of the mean per city extract y_data initial guesses p0 initialize them differently one at 20 and the other at 80 so the optimization algorithm works better this can be circumvented using simulated annealing or sth in the like optimize and in the end you will have 6 coeff 3 for each gaussian plot each gaussian separately using the single gauss function fit with 1 gaussian fit with 2 facecolor w edgecolor k could have achieved the same with self_production. First let s have a look at the country as a whole What we see is that the yearly total energy consumption has remained roughly the same while there is a linear increase in the number of connections. Why that is we ll see in the multi panel figure below. I will therefore drop this year in all following electricity analyses. I wonder what s going on with Enexis there. And as a side note Eindhoven s data is off as we see again 4. This because the provider influences parameters such as self production smartmeter percentage and lowtarif consumption. The percentage of lowtarif consumption tends to cluster per provider indicating that there might be different definitions of what lowtarif means. We can increase the resolution at a later point if that is of interest but so for now we can make pivot tables containing the aggregate of an energy parameter of interest per city per year Ok so the year 2009 which allegedly covers the consumption in the year before which is why I changed the x axis in the plot seems to be incomplete. Introduction Country wide picture intro 2. We see in the t SNE above that cities cluster together by their size as the marker size scales with city size and the provider they have. divide 2e2 alpha. Alright so now we have all the things at hand to start plotting a bunch of stuff and below are the maps I thought were worth making. On a positive note three Dutch cities seem to be doing a pretty good job at showing that others could do better Almere Apeldoorn and Zwolle. What we see here is that there is indeed a negative correlation between city size and the percentage of energy that is self produced. That and I just want to apply some things that I use in my genomics research and see how they pan out. Sequences over time in spirit of the other images in this analysis. For example running this by clicking run or pressing Shift Enter will list the files in the input directory Any results you write to the current directory are saved as output. The self production fraction as the median of the of total consumption for all cities combined has been increasing linearly from 1 in 2012 to sim 10 now. sort_values 2018 ascending False. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. Anyway ignoring this I think we now have at hand the right information to start binning the postal code based information into the polygons of the 491 municipalities minus Zeeland. But this might level off way before that due to technical hurdles revoking of subsidies or other regulations in the meantime. Let s look at the largest Dutch cities and where they stand. I will leave this as is and continue with the global analysis below. We could for instance classify cities into over or underperforming when above or below the linear regression by a certain amount as shown below gray is neither over or underperforming arbitrary offset chosen here. Admittedly there are not too many dimensions that are independent of each other so one can also answer these questions by juggling around with the data in different ways but this might become less obvious if you add more parameters such as the gas data or other metadata such as income house prices. Alright so here we see the large cities cluster into roughly 4 or 5 regions and we see especially clear from the first panel that they group based on other parameters besides size. We probably could also have gotten this from the percent of smartmeters parameter in the first place but let s look at this in greater detail because simply taking the countrywide mean here oversimplifies what is actually going on. So the defining features are lowtarif consumption active connections and smartmeter percentage. read_csv Input data files are available in the. IntroductionAs a first approach it suffices to look at the energy parameters at the city level. First let s see at what year given the decline rate of the lagging mode we expect all cities to have 80 smartmeters. Transition to the smart grid smartgrid 3. Perhaps it is more interesting to not let city size weigh in so much so let s select the features that are normalized the percentages these also happen to be the features with the highest variance which implies these will be more defining of a given city than features with less variance. My guess is also that Enexis will have a larger fraction of out overperformers than the other two providers. pivot_table elec2018 index city columns sumcols aggfunc np. This implies that on average the annual amount of electricity used by a connection household is going down. The largest cities seem to be doing worst in terms of becoming self reliant and that mostly has to do with the rapid growth of self production in smaller towns. It seems like the 80 smartmeters by 2020 is within reach The complete transition to 100 might take an additional 3 decades. A simple linear fit shows that this peak is likely to become zero within 2 years of the 2018 timepoint so around the start of 2020. For instance one can notice an increasing discrepancy between the mean and median of the mean percentage of smartmeters. Geographical projections geomapping 7. This while the number of connections is growing linearly so the consumption per connection approx household seeminly decreased possibly by large scale introduction of more energy efficient products such as the LED light. There are also some other small towns with a high percentage of self production towards upper right corner of plot but these are different in other ways as the remaining subplots show. From the top middle we see that the large cities do not really distinguish themselves in terms of self production. Global analysis feature selection and dimensional reductionHow similar or different are cities from eachother in terms of electricity consumption and behavior Are there different classes of cities based on energy parameters Does the average street in Rotterdam behave differently than the average street in Eindhoven These are questions one could attempt to answer using principle component analysis PCA or other dimensional reduction techniques e. What is the mean or median fraction of self produced energy as a function of the electricity consumed for the Dutch cities in 2018 We can see that for all Dutch cities combined the percentage self produced follows a log normal distribution centered around 10 in the most recent year of this dataset below left and that the median of this distribution shifts upward linearly with time starting around 2012. Non centralized electricity production by households selfprod 4. In addition the amount of electricity produced by households has been increasing linearly since 2012. At the same time we see that the number of smartmeters is increasing exponentially and one could expect that the number of smartmeters will start approaching the number of connections in the not too far future. This is convenient as we then do not have to start messing around with postal code areas some of which have been created or shuffled around in the intervening years. This is all great but it would be insightful to see which cities are representative of these 5 clusters and perhaps color them geographically to gain more insight as to why certain cities have certain feature values. In general we see the smartgrid transition started with a handful of small cities for each provider. This is an indication that we are not dealing with a normal distribution of these things across the cities which is not a surprise in itself. Ok so coloring the t SNE by the values of the independent parameters we get an idea of why the cities are grouped together in a certain way. Another convenient way to present this kind of data I find is to save a sequence of images like those above as a gif or movie for instance using the imageio http https imageio. sum transform the variables mean 0 var 1 actual t SNE reduction from 11 dims to 2 color by provider to see if the cities cluster by provider transform the variables mean 0 var 1 actual t SNE reduction from 11 dims to 2 make pivot tables of relevant parameter such that we have total per city per year transform the variables mean 0 var 1 actual t SNE reduction from 11 dims to 2 color by provider ignoring the discrepancies between the gas elec cities pc2 size pc2 self prod pc3 lowtarif pc4 smartmeter perc c l i h f or None courseness this seems like a very roundabout way first get the data into the right form add postalcode geolocations. This nicely follows Pareto s law 80 of the work done in 20 of the time and vice versa. Again we see cities clustering by size and the parameters being provider specific. They might have a different provider. io CSC18 lessons L4 point in polygon. Extrapolation of the fit y mx b to the data below right would suggest that the median reaches 50 self production in frac 50 b m approx2041. Many things can be observed here. Global analysis feature selection and dimensional reduction tsne 6. Amsterdam liander Rotterdam stedin the east and north enexis We can see that self production is a growing trend in all regions but that the Enexis region is outperforming the other regions likely because there is more space to place windmills or solar panels. City statsAbove we see that each city can have its own specific dynamics. When normalized by the number of active connections which is I think a proxy for the number of inhabitants this yields the average electricity produced per household per city. Technical issues with the dataset The province of Zeeland seems to be missing entirely but this could be due to there being a fourth provider Something is wrong with the historical pre 2017 data for Eindhoven Some cities seem to have multiple providers. If we then assume that the remaining 20 will take 80 of the time and that the transition started around 2012 the Netherlands will be a 100 smartgrid in 8years 2x8 32 2020 2052. Bottom middle we see the percentage of active connections is higher among the Enexis left two clusters. If we normalize the area under the curve we can fit the data. Within two years of the 2018 dataset it is expected that almost all cities will have 50 or actually around 80 smartmeter percentages. For instance region 1 indicated in top left is a cluster of tiny cities that have a very high percentage of self production which we saw earlier. png Or here is the animated verison again code commented out below. Ok let s look at the correlation between self production and city size for a bit more as we have seen above that it is easier for smaller more rural places to become more self reliant when it comes to electricity. We get For those who have stared at a map of the Netherlands more than once it becomes pretty clear that the entire province of Zeeland is missing. Interesting to note is that there are a couple of large non Enexis cities deep within Enexis territory let s see who they are Interesting these are all cities literally deep within Enexis territory so perhaps there is some overlap Indeed there is strange. This might actually be true but seems unlikely for some larger cities in Enexis territory like Weert and Deventer Some cities seem to be producing gas this seems unlikely There are many minor errors such as s Gravenhage appearing more than once but overall I ignore this since there is one s Gravenhage that is the right size the others are almost negligibly small. 4 ax ax let s make polygon dataframes for all years c l i h f or None courseness there must be a cleaner way to do all this but I m leaving it for now municipalities not having data polygons ijsselmeer zeeuwse meren c l i h f or None courseness all others f. It is clear from the smartmeter subplot that these are the leading cities in terms of smartmeters but they are different from each other in terms of lowtarif consumption percentage which tends to be provider specific. What we see is that over the past 7 years the slope of the fit became less negative. scatter longitude latitude s pc2018 2018_num_active_connections. Conclusions conclusions 1. This could be logical as it is probably impossible for large cities to be as self reliant when it comes to electricity production as smaller towns are i. Does connection to the smart grid also mean a smarter more economical use of electricity Let s see what the correlation between percent smartmeter and percent lowtarif consumption tells us per city with a different color for each provider. This allows me to easily merge the energy dataframe grouped by the 4 digit postal codes with relevant parameters summed or averaged with geolocation per postal code. TSNE UMAP or at least make classifying easier. html and everything is summarized into the functions I wrote above. We can also look at the importance of parameters using PCA 6. Conclusions Total electricity consumption seems have been roughly constant over the past decade or even a slight decline in the randstad Liander Stedin. Bottom left Enexis cluster Middle left Enexis cluster Top center cluster left side Top center cluster right side Right side cluster Perhaps adding some gas parameters would make it more interesting. This might be an artifact providers have different definitions ways of classifying things or represent the different ways in which the companies operate. Ok so we see above which of the large cities num_active_connections 5e4 are over underperforming compared to the regression performed on all Dutch cities. year we see a linear decrease. This effect is most prominent for Liander cities where for instance Amsterdam biggest orange circle moves from the bottom left towards the top right as the years pass. We could also do this for the individual postal code areas in two cities that are of similar size but divergent otherwise or cities that are very alike. Over the years bottom panel the growth of self production in large cities is lower than that of the bigger places turning most large cities into places that are underperforming compared to the fit. Peculiar to see that a very limited number of random towns produce a limited amount of gas By just joining these two datasets I have noticed there is an outersect between the cities in gas and electricity I m going to ignore that for now. Geographical projectionsAlright so let s try and project the information at onto a map of the Netherlands as this could make regional differences clear at a glance. So in 2020 one can expect the average city to have around 80 smartmeters. This likely has to do with there being a limit to which urbanized places can become self reliant e. Two groups containing fairly large cities region 2 and 3 do not cluster together with the other large cities in the middle. The negative initial slope at 2012 makes sense as it is much easier for small towns to get a relatively high percentage of self produced electricity than it is for large places. Perhaps the city size is a reasonable proxy as to what degree a city can produce its own energy though I suspect building structure climate etc also play a crucial role as for instance it might turn out that in the limit of large cities it is just more efficient to have a majority of the electricity produced in a centralized manner. Version 3 of the notebook new features are a more elaborate feature selection in the dimensional reduction section data visualization by projecting the data on a map Took some time to figure out and there are definitely many more possible approaches than this but it s a good first try. I obtained a list of the 4 digit postal code location here https github. ", "id": "bberghuis/dutch-electricity-eda-fs-clustering-maps", "size": "21140", "language": "python", "html_url": "https://www.kaggle.com/code/bberghuis/dutch-electricity-eda-fs-clustering-maps", "git_url": "https://www.kaggle.com/code/bberghuis/dutch-electricity-eda-fs-clustering-maps", "script": "bumpsplot add_widths scipy.optimize Patch geopandas IPython.display Point load_and_reindex exponenial_func PatchCollection stats numpy Image seaborn mpl_toolkits.basemap matplotlib.collections gauss2 shutil shapely.geometry gridspec matplotlib.ticker sklearn.manifold classify copyfile streamgraph matplotlib.patches scipy PCA make_group_zipcode matplotlib.pyplot Polygon gauss Normalize matplotlib.colors defaultdict pandas attach_municip Basemap datetime merge_energy_data_into_municip MaxNLocator interpolate matplotlib GeoDataFrame Polygon as PG TSNE make_log_df collections sklearn.decomposition curve_fit StandardScaler sklearn.preprocessing ", "entities": "(('factors', 'moment'), 's') (('median', '2041'), 'expect') (('they', 'city size'), 'see') (('me', 'postal code'), 'allow') (('this', 'quantitative expression'), 'give') (('this', 'course'), 'be') (('city', 'own specific dynamics'), 'see') (('graphs', 'them'), 'have') (('code', 'https i.'), 'comment') (('this', 'other meantime'), 'level') (('I', 'functions'), 'summarize') (('these', 'subplots remaining show'), 'be') (('large cities', '2012'), 'be') (('we', 'data'), 'fit') (('cities', 'multiple providers'), 'issue') (('data polygons ijsselmeer zeeuwse meren l i h f', 'others'), 'let') (('years', 'top right'), 'be') (('city', 'of course'), 'belong') (('Netherlands', '100 8years'), 'assume') (('otherwise that', 'similar size'), 'do') (('Enexis', 'smart grid'), 'be') (('I', 'imageio http https imageio'), 'be') (('flat', 'solar panels'), 'have') (('type', 'typically one'), 'be') (('self that', 'smaller towns'), 'seem') (('it', 'gas Perhaps parameters'), 'leave') (('two groups', 'rest'), 'show') (('correlation', 'provider'), 'mean') (('city individual stats', '5'), 'cityviolin') (('almost cities', 'smartmeter 50 actually around 80 percentages'), 'expect') (('One', 'course'), 'normalize') (('how different regions', 'one'), 'get') (('one', 'lowtarif consumption'), 'see') (('this', 'purposes'), 'divide') (('We', 'PCA'), 'look') (('well we', 'large numbers'), 'make') (('median', 'frac'), 'suggest') (('These', 'north mostly rural east'), 'expect') (('slope', 'negative value'), 'seem') (('s', 'bit'), 'let') (('read_csv Input data files', 'the'), 'be') (('it', 'city level'), 'IntroductionAs') (('lowtarif', 'different what'), 'tend') (('others', 'Almere better Apeldoorn'), 'seem') (('Two groups', 'middle'), 'cluster') (('right others', 'this'), 'be') (('smarter i', 'hip'), 'ax') (('why I', 'plot'), 'increase') (('This', 'time'), 'follow') (('why cities', 'together certain way'), 'get') (('as well we', 'last map'), 'seem') (('they', 'size'), 'see') (('one', 'smartmeters'), 'notice') (('postal codes', 'polygon'), 'involve') (('how they', 'genomics research'), 'that') (('Transition', 'city'), 'look') (('smaller towns', 'electricity production'), 'be') (('Zeeland', 'electricity dataset'), 'turn') (('urbanized places', 'likely which'), 'have') (('it', 'large places'), 'make') (('also Enexis', 'other two providers'), 'be') (('number', 'too far future'), 'see') (('complete transition', 'additional 3 decades'), 'seem') (('latter two', 'more densely populated randstad'), 'seem') (('that', 'mainly laziness'), 'choose') (('this', 'city'), 'think') (('average annual amount', 'connection household'), 'imply') (('we', 'https imgs'), 'say') (('smartgrid transition', 'provider'), 'see') (('which', 'itself'), 'be') (('pretty entire province', 'Zeeland'), 'get') (('provider', 'self production smartmeter such percentage'), 'this') (('I', 'that'), 'peculiar') (('we', 'Zeeland'), 'think') (('less you', 'income house other such prices'), 'be') (('amount', 'linearly 2012'), 'increase') (('companies', 'which'), 'be') (('Why we', 'panel multi figure'), 'see') (('what', 'Enexis'), 'wonder') (('percentage', 'two clusters'), 'see') (('one', 'reduction other dimensional e.'), 'be') (('geolocation', 'geopandas df pc2018'), 'add') (('Self production', 'roughly 2012'), 'become') (('color', '491 municipalities'), 'come') (('now cities', 'more Enexis'), 'see') (('peak', '2020'), 'show') (('index city pivot_table columns', 'sumcols aggfunc np'), 'elec2018') (('5e4', 'Dutch cities'), 'see') (('It', 'python docker image https kaggle github'), 'come') (('you', 'output'), 'list') (('which', 'consumption lowtarif percentage'), 'be') (('I', 'stuff'), 'have') (('average city', 'around 80 smartmeters'), 'expect') (('more self when it', 'electricity'), 'let') (('it', 'definitely many more possible this'), 'be') (('Conclusions electricity Total consumption', 'randstad Liander even slight Stedin'), 'seem') (('number', 'mid 2018'), 'show') (('that', 'hand'), 'be') (('distribution', 'early adopters'), 'see') (('k', 'self_production'), 'do') (('energy yearly total consumption', 'connections'), 'let') (('I', 'https here github'), 'obtain') (('regional differences', 'glance'), 'projectionsalright') (('I', 'global analysis'), 'leave') (('slope', 'fit'), 'be') (('that', 'fit'), 'over') (('parameters', 'size'), 'see') (('we', 'map'), 'be') (('some', 'intervening around years'), 'be') (('these', 'literally Enexis territory'), 'be') (('here what', 'simply countrywide'), 'get') (('it', 'large cities'), 'leave') (('that', 'energy'), 'be') (('large cities', 'self production'), 'see') (('it', 'centralized manner'), 'be') (('cities', '80 smartmeters'), 'let') (('we', 'which'), 'be') (('why certain cities', 'feature certain values'), 'be') (('where they', 'largest Dutch cities'), 'let') (('I', 'electricity analyses'), 'drop') (('Enexis region', 'likely more windmills'), 'stedin') (('http here https', 'gis processes'), 'fall') (('these', 'less variance'), 'be') (('Tilburg Zwolle Maastricht', '2012'), 'let') (('you', 'what'), 'let') (('linearly consumption', 'LED such light'), 'this') (('percentage self', '2012'), 'be') (('years', 'fit'), 'be') (('We', 'arbitrary offset'), 'classify') (('Almere', 'biggest energy'), 'see') (('off we', 'side note'), 'be') (('we', 'consumption lowtarif self production active connections'), 'be') (('I', 'digit 4 postal codes'), 'be') (('areas', 'self just more amenable others'), 'be') (('pc2 pc2 pc3 lowtarif pc4 smartmeter perc l i h elec this', 'postalcode geolocations'), 'transform') (('Transition', 'smart grid'), 'smartgrid') (('self production median', '10'), 'fraction') "}