{"name": "eda and building models for predicting outflow ", "full_name": " h1 EDA and Building models for predicting outflow h2 Codebook h1 1 Data Description h3 Conclusions that can be drawn at the moment h1 2 Dependency research and formulation of hypotheses h1 3 Building models to predict outflow ", "stargazers_count": 0, "forks_count": 0, "description": "In 1 2 months 510 people use the services but then it drops sharply. To achieve this goal it is important not only to try to attract new ones but also to retain existing ones. 90 of clients have a telephone service connected. Most of the clients pay for services by electronic check 3. Research of dependencies and formulation of hypotheses 3. About 2 3 of clients use additional servicesAs we can see about half of the clients have a From month to month contract type and about 1 4 each have Two years and One year contract types. Conclusions that can be drawn at the moment The difference between the sexes of clients is very small about 50 people male gender prevails. Thanks to this the task of retention will be easier to implement than the task of attracting new users about which we do not know anything yet. Based on the data about the services that the client uses we can make him a special offer trying to change his decision to leave the operator. com open id 1dPCG76ST6NohYKtVMGv6HpFL jD5p1eJ telecom_users. best_params_ CV_svc GridSearchCV svc svc_params scoring roc_auc cv skf CV_svc. Comparison of the quality of the obtained models. csv contains the following values customerID customer id gender client gender male female SeniorCitizen whether the client is a pensioner 1 0 Partner whether the client is married Yes No Dependents does the client have dependents Yes No tenure how many months a person has been a client of the company PhoneService is the telephone service activated Yes No MultipleLines whether multiple telephone lines are connected Yes No No phone service InternetService client s Internet provider DSL Fiber optic No OnlineSecurity is the online security service enabled Yes No No internet service OnlineBackup is the online backup service activated Yes No No internet service DeviceProtection does the client have equipment insurance Yes No No internet service TechSupport is the technical support service activated Yes No No internet service StreamingTV is the streaming TV service activated Yes No No internet service StreamingMovies is the streaming cinema service activated Yes No No internet service Contract type of customer contract Month to month One year Two year PaperlessBilling whether the client uses paperless billing Yes No PaymentMethod payment method Electronic check Mailed check Bank transfer automatic Credit card automatic MonthlyCharges current monthly payment TotalCharges the total amount that the client has paid for the services for the entire time Churn whether there was a churn Yes or No 1. Codebook Link to download data https drive. Building models to predict outflowXGBClassifierStacking Define train and test datasets for training Разделяем данные CV_rfc GridSearchCV rfc rfc_params scoring roc_auc cv skf CV_rfc. In the second section there must be a justification of hypotheses a detailed description of the identified relationships as well as their visualization. More than half of customers use paperless billing. Accordingly predicting the churn we can react in time and try to keep the client who wants to leave. EDA and Building models for predicting outflow Work description Any business wants to maximize the number of customers. In the fourth general conclusions of the work should be formulated additionally. fit X_train y_train gbc_best_params CV_gbc. Description of data with calculation of basic statistics 2. fit X_train y_train svc_best_params CV_svc. In addition a new client may be weakly interested in business services and it will be difficult to work with him while old clients already have the necessary data on interaction with the service. Retaining a client will cost the company less than attracting a new one. It can be assumed that at this time most of the clients leaveThe conclusion that almost all customers use a telephone connection was confirmedOn average half of the clients do not use additional services. best_params_ CV_gbc GridSearchCV gbc gbc_params scoring roc_auc cv skf CV_gbc. fit X_train y_train ada_best_params CV_ada. You are provided with a dataset from a telecommunications company. Half of the clients have a contract type From month to month. Dependency research and formulation of hypothesesAs we can see the conclusion that there are slightly more male clients than female clients is proved on the graphHere there is about the same situation of married and unmarried a little more than married or married. Find out how many unique values are contained in the dataWe can conclude that there are no duplicate customers in the dataNext let s start examining each attribute of the dataset separately and display a number of statistics for each of them. Most clients have no dependents. Data DescriptionLet s take a look at the presence of missing values so as not to face unpleasant surprises in the future. The data contains information about almost six thousand users their demographic characteristics the services they use the duration of using the operator s services the method of payment and the amount of payment. One third of clients have a payment method Electronic check. fit X_train y_train rfc_best_params CV_rfc. On average half of the clients do not use additional services. Building models for predicting outflow with justification for the choice of a particular model based on tested hypotheses and identified relationships 4. The work should include the following mandatory items 1. The task is to analyze the data and predict the churn of users to identify people who will and will not renew their contract. best_params_ CV_ada GridSearchCV ada ada_params scoring roc_auc cv skf CV_ada. ", "id": "radmirzosimov/eda-and-building-models-for-predicting-outflow", "size": "5540", "language": "python", "html_url": "https://www.kaggle.com/code/radmirzosimov/eda-and-building-models-for-predicting-outflow", "git_url": "https://www.kaggle.com/code/radmirzosimov/eda-and-building-models-for-predicting-outflow", "script": "classification_report confusion_matrix xgboost accuracy_score XGBClassifier sklearn.svm numpy seaborn recall_score SVC GradientBoostingClassifier roc_auc_score (GridSearchCV matplotlib.pyplot precision_score sklearn.model_selection pandas RandomForestClassifier r2_score missingno AdaBoostClassifier StackingClassifier sklearn.metrics sklearn.ensemble ", "entities": "(('we', 'anything'), 'be') (('confirmedOn average half', 'additional services'), 'assume') (('More than half', 'paperless billing'), 'use') (('male gender', 'clients'), 'prevail') (('Most', 'electronic check'), 'pay') (('Half', 'month'), 'have') (('business', 'customers'), 'model') (('client', 'entire time'), 'contain') (('old clients', 'service'), 'be') (('Data DescriptionLet s', 'future'), 'take') (('You', 'telecommunications company'), 'provide') (('then it', 'services'), 'use') (('90', 'telephone service'), 'have') (('One third', 'payment method Electronic check'), 'have') (('who', 'client'), 'predict') (('who', 'contract'), 'be') (('him', 'operator'), 'base') (('s', 'them'), 'conclude') (('work', 'following mandatory items'), 'include') (('fourth general conclusions', 'work'), 'formulate') (('conclusion', 'about same married'), 'research') (('about 1 4', 'each Two years'), 'use') (('it', 'also existing ones'), 'be') (('they', 'payment'), 'contain') (('Retaining', 'less new one'), 'cost') "}