{"name": "eda wsi pixels ", "full_name": " h1 About Notebook h1 Image Size Distribution h1 Toggle Level h1 Pixel Distribution h1 Toggle Level ", "stargazers_count": 0, "forks_count": 0, "description": "Let me know if you found these valuable. across sizes total pixels and a couple of other provided data columns in the train csv file using plotly. level2 is concentrated in range of a few thousands majorily. Path to the Directory Dataframe construction with Image Dimensions Converting the above results to a DataFrame The below dataframe details the information across WSI s in the training dataset. Image data size do vary as provided by the 2 data providers. Above dataframe will be used futher for data insights through visualization Dropping the intermediate created datasets Image Size Distribution Fetching the image width and height for plots Below are the scatter plots of Image pixels across height and width for all 3 levels What do the Image Size plots tell 1. There are a few outliers in terms of sizes among above 3 levels. tiff from the img column in Dataframe Merging the Whole slide images information with the Train DataFrame. Above distinction among data providers can be more clearly seen in the below scatter plot Toggle Level Note Above interactive plot might not be visible in comit notebook. Total number of Pixels at a given resolution level Here we note that distribution is similar across the image sizes. Image width height for level 0 lies in range of tens of thousands level1 until tens of 1000 s and the last one i. Drop duplicate column. Below plot analyses if the Gradings vary with image size i. In all the 3 levels Karolinska provided datasets are comparatively larger than in size. Toggle Level Below one is an interactive plot to switch among 3 levels quickly and get an overview of the distribution Pixel Distribution Below plots visualise the pixel What do the Total Pixel s plots tell us 1. About Notebook This notebook explores the data through the lens of Whole Slide Images i. ", "id": "prachi1211/eda-wsi-pixels", "size": "1910", "language": "python", "html_url": "https://www.kaggle.com/code/prachi1211/eda-wsi-pixels", "git_url": "https://www.kaggle.com/code/prachi1211/eda-wsi-pixels", "script": "make_subplots plotly.graph_objects plotly.express IPython.display Image interactive numpy ToggleButtons tqdm get_height interact IntSlider image_name matplotlib.pyplot get_width FileLinks PIL defaultdict pandas change_level ipywidgets plotly.subplots collections ", "entities": "(('notebook', 'Whole Slide Images i.'), 'explore') (('distinction', 'comit notebook'), 'above') (('Karolinska', 'comparatively size'), 'be') (('Total plots', '1'), 'level') (('distribution', 'image sizes'), 'number') (('Gradings', 'image size i.'), 'below') (('Image Size plots', '1'), 'use') (('level2', 'a few thousands'), 'concentrate') (('Image width height', 'tens of 1000 s'), 'lie') (('below dataframe', 'training dataset'), 'path') (('Image data size', 'data 2 providers'), 'vary') "}