{"name": "eda modelling breast cancer detection ", "full_name": " h1 Breast Cancer Data Analysis h3 Prediction at the end h3 Overview h3 What are the symptoms of breast cancer h1 Exploratory Data Analysis h2 Aim h2 Features h2 Base Checklist h4 Shape Analysis h4 Features Analysis h2 Dataset Analysis h3 Checking for duplicates h1 Target Distribution h1 Resampling h1 Categorical Features h1 Continuous Features h1 A bit of data engineering h3 Comments h3 Comments h4 Let s find out h1 Modelling h2 PCA Analysis h3 Remark h4 The classes are really hard to classify looking at the graph above h1 Training models h2 Models overview h2 Using RandomForest h3 Optimization h2 Using KNN h2 Using XGBoost h2 Using SVM h1 Tuning Threshold h1 Training Artificial Neural Network h1 Conclusion h4 According to the results shown above these models RF AdaBoost KNN SVM XGBoost LR ANN can t make the classification between Dead and Alive patients h4 Best we can do is getting a 1 2 chance of guessing right h2 Hypothesis h1 If you like please upvote h2 Also check my other notebooks h4 EDA Modelling Mice Trisomy 100 acc https www kaggle com dorianvoydie eda modelling mice 100 acc h4 EDA Modelling Breast Cancer Detection https www kaggle com dorianvoydie eda modelling breast cancer detection h4 Weather Forecasting 98 acc https www kaggle com dorianvoydie weather forecasting 98 acc h4 EDA Modelling Heart Attack 90 Acc https www kaggle com dorianvoydie eda modelling heart attack 90 accuracy score h4 EDA Modelling Mobile price 95 5 acc https www kaggle com dorianvoydie eda modelling 95 5 acc mobile price h4 EDA Modelling Stroke 74 acc https www kaggle com dorianvoydie eda modelling stroke 74 acc h4 EDA Modelling Holiday Package 89 acc https www kaggle com dorianvoydie eda modelling holiday package 89 acc h4 EDA Modelling Diabetes Detection https www kaggle com dorianvoydie eda modelling diabetes detection h4 Pokemon Stats https www kaggle com dorianvoydie pokemon stats h4 Fish Classification Using CNN 97 acc https www kaggle com dorianvoydie fish classification using cnn 97 acc h4 u200d Vaccine COVID 19 Indicators https www kaggle com dorianvoydie vaccine covid 19 indicators ", "stargazers_count": 0, "forks_count": 0, "description": "sample method to get random samples each class Categorical FeaturesContinuous Features A bit of data engineering. com dorianvoydie eda modelling diabetes detection Pokemon Stats https www. com rafjaa machine_learning_fecib master src static img resampling. Substantial support for breast cancer awareness and research funding has helped created advances in the diagnosis and treatment of breast cancer. Best we can do is getting a 1 2 chance of guessing right. com dorianvoydie weather forecasting 98 acc EDA Modelling Heart Attack 90 Acc. Training models Models overview Using RandomForest Optimization Using KNN Using XGBoost Using SVM Tuning Threshold Training Artificial Neural Network Conclusion According to the results shown above these models RF AdaBoost KNN SVM XGBoost LR ANN can t make the classification between Dead and Alive patients. com dorianvoydie eda modelling heart attack 90 accuracy score EDA Modelling Mobile price 95. com dorianvoydie eda modelling mice 100 acc EDA Modelling Breast Cancer Detection https www. In under sampling the simplest technique involves removing random records from the majority class which can cause loss of information. com dorianvoydie eda modelling holiday package 89 acc EDA Modelling Diabetes Detection https www. Let s find out Modelling PCA Analysis Remark The classes are really hard to classify looking at the graph above. com dorianvoydie fish classification using cnn 97 acc Vaccine COVID 19 Indicators https www. Base Checklist Shape Analysis target feature Patient_Status rows and columns 341 16 features types qualitatives 11 quantitatives 5 NaN analysis NaN 1 feature 5 of NaN Features Analysis Target Analysis Balanced Oui Non Non Percentages 79 Alive Dataset Analysis Checking for duplicatesTarget Distribution ResamplingA widely adopted technique for dealing with highly unbalanced datasets is called resampling. What are the symptoms of breast cancer Signs and symptoms of breast cancer may include A breast lump or thickening that feels different from the surrounding tissue Change in the size shape or appearance of a breast Changes to the skin over the breast such as dimpling A newly inverted nipple Peeling scaling crusting or flaking of the pigmented area of skin surrounding the nipple areola or breast skin Redness or pitting of the skin over your breast like the skin of an orange Exploratory Data Analysis Aim Understand the data A small step forward is better than a big one backwards Begin to develop a modelling strategy Features Patient_ID unique identifier id of a patient Age age at diagnosis Years Gender Male Female Protein1 Protein2 Protein3 Protein4 expression levels undefined units Tumour_Stage I II III Histology Infiltrating Ductal Carcinoma Infiltrating Lobular Carcinoma Mucinous Carcinoma ER status Positive Negative PR status Positive Negative HER2 status Positive Negative Surgery_type Lumpectomy Simple Mastectomy Modified Radical Mastectomy Other DateofSurgery Date on which surgery was performed in DD MON YY DateofLast_Visit Date of last visit in DD MON YY can be null in case the patient didn t visited again after the surgery Patient_Status Alive Dead can be null in case the patient didn t visited again after the surgery and there is no information available whether the patient is alive or dead. After skin cancer breast cancer is the most common cancer diagnosed in women in the United States. Breast cancer survival rates have increased and the number of deaths associated with this disease is steadily declining largely due to factors such as earlier detection a new personalized approach to treatment and a better understanding of the disease. com dorianvoydie pokemon stats Fish Classification Using CNN 97 acc. It consists of removing samples from the majority class under sampling and or adding more examples from the minority class over sampling. Breast cancer can occur in both men and women but it s far more common in women. Let s implement a basic example which uses the DataFrame. I could have tried to oversample instead If you like please upvote Also check my other notebooks EDA Modelling Mice Trisomy 100 acc. Hypothesis The features have no impact on the target There isn t enough rows in the dataset need more people The dataset isn t representative of the population As we undersampled the dataset we only have 66 2 rows in the end. Breast Cancer Data Analysis Prediction at the end OverviewBreast cancer is cancer that forms in the cells of the breasts. com dorianvoydie vaccine covid 19 indicators Classes déséquilibrées Class count Divide by class Class count Divide by class Resampling calculating the probabilities finding the predicted valued calculating the probabilities Finding the predicted valued Importing the Keras libraries and packages Initialising the ANN Adding the input layer and the first hidden layer Adding the second hidden layer Adding the third hidden layer Adding the output layer Compiling the ANN. png Despite the advantage of balancing classes these techniques also have their weaknesses there is no free lunch. The simplest implementation of over sampling is to duplicate random records from the minority class which can cause overfitting. com dorianvoydie eda modelling breast cancer detection Weather Forecasting 98 acc. com dorianvoydie eda modelling 95 5 acc mobile price EDA Modelling Stroke 74 acc. com dorianvoydie eda modelling stroke 74 acc EDA Modelling Holiday Package 89 acc. CommentsWe can now analyze categorical features as quantitative features CommentsConsidering the correlations shown above it seems really difficult to find a difference between Dead and Alive patients. ", "id": "dorianvoydie/eda-modelling-breast-cancer-detection", "size": "6353", "language": "python", "html_url": "https://www.kaggle.com/code/dorianvoydie/eda-modelling-breast-cancer-detection", "git_url": "https://www.kaggle.com/code/dorianvoydie/eda-modelling-breast-cancer-detection", "script": "RobustScaler classification_report keras.layers keras.models train_test_split plotly.express confusion_matrix xgboost accuracy_score numpy cross_val_score sklearn.svm seaborn make_pipeline Dropout preprocessing f1_score SVC Dense encoding sklearn.neighbors dataprep.eda sklearn.linear_model PCA learning_curve tensorflow imputation create_report feature_engineering matplotlib.pyplot plot_correlation MinMaxScaler Sequential plot sklearn.model_selection pandas roc_curve RandomForestClassifier LogisticRegression plot_missing sklearn.pipeline RandomizedSearchCV KNeighborsClassifier AdaBoostClassifier evaluation sklearn.decomposition GridSearchCV sklearn.metrics sklearn.ensemble StandardScaler sklearn.preprocessing ", "entities": "(('Substantial support', 'breast cancer'), 'help') (('we', 'end'), 'have') (('breast cancer modelling detection', 'Weather 98 acc'), 'Forecasting') (('RF AdaBoost KNN SVM XGBoost LR ANN', 'Dead patients'), 'overview') (('classes', 'really graph'), 'let') (('com dorianvoydie eda modelling', 'detection Pokemon Stats https www'), 'diabetes') (('Categorical FeaturesContinuous', 'data engineering'), 'method') (('skin cancer breast cancer', 'United States'), 'be') (('it', 'Dead patients'), 'analyze') (('which', 'information'), 'involve') (('it', 'far more women'), 'occur') (('com dorianvoydie weather', '98 acc'), 'forecasting') (('com dorianvoydie eda modelling', 'stroke 74 acc'), 'acc') (('90 accuracy', 'Modelling Mobile price'), 'com') (('which', 'overfitting'), 'be') (('Using', 'com dorianvoydie pokemon Fish Classification'), 'stat') (('Best we', '1 2 chance'), 'get') (('instead you', 'Modelling Mice 100 acc'), 'try') (('available patient', 'again surgery'), 'include') (('which', 'DataFrame'), 'let') (('that', 'breasts'), 'be') (('It', 'sampling'), 'consist') (('NaN Features Analysis Target Analysis Alive Dataset Analysis 5 NaN analysis NaN 1 5 Non 79 Checking', 'highly unbalanced datasets'), 'feature') (('techniques', 'also weaknesses'), 'png') (('number', 'better disease'), 'increase') "}