{"name": "eda haberman ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "Plot6 This plot is fairly redable compared to the other two but certainly we cannot make any concrete observations based on this graph. 128 compared to the people living more tha 5 years 5. This is not at all good for predicting as the overlapping is maximum. First we will import all the necessary libraries as shown below. Very complicated and overlapping points present. We will now determine the case with mathematical operations. The reason why there is no status is because the plotting is done onthe basis of status. Observations Plot2 Here the plot is age vs year. This figure shows that the chances of survival between 30 70 approx is same. Obviously it wont have a high rate of success rate but it can be made with more data. As its 50th is nearly same as the 75th of category 1 so of the nodes are between 0 8 there is 50 of error in category 2. No other coclusion can be determined we shall jump to the next feature. Now we shall plot some graphs to interpret the information better. 75th can be approx 4. Here we took age and nodes as the parameters. referance https en. org wiki Lymph_node 4 Status Denoted by 1 and 2. From the above code we can conclude that out of 306 patients that we got from the code haberdata. Here we used 3 features for plotting. the category 2 varies from 0 to 25. 3 Nodes A lymph node or lymph gland is a kidney shaped organ of the lymphatic system and the adaptive immune system. It is also very hard to read and carry out any observations. Now the pair plots did not give a good reading about the case so we ll shift towards plotting 1 D plotting. Status will be the class label. And it varies from 0 to 8. It is practically null. Whereas the mean of people survivng less than 5 years is 7. will give us the number of rows and columns will get to know the name of columns. else python code we can distinguish and predict it nicely. We can get clarification if we use PDF and CDF for this. observations For the category 1 we can see at 0 nodes it is highly elevated and the whiskers ranges from 0 to 8 whereas for the category 2 the histogram goes till 60 nodes and its whiskers ranges from 0 to 25. Nothing can be concluded from this histogram. The plot 4 plot 7 and plot 8 are the inverted plots of plot 2 plot 3 and plot 6 respectively. 930 All the necessary mathematical operations are done Now lets plot Box plot Violin plots and Contour plots Observations The 25 and 50 of the category 1 is nearly the same. Also the chances of long survival decreses with the increase of nodes. As we can see we cannot point out good and solid information out of this plot. It ranges from 30 to 83. For that we use pairplots. The features are age nodes and year. Here for people survivng more than 5 years is 0 and for the second group it is 5. Also 50 of them has 0 nodes on the other hand for the people living less than 5 years 50 of the people have 4 or less than 4 nodes and 75 of the people have less than or equal to 11 nodes. The density in category 2 is more from 0 to 20 Observations This is a 2 D density plot also called as contour plots. From quantiles we can conclude that people living more than 5 years 75 of them have 3 nodes or less that can also be deduced that 25 of people falling into this category has nodes more than 3. We wont be doing any analysis of these plots now. Lets plot CDF and the feature we will chose is nodes becuase clearly its the defining feature in this data set This is the CDF of people who survived 5 years or more. We will compute mean and standard deviation Observations The mean and standard deviation is computed as follows. The 75th is approx 12. Can be determine by the code haberdata age 2 Year Year in which the patients had the operation. Here we used seaborn for 2 D scatter plotting. As per the calculations we can deduce that the probability of people surviving less than 5 years is higher compared to the people surviving for more than 5 years in this dataset given The standard deviation is basically the spread of the data. Here blue and orange dots represent the survival status of the patients. How should we know which features will give us better plots so that we can classify the information better. As per the graph approx 83 of people have chance of long survival if nodes 4 approx. Here there are 9 plots. Here the mean of people surviving more than 5 years is 2. On the other hand the category 2 the 50th is equal to the 75th percentile of the category 1. 1 person will have short lifespan Lets jump onto the last feature to makes sure if we can find a plot way cleaner than this. It ranges from 1958 1969. The above plot does not give a better understanding as the colour is same and also a lot of points are overlapping Lets use seaborn library which has very good representation. Not at all readable. As per the calculations the spread for the people living less than 5 years 9. This is a plot where we can make some assumptions and predictions but yet it is not definitive. It is certainly difficult to read and thus will reject this plot for any conclusion Plot3 The plot is between age and nodes. 95 percentile suggests that people surviving more than 5 years 95 of them have less than or equal to 14 nodes present and on the other hand people surviving less than 5 years have 23 nodes MAD gives us the variability of the data. blue represents the patient survived 5 years or longer and orange dot represents the patient died within 5 year. PDF for age PDF for nodes PDF for year Box plot Violin plot Contour plots. Observations The first observation we can carry out is that the chances of survival long is minimal when the number of nodes 35. The orange line is the cdf and the blue line is the pdf of the same. we can only make approximate decisions Observations Here we can see that the chances of long survival is the highest when the number of nodes 25 Code not as per syntax if nodes 0 person will live more than 5 years elif nodes 0 and nodes 5 person has good chance of surviving long else nodes 5. This is an assignment on EDA on Haberman dataset. 85 We will now calculate median percentile and quantiles and MAD for better understanding Observations Here for the people survivng more than 5 years has nodes averaging to 0 whereas people who died within 5 years has nodes averaging to 4. The plot 1 plot 5 and plot 9 are known as histograms. so rejecting this plot too. Will now plot CDF for people who lived for 5 or less years This is the CDF of people lived 5 years or less Observations The first observation is approx 57 of people have short life if nodes 35 approx We have estabilisged nodes as our main feature. 1 Age It represents the age of the patients undergone the surgery. We can see for people who survived more than 5 uears are people usually between 50 60 years of age and the no of nodes they had is from 0 5 Conclusion By doing various plot analysis graph representations and some approximation we can try to predict a model to predict cancer. shape 225 patients survived 5 years or longer and sadly 81 patients died within 5 years. 1 means the patient survived 5 years or longer and 2 means the patient died within 5 year. The legend is status. ", "id": "vihaanshah/eda-haberman", "size": "8402", "language": "python", "html_url": "https://www.kaggle.com/code/vihaanshah/eda-haberman", "git_url": "https://www.kaggle.com/code/vihaanshah/eda-haberman", "script": "seaborn matplotlib.pyplot statsmodels pandas robust numpy ", "entities": "(('org wiki', '1'), 'Lymph_node') (('age', 'surgery'), 'age') (('who', 'people'), 'be') (('category', 'category'), 'be') (('plot 1 plot', '5 9 histograms'), 'know') (('survivng', 'less than 5 years'), 'be') (('chances', '70 approx'), 'show') (('5 years sadly 81 patients', '5 years'), 'shape') (('Here we', 'D scatter 2 plotting'), 'use') (('Here blue dots', 'patients'), 'represent') (('why plotting', 'status'), 'be') (('people', '11 nodes'), 'have') (('certainly we', 'graph'), 'plot6') (('First we', 'necessary libraries'), 'import') (('number', 'columns'), 'give') (('we', 'next feature'), 'determine') (('deviation standard mean deviation', 'mean'), 'compute') (('plot 4 plot', '3 6'), 'be') (('This', 'at all overlapping'), 'be') (('Plot2 Here plot', 'year'), 'observation') (('Nothing', 'histogram'), 'conclude') (('patients', 'operation'), 'determine') (('nodes', 'long survival'), 'have') (('we', 'plot'), 'point') (('1 so', 'category'), 'be') (('plot', 'age'), 'be') (('we', 'information'), 'know') (('we', 'plot way this'), 'have') (('we', 'code haberdata'), 'conclude') (('patient', '5 year'), 'represent') (('which', 'very good representation'), 'give') (('whiskers', '25'), 'observation') (('This', 'Haberman dataset'), 'be') (('we', 'it'), 'distinguish') (('Contour plots 25', 'category'), 'do') (('it', 'second group'), 'survivng') (('also 25', 'more than 3'), 'node') (('Here mean', 'more than 5 years'), 'be') (('patient', '5 year'), 'mean') (('0 nodes 5 person', 'good chance'), 'make') (('MAD', 'data'), 'suggest') (('orange line', 'blue same'), 'be') (('35 We', 'main feature'), 'plot') (('Here we', 'parameters'), 'take') (('to 20 This', 'D density 2 also contour plots'), 'be') (('chances', 'long when nodes'), 'observation') (('we', '1 D plotting'), 'give') (('It', 'also very observations'), 'be') (('We', 'plots'), 'do') (('We', 'mathematical operations'), 'determine') (('it', 'more data'), 'have') (('Nodes lymph 3 node', 'lymphatic system'), 'be') (('Now we', 'information'), 'plot') (('probability', 'basically data'), 'deduce') (('we', 'cancer'), 'see') (('we', 'this'), 'get') (('nodes', '4'), '85') (('yet it', 'assumptions'), 'be') (('people', 'spread'), 'as') "}