{"name": "eda image segmentation ", "full_name": " h1 Welcome to the Human Protein Atlas Single Cell Classification Competition h3 Quick Navigation h2 Brief about Single Cell Type Atlas h1 Importing dependencies h2 Feature Engineering h2 EDA h2 Image Segmentation h2 Bernoulli Mixture ", "stargazers_count": 0, "forks_count": 0, "description": "Model description These configurations can be seen as K components of the mixture model. There is one percent missing to fill up to 100 but this is caused by rounding errors and should not worry you. The scRNAseq analysis was based on publicly available genome wide expression data and comprises all protein coding genes in 192 individual cell type clusters corresponding to 12 different cell type groups. A specificity and distribution classification was performed to determine the number of genes elevated in these single cell types and the number of genes detected in one several or all cell types respectively. And for each sample x_ n of our N data spots there exists a related latent or hidden variable z_ n that holds 1 for the component k that generated x_ n and 0 for all others. png Quick Navigation 0. Image SegmentationBernoulli MixtureBernoulli Mixture Bernoulli mixture models to solve different types of problems in pattern recognition like feature selection classification dimensionality reduction and rule generation. We don t know how many of them are actually there and we will have to estimate them during the analysis. In addition we find that the Mitotic spindle often comes together with the Microtubules. Only a few percents are hold by cluster 5 14 22 and 27. Feature Engineering 1 2. com allunia protein atlas exploration and baseline https docs. Consequently we find a positive correlation between these targets. Brief about single cell type atlas 0 1. Each component tries to explain one target group we are seeking for. com kaggle competitions kaggle 23823 logos header. And in this process microtubules and thier ends are active and participate as well. This makes sense as both are participants for cellular division. More than 3 targets are sporadic Take away We can see that many targets only have very slight correlations. Importing dependenciesFeature EngineeringMapping of targets in a location Each sample consists of four image files. EDATake away We can see that most common protein structures belong to coarse grained cellular components like the plasma membrane the cytosol and the nucleus. Reference https www. Each file represents a different filter on the subcellular protein patterns represented by the sample ID. Imagine you would already know them then we could describe the probability density our data as follows P X sum_ Z P X Z theta theta sum_ Z P Z theta cdot P X Z theta Take away This looks great You can see that several clusters only hold one specific target protein For each target protein you can see the percentage of its occurences that are placed into specific clusters. Take away Most train images only have 1 or two target labels. Welcome to the Human Protein Atlas Single Cell Classification Competition https storage. Bernoulli Mixture 4 Brief about Single Cell Type Atlas The Single Cell Type Atlas contains single cell RNA sequencing scRNAseq data from 13 different human tissues together with in house generated immunohistochemically stained tissue sections visualizing the corresponding spatial protein expression patterns. Green for Protein of interest. Blue for Nuclei channels. One example 92 of Microtubules target proteins are located in cluster 7. Red for Microtubule channels. com bayespy bayespy reset seaborn style get image id get each image channel as a greyscale image second argument 0 in imread display each channel separately apply threshold on the nucleus image display threshold image morphological opening to remove noise Marker labelling Map component labels to hue val cvt to BGR for display set bg label to black apply threshold on the endoplasmic reticulum image display threshold image morphological opening to remove noise morphological closing Marker labelling Map component labels to hue val cvt to BGR for display set bg label to black apply threshold on the endoplasmic reticulum image display threshold images morphological opening to remove noise after binary thresholding morphological closing after binary thresholding morphological opening to remove noise after truncate thresholding morphological closing after truncate thresholding Marker labelling for binary thresholding Map component labels to hue val cvt to BGR for display set bg label to black Marker labelling for truncate thresholding Map component labels to hue val cvt to BGR for display set bg label to black apply adaptive threshold on endoplasmic reticulum image apply adaptive thresholding display threshold images Source https github. com bayespy bayespy E Step M Step Compute new log_likelihood. Image Segmentation 3 4. Here We re going to use Bernoulli Mixture Model to see How are specific proteins distributed over clusters in the dataset. Yellow for Endoplasmic Reticulum ER channels. ", "id": "divyanshuusingh/eda-image-segmentation", "size": "4571", "language": "python", "html_url": "https://www.kaggle.com/code/divyanshuusingh/eda-image-segmentation", "git_url": "https://www.kaggle.com/code/divyanshuusingh/eda-image-segmentation", "script": "Counter get_responsibilities get_log_likelihood reset_params train_test_split predict get_save_single Image numpy seaborn normalize_mu logsumexp get_log_bernoullis matplotlib.pyplot get_Neff score_samples remember_params PIL BernoulliMixture pandas init_params sklearn.model_selection get_sample_log_likelihood scipy.special get_mu fit fill_targets __init__ get_pi collections score ", "entities": "(('Only a few percents', 'cluster'), 'hold') (('scRNAseq analysis', 'cell type 12 different groups'), 'base') (('Single Cell Type Atlas', 'protein expression corresponding spatial patterns'), 'Mixture') (('truncate', 'thresholding display threshold images Source https adaptive github'), 'get') (('many targets', 'only very slight correlations'), 'be') (('How specific proteins', 'dataset'), 'go') (('we', 'target one group'), 'try') (('both', 'cellular division'), 'make') (('file', 'sample ID'), 'represent') (('train Most images', 'target only 1 labels'), 'take') (('Model configurations', 'mixture model'), 'description') (('target proteins', 'cluster'), 'locate') (('Consequently we', 'targets'), 'find') (('actually there we', 'analysis'), 'don') (('that', 'specific clusters'), 'know') (('sample', 'image four files'), 'consist') (('k that', 'others'), 'exist') (('Mitotic spindle', 'often together Microtubules'), 'find') (('this', 'you'), 'be') (('specificity classification', 'cell one several types'), 'perform') (('com kaggle competitions', 'logos 23823 header'), 'kaggle') (('protein most common structures', 'plasma membrane'), 'see') "}