{"name": "eda security master analysis ", "full_name": " h1 Security Master Analysis h1 Why Sec Master Analysis h3 What are some questions we want to answer h2 Making time series features when rows dates are missing h1 Takeaways ", "stargazers_count": 0, "forks_count": 0, "description": "com pandas dev pandas issues 15584 helped a lot. However it would be very odd for the Reuters News Data to not be point in time. In this case if you want to make long horizon time based features you need to join on assetName. Given that assetCode will never overlap on time and therefore allows using time as an index I choose that here. What s fascinating here is that you can see in the article headlines that the company is named correctly point in time as MetroPCS Communications Inc however the assetName is listed as T Mobile US Inc. However assetName continues to look like a consistent choice over time for a perm ID. This is much better Note that the default min_periods is 1 when you use a freq tag i. For example T Mobile US Inc And we can trace the lifetime of this company over multiple assetCodes. A security master refers to reference data about the lifetime of a particular asset tracking ticker changes name changes etc over time. However here is a major gotcha dual class stock. What about in this dataset YES We can conclude that since no assetCode has ever been linked to more than assetName that assetName could be a good choice for a permanent identifier. N was merged with TMUS. To make a rolling feature it was my initial inclination to try something like Let s see what we got Look at the time index. What about the other way around Is assetName a unique identifier In the real world companies change their names all the time a hilarious example of this is here https www. Missing time series data does not show up as NaN on the trading calendar rather the rows are just missing. The company started its life as PCS. N NYSE listed and then became Nasdaq listed. And let s see how long an asset is alive by the the distance betwen the first reported data point and last and the number of days in that distance that actually has dataThis was shocking to me. This is not provided here although in fact both Intrinio and Reuters provide this in the for sale version of the data used in this competition. the rolling average of 20 days spans the missing period of 2007 03 20 and is a non fixed frequency. The result makes sense if you look at 2009 06 26 you will see that the rolling average does not include any information from the year 2007 rather it is time aware and since there are 19 missing rows before give the 1 day windowed average. As such to make time series features you have to be careful with pandas rolling calculations and roll on calendar days not naively on the count of rows. the result makes no sense. http Let s define a valid has_data day for each asset if there is reported trading volume for the day. hypothesizing that days since IPO is a valid feature and use that as a factor. Kaggle competitions are usually won in the third or fourth decimal place of the score so every detail matters. Security Master Analysisby marketneutral Why Sec Master Analysis Before you do anything exciting in financial data science you need to understand the nature of the universe of assets you are working with and how the data is presented otherwise garbage in garbage out. Depending on what you wish to do you may use the assetCode assetName or time as a way to join the market data to news data. Looking across the entire dataset however things look a little better. Now let s look at whether tickers change over time. Is either assetCode or assetName unique So there are a number of companies that have more than 1 assetCode over their lifetime. What is the nature of missing data What does it mean when data is missing Let s explore and see. When we look at the amount of data in these spans it is even more surprising. com long blockchain company iced tea sec stock 2018 8. Because of this overlapping data there is no way to be sure about how to link assets over time. You are stuck with one of two bad choices link on assetCode and miss ticker changes and corporate actions or link on assetName but get bad output in the case of dual class shares. assetCode is not consistent across time the same economic entity can and in many cases does have a different assetCode assetCode is not a permanent identifier. Make environment and get data Note the D and on time. The fact that an asset is missing data is not informative in itself it is an artifact of the data collection and delivery process. So the organizers have also backfilled today s assetName into the news history. assetCode object a unique id of an assetSo is it unique or not and can we join time series features always over time on assetCode What about assetName Is that unique or do names change over time assetName category the name that corresponds to a group of assetCodes. For example ticker VNDA. Let s compare the asset lifetimes with the amout of data in those lifetime. There are very many assets that only exist for say 50 days or less. Let s see if we can find any news on this company back in 2007. Here I calculate the difference between the number of business days in each span and the count of valid days sorted by most missing data. Likely the most well know is Google called Alphabet Inc for its full life in this dataset another is Comcast Corp. It took me awhile to get this to work as pandas complains a lot on multi idexes this issue https github. Long horizon features like say 12m momentum may not produce sufficient asset coverage to be useful becuase so much data is missing. assetName while consistent across time can refer to more than once stock at the same time and therefore cannot be used to make time series features assetName is not a unique permanent identifier. O has its first data point on 2007 02 23 and its last on 2016 12 22 for a span of 2556 business days. You can see this data matches with the lifetimes dataframe subset above. You have to be very careful with time based features because of missing data. Takeaways Security master issues are critical. T Mobile acquired MetroPCS on May 1 2013 google search when did t mobile acquire MetroPCS. Though not very common some companies issue more than one class of stock at the same time. This is unfortunate becuase you may hypothesize that news impact is a bigger driver of return variance during the early part of an asset s life due to lack of analyst coverage lack of participation by quants etc. The rules state Each asset is identified by an assetCode note that a single company may have multiple assetCodes. These may be Unknown if the corresponding assetCode does not have any rows in the news data. However in that 2556 days there are only 115 days that actually have data It s not the case that VNDA. For example you cannot calcuate a true asset age e. However to do that without error requires that you deeply understand the nature of the asset universe. What are some questions we want to answer Is assetCode a unique and permanent identifier If you group by assetCode and make time series features are you assured to be referencing the same instrument In the real world the ticker symbol is not guaranteed to refer to the same company over time. It is possible that a company changed its ticker and it s name on the same day and therefore we would not be able to catch this but let s assume this doesn t happen. One gotcha I see is that don t think that assetName is correct point in time. As we saw above it is not possible to do this 100 without error because we don t know the permanent identifier we must make a tradeoff between the error of using assetCode or assetName. So even though we asked for a 20 day window as long as there is at least 1 data point we will get a windowed average. In finance raw information is typically uninteresting and uninformative and you need to do substantial feature engineering and create either or both of time series and cross sectional features. This is hard to verify without proper commercial security master data but I don t think that the actual name of this company in 2007 was T Mobile it was something like Metro PCS. Data providers usually provide a permanent ID so that you can keep track of this over time. Therefore the assetName must not be point in time rather it looks like assetName is the name of the company when this dataset was created for Kaggle recently and then backfilled. O didn t exist during those times we just don t have data. This implies that you cannot use NLP on the headline field in any way to join or infer asset clustering. The next best thing is to roll on calendar days freq tag D. This is not exciting fancy data science but absolutely essential. Making time series features when rows dates are missingLet s say you want to make rolling window time series feature like a moving average on volume. ", "id": "marketneutral/eda-security-master-analysis", "size": "9456", "language": "python", "html_url": "https://www.kaggle.com/code/marketneutral/eda-security-master-analysis", "git_url": "https://www.kaggle.com/code/marketneutral/eda-security-master-analysis", "script": "twosigmanews cufflinks plotly.plotly kaggle.competitions matplotlib.pyplot init_notebook_mode plotly.offline plotly.graph_objs pandas iplot numpy ", "entities": "(('data', 'time'), 'make') (('assetCode', 'good permanent identifier'), 'about') (('rather rows', 'trading calendar'), 'show') (('tickers', 'time'), 'let') (('T Mobile US we', 'multiple assetCodes'), 'Inc') (('that', 'assetCodes'), 'object') (('corresponding', 'news data'), 'be') (('typically you', 'sectional features'), 'uninteresting') (('s', 'What'), 'be') (('you', 'news data'), 'use') (('blockchain com long company', 'tea sec stock'), 'ice') (('T Mobile', 't when mobile acquire'), 'acquire') (('I', 'that'), 'give') (('So organizers', 'news also today history'), 'backfille') (('You', 'missing data'), 'have') (('ticker symbol', 'time'), 'be') (('when dataset', 'Kaggle'), 'point') (('you', 'asset clustering'), 'imply') (('we', 'assetCode'), 'be') (('data as long at least 1 we', 'windowed average'), 'get') (('However it', 'time'), 'be') (('rolling average', '2007'), 'span') (('single company', 'multiple assetCodes'), 'state') (('you', 'time'), 'provide') (('when you', 'freq tag i.'), 'be') (('Here I', 'most missing data'), 'calculate') (('pandas', 'multi idexes'), 'take') (('This', 'data fancy science'), 'be') (('it', 'data collection process'), 'be') (('very companies', 'same time'), 'issue') (('we', 'don just data'), 'have') (('how data', 'otherwise garbage'), 'marketneutral') (('however things', 'entire dataset'), 'look') (('rather it', 'time 19 missing 1 day'), 'make') (('You', 'class dual shares'), 'stick') (('useful so much data', 'asset sufficient coverage'), 'feature') (('T it', 'Metro PCS'), 'be') (('next best thing', 'calendar days freq tag D.'), 'be') (('com pandas dev pandas issues', 'lot'), 'help') (('window time rolling series', 'volume'), 'say') (('security master', 'time'), 'refer') (('doesn', 'this'), 'be') (('Kaggle competitions', 'score'), 'win') (('you', 'asset universe'), 'require') (('we', 'back 2007'), 'let') (('it', 'spans'), 'be') (('assetName', 'correct time'), 'be') (('you', 'rows'), 'make') (('Intrinio', 'competition'), 'provide') (('It', 'actually data'), 'be') (('very many that', 'only say'), 'be') (('news impact', 'quants'), 'be') (('s', 'day'), 'let') (('we', 'time index'), 'be') (('most Google', 'Comcast Corp.'), 'likely') (('you', 'asset age true e.'), 'calcuate') (('features you', 'horizon long time'), 'need') (('time hilarious example', 'this'), 'be') (('actually dataThis', 'me'), 'let') (('however the', 'T Mobile US Inc.'), 'be') (('IPO', 'factor'), 'hypothesize') (('time therefore series', 'same time'), 'refer') (('that', 'lifetime'), 'be') (('same economic entity', 'assetCode different assetCode'), 'be') (('s', 'lifetime'), 'let') (('data', 'lifetimes'), 'see') "}