{"name": "eda and models ", "full_name": " h2 General information h2 Functions used in this kernel h2 Data loading and overview h2 Data Exploration h2 Feature engineering h2 Prepare data for modelling h2 LGBM h2 Blending ", "stargazers_count": 0, "forks_count": 0, "description": "Let s have a closer look at them. There is no logic in them simply aggregations on top features. Here we can see some information about client s device. Now let s have a look at transaction data. com notslush altair visualization 2018 stackoverflow survey Keep track of unique IDs Cache will stay outside and to set up scoring parameters out of fold predictions on train data averaged predictions on train data list of scores on folds split and train on folds feature importance to set up scoring parameters out of fold predictions on train data averaged predictions on train data out of fold predictions on train data averaged predictions on train data list of scores on folds split and train on folds feature importance setting up altair let s combine the data and work with the whole dataset by https www. merge sub test on TransactionID prediction sub. to_csv submission_xgb. This was already noted in abother kernel https www. EEE CIS works across a variety of AI and machine learning areas including deep neural networks fuzzy systems evolutionary computation and swarm intelligence. com dimartinot Cleaning infinite values to NaN categorical_feature cat_cols xgb_params eta 0. We have several features showing some kind of found status and several binary columns. id_01 id_11 are continuous variables id_12 id_38 are categorical and the last two columns are obviously also categorical. General informationIn this kernel I work with IEEE Fraud Detection competition. com robikscube ieee fraud detection first look and edaSo card6 is type of card card4 is credit card company Feature engineeringLet s create some aggregations. csv index False test test. Maybe it would be possible to use additional transactions to generate new features. Prepare data for modelling LGBM Blending using ideas from this kernel https www. Data loading and overviewData is separated into two datasets information about the identity of the customer and transaction information. So if someone wants to normalize all variables it would be necessary to separate such variables which seem to be already normalized. Not all transactions belong to identities which are available. sort_values TransactionDT test prediction result_dict_lgb prediction result_dict_xgb prediction sub isFraud pd. There are a lot of continuous variables and some categorical. Some of features seem to be normalized. So we have two medium sized datasets with a lot of columns. 04 max_depth 5 subsample 0. We have a binary classification problem with a heavy imbalance which is an inherent property of such problems. Also there are columns with one unique value or all missing. Train and test data have similar number of rowsMost of columns have missing data which is normal in real world. It is important to be careful here some of info could be for old devices and may be absent from test data. id_03 has 88 of missing values and 98 of values are either missing or equal to 0. id_01 has an interesting distribution it has 77 unique non positive values with skeweness to 0. A very important idea it seems that train and test transaction dates don t overlap so it would be prudent to use time based split for validation. 22 of values in id_11 are equal to 100and 76 are missing. At first I ll explore the data and try to find valuable insights maybe I ll do some feature engineering and then it wil be time to build models. Today they re partnering with the world s leading payment service company Vesta Corporation seeking the best solutions for fraud prevention industry and now you are invited to join the challenge. Data ExplorationLet s start with identity information. org images files slideshow abstract01. sort_values TransactionDT test prediction result_dict_xgb prediction sub isFraud pd. jpg Work in progress Importing libraries Functions used in this kernelThey are in the hidden cell below. 85 objective binary logistic eval_metric auc silent True nthread 1 tree_method gpu_hist result_dict_xgb train_model_classification X X X_test X_test y y params xgb_params folds folds model_type xgb eval_metric auc plot_feature_importance False verbose 500 early_stopping_rounds 200 n_estimators 5000 averaging rank test test. ", "id": "artgor/eda-and-models", "size": "2897", "language": "python", "html_url": "https://www.kaggle.com/code/artgor/eda-and-models", "git_url": "https://www.kaggle.com/code/artgor/eda-and-models", "script": "product RepeatedKFold lightgbm GroupKFold linear_model networkx NuSVR train_test_split IPython.display xgboost SVR sklearn.svm numpy CatBoostClassifier seaborn catboost CatBoostRegressor TimeSeriesSplit v5 clean_inf_nan tqdm_notebook prepare_altair mean_absolute_error train_model_regression reduce_mem_usage tqdm render sklearn StratifiedKFold KFold add_autoincrement matplotlib.pyplot jit metrics sklearn.model_selection pandas numba wrapped altair.vega group_mean_log_mae eval_auc train_model_classification HTML fast_auc altair LabelEncoder GridSearchCV itertools sklearn.metrics StandardScaler sklearn.preprocessing ", "entities": "(('EEE CIS', 'deep neural networks'), 'work') (('which', 'identities'), 'belong') (('We', 'found status'), 'have') (('General I', 'IEEE Fraud Detection competition'), 'informationin') (('22', '100and'), 'be') (('it', '0'), 'have') (('model_type xgb eval_metric auc', 'rank test 200 n_estimators 5000 test'), 'silent') (('Data loading', 'customer information'), 'separate') (('which', 'real world'), 'have') (('which', 'inherent such problems'), 'have') (('kernelThey', 'hidden cell'), 'work') (('Maybe it', 'new features'), 'be') (('id_03', '0'), 'have') (('it', 'validation'), 'idea') (('then it', 'models'), 'explore') (('s', 'https www'), 'visualization') (('Here we', 'device'), 'see') (('credit card company Feature engineeringLet', 'aggregations'), 'look') (('now you', 'challenge'), 'partner') (('Now s', 'transaction data'), 'let') (('This', 'kernel https already abother www'), 'note') (('here some', 'test data'), 'be') (('So we', 'columns'), 'have') (('Data ExplorationLet', 'identity information'), 'start') (('which', 'such variables'), 'so') "}