{"name": "eda versioning easy to use dataset ", "full_name": " h1 EDA and Dataset Versioning using W B h1 Install Required Libraries h1 Install Required Libraries h1 Import Required Libraries h1 Import Required Libraries h1 Read Data h1 Read Data h1 Visualize 1 Example h1 Visualize Entire Dataset h1 Dataset Versioning h1 Download Data ", "stargazers_count": 0, "forks_count": 0, "description": "json The files have been downloaded from here Visualize 1 Example Visualize Entire DatasetView the Complete Table Here https i. json part 00001 48a6f07e bb86 4735 aac7 883349f41a28 c000. gif Dataset Versioning Download Data https i. jpg Upvote https img. EDA and Dataset Versioning using W BSome key points to note in the original data Not all the images have a corresponding caption Some images captions available in many languagesThis dataset contains 300px b64_bytes for all the images no downloading required along with a list of captions in all the available languages Install Required Libraries Import Required Libraries We will be using Weights and Biases for Visualizing the dataset Dataset versioningW B Dashboard wandb. json part 00002 48a6f07e bb86 4735 aac7 883349f41a28 c000. ai dchanda Wikipedia Read DataDirectory Structure wikipediasmall part 00000 48a6f07e bb86 4735 aac7 883349f41a28 c000. io badge Upvote If 20you 20like 20my 20work 07b3c8 style for the badge logo kaggle Check if captions or images are empty. ", "id": "debarshichanda/eda-versioning-easy-to-use-dataset", "size": "4500", "language": "python", "html_url": "https://www.kaggle.com/code/debarshichanda/eda-versioning-easy-to-use-dataset", "git_url": "https://www.kaggle.com/code/debarshichanda/eda-versioning-easy-to-use-dataset", "script": "BytesIO display UserSecretsClient kaggle_secrets io IPython.display PIL Image ", "entities": "(('Install Required Import Required We', 'Dataset versioningW B Dashboard dataset wandb'), 'Versioning') (('kaggle captions', 'badge logo'), 'badge') (('files', 'Example Visualize Entire Complete https 1 i.'), 'json') "}