{"name": "efficient grading for lending club with catboost ", "full_name": " h1 Efficient grading for Lending Club with CatBoost h2 Contents h2 Introduction h2 Problem definition h2 Data import h2 EDA and data preprocessing h3 filtering out variables not available before loan origination h3 portfolio insights h3 target definition h3 filtering out features with high uninfomative missing rate h3 variables categorization h3 facility level variables h3 scoring variables h3 customer related variables h3 delinquency related variables h3 inqueries related variables h3 accounts related variables h3 balances related variables h2 Sample split h2 Missing treatment h2 Data Types convertions h2 Feature engineering h2 Correlation analysis h2 Data normalization h2 Cat Boost model h2 Logistic Regression model h2 Best model h2 Alternative grading h2 Conclusion and business gains ", "stargazers_count": 0, "forks_count": 0, "description": "But that s results for train sample. 02 were removed as well. customer related variablesConservative assumption if emp_length is missing than employment length is 0. Creating flags for these two. Interest rate is dependent on sub grade. We ll have 7 grades as Lending Club does. As promised dropping outliers for dti and annual_ind but only for development sample. Please see more info here https www. target definitionFor the purpose of this task we assume that loan has default status if it has one of the following loan_statuses Charged off Default Does not meet the credit policy. Let s map alternative grades to respective names. For continuous variables everything is ok. It looks like this variables were collected from some point in time exclusion may be not the best solution in this case still on the purpose of this task I assume some simplification and remove these variables from further analysis. In case of investors the motivation is obvious as well. Besides seems like DTI given in. For grades A E ROI is higher comparing to previous results. Moreover there is strong correlation with time. Such an interest in model improvement has intensified in recent years mostly because of fast development of machine learning and artificial intelligence. The riskiest category amongst three biggest is RENT. Cat Boost model Cat Boost model 12. Loan to income shows the relation between annual principal due to annual income. Here we can impute 0 for missings assuming no inqueries made. Notice DR for grade G almost didn t change but new model predicted 4 times more loans to be in the worst grade. Conclusion and business gainsIn this notebook I tried to show that grading policy used by Lending Club is not optimal. Filling missings with zeros seems as an adequate measure in this case too. Features with Gini lower than 0. Assigning them to non defaults proably will lead to overestimation of True Negative rate. scoring variables fico_range_low is ideally correlated with fico_range_high. Data Types convertions Data Types convertions 8. The main goal of this notebook is to show that there is a space for improvement for Lending Clubs s grading policy. Dropping one of them. Addtionaly let s create three lists to categorize variables by type. Lower bound provided as well as it s hard to believe financed loan for client with annual income less than 10000 dollars annually. In given task the goal is to increase detection of defaulted loans before the loan is issued offered by P2P lending company Lending Club. New model seems to be more restrictive as it puts more loans to worse buckets but as I shew in the previous section default rate is the same in comparison to old G grade. Let s see how predicted probabilty for test set distributed by grades. Less risky by predicted default probability will be named A second B and so on. For this I ll use KMeans classifier. Peer to peer lending differs from traditional financial institutions like banks or commercial lending companies. At the aboves plot we may see that for recent dates there are not many closed loans because minumum loan term is 3 years. Still filtering dataset by income we can notice that some of borrowers with high income are on the high position. Logistic Regression model Logistic Regression model 13. Notice for each sample we take max from training sample. Better scoring gives more robust evaluation of risk by Lending Club and helps investors make more adequate decisions. Grading is a base for interest rate assignment so adequate risk evaluation should help investors to make more perceived investment decisions which is in line with ther risk appetite. As previously numerous outliers this may be seen from provided below statistics even without plotting a boxplot. So I remove features with high rate of non informative missings. Sample splitI will split samples on three train validation and test. In given notebook I built default predictive model and provided alternative grading approach based on this model. DTI greater than 80 is probably may be considered as outlier because it s very high debt share in monthly income. Newly created grading policy shows better results in terms of default identification. The probability of approval of such loan is extremely low. Some variables which are not available prior to data origination are needed for calculations of returns. filtering out features with high uninfomative missing rateThere are two types of missings informative and non informative. Often more predictive credit decisioning model can identify a greater number of customers within an institution s specified risk tolerance which should expand revenues as well. Looking ahead those features will be removed and will not be used during modelling as most of them are not available before loan orgination. Efficient grading for Lending Club with CatBoost Contents1. Considering the fact that based on grades interest rates are set grading plays key role in Lending Club s interaction with clients. A well functioning model should distinguish creditworthy customers from those that are credit risks. The motivation of borrowers is clear they want to find as cheap capital as possible so they re seeking for the best offer at the market which is available for them. Informative are the ones which gives some information like missing in DPD meaning no delinquency ever. Investors look for high ROI return of investments but remembering that returns are proportional to risks we may formalize saying that investors look for appropriate returns risks ratio. grade_related variables will not be used. inqueries related variables inq_fi and inq_last_12m are collected since the end of 2015. Plot below shows that CatBoost model is slightly better than LR in terms of ROC AUC. Besides probably it will result lower churn rate for platform s clients. After that Lending Club gives access to the loan for investors with information about the loan and the borrower incl. The main Lending Club interest is to attract more clients and maintain protfolio size. Model can be improved as well deeper data insights additional external data model tuning more model candidates broader feature engineering. Binary variables have int type others will be encoded. Feature engineeringHere I create only one additional variable. The size of the service fee was 1 on all amounts the borrower pays. Data Types convertionsData types for categorical variables are ok. We can notice that new model classifies more loans to A grade and to F G grades which means it s more confident with predicting the best and the worst loans in terms of risk level. EDA and data preprocessing EDA and data preprocessing filtering out variables not available before loan origination filtering out variables not available before loan origination portfolio insights portfolio insights target definition target definition filtering out features with high uninfomative missing rate filtering out features with high uninfomative missing rate variables categorization variables categorization facility level variables facility level variables scoring variables scoring variables customer related variables customer related variables delinquency related variables delinquency related variables inqueries related variables inqueries related variables accounts related variables accounts related variables balances related variables balances related variables 5. Below I define supportive functions for Gini index calculation and variables meaning checking. grade and sub grade and investors decide whether or not to invest money in this loan. Data normalization Data normalization 11. Lending Club makes money by charging borrowers an origination fee and investors a service fee. Model was built based on features available only before loan origination to prevent data leakage. The lower the grade the higher the interest rate which means that investors may take higher risks to gain potentially higher returns. Borrower applies for the loan then if he she meets all the basic requirements Lending Club using their scoring model assigns client to respective grade. Probably for num variables 0 may be used for imputation. We re able to achive almost 64 of ROC AUC and almost 40 Gini for test sample. Investors make money from interest. droping records with missed term converting issue date to date format drop records with unknown issue date drop records with loan_status null removing variables with low disriminatory power. We may see more loans in G grade with higher DR than the old one. From aboves analysis underestimation of risk in many cases may be noticed. Sample split Sample split 6. So Lending Club is a mediator between investors and borrowers earning money by charging both. Lending Club classifies considerably more loans to B and C grades while new model classify many more loans to worse grades. Categories encoded correctly. Logistic Regression modelTo build Logistic Regression categorical variables should be encoded. The standard loan period is three years. For num_tl_90g_dpd_24m num_accts_ever_120_pd and delinq_2yrs missings imputation and data type convertion needed. Some incomes are not consistent with employment position. Below there is a table showing movements between standard grades and alternative ones for test sample built based on the new model. Conclusion and business gains Conclusion and business gains Introduction LendingClub https www. If you find this Notebook useful please upvote. I will not use this variables for prediction because these four values calculated by Lending Club. Variable tot_coll_amt has many outliers and relatively high standard deviation. Alternative grading Alternative grading 15. Let s check different thresholds and dependency of chosen metric on it. Seeking for default rate reduction we can end up with too restrictive underwriting policy which does not neccessary correlate with higher ROI for investors because we ll not let investors choose risky loans which means lower interests. Lending Club Dataset contains a comprehensive list of features and allows building predictive models. For the rest of variables I impute 0. ROC AUC 53 Gini 33 The best threshold. Lending Club enables borrowers to create unsecured personal loans between 1 000 USD and 40 000 USD. Correlation analysis Correlation analysis 10. For mths_since_recent_inq missings imputation and type convertion needed. Too low diversification. There are 7 grades and 35 sub grades. For the purpose of this task it s decided to drop title column. Term seems to be have relatively high descriminatory power. Negative DTI is for sure an error. Now let s try it for the test sample. Introduction Introduction 2. 0 of the loan amount. Merging some purpose groups. Nevertheless it s decided to provide an upper bound for annual income and exclude records with very high income to avoid impact of such records on estimation. portfolio insightsWe may notice that even for fully paid loans recovered fraction doesn t always reach 100 sometimes even reach higher values. delinquency related variablesCreating new variable based on months since variables to avoid such a high missing rate. It s decided to drop these 5 variables. Correlation analysisChosen approach is to check pairwise correlation and Gini index threshold for correlation value is 70. Alternative grades have almost the same distribution as a standard ones. Some mergings may be managed for simplification dropping addr_state. Now doesn t matter in which loans from A D grades investors have invested expected return is almost the same. Data importAs warning shows there are numerous columns in the data set with mixed data types. I leave only variable with highest Gini amongst correlated. Model performance was measured based on Default Rate statistics and ROI for each bucket. The size of the origination fee depended on the credit grade and ranges to be 1. Those exclusions will be performed later on train and validation samples. EDA and data preprocessing filtering out variables not available before loan originationI tried to filter out variables which can not be available before loan origination to prevent data leakage. Problem definitionNumerous companies from financial indutry often invest considerable resources to improve their predictive models with the aim of having better insights into their customers. Non informative missing don t contain any information. Feature Engineering Feature Engineering 9. collections_12_mths_ex_med chargeoff_within_12_mths delinq_amnt till 99 percentile don t have any value except 0. Seems like the old rating policy underestimates risk level. In other words seems like risk compensation is more accurate. Due to high missing rate creating a flag. As may be seen from the aboves our model prediction gives more robust grading comparing to standard one used by Lending Club. Best model Best model 14. Missing treatment Missing treatment 7. As can be noticed ROI for four first classes is almost the same we avoid ROI disproportion as it was previously. Cat Boost modelROC_AUC equals 54. org wiki Lending_Club LendingClub made money by charging borrowers an origination fee and investors a service fee. accounts related variablesSimilar missing rate for several variables looks strange. We re able more efficiently distinguish better loans from worse. Preventing underestimation of risk should bring following benefits for Lending Club better identification of riskier clients should result in higher gains from originatiot fee identification of greater number of customers within an institution s specified risk tolerance reduction of investors losses as a result lower churn rate lower interest rates for less risky clients model outputs may help improve underwriting policy. It was the first peer to peer lender to register its offerings as securities with the Securities and Exchange Commission SEC and to offer loan trading on a secondary market. Best modelSo I m picking Cat Boost model for higher Gini on validation sample. Data import Data import 4. Missing treatmentFilling missings for annual_income and dti with medians from train sample. The first part of the table shows statistics for standard grading policy. Variables months since. balances related variablesAgain the same logic drop variables with high missing rate since they were collected from 2015. Again new grading identifies the riskiest loans more effectively than the old policy. Now comparing results for test sample. Missings in this case probably means no event so the distance should be maximum. The dataset includes detailed information for every loan issued by Lending Club from 2007 to Q4 2018. Imputation of missings will be done later based on training sample. com foliofn rateDetail. All client ids are missing. For standard lending institution default predictive model with high performance helps to considerably minimize Credit Loss resulting in higher revenue and profits. We may merge three least numerous groups to one but this group still will be too small. facility level variablesSeems like title is a subcategory of purpose or more detailed description. For variables pub_rec_bankruptcies and pub_rec distribution of values is more diverse still there are not many records with value above zero. For Lending Club it probably means the loss of investors with high risk appetite and borrowers with weak credit history or in case of Lending Club those who need higher loan amount. Data normalizationStandard normalization for continuous variables. Alternative gradingLet s check ROI and default rate for each Lending Club s grade on train and test samples. variables categorizationLet s split variables on few groups facility level variables scoring variables customer related variables delinquency related variables inqueries related variables accounts related variables balances related grade_related is the group for variables dependent on grade. Zero will not be a good choice. com was an American peer to peer lending company headquartered in San Francisco California. Problem definition Problem definition 3. num_tl_120dpd_2m and num_tl_30dpd updated ones for 2 months not enough appearances decided to drop. Only closed loans conisdered which means Current and a bit late loans were excluded from the analysis. Now I ll try to create new grading. Having comparable share of each grade on the unseen data by the model we re able to reach higher ROI for better grades and distinguish loans of worse quality which are in alternative grade G which by the way has much higher share in the portfolio comparing to initial grade. So the proposal is to merge it in the most conservative way which means with category with the highest DR to not underestimate the risk. If investors experience losses it may cause churn rate growth. Status Charged Off Late 31 120 days I ll drop loans with the following statuses In Grace Period Late 16 30 days CurrentI made this because we re unable to identify which of them are defaults non defaults. Probably in this case we may impute max as features show a distance to some event. Investors can search and browse the loan listings on Lending Club website and select loans that they want to invest in based on the information supplied about the borrower amount of loan loan grade and loan purpose. The underwriting process for Lending Club looks like this. Usually the better predictive model the more efficient is the underwriting policy and collection process. Refering to Wikipedia https en. The goal is to show that using data to which Lending Club has access before grading we re able to distinguish the most risky group of borrowers and provide better grading. Below I ll try to analyze possible business gains from better detection of defaults for Lending Club. Notice that training sample is used to fit classifier. The second one for the new one. Too many unique values. Additionally higher ROI transfered from more risky grades to ones with expected better quality. ", "id": "karthur10/efficient-grading-for-lending-club-with-catboost", "size": "18499", "language": "python", "html_url": "https://www.kaggle.com/code/karthur10/efficient-grading-for-lending-club-with-catboost", "git_url": "https://www.kaggle.com/code/karthur10/efficient-grading-for-lending-club-with-catboost", "script": "classification_report train_test_split pyplot pyplot as plt IPython.display confusion_matrix check_gini CatBoostClassifier Image sklearn.cluster numpy seaborn catboost Pool roc_auc_score sklearn.linear_model gini meaning sklearn.model_selection pandas KMeans roc_curve LogisticRegression matplotlib sklearn.metrics StandardScaler sklearn.preprocessing ", "entities": "(('We', 'test almost 40 sample'), 're') (('on all borrower', 'service fee'), 'be') (('which', 'delinquency'), 'be') (('as well deeper data', 'feature broader engineering'), 'improve') (('don informative missing t', 'information'), 'contain') (('which', 'initial grade'), 'have') (('We', 'old one'), 'see') (('training sample', 'classifier'), 'notice') (('Below I', 'Lending Club'), 'try') (('Lending Club', '1 000 USD'), 'enable') (('they', '2015'), 'variablesagain') (('she', 'grade'), 'apply') (('Here we', 'inqueries'), 'impute') (('probability', 'such loan'), 'be') (('Again new grading', 'more effectively old policy'), 'identifie') (('most', 'loan orgination'), 'remove') (('I', 'further analysis'), 'look') (('underwriting process', 'this'), 'look') (('Lending So Club', 'both'), 'be') (('C new model', 'worse grades'), 'classifie') (('it', 'rate churn growth'), 'experience') (('emp_length', 'employment length'), 'be') (('they', 'loan loan grade purpose'), 'search') (('Lending Club', '7 grades'), 'have') (('distance', 'probably event'), 'mean') (('It', 'secondary market'), 'be') (('Assigning', 'True Negative rate'), 'lead') (('accounts', 'several variables'), 'related') (('Data Types convertionsData types', 'categorical variables'), 'be') (('Feature engineeringHere I', 'only one additional variable'), 'create') (('I', 'Lending Club'), 'use') (('Filling', 'case'), 'seem') (('loan many closed minumum term', 'recent dates'), 'see') (('CatBoost below model', 'ROC AUC'), 'show') (('that', 'those'), 'distinguish') (('some', 'high position'), 'notice') (('type missings imputation convertion', 'mths_since_recent_inq'), 'need') (('Term', 'relatively high descriminatory power'), 'seem') (('s', 'it'), 'let') (('So I', 'non informative missings'), 'remove') (('s', 'names'), 'let') (('Nevertheless it', 'estimation'), 'decide') (('investors', 'ratio'), 'look') (('everything', 'continuous variables'), 'be') (('mergings', 'simplification'), 'manage') (('s', 'grades'), 'let') (('borrower', 'loan'), 'give') (('rate variables categorization variables categorization facility level variables facility level high uninfomative missing variables', 'variables accounts related variables balances related related variables'), 'preprocesse') (('scoring', 'ideally fico_range_high'), 'correlate') (('Data importAs warning', 'data mixed types'), 'show') (('risk compensation', 'other words'), 'seem') (('investors', 'more adequate decisions'), 'give') (('model prediction', 'Lending Club'), 'give') (('Imputation', 'training later sample'), 'do') (('incomes', 'employment position'), 'be') (('which', 'data leakage'), 'preprocessing') (('facility level variablesSeems', 'purpose'), 'be') (('aboves analysis underestimation', 'many cases'), 'notice') (('it', 'debt very high monthly income'), 'consider') (('one', 'credit policy'), 'definitionFor') (('s', 'type'), 'let') (('Lending Club main interest', 'protfolio size'), 'be') (('org wiki Lending_Club LendingClub', 'service fee'), 'make') (('I', 'G old grade'), 'seem') (('which', 'non defaults'), 'Charged') (('Sample splitI', 'train three validation'), 'split') (('I', 'model'), 'build') (('which', 'risk'), 'be') (('lending standard institution', 'higher revenue'), 'help') (('riskiest category', 'three biggest'), 'be') (('missings num_accts_ever_120_pd delinq_2yrs imputation', 'num_tl_90g_dpd_24 m'), 'need') (('Best I', 'validation sample'), 'modelSo') (('filtering', 'rateThere two missings'), 'be') (('we', 'training sample'), 'notice') (('main goal', 'Lending grading policy'), 'be') (('Variable tot_coll_amt', 'many outliers'), 'have') (('amongst', 'highest Gini'), 'leave') (('interest', 'machine learning'), 'intensify') (('inq_last_12 m', '2015'), 'related') (('Below I', 'Gini index calculation'), 'define') (('Less risky', 'default predicted probability'), 'name') (('dataset', 'Q4'), 'include') (('which', 'bit late analysis'), 'conisdere') (('grade', 'loan'), 'decide') (('churn interest result lower rate lower rates', 'underwriting policy'), 'result') (('group', 'one'), 'merge') (('don 99 t', '0'), 'chargeoff_within_12_mths') (('grading policy', 'Lending Club'), 'conclusion') (('size', 'credit grade'), 'depend') (('which', 'ther risk appetite'), 'be') (('it', 'title column'), 'decide') (('Problem definitionNumerous companies', 'customers'), 'invest') (('it', 'ROI disproportion'), 'be') (('we', 'better grading'), 'be') (('which', 'lower interests'), 'end') (('exclusions', 'later train samples'), 'perform') (('which', 'them'), 'be') (('grading Newly created policy', 'default identification'), 'show') (('Loan', 'annual income'), 'show') (('as well it', 'less than 10000 dollars'), 'bind') (('first part', 'grading standard policy'), 'show') (('Alternative gradingLet', 'train samples'), 'check') (('E ROI', 'higher previous results'), 'be') (('com', 'San Francisco California'), 'be') (('features', 'event'), 'impute') (('Additionally higher ROI', 'expected better quality'), 'transfer') (('Lending Club', 'service fee'), 'make') (('motivation', 'investors'), 'be') (('loan', 'P2P lending company Lending Club'), 'be') (('grading Alternative Alternative', '15'), 'grade') (('which', 'returns'), 'need') (('t', 'sometimes even higher values'), 'notice') (('which', 'revenues'), 'identify') (('investors', 'potentially higher returns'), 'rate') (('Lending Club Dataset', 'predictive models'), 'contain') (('loans', 'expected return'), 'be') (('related grade_related', 'dependent grade'), 'split') (('this', 'even boxplot'), 'see') (('Correlation analysisChosen approach', 'Gini index correlation value'), 'be') (('who', 'loan higher amount'), 'mean') (('didn t almost change', 'worst grade'), 'DR') (('Besides probably it', 'clients'), 'result') (('Alternative grades', 'standard ones'), 'have') (('Model performance', 'bucket'), 'measure') (('We', 'more efficiently better loans'), 're') (('Model', 'data leakage'), 'build') (('it', 'risk level'), 'notice') (('enough appearances', '2 months'), 'decide') (('variables', 'high missing rate'), 'related') (('distribution', 'zero'), 'be') "}