{"name": "elucidata data science assignment ", "full_name": " h1 Introduction h3 Cancers h1 Data Exploration h3 Load Dataset h3 What can be said about the variance of the PCA h3 Visualize the data whole data using PCA h1 2 ", "stargazers_count": 0, "forks_count": 0, "description": "Load DatasetHere we parse our dataset into GCToo pandas dataframe instance which contains 3 component dataframes row_metadata_df column_metadata_df and data_df. 6 million deaths in 2018. pathologic_t The T refers to the size and extent of the main tumor. 80 million cases Prostate 1. Let s explore some variables Clearly 65 of time patient are dead if mRNAseq_cluster type is 1 and 3. Let s read these 25 IFN signature This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. Cancer arises from the transformation of normal cells into tumour cells in a multistage process that generally progresses from a pre cancerous lesion to a malignant tumour. 04 million cases Stomach 1. In this assignment we are going to analyse the previous data of genes structure to detect the cancer patient and provide early treatment. gct data format https github. bcr_patient_barcode and bcr_patient_uuid representing the metadata of the participants and their samples. The histology for the different tumor samples is contained in the my_data. pathologic stages are as follow stage 0 Abnormal cells are present but have not spread to nearby tissue. Data Exploration Here we have a dataset of normalized RNA Sequencing reads for pancreatic cancer tumors. com cmap cmapPy raw f3fdf016095bb08d9402ec9b6d3ebf6e603d20a1 tutorials GCT_mockup. This means that the cancer has spread from the primary tumor to other parts of the body. The most common cancers are Lung 2. The motive of this notebook is to explore and analyse the cancers patient based on their genes structure. vital_status Current status of patient live death. stage iv The cancer has spread to distant parts of the body. RNA Seq RNA sequencing is a sequencing technique to detect the quantity of RNA in a biological sample at a given moment. majority of patient have pathologic_t3 and pathologic_n1 types stages. Columns metadata explain about behaviour of patient. may pose data leakage adenocarcinoma_invasion Tells about cancer grows and spreads to near cell or not. png Let s dive into data and explore it. 28 million cases Skin cancer non melanoma 1. Cancer is a leading cause of death worldwide accounting for an estimated 9. pathologic_stage Stage of cancer amount or spread of cancer in the body pathologic_m The M refers to whether the cancer has metastasized. Data set have not this stage because approx all adenocarcinoma_invasion value is True. Type I interferons IFNs are a large subgroup of interferon proteins that help regulate the activity of the immune system. The M refers to whether the cancer has metastasized. The N refers to the the number of nearby lymph nodes that have cancer. There is 50 50 chance of patient are currently alive or deadApprox every patient cancer grows and spreads into body cells. Genes Structures Ribonucleic acid RNA is a polymeric molecule essential in various biological roles in coding decoding regulation and expression of genes. GCT file The GCT file format a tab delimited text based format pairing matrix expression values with row and column metadata allowing comparison of both transcriptional and contextual differences across samples. Read all portion of data Columns meta data Shape of columns metadata Number of missing values in each column of col_meta_data Explore each columns of col_meatadata drop columns which have constant value Number of missing values in each column of my data Fill in the lines below imputation removed column names put them back Lets combine col_meta_data and my_data. this rid show the types of RNA sequence 18465 different types of RNA seq. sample_type is our target variable which tells that which patient have cancer tumor or not. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. The file format is GCT a tab delimited file used for sharing gene expression data and metadata details for each sample for samples. RNA and DNA are nucleic acids and along with lipids proteins and carbohydrates constitute the four major macromolecules essential for all known forms of life. Interferons IFNs are a group of signaling proteins made and released by host cells in response to the presence of several pathogens such as viruses bacteria parasites and also tumor cells. Lets see individual dataframe and explore it. This means that the cancer has spread from the primary tumor to other parts of the body pathologic_n The N refers to the the number of nearby lymph nodes that have cancer. IntroductionThis notebook is a part of Assignment provided by Elucidata for 6 months internship in data science. mRNAseq_cluster estimates of the levels of individual isoforms within the cell of RNA sequence. maximum_tumor_dimension Size of Tumor tumor size is strongly related to chances for survival. The genes responsible for type 1 Interferons is called Type 1 IFN signature and consists a set of 25 genes in homo sapiens. on average which has higher tumor dimension are most likely to dead. A schematic of a sample GCT file is pictured below. The main tumor is usually called the primary tumor. mRNAseq_cluster 1 3 4 are risky types then 2 5 Types of tumer not play role in current vital status of patient. The T refers to the size and extent of the main tumor. participant_id unique value for each patient. read_csv Input data files are available in the. 09 million cases Breast 2. Cancer mortality can be reduced if cases are detected and treated early. 09 million cases Colorectal 1. The measurement consists of 20 000 genes for 183 pancreatic cancer tumors. The higher the number the larger the cancer tumor and the more it has spread into nearby tissues. the neuroendocrine tumors clearly not separable from the adenocarcinoma tumors 2Lets Remove the neuroendocrine tumors from the dataset so that it contains only the adenocarcinoma tumor samples. stage i stage ii stage iii Cancer is present. What can be said about the variance of the PCA Visualize the data whole data using PCA. Lets see the description of some variables of this data. For example running this by clicking run or pressing Shift Enter will list all files under the input directory Any results you write to the current directory are saved as output. Pancreatic Adenocarcinoma PAAD is the third most common cause of death from cancer with an overall 5 year survival rate of less than 5 and is predicted to become the second leading cause of cancer mortality in the United States by 2030. ", "id": "faizanurrahmann/elucidata-data-science-assignment", "size": "6065", "language": "python", "html_url": "https://www.kaggle.com/code/faizanurrahmann/elucidata-data-science-assignment", "git_url": "https://www.kaggle.com/code/faizanurrahmann/elucidata-data-science-assignment", "script": "cmapPy.pandasGEXpress.parse SimpleImputer numpy seaborn plotnine PCA as sklearnPCA sklearn.manifold PCA matplotlib.pyplot cat_to_numeric remove_nulls mpl_toolkits.mplot3d parse pandas gsva sklearn.impute GSVA TSNE sklearn.decomposition Axes3D StandardScaler sklearn.preprocessing ", "entities": "(('cancer', 'body pathologic_m'), 'stage') (('Interferons IFNs', 'such viruses'), 'be') (('majority', 'types pathologic_t3 stages'), 'have') (('GCT', 'samples'), 'file') (('Data Here we', 'cancer pancreatic tumors'), 'Exploration') (('Columns metadata', 'patient'), 'explain') (('Adenocarcinoma Pancreatic PAAD', '2030'), 'be') (('that', 'cancer'), 'refer') (('What', 'data whole PCA'), 'say') (('motive', 'genes structure'), 'be') (('RNA', 'life'), 'be') (('it', 'adenocarcinoma tumor only samples'), 'separable') (('It', 'python docker image https kaggle github'), 'let') (('cancer', 'body'), 'stage') (('T', 'main tumor'), 'pathologic_t') (('file format', 'samples'), 'be') (('Genes Structures Ribonucleic acid RNA', 'genes'), 'be') (('read_csv Input data files', 'the'), 'be') (('Lets', 'data'), 'see') (('patient', 'cancer tumor'), 'be') (('0 Abnormal cells', 'nearby tissue'), 'be') (('measurement', 'cancer 183 pancreatic tumors'), 'consist') (('approx', 'adenocarcinoma_invasion value'), 'have') (('cancer', 'body'), 'mean') (('mRNAseq_cluster type', 'Clearly 65 time'), 'let') (('2 risky then 5 Types', 'patient'), 'mRNAseq_cluster') (('that', 'immune system'), 'type') (('we', 'early treatment'), 'go') (('back Lets', 'them'), 'read') (('Lets', 'it'), 'see') (('genes', 'homo sapiens'), 'call') (('you', 'output'), 'list') (('cancer The higher number the larger the it', 'nearby tissues'), 'tumor') (('currently patient cancer', 'body cells'), 'be') (('this', 'RNA 18465 different seq'), 'rid') (('that', 'cancer'), 'mean') (('that', 'malignant tumour'), 'arise') (('which', 'tumor higher dimension'), 'be') (('notebook', 'data science'), 'be') (('histology', 'my_data'), 'contain') (('RNA Seq RNA sequencing', 'given moment'), 'be') (('which', 'component dataframes row_metadata_df 3 column_metadata_df'), 'parse') (('maximum_tumor_dimension Size', 'survival'), 'be') (('T', 'main tumor'), 'refer') (('schematic', 'sample GCT file'), 'picture') (('Cancer', 'worldwide estimated 9'), 'be') "}