{"name": "even faster hpa cell segmentation ", "full_name": " h1 Even Faster HPA Cell Segmentation h2 Setup h1 Measure execution time h2 linshokaku s Faster HPA Cell Segmentation h2 Optimized package h1 Outputs comparison ", "stargazers_count": 0, "forks_count": 0, "description": "Setup Measure execution time linshokaku s https www. com SamusRam HPA Cell Segmentation. com linshokaku Faster HPA Cell Segmentation Optimized package Outputs comparison a bytes object dt for hpa_image to remove the small pseduo nuclei this is to remove the cell borders signal from cell mask. The example usage can be found below. For more details on the changes one might wanna check out the optimized fork of HPA Cell Segmentation on GitHub https github. The inputs are expected to be NumPy arrays. Even Faster HPA Cell SegmentationBuilding on top of the awesome notebook https www. logical_and with some revision to replace this func. linshokaku noticed the possibility to post process smaller images before upsampling them back linshokaku also added batched processing with hardcoded batch size inside the segmenter code. com linshokaku faster hpa cell segmentation by deoxy linshokaku https www. I optimized the creation of boolean masks traversing the array just once instead of the original implementation which required two array traversals. I combined it with my attempts to speed the segmentation up. The batch size is not hardcoded. Tuned for segmentation hpa images exclude the green area first this part is to use green channel and extend cell label to green channel benefit is to exclude cells clear on border but without nucleus batching is inside the class and is set to 24 the same batch size as in faster_segmentation internally. ", "id": "samusram/even-faster-hpa-cell-segmentation", "size": "1056", "language": "python", "html_url": "https://www.kaggle.com/code/samusram/even-faster-hpa-cell-segmentation", "git_url": "https://www.kaggle.com/code/samusram/even-faster-hpa-cell-segmentation", "script": "download_with_url cellsegmentator filters __wsh _segment_helper label_cell numpy Image _restore_scaling_padding skimage pred_cells pred_nuclei scipy.ndimage utils _preprocess tqdm segmentation util transform hpacellseg hpacellseg.cellsegmentator load_images matplotlib.pyplot __fill_holes PIL pandas closing skimage.morphology disk _image_conversion CellSegmentator(object) (binary_erosion __init__ measure ", "entities": "(('this', 'cell mask'), 'comparison') (('first part', 'faster_segmentation'), 'be') (('wanna', 'GitHub https github'), 'check') (('which', 'array two traversals'), 'optimize') (('linshokaku', 'segmenter code'), 'notice') (('I', 'segmentation'), 'combine') "}