{"name": "exploratory study on ml algorithms ", "full_name": " h2 Data statistics h2 Transformation h2 Data Interaction h2 Data Visualization h2 Data Preparation h2 Evaluation prediction and analysis h2 Make Predictions h2 Load raw data h2 Data statistics h2 Data statistics h2 Data statistics h2 Data Visualization h2 Data Transformation h2 Data Interaction h2 Data Interaction h2 Data Visualization h2 Data Preparation h2 Data Preparation h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Evaluation prediction and analysis h2 Make Predictions ", "stargazers_count": 0, "forks_count": 0, "description": "Please upvote this kernel so that it reaches the top of the chart and is easily locatable by new users. Hence this is a regression problem. com c allstate claims severity dataLearning We need to predict the loss based on the other attributes. Data statistics Shape Data statistics Description Data statistics Skew Data Visualization Box and density plots Data Transformation Skew correction Data Interaction Correlation Data Interaction Scatter plot Data Visualization Categorical attributes Data Preparation One Hot Encoding of categorical data Data Preparation Split into train and validation Evaluation prediction and analysis Linear Regression Linear algo Evaluation prediction and analysis Ridge Regression Linear algo Evaluation prediction and analysis LASSO Linear Regression Linear algo Evaluation prediction and analysis Elastic Net Regression Linear algo Evaluation prediction and analysis KNN non linear algo Evaluation prediction and analysis CART non linear algo Evaluation prediction and analysis SVM Non linear algo Evaluation prediction and analysis Bagged Decision Trees Bagging Evaluation prediction and analysis Random Forest Bagging Evaluation prediction and analysis Extra Trees Bagging Evaluation prediction and analysis AdaBoost Boosting Evaluation prediction and analysis Stochastic Gradient Boosting Boosting Evaluation prediction and analysis XGBoost Evaluation prediction and analysis MLP Deep Learning Make Predictions. My other exploratory studies can be accessed here https www. Your comments on how we can improve this kernel is welcome. Thank you for opening this script I have made all efforts to document each and every step involved in the prediction process so that this notebook acts as a good starting point for new Kagglers and new machine learning enthusiasts. com sharmasanthosh kernels Data statistics Shape Peek Description Skew Transformation Correction of skew Data Interaction Correlation Scatter plot Data Visualization Box and density plots Grouping of one hot encoded attributes Data Preparation One hot encoding of categorical data Test train split Evaluation prediction and analysis Linear Regression Linear algo Ridge Regression Linear algo LASSO Linear Regression Linear algo Elastic Net Regression Linear algo KNN non linear algo CART non linear algo SVM Non linear algo Bagged Decision Trees Bagging Random Forest Bagging Extra Trees Bagging AdaBoost Boosting Stochastic Gradient Boosting Boosting MLP Deep Learning XGBoost Make Predictions Load raw data Information about all the attributes can be found here https www. ", "id": "sharmasanthosh/exploratory-study-on-ml-algorithms", "size": "2884", "language": "python", "html_url": "https://www.kaggle.com/code/sharmasanthosh/exploratory-study-on-ml-algorithms", "git_url": "https://www.kaggle.com/code/sharmasanthosh/exploratory-study-on-ml-algorithms", "script": "OneHotEncoder cross_validation keras.layers keras.models keras.wrappers.scikit_learn LinearRegression keras.constraints maxnorm dropout Ridge SVR xgboost sklearn.svm RandomForestRegressor seaborn KerasRegressor SGD Dropout Dense deeper mean_absolute_error KNeighborsRegressor sklearn.neighbors sklearn.tree XGBRegressor GradientBoostingRegressor keras.optimizers sklearn sklearn.linear_model smaller decay matplotlib.pyplot BaggingRegressor Sequential ExtraTreesRegressor DecisionTreeRegressor AdaBoostRegressor ElasticNet baseline LabelEncoder sklearn.metrics Lasso sklearn.ensemble sklearn.preprocessing ", "entities": "(('com c claims allstate We', 'other attributes'), 'severity') (('Predictions', 'attributes'), 'com') (('how we', 'kernel'), 'be') (('it', 'easily new users'), 'upvote') (('notebook', 'new Kagglers'), 'thank') (('XGBoost Evaluation prediction', 'MLP Deep Predictions'), 'attribute') "}