{"name": "exploratory data analysis dsb 2018 ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "Most of the images look like they are 256x256 so the squashing stretching might not be an issue. This will make the data easier to manipulate and plot. There is a wide range of different nuclei sizes and shapes. Whereas the nuclei in the image overlap the masks do not appear to do so. Scaling the smaller images up might be a better option than scaling the larger images down as this would also result in a loss of information. A few more things I would like to look into are the distribution of color in the images identifying different nuclei groups clusters and taking a look at the test set. As you can see above the nucleus mask completely disappears when the image is scaled down to 128x128 pixels. Increment nucleus count. Different strategies should be tried here to see what works best. Nuclei Sizes Let s take a look at some differently sized nuclei in the training set. The smallest nucleus was only a few pixels in size and was found in one of the larger images 1000x1000 resizing this image caused the tiny nucleus to disappear so resizing images should be approached with great caution. I have only scratched the surface of this dataset and there is much more to explore. These lists will be used to store the image metadata that will then be used to create pandas dataframes. Create Image Masks Metadata Dataframe Let s create another data frame for the masks metadata. The smallest image was 256x256 and the largest was 1040x1388 pixels. Append to masks data list that will be used to create a pandas dataframe. Loop over the mask ids read the images and gather metadata from them. There is quite a large range in the number of nuclei per image. There are 198 annotated nuclei in this image. It s an interesting structure possibly some kind of creature There appears to be a lot going on in this image but there are only two annotated nuclei. com jerrythomas exploratory analysis https www. Contents Importing and processing image data Looking at the image metadata summary statistics Plotting image width height and area distributions Plotting number of nuclei per image distribution Plotting images with the most and fewest nuclei Plotting the smallest and largest nuclei Plotting a sample of images Conclusion Create Images Metadata Dataframe Create a pandas data frame from the list of image metadata that was created in the loop above. Build image info list that will be used to create dataframe. Create dataframe for images Create dataframe for masks Increment col index and reset each time it gets to 4 to start a new row Increment row index every 4 items. Sum and divide by 255 to get the number of pixels for the nucleus. Introduction This will be a short exploratory analysis with the goal of becoming more familiar with the 2018 Data Science Bowl dataset and identifying some possible hurdles that could have a negative effect on model performance. After creating the data frame we can take a look at its summary stats along with the first five and last five rows to make sure it looks ok and get familiar with it. Any suggestions for improvements would be very helpful. Loop over the training images. tqdm is used to display progress as reading all the images can take about 1 2 minutes. This is done after the masks loop because we want to store the number of nuclei per image in the img_data list. The images could be resized to squares but this will cause images to be squashed either vertically or horizontally and would result in a loss of information. The distribution of nuclei masks per image appears to be skewed to the right. Initialize counter. This issue will need to be addressed before feeding the images to our model. flush These lists will be used to store the images. Wow This nucleus is either very small or very far away This makes me concerned about scaling down some of the larger images as some of these small nuclei could become undetectable or a least much more difficult to detect. The size of nuclei vary a lot throughout the images in the training set and is likely to make detection more challenging. There is one mask for each annotated nucleus. Let s see what the masks look like when stacked on top of each other. com keegil keras u net starter lb 0 277 Get train and test IDs sys. Plot some of the metadata distributions The image dimensions do not appear to be equally distributed and have a somewhat bimodal distribution. Conclusion There is a large range of image dimensions in the dataset and not all of the images are square. In the image on the right the nuclei appear to overlap each other. I adapted various parts of the following kernels while putting this together https www. Also please don t hesitate to point out any mistakes I might have made there are probably a lot of them. ", "id": "jackvial/exploratory-data-analysis-dsb-2018", "size": "3895", "language": "python", "html_url": "https://www.kaggle.com/code/jackvial/exploratory-data-analysis-dsb-2018", "git_url": "https://www.kaggle.com/code/jackvial/exploratory-data-analysis-dsb-2018", "script": "seaborn skimage.transform skimage.morphology imread skimage.io matplotlib.pyplot imread_collection imshow label chain resize pandas concatenate_images itertools tqdm numpy ", "entities": "(('completely when image', '128x128 pixels'), 'disappear') (('that', 'loop'), 'create') (('image dimensions', 'bimodal equally somewhat distribution'), 'plot') (('issue', 'model'), 'need') (('I', 'https together www'), 'adapt') (('resizing so images', 'great caution'), 'be') (('s', 'masks metadata'), 'let') (('last five it', 'it'), 'take') (('suggestions', 'improvements'), 'be') (('nuclei', 'other'), 'appear') (('images', 'information'), 'resize') (('lists', 'images'), 'flush') (('masks', 'other'), 'let') (('I', 'probably them'), 'hesitate') (('some', 'small nuclei'), 'be') (('we', 'img_data list'), 'do') (('tqdm', '1 about 2 minutes'), 'use') (('this', 'information'), 'be') (('time it', 'row Increment row new index'), 'create') (('I', 'test set'), 'be') (('I', 'dataset'), 'scratch') (('overlap', 'masks'), 'appear') (('that', 'model performance'), 'introduction') (('distribution', 'right'), 'appear') (('detection', 'training set'), 'vary') (('Build image info that', 'dataframe'), 'list') (('that', 'pandas dataframe'), 'append') (('that', 'pandas then dataframes'), 'use') (('all', 'images'), 'conclusion') (('so squashing stretching', 'images'), 'look') (('s', 'training set'), 'let') (('It', 'image'), 's') (('ids', 'them'), 'read') "}