{"name": "exploratory data analysis india s story ", "full_name": " h1 Summary h2 1 Number of loans by country h2 2 Most popular sectors in which loans are taken h2 3 Distribution of Loan duration h2 4 Distribution of number of lenders h2 5 Gender of borrowers h2 6 Distribution of Loan Amount h3 6 1 Analysis of loan amount below 2000 h3 6 2 Analysis of loan amount 2 000 20 000 h3 6 3 Analysis of loan amount 20 000 to 60 000 h3 6 4 Loan amount above 60 000 h3 6 5 Loan amount by Sector h3 6 6 Loan Amount by Gender h3 6 7 Loan Amount by Country h2 Time taken to fund loans h3 7 1 Maximum time taken for a loan to be funded h3 7 2 Distribution of time taken for a loan to be funded h3 7 3 Distribution of time taken for a loan to be funded greater than 100 days h3 7 4 Is there any difference in the time taken to fund a loan based on the gender of the borrower h3 7 5 Is there any difference in the time taken to fund a loan based on the country of the borrower ", "stargazers_count": 0, "forks_count": 0, "description": "SummaryI m exploring the data a bit to get a feel of where loans are more commonly being disbursed where larger loans are being disbursed how various factors affect loan amount. Distribution of number of lenders Most loans have between 1 to 150 lenders with some outliers having large numbers of lenders with the maximum number of lenders being 2986 5. Distribution of Loan Amount 6. I will dig into this a bit more after exploring the breakdown by country. 4 Is there any difference in the time taken to fund a loan based on the gender of the borrower It looks like female only borrower borrower groups take slightly less time to get funded. This is probably an error which I need to look into further. There is only one case where the posted time is 17 days greater than the funded time. Distribution of Loan Amount We will consider the funded_amount variable as this is the amount which is disbursed to the borrower by the field agent As all amounts are in USD no currency conversion is required Most of the values are below 2000 with 8 of all loans lying above this value 6. We would need to investigate if this is significant. 4 Is there any difference in the time taken to fund a loan based on the gender of the borrower 1. Distribution of Loan durationMost loans are short term loans of less than 24 months two years 4. Distribution of Loan duration4. 4 Loan amount above 60 000 6. Time taken to fund loans 7. read_csv From https deparkes. The distribution for mixed gender groups of borrowers is much more widespread 6. Gender of borrowers6. 3 Analysis of loan amount 20 000 to 60 000 A few values lie in this range Most of the high value loans are disbursed for Agriculture and Retail 6. Most popular sectors in which loans are taken Agriculture food and retail are the most popular sectors in which loans are taken 3. 5 Loan amount by Sector 6. 1 of all loans in the entire sample take more than a 100 days to be funded 7. 3 Distribution of time taken for a loan to be funded greater than 100 days 7. 2 Distribution of time taken for a loan to be funded 7. 6 Loan Amount by Gender 6. 1 Maximum time taken for a loan to be funded 7. 4 Loan amount above 60 000 There is only a single loan amount with a value of 100 000 in this range distributed for Agriculture in Haiti 6. linear algebra data processing CSV file I O e. Lenders are then able to see the loan on Kiva and make contributions towards it. uk 2016 11 04 sort pandas boxplot use dict comprehension to create new dataframe from the iterable groupby object each group name becomes a column in the new dataframe find and sort the median values in this new dataframe use the columns in the dataframe ordered sorted by median value return axes so changes can be made outside the function Q3 1. 7 Loan Amount by Country7. Number of Loans By Country2. The agent then posts the loan to Kiva at the posted_time. 7 Loan Amount by Country There s a lot going on here but some countries that are clearly on the higher end of the loan amount spectrum are Afhanistan Congo Chile. Number of loans by country Since Kiva extends services to financially excluded people around the globe it makes sense that the countries where the most loans are given out are developing nations like the Phillipines and Kenya 2. It will be interesting to see what kind of sectors the loans in these countries were made for In Afghanistan there were only 2 loans disbursed with amounts between 6 000 and 8 000 and both of them were for Textile activity. 2 Analysis of loan amount 2 000 20 000 6. Most popular sectors in which loans are taken3. 2 Analysis of loan amount 2 000 20 000 Most of the outliers lie in this range 6. It s surprising to see the United States on the higher end of the spectrum. 1 Analysis of loan amount below 2000 6. A possible explanation for Nigeria is that the value of the dollar against the Nigerian naira is so high that even small loan amounts in dollar value go a long way Time taken to fund loansThe loan disbursal process works like this in Kiva the field agent disburses the loan to the borrower at the disbursed_time. The longest time it took for a loan to get funded was 1 year and 2 months Most of the loans are funded within a 100 days. 5 IQR percentage of loans above upper whisker. 5 Is there any difference in the time taken to fund a loan based on the country of the borrower Countries are sorted in the increasing order of their median time to fund Countries like Afghanistan and Chile are on the lower end of the spectrum. 6 Loan Amount by Gender The distribution of loan amount show slightly lower amounts for female only borrowers than for male only borrowers. 5 Loan amount by Sector Not much observable difference in distributions of loan amount by sector except that loan amounts for the personal use sector tends to be on the lower side 6. After this initial analysis I will go into borrower profiles and how Kiva can use these to make decisions about disbursing loans. The time at which the loan has been completely funded is the funded_time We can then consider the time taken to completed fund a loan to be funded_time posted_time. On the other end of the spectrum are countries like Nigeria which has the lowest distribution. 1 Analysis of loan amount below 2000 The distribution is skewed to the right with higher loan amounts being less common 6. Gender of borrowers Female only borrowers single or group are significantly more than male only borrowers and mixed groups 6. Distribution of number of lenders5. 3 Analysis of loan amount 20 000 to 60 000 6. ", "id": "ddigges/exploratory-data-analysis-india-s-story", "size": "5521", "language": "python", "html_url": "https://www.kaggle.com/code/ddigges/exploratory-data-analysis-india-s-story", "git_url": "https://www.kaggle.com/code/ddigges/exploratory-data-analysis-india-s-story", "script": "seaborn matplotlib.pyplot pandas process_gender boxplot_sorted numpy ", "entities": "(('only one where posted time', '17 days funded time'), 'be') (('amounts', 'lower side'), 'tend') (('I', 'further'), 'be') (('distribution', 'borrowers'), 'be') (('It', 'spectrum'), 's') (('field agent', 'disbursed_time'), 'be') (('Lenders', 'it'), 'be') (('only borrowers', 'single significantly more male'), 'be') (('where most loans', 'Phillipines'), 'make') (('I', 'country'), 'dig') (('how Kiva', 'disbursing loans'), 'go') (('loans', 'Most popular which'), 'sector') (('8 both', 'Textile activity'), 'be') (('how various factors', 'loan amount'), 'm') (('then time', 'loan'), 'be') (('borrower borrower female only groups', 'slightly less time'), 'be') (('which', 'lowest distribution'), 'be') (('Most', 'Agriculture'), 'Analysis') (('distribution', 'male only borrowers'), 'Amount') (('Most loans', 'lenders'), 'distribution') (('that', 'loan amount spectrum'), 'Amount') (('Countries', 'spectrum'), 'be') (('loan', 'time'), 'fund') (('1 year 2 Most', '100 days'), 'be') (('2 20 000 000 Most', 'range'), 'Analysis') (('distribution', 'higher loan'), 'Analysis') (('changes', 'function'), 'use') (('loans', 'term short less than 24 months'), 'be') (('Most', 'value'), 'distribution') (('loans', '3'), 'be') (('agent', 'posted_time'), 'post') (('loan', '2 time'), 'distribution') (('1', '100 days'), 'take') (('4', 'borrower'), 'be') "}