{"name": "fifa in depth analysis with linear regression ", "full_name": " h1 Introduction h1 Table of Contents h1 1 Glimpse of the data at hand h1 2 Data Cleaning h1 3 Data Analysis h1 4 Exploratory Data Analysis h3 From the plot we can infer many things h1 5 Modelling h3 If these kernels impress you give them an Upvote ", "stargazers_count": 0, "forks_count": 0, "description": "It motivates me to produce more quality content Image https images. Modelling 5 1. EDA wirh R3 IDEnsemble Learning Part 1Ensemble Learning Part 2Students performance in Exams EDA in depth Pulmonary Embolism Dicom preprocessing EDA Titanic Machine Learning from Disaster Graduate Admission Chances Flower_Classification Augmentations EDAStorytelling with GWD pre_print data If these kernels impress you give them an Upvote. Exploratory Data Analysis Potential tends to fall as you grow oldSource of below visualisations fifa19 analysis https www. It is the 26th installment in the FIFA series and was released on 28 September 2018 for PlayStation 3 PlayStation 4 Xbox 360 Xbox One Nintendo Switch and Microsoft Windows Source Wikipedia https en. My Other KernelsClick on the button to view kernel. jpg t 1305899489 quality 60 w 1600 Table of Contents1. com di library GOAL d2 e5 fifa 19 ultimate team_19gk2cvl4sd11kpd72z9ufwi1. com dczerniawko fifa19 analysis As the age increases the sprint speed decreases Left Footed Players vs Right Footed Players Crossing vs Dribbling Relation between potential and age with respected value of players Lowest correlation among the goalkeeping side with other columns and high among themselves High correlation between Dribbling Volleys Passing etc. org wiki FIFA_19 This game did not recieve much popular reviews. Go to TOP Number of countries available and top 5 countries with highest number of players Total number of clubs present and top 5 clubs with highest number of players Player with maximum Potential and Overall Performance Cleaning some of values so that we can interpret them Top earners number of variable We are going to plot the first line of the data frame. Exploratory Data Analysis 4 5. We will have comparisions for Age Overall Potential Accelaration SprintSpeed Agility Stamina Strength From the plot we can infer many things. Data Analysis 3 4. As we can see we guessed right and now we have fewer null values. Data Cleaning 48 is repeating many times lets check if all of them are same ID or notAs they are same I am assuming it will be same for other all columns too. However we will have a deep analysis in this notebook. But we need to repeat the first value to close the circular graph What will be the angle of each axis in the plot we divide the plot number of variable Initialise the spider plot Draw one axe per variable add labels labels yet Draw ylabels Plot data Fill area DROP UNNECESSARY VALUES Turn Real Face into a binary indicator variable Turn Preferred Foot into a binary indicator variable Create a simplified position varaible to account for all player positions Get a count of Nationalities in the Dataset make of list of those with over 250 Players our Major Nations Replace Nationality with a binary indicator variable for Major Nation Create a copy of the original dataframe to avoid indexing errors Apply changes to dataset to create new column Split the Work Rate Column in two Create new column for first work rate Create new column for second work rate Drop original columns used Split ID as a Target value Splitting into test and train One Hot Encoding Applying Linear Regression Finding the r2 score and root mean squared error Top 3 important features are Potential Age Reactions Visualising the results. Glimpse of the data at hand 1 2. Data Cleaning 2 3. ModellingPermutation importance is the first tool for understanding a machine learning model and involves shuffling individual variables in the validation data after a model has been fit and seeing the effect on accuracy. Firstly most of the people are right footed xD Some unusual behavior in Potential vs Overall Accelaration and SprintSpeed follow a proper linear relationship Agility vs SprintSpeed Agility vs Accelaration and Agility vs Stamina have somewhat linear relationship 5. Please upvote this kernel if you like it. Glimpse of the data at hand 2. FIFA EDA and Linear Regression Starter IntroductionFIFA 19 is a football simulation video game developed by EA Vancouver as part of Electronic Arts FIFA series. ", "id": "nitindatta/fifa-in-depth-analysis-with-linear-regression", "size": "4648", "language": "python", "html_url": "https://www.kaggle.com/code/nitindatta/fifa-in-depth-analysis-with-linear-regression", "git_url": "https://www.kaggle.com/code/nitindatta/fifa-in-depth-analysis-with-linear-regression", "script": "math Counter right_footed train_test_split LinearRegression numpy seaborn value_to_int face_to_num sklearn.linear_model matplotlib.pyplot sklearn.model_selection pandas PermutationImportance r2_score missingno mean_squared_error pi simple_position eli5.sklearn major_nation sklearn.metrics collections ", "entities": "(('error Top 3 important features', 'Potential Age results'), 'need') (('org game', 'much popular reviews'), 'wiki') (('we', 'many things'), 'have') (('We', 'data frame'), 'go') (('it', 'other columns'), 'repeat') (('sprint speed', 'Dribbling Volleys Passing etc'), 'analysis') (('It', 'quality content Image https more images'), 'motivate') (('com di library', 'GOAL d2 19 ultimate team_19gk2cvl4sd11kpd72z9ufwi1'), 'fifa') (('shuffling', 'accuracy'), 'be') (('you', 'it'), 'upvote') (('you', 'analysis https visualisations fifa19 www'), 'tend') (('FIFA EDA', 'Electronic Arts FIFA series'), 'be') (('However we', 'notebook'), 'have') (('right now we', 'fewer null values'), 'guess') (('kernels', 'Upvote'), 'EDA') (('It', '2018 PlayStation 3 PlayStation'), 'be') (('Agility', 'somewhat linear relationship'), 'be') "}