{"name": "fork of mtg gathering the colors by release ", "full_name": " h3 Introduction h3 Settings h3 Read Data h3 Remove Outliers h3 Preprocess Color h3 Co occurrences h3 Correlation Heatmap h3 Creatures h3 Interactive 3D Scatterplot h3 Mana distribution h3 Power distribution h3 Toughness distribution h3 Radar chart factory h3 Radar Chart h4 Radar Charts Mono color decks h4 Radar Charts Multi color decks h3 Appendix ", "stargazers_count": 0, "forks_count": 0, "description": "Settings Read Data Remove Outliers Preprocess Colors Co occurrences Correlation Heatmap Interactive 3D Scatterplot Mana distribution Power distribution Toughness distribution Radar charts List of all releases SettingsFor this notebook we just look at the latest Kaladesh set. For simple visualizations we have to make some simplifications. We ll assign colors to exhibits A and B below but not to C. Eldrazi creatures that need a specific color mana to cast but is Deviod of a color type. I think this is dirty data. Exhibit A the edge case when colors is missing but colorIdentity is not 1. Truly colorless artifact creatures like Juggernaut. org examples api radar_chart. spine_type must be left right top bottom or circle. Truly colorless artifacts like Leonin Scimitar. Radar Charts Mono color decks Radar Charts Multi color decks AppendixComplete listing of sets in the data. For this notebook we limit the number of releases so that we can include a low level visualization of power vs toughness. the axes frame to draw correctly for a polygon frame. Capture release filter Some data fu to get all cards into a single table along with a couple of release columns. Artifacts that do not need colored mana to cast but activations associated with colored mana. Co occurrences Correlation Heatmap Creatures Interactive 3D ScatterplotInteractive 3D scatter of power versus toughness by Color gives a good overview of the creatures available. Exhibit C the edge case when both colors and colorIdentity are missing 1. And it s interesting that the mult color creatures have a negative relationship between power and toughness. For example Serra Angel needs white mana to cast and should count as white for Protection From White. 5 use 1 line segment to connect specified points define draw_frame method FIXME markers at x 0 y 0 get doubled up The following is a hack to get the spines i. IntroductionThis notebook is a fork of the one that gave a high level look into the 5 core mana colors for all releases together. Each radar shows the distribution of cards into 5 types with every circle denoting 10. I m not a MTG expert so maybe there is some rule I m not aware of. Refer to it to define your own release_filter. calculate evenly spaced axis angles rotate theta such that the first axis is at the top unit circle centered on 0. remove promo cards that aren t used in normal play Edit 2016 09 30 Could be null because it s too new to have a ruling on it. Exhibit B the edge case when colorIdentity is missing but colors is not 1. html Radar ChartWe will look at how the distribution of card types varies by mana color. Ordered by release date. Recommened views zoom in and assume an isometric view 2D view of power 2D view of toughness Mana distribution Power distribution Toughness distribution Radar chart factoryCode from http matplotlib. But all possible releases in the data are listed in the appendix appendix below. Is there a better way of grouping Values are percentages so 100 artifacts does not mean there are lots of artifacts of that color. Feel free to fork this and edit the release_filter variable below for any release that you may be interested in. Notice how much of an outlier the colorless Metalwork Colossus is. See the Interactive 3D Scatterplot section. close off polygon by repeating first vertex Do not double count creatures Some double counting of artifacts and enchantments exist but it s rare. remove cards that are banned in any game type remove tokens without types Power and toughness that depends on board state or mana cannot be resolved Combine colorIdentity and colors Include colorless and multi color. Read Data Remove Outliers Preprocess ColorA core part of Magic The Gathering MTG is how different rules interact with each other. For example Counterspell seems to me like the typical blue spell. ", "id": "willieliao/fork-of-mtg-gathering-the-colors-by-release", "size": "3283", "language": "python", "html_url": "https://www.kaggle.com/code/willieliao/fork-of-mtg-gathering-the-colors-by-release", "git_url": "https://www.kaggle.com/code/willieliao/fork-of-mtg-gathering-the-colors-by-release", "script": "math numpy.random tools aes Spine _gen_axes_patch FigureFactory as FF init_notebook_mode PolarAxes radar_factory set_varlabels download_plotlyjs _close_line draw_circle_patch numpy seaborn matplotlib.path Path plotly RadarAxes(PolarAxes) matplotlib.projections.polar FigureFactory fill matplotlib.projections unit_poly_verts random plotly.tools matplotlib.pyplot _gen_axes_spines ceil plotly.offline plot pandas plotly.graph_objs draw_poly_patch iplot register_projection matplotlib.spines ggplot ", "entities": "(('that', 'releases'), 'be') (('Edit 2016 09 it', 'it'), 'remove') (('how distribution', 'mana color'), 'look') (('Counterspell', 'typical blue spell'), 'seem') (('Combine colorIdentity', 'colorless'), 'resolve') (('how different rules', 'other'), 'Read') (('we', 'simplifications'), 'have') (('so maybe I', 'MTG expert'), 'm') (('it', 'artifacts'), 'close') (('we', 'Kaladesh just latest set'), 'read') (('Serra Angel', 'White'), 'need') (('Metalwork Colossus', 'outlier'), 'notice') (('that', 'colored mana'), 'artifact') (('radar', '10'), 'show') (('we', 'toughness'), 'limit') (('such first axis', '0'), 'calculate') (('We', 'below C.'), 'assign') (('so 100 artifacts', 'color'), 'be') (('spines', 'x'), 'define') (('you', 'that'), 'feel') (('Correlation Heatmap Interactive ScatterplotInteractive 3D Co 3D scatter', 'creatures'), 'occurrence') (('possible releases', 'appendix appendix'), 'list') (('Eldrazi that', 'color type'), 'creature') (('Exhibit edge when colors', '1'), 'c') (('Radar', 'factoryCode http matplotlib'), 'view') (('mult color creatures', 'power'), 's') "}