{"name": "generating fake starfish ", "full_name": " h1 What s the Notebook for h1 Input Image for Pedestrian Synthesis GAN PS GAN h1 Synthesized Results h2 Sample of Synthesized Images h2 Sample of Poorly Sinthesized Images h1 Reference ", "stargazers_count": 0, "forks_count": 0, "description": "02047 Input Image for Pedestrian Synthesis GAN PS GAN Synthesized ResultsHere I can show part of the synthesized results. com yueruchen Pedestrian Synthesis GAN 3 https github. It sometimes outputs completely fake looking images when fed new image which doesn t apper in train dataset. The model sometimes generates COTS like object sometimes not. Since I fed only 1200 input data I think the model are overfitted. The model can be trained if we prepare an image in which the BBox and the target are replaced by noise so I trained it using a partial dataset of the competition about 1 200 sampled clips of size 256x256. It looks sufficient to train the model but considering they are sourced from almost identical successive frames it is doubtful that they are sufficient. Here I used the model Pedestrian Syntheis GAN 1 which was used to generate pseudo images of pedestrians. I doubt this model can generate the data useful for object detection. The modified repository might still contain many bugs. com bilzard Pedestrian Synthesis GAN number of bounding boxes number of annotated frames. Sample of Poorly Sinthesized Images ReferenceThe original repository 2 has many bugs so I forked and modified the repository 3. Can we inprove the detection model by adding new synthesized images in GAN This is the first motivation of this approach. Sample of Synthesized ImagesI trained the model for about 150 epochs but the latest model s discriminator seems overfitting because almost perfectly discriminates fake and real. 2 https github. What s the Notebook for This competition has 11 898 bounding boxes and 4 919 annotated. So I used weight of 125 epoch. ", "id": "tatamikenn/generating-fake-starfish", "size": "1688", "language": "python", "html_url": "https://www.kaggle.com/code/tatamikenn/generating-fake-starfish", "git_url": "https://www.kaggle.com/code/tatamikenn/generating-fake-starfish", "script": "Path pathlib matplotlib.pyplot pandas plot_real_and_fake_image numpy ", "entities": "(('so I', '1 about 200 sampled size'), 'train') (('modified repository', 'still many bugs'), 'contain') (('s', '11 898 bounding boxes'), 'have') (('which', 'train dataset'), 'output') (('model', 'input only 1200 data'), 'think') (('latest discriminator', 'about 150 epochs'), 'train') (('I', 'synthesized results'), 'Image') (('they', 'almost identical successive frames'), 'look') (('This', 'first approach'), 'inprove') (('Pedestrian Syntheis 1 which', 'pedestrians'), 'use') (('so I', 'repository'), 'have') (('model', 'object'), 'generate') (('model', 'object detection'), 'doubt') "}