{"name": "gfootball rules from environment exploration ", "full_name": " h1 Installation h1 GFootball Rule based Bot Template and Environment Exploration ", "stargazers_count": 0, "forks_count": 0, "description": "Also the helper code to see the enum structure at here https github. 010506737977266312 0. 010457873344421387 0. 5017596483230591 Ball position at step 10 is 0. 015978505834937096 Ball position at step 70 is 0. 11439678072929382 Player position at step 71 is 0. When PalyerRole is involved there will be errors somehow which is blocking to locate enemy goalkeeper accurately. 00039497180841863155 0. What I want to explore is the gravity constant in this game. 01554815098643303 Ball position at step 73 is 0. Get team size Does the player we control have the ball Kickoff strategy short pass to teammate Goalkick strategy high pass to front Freekick strategy make shot when close to goal high pass when in back field and short pass in mid field Corner strategy high pass to goal area Throwin strategy short pass into field Penalty strategy make a shot Defending strategy Make sure player is running. 010418068617582321 0. 010547423735260963 0. InstallationThe first step is to install required tools as well GFootball Rule based Bot Template and Environment ExplorationBelow we present a simple Bot with couple rules playing GFootball. We may assume this is equal to one step running length. 6465353332459927e 06 0. GFootball environment. 003420717315748334 0. 015880394726991653 Ball position at step 72 is 0. Per the video of the game I saw right team player 1 was sprinting with the ball during steps 30 to 40. Take a look at left team log for beginning steps. 00018943101167678833 Right team player 1 speed change at step 35 is 0. Will try to use it later. com Kaggle kaggle environments blob master kaggle_environments envs football helpers. 10063117742538452 Ball speed change between step 9 and 10 is 8. What is better now your roommate can achieve some operations human being cannot achieve Do go through the detailed description of the GFootball observations is available here https github. Load out log files from environment. Right team player 1 position at step 35 is 0. In this one I m trying to use the log file to further understand the environment and try my best to summarize some rules based on my game experience. It seems the ball will stay at center for couple steps before the game start. 014 per step with ballIn the game I saw during step 60 80 player 8 is sprinting toward right with ball. 013992365449666977 0. when the ball is generally on the ground not flying Run towards the ball s left position. 00038968087756074965 0. 15 and player can pick a high pass at height around 0. 015 space between player and ball. 028232717886567116 Right team player 1 speed at step 35 is 0. 39738738536834717 Ball speed at step 9 is 0. 1332190954126418e 05 We can see that the sprint speed is around 0. 025729181244969368 0. Above results will chagne game to game what I saw in a game Ball position at step 9 is 0. A further look into one step. 002634421456605196 0. Run towards the goal otherwise. 015958167612552643 0. 00039332741289399564 0. 6686542443931103e 06 0. when the ball is flying Run towards the landing point s left position. Make sure that the Branch in git clone and in wget call matches Global param As we always sprint Ignore drag to estimate the landing point Check whether pressing on direction buttons and take action if so Else press on direction first Find right team positions Fix goalkeeper index here as PlayerRole has issues Default PlayerRole 0 7 9 2 1 1 3 5 5 5 6 We always control left team observations and actions are mirrored appropriately by the environment. 0030293932650238276 0. The ball ground level height is around 0. 047481197863817215 Ball speed at step 10 is 0. Also we can explore how the speed stored in ball_direction work. 0003913240507245064 0. This space is very close to the sprint length per step. 047481197863817215 Ball position change between step 9 and 10 is 0. 04987070709466934 Ball speed at step 10 is 0. 00039699606713838875 0. Keep making shot when around landing point Set up the Environment. The sprint speed is around 0. It is simulating your direction button holding action when you use controller to paly the game. 0001925030373968184 Right team player 1 speed at step 36 is 0. Try to take over the ball if close to the ball. 00014234986156225204 2. 09735190495848656 We can easily see the air fraction can be ignored generally and the gravity constant in the game is around 0. 013931572437286377 0. There are couple high level tricks which can be summarized from playing the game as well 1. So I keep only ball position and speed log only. 013850015588104725 0. 0037410855293273926 Ball speed change between step 9 and 10 is 9. And then we can start coding the rules. 108614176511765e 05 3. And below we are going to explore what is the speed during sprint. I would like to call rule based agent as GFootball coach simulator. 15489338338375092 Install Kaggle environments. 01591404154896736 Ball position at step 71 is 0. We can see there is always a 0. My assumption here is that the latest PR merged in the helper is not available in the scoring environment. 4980185627937317 Ball speed at step 9 is 0. So I specifically checked the palyer log during those steps. 1119992733001709 Player position at step 72 is 0. Instead it is simulating how you shout to your roommate Why you idiot do not press RL A X when you blublublu when your roommate is playing and you are watching. 012 during sprint which is close to the sprint speed. It is not simulating how you coaching a football team. 0 while goalkeeper can catch the ball at around 0. Player position at step 70 is 0. 09650498256087303 Ball position at step 9 is 0. 00017117084644269198 Right team player 1 position change at step 35 is 0. Try to check sticky_actions before you do slide pass and shot epecially the direction part. The space between boal controller and ball is around 0. 4980185627937317 Ball position at step 10 is 0. 098 and drag plays a role during ball flying. Shot if we are close to the goal based on x coordinate. com google research football blob master gfootball doc observation. 015966957435011864 0. When close to the ball try to take over. 028422148898243904 Right team player 1 position at step 36 is 0. 14398618042469025 Ball position change between step 9 and 10 is 0. 14346031844615936 Player position at step 73 is 0. They are very helpful. 866935968399048e 05 3. ", "id": "sx2154/gfootball-rules-from-environment-exploration", "size": "5659", "language": "python", "html_url": "https://www.kaggle.com/code/sx2154/gfootball-rules-from-environment-exploration", "git_url": "https://www.kaggle.com/code/sx2154/gfootball-rules-from-environment-exploration", "script": "sticky_check ball_landing make kaggle_environments kaggle_environments.envs.football.helpers agent pandas datetime numpy ", "entities": "(('I', 'game experience'), 'try') (('Player 1119992733001709 position', 'step'), 'be') (('position team player 1 change', 'step'), '00017117084644269198') (('Ball position', 'step'), '5017596483230591') (('how speed', 'ball_direction work'), 'explore') (('when you', 'game'), 'simulate') (('Ball position', 'step'), '015880394726991653') (('space', 'step'), 'be') (('So I', 'ball only position'), 'keep') (('Ball 015978505834937096 position', 'step'), 'be') (('Ball position', 'step'), 'chagne') (('team player', '1 step'), '0001925030373968184') (('Ball position', 'step'), '09650498256087303') (('specifically palyer', 'steps'), 'check') (('team always left observations', 'appropriately environment'), 'make') (('speed', 'sprint'), 'go') (('here latest PR', 'scoring environment'), 'be') (('team 028232717886567116 Right player 1 speed', 'step'), 'be') (('when ball', 'position'), 'left') (('we', 'x coordinate'), 'shoot') (('Player position', 'step'), '11439678072929382') (('level couple high which', 'game'), 'be') (('9 10', 'step'), '0037410855293273926') (('Ball speed', 'step'), '047481197863817215') (('this', 'step running one length'), 'assume') (('Ball position 14398618042469025 change', 'step'), 'be') (('which', 'sprint speed'), '012') (('Ball speed', 'step'), 'be') (('when ball', 'left position'), 'be') (('you', 'RL A idiot X'), 'simulate') (('Environment we', 'GFootball'), 'be') (('Ball position change', 'step'), '047481197863817215') (('player', 'field Penalty strategy'), 'get') (('Ball position', 'step'), '01554815098643303') (('Ball position', 'step'), '01591404154896736') (('I', '30 40'), 'see') (('I', 'ball'), 'sprint') (('Ball 39738738536834717 speed', 'step'), 'be') (('now roommate', 'https here github'), 'achieve') (('gravity', 'game'), 'be') (('space', 'boal controller'), 'be') (('Ball 4980185627937317 speed', 'step'), 'be') (('goalkeeper', 'around 0'), '0') (('team player 1 position', 'step'), '028422148898243904') (('speed Right team player 1 change', 'step'), '00018943101167678833') (('9 10', 'step'), 'be') (('I', 'GFootball coach simulator'), 'like') (('Ball 4980185627937317 position', 'step'), 'be') (('how you', 'football team'), 'simulate') (('game', 'couple steps'), 'seem') (('you', 'direction epecially part'), 'try') (('team Right player 1 position', 'step'), 'be') (('15', '0'), 'pick') (('drag', 'ball flying'), 'play') (('Player position', 'step'), '14346031844615936') (('somehow which', 'enemy goalkeeper'), 'be') (('generally gravity', 'game'), 'see') "}