{"name": "heart attack eda predictor 95 accuracy score ", "full_name": " h1 Heart Attack EDA and Prediction h1 Table of Contents h1 Dataset Info h1 Preparing Workspace h2 Importing Libraries h2 Setting Params h2 Loading Data h1 Preliminary Analysis h2 Shape of the dataset h2 Preview of the dataset h2 Missing Values h2 Categorical and Continous h2 General Stats h1 Exploratory Data Analysis h2 Univariate Analysis h3 Voilin plot for continous variables h4 Conclusion h3 Count plot for categorical features h4 Conclusion h2 Bivariate Analysis h3 Seperation of categorical variables w r t to output h4 Conclusion h3 Corrected Cramer s V for categorical variables h4 Conclusion h3 Plots for continous variables w r t output h4 Conclusion h3 Kruskal Wallis H test h4 Conclusion h3 Check for Multi Collinearity Correlation of variables among themselves h4 Conclusion h3 Pair plot One plot to rule them all h2 Conclusion h1 Model Development h2 Loading Libraries h2 Feature Engineering h2 Training Models and Getting Results h2 Stacking h2 Plot of Scores h1 Conclusion h1 Thank you ", "stargazers_count": 0, "forks_count": 0, "description": "Also thanks to my bro Naman Manchanda https www. Restecg Thall Caa Slp are likely to impact few models sensitive to data distribution because value counts for some values is extremely low. The best ones were Ensemble Methods Gradient Boost AdaBoost and Logistic Regression Thank you Thanks for reading up to this far. t output Kruskal Wallis H test Check for Multi Collinearity Correlation of variables among themselves Pair plot One plot to rule them all Conclusion Model Development Loading Libraries Feature Engineering Training Models and Getting Results Stacking Plot of Scores Conclusion Thank you Dataset Info age Age of the patient sex Sex of the patient cp Chest pain type 0 Typical Angina 1 Atypical Angina 2 Non anginal Pain 3 Asymptomatic trtbps Resting blood pressure in mm Hg chol Cholestoral in mg dl fetched via BMI sensor fbs fasting blood sugar 120 mg dl 1 True 0 False restecg Resting electrocardiographic results 0 Normal 1 ST T wave normality 2 Left ventricular hypertrophy thalachh Maximum heart rate achieved oldpeak Previous peak slp Slope caa Number of major vessels thall Thalium Stress Test result 0 3 exng Exercise induced angina 1 Yes 0 No output Target variable Preparing Workspace Importing Libraries Setting Params Loading Data Preliminary Analysis Shape of the dataset Preview of the dataset Missing Values Categorical and Continous General Stats Exploratory Data Analysis Univariate Analysis Voilin plot for continous variables Conclusion chol trtbps and oldpeak have decent amount of outliers that could affect certain models sensitive to them. t to output Corrected Cramer s V for categorical variables Plots for continous variables w. t output Conclusion Trtbps and Chol are not likely to have correlation Age and Thalachh might have weak correlation Oldpeak is likely to be correlated. Although chol and trtpbs cut very close to our alpha which is 0. If you liked the notebook please consider upvoting. Fbs and Cp could possibly affect models sensitive to data distribution because their value counts is also not ideal. All continous variables are related to output Multi collinearity Variables do not have strong correlation and are weakly correlated Model Development Loading Libraries Feature Engineering We would get out X as the values we determined to have an impact Standardize them and get One hot encoding for categorical variables. Table of Contents Dataset Info Preparing Workspace Importing Libraries Setting Params Loading Data Preliminary Analysis Shape of the dataset Preview of the dataset Missing Values Categorical and Continous General Stats Exploratory Data Analysis Univariate Analysis Voilin plot for continous variables Count plot for categorical features Bivariate Analysis Seperation of categorical variables w. This could affect models or analysis with uniform distribution as requirement. Kruskal Wallis H test Since the distribution for some variables is non Gaussian we would be using non parametric test specifically Kruskal Wallis H Test ConclusionSuprisingly all variables have correlation. Relation to target variable All categorical variables except Fbs are related to output albeit to varying degrees. oldpeak and chol moderately are not uniformly distributed. Heart Attack EDA and PredictionThis notebook aims at exploring the dataset and making predictions on whether a person will have heart attack or not. Check for Multi Collinearity Correlation of variables among themselves ConclusionVariables do not have strong correlation and are weakly correlated Pair plot One plot to rule them all Conclusion Here s the conclusion from the entire EDA Feature Insights chol trtbps and oldpeak have decent amount of outliers. t to output Corrected Cramer s V for categorical variables ConclusionThe stats seem to agree with the conclusions we drew previously from graph along with a measure of the correlation. Fbs is not related at all Sex Restecg have very weak correlation Sp Thall seem to have a moderately strong correlation Exng Caa Slp have decent correlation Plots for continous variables w. Training Models and Getting Results Stacking Plot of Scores Conclusion We started with tabular data and performed EDA and got crucial information We did some feature engineering by performing Standardization and One Hot Encoding We created several models and got their results. This could affect certain models sensitive to them. Especially Restecg and sex have very weak relation. Bivariate Analysis Seperation of categorical variables w. t to output Conclusion Fbs doesn t seem to be related at all to output Sex Restecg seem to be somewhat correlated to output Others have a fair correlation w. Count plot for categorical features Conclusion Restecg Thall Caa Slp are likely to impact few models sensitive to data distribution because value counts for some values is extremely low. com namanmanchanda for his tips on visualizations. ", "id": "abhinavgargacb/heart-attack-eda-predictor-95-accuracy-score", "size": "6946", "language": "python", "html_url": "https://www.kaggle.com/code/abhinavgargacb/heart-attack-eda-predictor-95-accuracy-score", "git_url": "https://www.kaggle.com/code/abhinavgargacb/heart-attack-eda-predictor-95-accuracy-score", "script": "RobustScaler classification_report train_test_split confusion_matrix sklearn.svm accuracy_score numpy seaborn SVC sklearn.neighbors sklearn.tree GradientBoostingClassifier cramers_corrected_stat sklearn.linear_model matplotlib.pyplot MinMaxScaler DecisionTreeClassifier sklearn.model_selection pandas RandomForestClassifier LogisticRegression precision_recall_fscore_support scipy.stats KNeighborsClassifier AdaBoostClassifier StackingClassifier sklearn.metrics sklearn.ensemble StandardScaler sklearn.preprocessing ", "entities": "(('value counts', 'data sensitive distribution'), 'affect') (('Hot One We', 'results'), 'Models') (('This', 'requirement'), 'affect') (('counts', 'values'), 'be') (('This', 'sensitive them'), 'affect') (('you', 'notebook'), 'like') (('Conclusion Fbs doesn t', 'correlation fair w.'), 'seem') (('which', 'very close alpha'), 'cut') (('Here conclusion', 'outliers'), 'have') (('categorical variables', 'albeit varying degrees'), 'variable') (('that', 'sensitive them'), 'test') (('we', 'correlation'), 't') (('Exng Caa Slp', 'variables continous w.'), 'relate') (('Especially Restecg', 'very weak relation'), 'have') (('best ones', 'Thanks this'), 'be') (('Kruskal Wallis H Test specifically ConclusionSuprisingly variables', 'correlation'), 'test') (('we', 'categorical variables'), 'relate') (('person', 'heart attack'), 'aim') "}