{"name": "histopathologic cancer detection ", "full_name": " h1 Histopathologic Cancer Detection h3 By Soumya Ranjan Behera h2 Abstract h2 Major Outcomes h2 About the Data Set h1 Exploratory Data Analysis h3 Total Samples Available h3 Create a DataFrame of all Train Image Labels h3 Visualize some Train Images h3 See the distribution of Train Labels h1 Feature Engineering h3 Take 80K images from both categories h3 Split into Train and Validation Sets h3 Put the two types of images into two folder to help Keras ImageGenerator h1 Create our Model CancerNet h3 Visualize our model architecture h2 Model Architecture will be shown here when notebook will run otherwise see Output Visualization Section h1 Model Training h3 Define LR Scheduler and Save Model Checkpoint on Maximum Validation Accuracy h1 Model Evaluation h3 Compare Training and Validation Metrics h3 Load the saved weights h3 Validate the model Measure Model Performance h2 Confusion Matrix h2 Classification Report h1 Make Test Predictions for Kaggle h3 Make Submission File h1 Conclusion h1 References h3 Author Soumya Ranjan Behera ", "stargazers_count": 0, "forks_count": 0, "description": "About the Data Set The data for this kernel is a slightly modified version of the PatchCamelyon PCam https github. PCam provides a new benchmark for machine learning models bigger than CIFAR10 smaller than imagenet trainable on a single GPU. Ehteshami Bejnordi et al. com metrics to evaluate your machine learning algorithm f10ba6e38234 From the confusion matrix and classification report we see that our model is equally good at detecting both classes. Precision Given a class prediction from a classifier how likely is it to be correct It is the number of correct positive results divided by the number of positive results predicted by the classifier. com basveeling pcam benchmark dataset. com 2019 02 18 breast cancer classification with keras and deep learning 5. com in soumya044 Abstract Importance Application of deep learning algorithms to whole slide pathology images can potentially improve diagnostic accuracy and efficiency. 680 color images 96 x 96px extracted from histopathologic scans of lymph node sections. Feature Engineering As per this kernel https www. create test_dir create test_images inside test_dir check that the directory we created exists Transfer the test images into image_dir source path to image destination path to image copy the image from the source to the destination len os. More about Evaluation Metrics here https towardsdatascience. h5 Save Best Epoch LR Scheduler Used here Plot training validation accuracy values Plot training validation loss values Here the best epoch will be used. listdir test_dir test_images Put the predictions into a dataframe This outputs the file names in the sequence in which the generator processed the test images. Histopathologic Cancer Detection Identification of Metastatic Tissue in Histopathologic Scans of Lymph Node Sections By Soumya Ranjan Behera https www. load_weights checkpoint. Confusion Matrix Classification Report Recall The classifier s ability to detect a given class. com vbookshelf cnn how to use 160 000 images without crashing 4. tif This function will extract the id 00006537328c33e284c973d7b39d340809f7271b split into a list split into a list Get the predicted labels. But we can use other deeper or pre trained models with higher availability of resources. It is the number of correct positive results divided by the number of all relevant samples all samples that should have been identified as positive. Furthermore the balance between task difficulty and tractability makes it a prime suspect for fundamental machine learning research on topics as active learning model uncertainty and explainability. Total Samples Available removing this image because it caused a training error previously removing this image because it s black take a random sample of class 0 with size equal to num samples in class 1 filter out class 1 concat the dataframes shuffle train_test_split stratify y creates a balanced validation set. Create a new directory Folder Structure create a path to base_dir to which we will join the names of the new folders train_dir val_dir create new folders inside train_dir create new folders inside val_dir Set the id as the index in df_data Get a list of train and val images Transfer the train images the id in the csv file does not have the. These deep learning models may have achieved better diagnostic performance than real pathologists but this will require evaluation in a clinical setting to measure its utility in diagnosis of lymph node metastases in tissue sections References 1. com c histopathologic cancer detection Author Soumya Ranjan Behera https www. For example running this by clicking run or pressing Shift Enter will list the files in the input directory Any results you write to the current directory are saved as output. oZo9D1Huxk091PMK1QJslQ checkpoint. Get the true labels Get the predicted labels as probabilities For this to work we need y_pred as binary labels not as probabilities Generate a classification report Folder Structure We will be feeding test images from a folder into predict_generator. com in soumya044 Feel free to connect LinkedIn https www. 9 ROC AUC value which is a quite good performance. add the filenames to the dataframe Create an id column A file name now has this format images 00006537328c33e284c973d7b39d340809f7271b. Original Data Set PatchCamelyon PCam https www. Major Outcomes The presence of specific metastatic foci and the absence vs presence of lymph node metastasis in a slide or image using receiver operating characteristic ROC curve analysis. csv Remove the test_dir to free up memory and commit our kernel successfully Conclusion The proposed deep learning model works good under Kaggle environments. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. Ju_WeWrdCHBebCvN AdSwFCZRJIm1Ru5gJkP v0jz212zkjh0ojBQ1uHu7Cv7eBXHx8xrBXQHAJpdEy8TQ59Z26Onub OkbUbWmto FcjuRGJfFHlxnehCU0fLVB3ZTye4beLcsar4TV_VlKHOic4QP0MW7ajdUimXs09qZhpwI. We were asked to predict a probability that the image has tumor tissue get the id column Delete the test_dir directory we created to prevent a Kaggle error. Breast cancer classification with Keras and Deep Learning CancerNet Architecture by Adrian Rosebrock https www. lla3iIArVKorEUKxxzzMxg. The images are labeled as 0 or 1 where 0 No Tumor Tissue and 1 Has Tumor Tissue s Exploratory Data Analysis Total Samples Available Create a DataFrame of all Train Image Labels Visualize some Train Images See the distribution of Train LabelsHere the Label 1 is 60 and Label 0 is 40 of the whole train images. Essentially it punishes extreme values. Diagnostic Assessment of Deep Learning Algorithms for Detection of Lymph Node Metastases in Women With Breast Cancer. tif extension therefore we add it here get the label for a certain image these must match the folder names source path to image destination path to image copy the image from the source to the destination Transfer the val images the id in the csv file does not have the. tif extension therefore we add it here get the label for a certain image these must match the folder names source path to image destination path to image copy the image from the source to the destination Note shuffle False causes the test dataset to not be shuffled Import Keras initializa model Add First Layer CONV ReLU Pooling Add Second Layer CONV ReLU Pooling Add Third Layer CONV ReLU Pooling FC ReLU FC Output initialize the model along with the input shape to be channels last and the channels dimension itself CONV RELU POOL CONV RELU POOL 2 CONV RELU POOL 3 first and only set of FC RELU layers softmax classifier return the constructed network architecture Edit Adagrad lr 1e 2 decay 1e 2 10 was used previous y wget https www. Kaggle allows a max of 500 files to be saved. Marsh s Kernel how to use 160 000 images without crashing https www. Each image is annoted with a binary label indicating presence of metastatic tissue. F1 Score The harmonic mean of the recall and precision. The original PCam dataset contains duplicate images due to its probabilistic sampling however the version presented on Kaggle does not contain duplicates. Remove our base_dir to free up some memory Make Test Predictions for Kaggle Move the Test images into a directory test_dir Extract ID field from Test Image file names Make Submission File Submission File Download Link. Rotation Equivariant CNNs for Digital Pathology. The PatchCamelyon benchmark is a new and challenging image classification dataset. PCam packs the clinically relevant task of metastasis detection into a straight forward binary image classification task akin to CIFAR 10 and MNIST. com vbookshelf cnn how to use 160 000 images without crashing we can balance the labels using Random Sampling and reduce the memory usage or potential crash. read_csv Input data files are available in the. There is a little imbalance here which we can rectify to get better performance. Take 80K images from both categories Split into Train and Validation Sets Put the two types of images into two folder to help Keras ImageGenerator Creating Directory Structure Transfer the respective images into their respective folders Create our Model CancerNet Specify optimizer and loss function Visualize our model architecture Model Architecture will be shown here when notebook will run otherwise see Output Visualization Section Model Training Define LR Scheduler and Save Model Checkpoint on Maximum Validation Accuracy Model Evaluation Compare Training and Validation Metrics We can determine our epochs based on the convergence of below graphs. Load the saved weights Validate the model Measure Model Performance Let s plot our ROC Curve We are getting around 0. JAMA The Journal of the American Medical Association 318 22 2199 2210. Objective Assess the performance of automated deep learning algorithms at detecting metastases in hematoxylin and eosin stained tissue sections of lymph nodes of women with breast cancer and compare it with pathologists diagnoses in a diagnostic setting. Models can easily be trained on a single GPU in a couple hours and achieve competitive scores in the Camelyon16 tasks of tumor detection and whole slide image diagnosis. com in soumya044 This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. com kf 10003609 eyJhbGciOiJkaXIiLCJlbmMiOiJBMTI4Q0JDLUhTMjU2In0. make a prediction Put the predictions into a dataframe. ", "id": "soumya044/histopathologic-cancer-detection", "size": "6440", "language": "python", "html_url": "https://www.kaggle.com/code/soumya044/histopathologic-cancer-detection", "git_url": "https://www.kaggle.com/code/soumya044/histopathologic-cancer-detection", "script": "mlxtend.plotting classification_report keras.layers Activation keras.models train_test_split confusion_matrix build sklearn.utils plot_model keras.preprocessing.image numpy MaxPooling2D seaborn SGD Dropout CancerNet Adam ImageDataGenerator BatchNormalization Dense keras.layers.normalization keras.callbacks roc_auc_score plot_confusion_matrix keras.optimizers keras.layers.convolutional ReduceLROnPlateau auc extract_id matplotlib.pyplot ModelCheckpoint Sequential shuffle sklearn.model_selection pandas Adagrad roc_curve Conv2D Net SeparableConv2D keras.utils keras.layers.core sklearn.metrics Flatten ", "entities": "(('function', 'predicted labels'), 'extract') (('Edit Adagrad 2 2 10', 'network constructed architecture'), 'extension') (('Validation We', 'graphs'), 'take') (('this', 'tissue sections'), 'achieve') (('i d', 'the'), 'extension') (('image', 'metastatic tissue'), 'annote') (('samples that', 'relevant samples'), 'be') (('learning proposed deep model', 'Kaggle environments'), 'remove') (('Data data', 'PatchCamelyon PCam https slightly modified github'), 'set') (('Confusion Matrix Classification Report', 'given class'), 'Recall') (('file name', 'format now images'), 'add') (('generator', 'test images'), 'listdir') (('com', 'potentially diagnostic accuracy'), 'improve') (('read_csv Input data files', 'the'), 'be') (('max', '500 files'), 'allow') (('y', 'validation balanced set'), 'take') (('It', 'classifier'), 'give') (('we', 'destination len os'), 'create') (('we', 'better performance'), 'be') (('we', 'memory usage'), 'com') (('it', 'learning model active uncertainty'), 'make') (('Marsh', 'https www'), 's') (('We', 'around 0'), 'load') (('d test_dir we', 'Kaggle error'), 'ask') (('you', 'output'), 'list') (('Train Images', 'train 1 0 whole images'), 'label') (('Models', 'tumor detection'), 'train') (('model', 'equally classes'), 'metric') (('Here best epoch', 'Plot training validation loss values'), 'save') (('PCam', 'akin CIFAR'), 'pack') (('It', 'python docker image https kaggle github'), 'com') (('PCam', 'trainable single GPU'), 'provide') (('We', 'predict_generator'), 'need') (('prediction', 'dataframe'), 'make') (('we', 'resources'), 'use') (('i d', 'the'), 'create') (('however version', 'duplicates'), 'contain') "}