{"name": "hpa public data download and hpacellseg ", "full_name": " h1 Downloading HPA public data h2 Update h1 Using HPA segmentation tool ", "stargazers_count": 0, "forks_count": 0, "description": "With 82495 77668 images 4 channels everything amounts to around 2. Each channel is approximately 8MB. The function to convert from label names to indexes is also added if you want to double check. For example https images. Warning These are raw full size images. As I mentioned in Single Cell Patterns https www. org 10005 921_B9_1_blue. We have 17 cell lines in the training set and test set. So if you want to download extra public data for training and downloading is too slow because of big size you probably want to consider Downloading just 17 cell lines 67k images 4 channels instead of 77. Please remove them so you don t have to download twice. All label names in the public HPA and their corresponding index. I have also added a column Label_idx. com CellProfiling HPA Cell SegmentationBelow is a demonstration of installing and using this segmentation tool on some of the downloaded images above. com lnhtrang single cell patterns notebook we merged some classes for this competition. 6k images Sampling according to label eg. jpg Using HPA segmentation toolFrom https github. Downloading HPA public data Update 2021 02 26 I indicated which images are in trainset in the column in_trainset. These were purposely created for visualization on HPA website. They are much smaller in size you will loose some info compared to tif file but maybe that s enough for your model. You have a lot of Nucleoplasm and Cytosol in the training set already so maybe you just need more rare labels Using jpeg images. To download jpeg simply change. Remove all images overlapping with Training set Remove all images with only labels that are not in this competition For nuclei For full cells post processing Visualizing the segmentation masks we just predicted above. ", "id": "lnhtrang/hpa-public-data-download-and-hpacellseg", "size": "1618", "language": "python", "html_url": "https://www.kaggle.com/code/lnhtrang/hpa-public-data-download-and-hpacellseg", "git_url": "https://www.kaggle.com/code/lnhtrang/hpa-public-data-download-and-hpacellseg", "script": "hpacellseg.utils hpacellseg.cellsegmentator matplotlib.pyplot tif_gzip_to_png add_label_idx download_and_convert_tifgzip_to_png pandas label_nuclei label_cell numpy ", "entities": "(('67k', 'instead 77'), 'be') (('6k', 'label eg'), 'image') (('also you', 'check'), 'add') (('everything', 'around 2'), 'image') (('I', 'Single Cell Patterns https www'), 'mention') (('we', 'competition'), 'com') (('We', 'training set'), 'have') (('we', 'segmentation masks'), 'remove') (('images', 'column'), 'download') (('already so maybe you', 'jpeg images'), 'have') (('so you', 'them'), 'remove') (('com CellProfiling HPA Cell SegmentationBelow', 'downloaded images'), 'be') (('These', 'HPA website'), 'create') (('maybe that', 'model'), 'be') "}