{"name": "in depth visualisations simple methods ", "full_name": " h1 Women and kids first c Titanic h1 Visualization of titanic dataset h1 1 Exploratory analysis h2 Basic Information about the table h2 1 1 Superficial overview of each variable h4 A citate from a movie Children and women first h2 1 2 Survival by Sex and Age h2 1 3 Survival by Class Embarked and Fare h2 1 3 1 Survival by Class and Embarked h2 1 3 2 Fare and class distribution h2 1 3 3 Class and age distribution h2 1 4 Survival rate regarding the family members h2 1 5 Survival rate by the title h2 1 6 Survival rate by cabin h2 1 7 Correlation of the variables h2 2 FEATURE SELECTION AND ENGINEERING h2 2 1 Impute values h2 2 2 ENGENEER VALUES h2 CLASSIFICATION h2 1 Random Forest h2 2 Logistic Regression h2 3 KNeighbours h2 4 Ensemble h2 5 XGBoost ", "stargazers_count": 0, "forks_count": 0, "description": "However the same fact does not hold for the girls. 183 samples have na values. First we check how many nas there is in general. A citate from a movie Children and women first. It shows the number of na values in each column. Four ML techniques are used to do prediction RandomForest LogisticRegression KNeighbours and the Ensemble. Women and kids first c Titanic Titanic https www. We will group the roalties and assign masters to Mr and due to the fact that there were not so many roaly women we will assign then to Mrs. com dims4 USNEWS 4f3cd50 2147483647 thumbnail 970x647 quality 85 url http 3A 2F 2Fmedia. The age is less than 12. As there are 681 unique tickets and there is no way to extract less detailed information we exclude this variable. For men of the same age the survival chances are flipped. However a high variation of survival rate appears once family size exceeds 4 as mothers daughters would search longer for the members and therefore the chanes for survival decrease. 1 Survival by Class and Embarked As noticed already before the class 1 passangers had a higher survival rate. As we have seen from describe there are too many unique values for Ticket and missing values for CabinConvert Pclass into categorical variableCreate dummy variables for categorical data. The more people they are the more managment is required. We will exclude this variable embarked Q. Exploratory analysis Basic Information about the tableAverage Age is 29 years and ticket price is 32. 2 Fare and class distribution It appears that the higher the fare was in the first class the higher survival chances a person from the 1st had. You can see that the age of of people with this title is less than 13. Embarked C has a higher survival rate. Women and roalties had higher survival rate. If there is only small amount then we can just exclude those individuals. Considering that there are 891 training samples 708 do not have missing values. There are 891 unique names but we could take a look on the title of each person to understand if the survival rate of people from high society was higher 1. For women the survival chances are higher between 14 and 40 age. 5 Survival rate by the title Barplots show that roalties had normally 1st or 2nd class tickets. jpg Visualization of titanic datasetThis notebook presents a profound exploratory analysis of the dataset in order to demonstrate different visualization techniques as well as provide understanding of the dependencies and interesting facts. There are different techniques one can impute the values. The mean of age should only be calculated on train set to avoid data leakage. In fact a title Master was given to unmarried boys. Embarked in Q as a 3rd class gave you slighly better survival chances than embarked in S for the same class. The third class had the same survival rate as the 3rd class embarked C. Logistic Regression 3. It is better to impute. 3 Class and age distribution Interesting note that Age decreases proportionally with the Pclass meaning most old passangers are from 1st class. Regarding the big families I would explain that it is hard to manage the whole family and therefore people would search for the family members insetad of getting on the boat. CLASSIFICATION 1. Majority from the 3rd class and most children from the 2nd class survived. and between 13 and 30 is lower. The younger people from 1st had higher survival chanches than older from the same class. Embarked fill embarked with a major classPclass because there is only one missing value in Fare we will fill it with a median of the corresponding PclassThere are several imputing techniques we will use the random number from the range mean std Check if we disrupted the distribution somehow. Sex Survival chances of women are higher. From crosstab we see that there were only 5 passengers in embarked Q with the 1st and 2nd class. However people with the title Master had mostly 3rd class. Pclass Having a first class ticket is beneficial for the survival. For example you want to impute the mean of age in the mussing values in test set. Alone men might want to sacrifice and help other people to survive. Check wich columns to impute in which set. 6 Survival rate by cabinCabin is supposed to be less distingushing also taking into consideration that most of the values are missing. 2 ENGENEER VALUESIntegrate into test the title featureSeperate young and adult peopleDrop broaden variables. All women who died were from the 3rd class. In fact there is a very high variation in survival rate in embarked Q among 1st and 2nd class. 1 Superficial overview of each variableJust a quick look on variables we are dealing with. Investigate who were masters. 7 Correlation of the variables Pclass is slightly correlated with Fare as logically 3rd class ticket would cost less than the 1st class. UPDATE1 XGBoost was addedUPDATE2 The calculation of the values to be imputed should ONLY be done on train set and not on test set or both. There are only two titlted women in the train class and both have survived I would put them into Mrs class The civils and reverends a lower one due to the fact that they had wanted to help people. FEATURE SELECTION AND ENGINEERING 2. Take it into consideration while engineering the variable we could specify a categorical variable as young and adult. The reasoning might be that alone people would want to sacrifice themselves to help others. It would be interesting to see if for instance the majority of Pclass 1 went on board in embarked C. 2 Survival by Sex and Age Survival rate of boys is higher than of the adult men. That explains large variation in survival rate and a perfect separation of men and women in Q. If you liked the Kernel please upvote Have fun with the data To get the full family size of a person added siblings and parch. I will happy to hear some remarks or suggestions and feel free to upvote if you like it Have fun with the data 1. Logistic Regression performed the best with a score of 0. The females traveling with up to 2 more family members had a higher chance to survive. 3 Survival by Class Embarked and Fare. 1 Impute valuesNB The calculation of values to impute should only be done on train set. XGBoost I will be happy to hear remarks or comments. SibSp and Parch middle size families had higher survival rate than the people who travelled alone or big families. Pclass is also slightly correlated with Survived SibSp and Parch are weakly correlated as basically they show how big the family size is. Random ForestThere are many categorical features so I have chosen random forest to do the classification. However if you had no family members you might wanted to help others and therefore sacrifice. We will construct a new feature Age Class to intefere the this findig. 4 Survival rate regarding the family membersAssumption the less people was in your family the faster you were to get to the boat. com 2F0e 2Fe187dd2f8f1fe5be9058fa8eef419e 2F7018FE_DA_080929titanic. ", "id": "jkokatjuhha/in-depth-visualisations-simple-methods", "size": "7245", "language": "python", "html_url": "https://www.kaggle.com/code/jkokatjuhha/in-depth-visualisations-simple-methods", "git_url": "https://www.kaggle.com/code/jkokatjuhha/in-depth-visualisations-simple-methods", "script": "plot_importance xgboost XGBClassifier cross_val_score numpy seaborn extract_cabin sklearn.neighbors prediction sklearn.linear_model matplotlib.pyplot sklearn.model_selection pandas RandomForestClassifier LogisticRegression scatter_matrix pandas.tools.plotting VotingClassifier KNeighborsClassifier GridSearchCV sklearn.ensemble StandardScaler sklearn.preprocessing ", "entities": "(('roalties', 'class normally 1st tickets'), 'show') (('However same fact', 'girls'), 'hold') (('most old passangers', '1st class'), 'distribution') (('you', 'person added siblings'), 'have') (('most', 'values'), 'suppose') (('We', 'Q.'), 'exclude') (('majority', 'embarked C.'), 'be') (('already class 1 passangers', 'survival higher rate'), 'Survival') (('3rd class', 'C.'), 'have') (('chances', '14 age'), 'be') (('XGBoost I', 'remarks'), 'be') (('mean', 'data leakage'), 'calculate') (('only small then we', 'just individuals'), 'exclude') (('roaly so many we', 'then Mrs.'), 'group') (('Majority', 'most 2nd class'), 'survive') (('ticket 29 price', 'tableAverage Age'), 'be') (('age', 'title'), 'see') (('Embarked', 'same class'), 'give') (('we', 'categorical data'), 'be') (('you', 'others'), 'however') (('That', 'Q.'), 'explain') (('Having', 'survival'), 'be') (('chances', 'same age'), 'flip') (('we', 'quick variables'), 'overview') (('ML Four techniques', 'prediction RandomForest LogisticRegression KNeighbours'), 'use') (('We', 'findig'), 'construct') (('Master', 'unmarried boys'), 'give') (('calculation', 'set'), 'UPDATE1') (('family members', 'boat'), 'explain') (('you', 'test set'), 'want') (('it', 'data'), 'happy') (('the faster you', 'boat'), 'be') (('who', '3rd class'), 'be') (('many categorical so I', 'classification'), 'be') (('family how size', 'Survived also slightly SibSp'), 'correlate') (('Impute calculation', 'train only set'), '1') (('people', 'others'), 'be') (('jpg Visualization', 'dependencies'), 'present') (('std we', 'distribution'), 'embark') (('younger people', 'older same class'), 'have') (('It', 'column'), 'show') (('we', '1st class'), 'see') (('class logically 3rd ticket', '1st class'), 'correlate') (('person', '1st'), 'fare') (('training 891 708', 'missing values'), 'consider') (('Sex Survival chances', 'women'), 'be') (('we', 'categorical variable'), 'specify') (('survival rate', 'high society'), 'be') (('different one', 'values'), 'be') (('we', 'variable'), 'exclude') (('2 Survival', 'adult men'), 'be') (('Logistic Regression', '0'), 'perform') (('mothers daughters', 'survival therefore decrease'), 'appear') (('However people', 'mostly 3rd class'), 'have') (('females', 'higher chance'), 'have') (('Women', 'survival higher rate'), 'have') (('they', 'people'), 'be') (('who', 'alone families'), 'have') "}