{"name": "intro to cnn using keras to predict pneumonia ", "full_name": " h1 The purpose of this exercise is to see how accurate of a Neural Network we can create to classify X Ray scans from patients with pneumonia h1 Let s start by Importing the required libraries h2 Let s set up the training and testing folders h2 Let s take a look at some of the pictures h1 Alright I don t know about you but I am no X Ray reading wizard but these don t look too off to me h1 Soooo h1 Have you ever wondered HOW and WHAT a computer sees h1 CONVOLUTIONAL NEURAL NETWORKS TO THE RESCUE h1 There you go all caught up No need to be scared If this looks intimidating don t worry it is pretty easy to implement h1 Convolutional Neural Networks are easy to build and run because of the deep learning libraries such as Keras h1 Now we are going to fit the model to our training dataset and we will keep out testing dataset seperate h1 This summary is a great way for us to see how our CNN is being set up h1 PHEW So we just built a CNN that can predict penumonia from X Ray scans WOOOOO h1 Let s take a look at the Confusion matrix and the Classification Report h1 Now let s see how accuracy changed over our training and Validation Set and also how our Loss function changed h1 What this means ", "stargazers_count": 0, "forks_count": 0, "description": "In the convolution operation we take a filter usually 2x2 or 3x3 matrix and slide it over the image matrix. The sensory input is transported to your brain. png Two of the most commonly associated words with CNN are stride and padding STRIDE Stride just means the amount a filter moves during a covolution operation. Rays of lights reflected off an object hit your retina. There is no need for a doctor or a health care provider to ponder these images to gauge things. After each convolution I will add a Pooling layer using max pooling. The second FC has only 1 unit becuase it needs to predict if someone has pneumonia. png https cdn images 1. val contains images which we will use to validate our model. I don t know about you but I am no X Ray reading wizard but these don t look too off to me. I will be working with some more bio medical imaging dataset just to get more practice and probably create some web applications online for atleast one of them forlinear algebra for plotting things Keras Libraries train Normal pic Load the images Let s plt these images let s build the CNN model 2nd Convolution 2nd Pooling layer Flatten the layer Fully Connected Layers Compile the Neural network Fitting the CNN to the images The function ImageDataGenerator augments your image by iterating through image as your CNN is getting ready to process that image Image normalization. There are two ways we can resolve this problem 1. com max 800 1 VVvdh BUKFh2pwDD0kPeRA 2x. The purpose of this exercise is to see how accurate of a Neural Network we can create to classify X Ray scans from patients with pneumonia. png We use different filters to pass over our inputs and take all the feature maps put them together as the final output of the convolutional layer. After the second convolutional layer we will add 2 Fully Connected layers which will take out feature map of an image and make predictions about it. gif This is a 2 D representation of calculations happening in 3 dimensions. This is because what they see are not pictures but numerical representaions of pixels describing these pictures. There are slight differences in the pictures but let s see if we can t create a Convolutional Neural Network which can create a more objective measure of quantifying and classifying these differences. So a stride of 1 means that the filter will slide 1 pixel after each covolution operation as shown in this animation. gif Let s take a look at the Confusion matrix and the Classification Report. The most commonly used one is max pooling which takes the maximum value in the window created by a filter. This significantly reduces the training time and preserves significant information. If this looks intimidating don t worry it is pretty easy to implement. Not go 250 000 in debt and train a Convolutional Nerual Network to tell me the differnces. Optimization functions are far too complex for me to get into in this post. com media 3ov9jG4eqz9k3XXsU8 giphy. The next step of our process involves further reducing the dimensionality of the data which will lower the computation power required for training this model. com media ChzfTLSi47FYc giphy. Overfitting is when your model gets a little too comofortable with the training data and can t handle data it hasn t see. gif CONVOLUTIONAL NEURAL NETWORKS TO THE RESCUEA Convolutional Neural Network is a special type of an Artificial Intelligence implementation which uses a special mathematical matrix manipulation called the convolution operation to process data from the images. com max 800 1 EuSjHyyDRPAQUdKCKLTgIQ. display when you call Keras. gif https cdn images 1. Now let s see how accuracy changed over our training and Validation Set and also how our Loss function changed What this means The world of medical imaging is ripe for a revolution in terms of deploying CNN based technologies. PADDING Padding is just zero value pixels that surround the input image. This protects the loss of any valuable information since the feature map is ever shrinking. com media l396ZJAsqbN5VX3O0 giphy. The above pictures are being generated randomly from the dataset. com max 800 1 vbfPq HvBCkAcZhiSTZybg. There are some obvious differences in the rib cage shape of the patient who has pneumonia vs someone who is normal. However other than that I can t tell anything else. Your brain then stores that association and you don t have to be taught this again. I am going to build a CNN that has 2 Convolution layers. The Network takes an input image and uses a filter or kernel to create a feature map describing the image. classes y_pred Accuracy Loss. This is not a shot at doctors or their jobs The task of reading these is incredibly menial and repititive. When we compile this CNN we will use the Adam optimization fuction which optimizes how fast our model learns the correct classification of the image. Now we are going to fit the model to our training dataset and we will keep out testing dataset seperate This summary is a great way for us to see how our CNN is being set up PHEW So we just built a CNN that can predict penumonia from X Ray scans WOOOOO https media. We then pass the output of this layer through a non linear activation function. The way we mammals and almost any other animal with two eyes and a developed brain sees is something as follows 1. test this contains the data that we use to test the model once it has learned the relationships between the images and their label Pneumonia Not Pneumonia Let s set up the training and testing folders. You know something is an umbrella because you look at it and someone told you that this specific object is called an umbrella. The coresponding numbers in both matrices are multiplied and and added to yield a single number describing that input space. confusion_matrix validation_generator. gif Let s start by Importing the required libraries Our data is located in three folders 1. This process is repeated all over the image. So while we see things in pictures a computer sees this https cdn images 1. Using TensorFlow backend. train contains the training data images for teaching our model. This can be seen in the following animation https cdn images 1. com max 800 0 iqNdZWyNeCr5tCkc. Computers learn see in not such a different way from us. They will however need to look and analyze thousands upon thousands of images before they can generalize and say that a yellow umbrella falls under the same category as a black umbrella. This is achieved by using a Pooling Layer. The most commonly used one is ReLU. com applied deep learning part 4 convolutional neural networks 584bc134c1e2 There you go. It runs on top of more low level libraries such as Tensorflow which is why you will usually see that message. Those are two things that AI technologies are great at. The brain after interpreting the input tells you what it sees. com media l0MYtoPNAQ0YCgNVe giphy. com media l3q2UyW34cT2rcgko giphy. org an intuitive guide to convolutional neural networks 260c2de0a050 The gifs animations are from this post https towardsdatascience. gif Convolutional Neural Networks are easy to build and run because of the deep learning libraries such as Keras Keras is a high level deep learning library. Let s take a look at some of the pictures. gif Have you ever wondered HOW and WHAT a computer sees The answer to that lies in mammilian physiology. com max 1600 1 cot55wd6gdoJlovlCw0AAQ. A convolution does this by multiplying two matrices and yielding a third smaller matrix. This is what is actually happening Source https cdn images 1. Go to Med school and learn the skills that are necessary to read these figures and make educated guesses as to what they mean. Also recall that your family was there to teach you what things are. This section was inspired by this post https medium. No need to be scared. https cdn images 1. The purpose of this data set is to prevent our model from Overfitting. ", "id": "sanwal092/intro-to-cnn-using-keras-to-predict-pneumonia", "size": "8920", "language": "python", "html_url": "https://www.kaggle.com/code/sanwal092/intro-to-cnn-using-keras-to-predict-pneumonia", "git_url": "https://www.kaggle.com/code/sanwal092/intro-to-cnn-using-keras-to-predict-pneumonia", "script": "MaxPooling2D numpy ImageDataGenerator classification_report keras.layers keras.models matplotlib.pyplot Dense load_img Sequential PIL confusion_matrix sklearn.metrics Flatten Conv2D keras.preprocessing.image Image ", "entities": "(('s', 'Confusion matrix'), 'let') (('association', 'don this'), 'store') (('I', 't anything'), 'tell') (('process', 'all image'), 'repeat') (('convolution', 'third smaller matrix'), 'do') (('that', 'Convolution 2 layers'), 'go') (('I', 'max pooling'), 'add') (('who', 'someone'), 'be') (('sensory input', 'brain'), 'transport') (('someone', 'pneumonia'), 'have') (('which', 'differences'), 'be') (('data', 'three folders'), 'let') (('AI technologies', 'two that'), 'be') (('train', 'model'), 'contain') (('two we', 'problem'), 'be') (('which', 'images'), 'be') (('s', 'pictures'), 'let') (('png We', 'convolutional layer'), 'use') (('max which', 'filter'), 'be') (('we', 'brain developed 1'), 'be') (('we', 'model'), 'contain') (('we', 'pneumonia'), 'be') (('it', 'don t'), 'worry') (('above pictures', 'randomly dataset'), 'generate') (('why you', 'usually message'), 'run') (('CNN', 'image Image normalization'), 'work') (('which', 'model'), 'involve') (('what', 'Source https cdn actually images'), 'be') (('gifs 260c2de0a050 animations', 'post https towardsdatascience'), 'org') (('don t', 'too off me'), 'know') (('computer', 'https cdn images'), 'see') (('it', 't see'), 'be') (('just amount', 'filter covolution operation'), 'png') (('We', 'non activation linear function'), 'pass') (('Rays', 'retina'), 'reflect') (('things', 'there you'), 'recall') (('This', 'significant information'), 'reduce') (('coresponding numbers', 'input space'), 'be') (('purpose', 'Overfitting'), 'be') (('value just zero that', 'input image'), 'be') (('deep learning libraries', 'Keras such Keras'), 'be') (('Computers', 'us'), 'learn') (('which', 'it'), 'add') (('feature map', 'valuable information'), 'protect') (('yellow umbrella', 'black umbrella'), 'need') (('it', 'what'), 'tell') (('how fast model', 'image'), 'use') (('that', 'X Ray scans WOOOOO https media'), 'go') (('doctor', 'things'), 'be') (('we', 'image matrix'), 'take') (('world', 'CNN based technologies'), 'let') (('This', 'animation https cdn following images'), 'see') (('far too me', 'post'), 'be') (('This', 'Pooling Layer'), 'achieve') (('There you', 'deep learning part 4 convolutional neural networks'), 'apply') (('task', 'these'), 'be') (('This', '3 dimensions'), 'gif') (('Network', 'image'), 'take') (('ever HOW computer', 'mammilian physiology'), 'wonder') (('they', 'what'), 'go') (('filter', 'animation'), 'mean') (('section', 'post https medium'), 'inspire') (('specific object', 'you'), 'know') (('see', 'pictures'), 'be') (('s', 'training folders'), 'test') "}