{"name": "intro to seismic salt and how to geophysics ", "full_name": " h1 Data Exploration h1 Train Model h1 Test Data h1 Prepare Submission ", "stargazers_count": 0, "forks_count": 0, "description": "Sand gets deposited on top of existing sand. com the showroom data for my thesis. org images 1 14 Ch05_fig0 1. I mentioned that seismic is kind of like ultrasound. This takes a while it s 18000 samples. A good starting point is this publication http www. We can draw heavily on other work instead of regurgitating the geophysics work that has been done before. Let s do it quick and dirty for now but eventually consider aliasing and all that fun. The U Net is basically looking like an Auto Encoder with shortcuts. Talk about biasing your data. It s just something to keep in mind while thinking about resolution. That has some physical implications but for now we don t have to deal with that. Set some parameters Get and resize train images and masks Check if training data looks all right Define IoU metric Build U Net model Get and resize test images Predict on train val and test Threshold predictions Create list of upsampled test masks Perform a sanity check on some random training samples if last run is unsaved i. The Society of Exploration geophysicist alone has over 10 000 publications with the keyword salt https library. First we ll need to get our data into a shape that works for U Nets. We can see that TGS chose to use very varied data by inspecting. So if you talk to cynic geophysicists you ll hear that deep learning better outperform the Chaos attribute. Seismic data is a neat thing. Code for automatic seismic interpretation can be found here https github. All of this is one to one from Ketil and does not differ from any of the other segmentation tasks. com wp content uploads 2016 08 Chopra_Marfurt_TLE_Aug2016 LowRes. com agile geoscience bruges Let s dive in for now. com keegil keras u net starter lb 0 277Let s throw a Unet at our data. I am blatanly stealing from Ketil at this point. The seismic itself is pretty old in the publication and you re dealing with data that is less noisy here which is nice. There is an entire research branch dedicated to salt tectonics that is the movement of salt in the subsurface. If you find you need some geophysical helpers you can import Bruges https github. Seismic Data with salt CC BY SA Yilmaz https wiki. Recently geoscience has started to adopt deep learning and it has seen a clear boom particularly in imaging salt. All credit goes to him and his nice code. One common seismic attribute is called chaos or seismic disorder. Salt bodies are important for the hydrocarbon industry as they usually form nice oil traps. We build models on one type of seismic and have no idea whether it generalizes. That is great and adresses a problem in deep learning geoscience at the moment. org wiki Salt flank_reflections and https wiki. You ll find sections on Salt in there as well https wiki. To give you the gist these salt diapirs form from salt layers somewhere else that were under much pressure. That means it should be a power of 2. Check them out to improve on this. This one isn t in keras but obviously we re stealing this one too from Ketil. com content documents Resource 20Center Articles INT_Imaging_Salt_tutorial_141101. I have written a bit about salt on my blog http the geophysicist. These can be seen like feature maps on the texture of the seismic. org wiki Salt flank_reflections media File Ch05_fig0 1. com crild facies_netYou will notice that these solutions load a specific SEG Y file which luckily we don t have to bother with. Interpretation on seismic images has long used texture attributes to identify better and highlight areas of interest. You can think of Earth as layered. org action doSearch AllField salt. Imaging salt has been a huge topic in the seismic industry basically since they imaged salt the first time. Building the sequential Model. Test DataFirst we ll get the test data. png Caption Figure 5. If you re running this on kaggle this is the point you want to have GPU support. These started to flow behave ductile and find a way into other layers above. 0 1 Conflicting dips associated with salt flanks a CMP stack without dip moveout correction b time migration of the stack in a c the stack with dip moveout correction d time migration of the stack in c. com bolgebrygg MalenoV https github. com waldeland CNN for ASI https github. However you can glean some information from them how to approach seismic data. For salt you will notice that the texture in the salt masks is rather chaotic where the surrounding seismic is more striped. We ll look at it again just to be sure. So there s a clear motivation to delineate salt bodies in the subsurface. A nice CSV with predictions. If you would like to do a deep dive you can see this publication https www. Prepare SubmissionWe need to prepare the submission. pdf Seismic data interpreters are used to interpreting on 2D or 3D images that have been heavily processed. That s great an algorithm we build will then know that patches exist entirely without salt. We re also sprinkling in some earlystopping to prevent overfitting. TGS provided some nice PNG files instead. Data ExplorationLet s look at some data. So I had a look at https www. You can imagine it like an ultra sound of the subsurface. Train ModelOur task just like the segmentation task for nuclei is evaluated on the mean IoU metric. In comes salt which is behaving very much unlike other rocks. Seismic data usually has wavelengths around 1m to 100m. However in an ultra sound we use much smaller wavelengths to image our body. org wiki Salt_flanks. We have many examples without salt as you can see by the masks that are entirely dark. The standard work of seismic data analysis https wiki. org wiki Seismic_Data_Analysis is open access. ", "id": "jesperdramsch/intro-to-seismic-salt-and-how-to-geophysics", "size": "5586", "language": "python", "html_url": "https://www.kaggle.com/code/jesperdramsch/intro-to-seismic-salt-and-how-to-geophysics", "git_url": "https://www.kaggle.com/code/jesperdramsch/intro-to-seismic-salt-and-how-to-geophysics", "script": "tnrange skimage.transform keras.layers keras.models keras array_to_img mean_iou Lambda keras.preprocessing.image numpy MaxPooling2D img_to_array ImageDataGenerator load_img backend as K tqdm_notebook chain keras.callbacks imread concatenate_images tqdm keras.layers.convolutional tensorflow skimage.io matplotlib.pyplot ModelCheckpoint backend resize pandas RLenc EarlyStopping skimage.morphology load_model Conv2D Model Conv2DTranspose concatenate Input keras.layers.core imshow label keras.layers.pooling keras.layers.merge itertools ", "entities": "(('they', 'oil usually nice traps'), 'be') (('that', 'masks'), 'have') (('last run', 'training random samples'), 'Set') (('deep learning', 'Chaos better attribute'), 'hear') (('it', 'particularly salt'), 'start') (('We', 'overfitting'), 'sprinkle') (('luckily we', 'which'), 'notice') (('These', 'other layers'), 'start') (('then patches', 'entirely salt'), 's') (('You', 'https in there as well wiki'), 'find') (('that', 'geophysics instead work'), 'draw') (('Code', 'https here github'), 'find') (('that', '2D images'), 'use') (('s', 'now eventually aliasing'), 'let') (('publication', 'www'), 'be') (('However you', 'how seismic data'), 'glean') (('obviously we', 'too Ketil'), 't') (('It', 'resolution'), 's') (('Train ModelOur task', 'IoU mean metric'), 'evaluate') (('I', 'point'), 'be') (('credit', 'him'), 'go') (('that', 'U Nets'), 'need') (('Society', 'keyword salt https library'), 'have') (('you', 'publication https www'), 'like') (('which', 'very much other rocks'), 'in') (('Interpretation', 'interest'), 'use') (('That', 'moment'), 'be') (('somewhere else that', 'much pressure'), 'give') (('Sand', 'existing sand'), 'deposit') (('Seismic data', 'usually wavelengths around 1 m to 100 m'), 'have') (('less here which', 'data'), 'be') (('you', 'GPU support'), 'run') (('that', 'subsurface'), 'be') (('TGS', 'very varied data'), 'see') (('it', 'idea'), 'build') (('basically they', 'salt'), 'be') (('You', 'subsurface'), 'imagine') (('I', 'geophysicist'), 'write') (('we', 'body'), 'use') (('you', 'Bruges https github'), 'find') (('com keegil u net lb 0 277Let', 'data'), 'keras') (('All', 'segmentation other tasks'), 'be') (('rather where surrounding seismic', 'salt masks'), 'notice') (('we', 'don that'), 'have') (('TGS', 'PNG nice files'), 'provide') (('These', 'seismic'), 'see') (('U Net', 'shortcuts'), 'look') (('1 Conflicting dips', 'c.'), '0') (('SubmissionWe', 'submission'), 'prepare') "}