{"name": "introduction eda ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "We have the same two unique data providers. We see that our training data is close enough to being evenly split between our two data providers. The only category involving Gleason pattern 5 which is present in the traning data at a rate of more than 2. These systems were not until this challenge tested with multi center datasets at scale. Generally the cases from karolinska are skewed towards the less severe end of the scale compared to radboud. The system suffers from significant inter observer variability while in some countries there is a lack of qaulified pathologists. We see in the above chart that there are comparatively few training examples for some of the most severe Gleason Patterns. We see that 1 training example with Gleason Pattern 4 3 is mapped to an unexpected ISUP grade. This chart confirms what we checked earlier with regards the differing labels of benign examples across our two data providers. We will also check that Gleason Patterns and ISUP Grades match for each training example. We see that over 25 of our data is benign ISUP grade 0 while another 25 is ISUP grade 1 the other 4 ISUP grades are present in our data at a rate in the range 11. png attachment Screen 20Shot 202020 04 08 20at 202. We will probably remove this example unless there is a very obvious mis labelling we can correct. This information may come in useful at future junctures in the design of this ML system. Screen 20Shot 202020 04 08 20at 202. We are provided with a labelled training set of 10 616 Whole Slide Images of prostate tissue biopsies. The Gleason Score directly leads to the ISUP grade as per figure 1. As mentioned in the challenge overview this is a truncated version of the test file full versions are available to notebooks upon submission. These tissue samples are examined by a pathologist and scored according to the Gleason grading system. Let us compute the likelihood that the Gleason Score is 4 5 given that 5 is one of the scores. Submissions will be scored based on their performance in predicting an ISUP grade for a hidden test set graded by expert pathologists. Let us now dig into the data further to check distribution of ISUP grades and Gleason Patterns both generally and comparing across providers. Let us now compare the relative distribution of ISUP grade by data provider. The training set for this challenge is the most extensive multi center dataset on Gleason grading available. We shall find now find the image id for this suspicious case and also ensure there are no other suspicious cases. Radboud labels benign examples as negative label while karolinska uses 0 0. Let us now check to ensure that Gleason patterns are mapped to ISUP grades as per figure 1. For example a biopsy that contains 60 Gleason 4 37 Gleason 3 and 3 Gleason 5 should get a score of 4 5 9. For details see Epstein 2016. Further the highest grade should always be part of the score. 1 the patterns present in a single biopsy are used to form a Gleason score e. 10616 image ids images can be loaded from this unique id and the corresponding data provider karoliska or radboud ISUP grade and Gleason Score which directly leads to the ISUP grade as per Figure 1. This may serve as a useful sanity check on model predictions. Biopsies recieve their Gleason grade according to the architectural growth patterns of the tumor Fig. References Ström Kartasalo 2020 Rohit Singh s Notebook https www. A training example from karolinska with Gleason score 4 3 but ISUP grade of 2. Let us now check how the distibrution of Gleason score s vary by provider. The minority pattern must account for at least 5 of the total area to be included e. Ok so that is the end of our exploratory data analysis we have isolated a mis labelled example discovered two differing labels for benign cases and gained an understanding about how our examples break down by data provider. Deep Learning systems have shown promise in accurately grading PCa. The weighted kappa penalises incorrect predictions more the further they lie from the correct ISUP value. png Exploratory Data Analysis Rohit Singh s Notebook listed in references was helpful for several aspects of this. com rohitsingh9990 panda eda better visualization simple baselineProstate Cancer PCa Grade assessment. We also see that benign slides have two different lables 0 0 or negative presumably this is due to variation in labelling by data provider. The code below confirms this. We also see more than twice as many 3 3 scores from karoliska than radboud. The quadratic weighted kappa is used to score submissions. There is just one suspicious case which we saw on the plot. We see above the first 5 rows and header row of our data. We see here that within the test data we are provided with image id and data_provider. A score of 1 represents a perfect submission with no errors on the test set while 0 represents a performance no better than chance. We also see our training data has shape 10616 x 3. While the opposite is true for Gleason score 4 3. More of our severe cases scores with 5 as minority or majority pattern come from radboud rather than karolinska. We see karaolinska provides more of the training examples with ISUP grade 0 or 1 while radboud provides more of the training examples with ISUP grade 3 4 or 5. There is a risk of missing cancers and a risk of overgrading resulting in unnecessary treatment. if pattern 3 is less than 5 the Gleason score 4 3 will instead be 4 4. To simplify slightly in the case of multiple different Gleason patterns being present the score is composed of the most frequently occurring pattern and the second most frequent pattern in the biopsy as judged by the pathologist. ", "id": "dararc/introduction-eda", "size": "5868", "language": "python", "html_url": "https://www.kaggle.com/code/dararc/introduction-eda", "git_url": "https://www.kaggle.com/code/dararc/introduction-eda", "script": "plot_relative_distribution seaborn matplotlib.image matplotlib.pyplot plot_count pandas numpy ", "entities": "(('system', 'qaulified pathologists'), 'suffer') (('i', 'image'), 'see') (('ISUP ISUP 1 other 4 grades', 'range'), 'see') (('Biopsies', 'tumor Fig'), 'recieve') (('We', 'Gleason most severe Patterns'), 'see') (('we', 'data two providers'), 'confirm') (('png Exploratory Data Analysis Rohit Notebook', 'this'), 'be') (('information', 'ML system'), 'come') (('We', 'radboud'), 'see') (('training example', 'ISUP 2'), 'score') (('data provider radboud ISUP Gleason corresponding which', 'Figure'), 'load') (('i', 'suspicious case'), 'find') (('We', 'header data'), 'see') (('training data', 'data enough evenly two providers'), 'see') (('tissue samples', 'Gleason grading system'), 'examine') (('full versions', 'submission'), 'be') (('score', 'pathologist'), 'compose') (('Gleason now patterns', 'figure'), 'let') (('Generally cases', 'radboud'), 'be') (('karolinska', 'negative label'), 'label') (('5 which', 'more than 2'), 'category') (('challenge', 'scale'), 'be') (('us', 'data provider'), 'let') (('0 0 presumably this', 'data provider'), 'be') (('We', 'tissue prostate biopsies'), 'provide') (('us', 'Gleason generally providers'), 'let') (('This', 'model predictions'), 'serve') (('0 radboud', '3 4'), 'see') (('3 less than 5 Gleason', '4 3'), 'be') (('We', 'ISUP Grades training example'), 'check') (('at least 5', 'e.'), 'account') (('quadratic weighted kappa', 'submissions'), 'use') (('We', 'data same two unique providers'), 'have') (('how examples', 'data provider'), 'ok') (('4 3', 'ISUP unexpected grade'), 'see') (('Submissions', 'expert pathologists'), 'score') (('minority pattern', 'rather karolinska'), 'score') (('Gleason Score', 'scores'), 'let') (('Gleason', '4 3'), 'be') (('Deep Learning systems', 'accurately grading PCa'), 'show') (('more the further they', 'ISUP correct value'), 'penalise') (('patterns', 'Gleason score e.'), 'use') (('0', 'better chance'), 'represent') (('Gleason Score', 'figure'), 'lead') (('training', 'most extensive multi Gleason'), 'be') (('training also data', '10616'), 'see') (('us', 'provider'), 'let') (('mis very obvious we', 'probably example'), 'remove') (('that', '4 5 9'), 'get') (('we', 'plot'), 'be') (('Further highest grade', 'always score'), 'be') "}