{"name": "kernel4a3b468030 ", "full_name": " h1 Определение стадии рака простаты по цифровой патологии биопсии h3 1 Что такое рак простаты h3 2 Диагностика и стадии рака простаты h3 3 Решение медицинских задач с помощью нейросетей h3 4 Связь биопсии и шкалы Глисона h3 5 Что такое ISUP h3 6 Как выглядит шкала Глисон в нашем датасете h1 Особенности данных присвоение баллов по шкале Глисон h1 EDA предобработка данных h2 Класс конфигуратор h3 Посмотрим теперь что лежит в датасете test csv h1 EDA анализ h1 Image EDA h2 1 Какой формат изображений нам предоставлен и как с ним работать h2 2 Зачем нам уровни levels изображения h2 3 Что такое понижающая Downsampling и повышающая Upsampling дискретизация при обработке изображений h1 Теперь посмотрим какую информацию мы можем получить из изображения после создания объекта Openslide h3 Выведем сразу несколько изображений с разными ISUP и gleason score h2 train laibel masks h3 1 Зачем нужна маска для изображения h2 Различение злокачественных и незлокачественных областей с помощью МАСКИ h2 Наложение масок на слайды h1 Тренировка модели h2 EfficientNet B3 Model h1 Преобразование изображения с помощью свертки карты фрагментов h1 Метрика качества модели ", "stargazers_count": 0, "forks_count": 0, "description": "BatchNorm2d planes 4 self. OpenSlide документация по ссылке https openslide. Изображение типа RGB красный зеленый синий использует три слоя для определения цвета один слой определяет крупномасштабное изображение некоторые типы изображений содержат более трех слоев. Доброкачественные предстательные железы со складчатым эпителием. fc2 x x self. Увеличение оценки участка на балл за меньший объем площади пораженных клеток. Upsampling повышающая дискретизация это увеличение пространственного разрешения при сохранении 2D представления. downsample is not None residual self. Значения маски зависят от поставщика данных Radboud железы предстательной железы имеют индивидуальную маркировку. AdaptiveAvgPool2d 1 self. Для каждого пикселя определены 3 уровня интенсивности по 1 для каждого цвета и вместе используя своего рода смешивание цветов они определяют цвет этих пикселей. Выводим изображения на экран подписываем свои изображения Here we compute the pixel spacing the physical size of a pixel in the image. Sequential OrderedDict layer0_modules self. Сейчас в здравоохранении начинают все шире использоваться технологии искусственного интеллекта в первую очередь в сфере диагностики по медицинским изображениям. size 0 1 x self. dropout x x x. В данном файле доступна информация по наименованию изображения биопсии оценке по шкале Глисон и стадии рака по ISUP. EfficientNet предобученная на ImageNet сеть. Таким образом сумма Глисона варьирует от 2 1 1 до 10 5 5 баллов. В нашем датасете учтены некоторые особенности оценки по шкале Глисон по доминирующему и вторичному типу опухолей два фрагмента с биопсии 1. Module Base class for bottlenecks that implements forward method. Изображения называют цифровой патологией. Это и называется системой оценок шкалой Глисона. К раковым относятся ткани простаты имеющие сумму Глисона выше 6. Module def __init__ self channels reduction super SEModule self. Создавая слишком глубокую слоистую сеть мы можем в какой то момент получить невысокие результаты. BatchNorm2d inplanes relu1 nn. База данных ImageNet проект по созданию и сопровождению массивной базы данных аннотированных изображений предназначенная для отработки и тестирования методов распознавания образов и машинного зрения. com qubvel efficientnet blob master efficientnet weights. inplanes planes groups reduction return nn. BatchNorm2d 64 relu1 nn. _make_layer block planes 512 blocks layers 3 stride 2 groups groups reduction reduction downsample_kernel_size downsample_kernel_size downsample_padding downsample_padding self. Применение цветовой карты устраняет проблему назначая каждой метке от 0 до 6 отдельный цвет. last_linear x return x def forward self x x self. Какой формат изображений нам предоставлен и как с ним работать Tagged Image File Format TIFF это формат растрового изображения с переменным разрешением разработанный Aldus ныне являющийся частью Adobe в 1986 году. Между биопсиями наблюдаются заметные различия в цвете Выведем сразу несколько изображений с разными ISUP и gleason_score train_laibel_masks 1. ImageNet Large Scale Visual Recognition Challenge Кампания по широкомасштабному распознаванию образов в ImageNet в рамках которого различные программные продукты ежегодно соревнуются в классификации и распознавании объектов и сцен в базе данных ImageNet. ReLU inplace True conv2 nn. Загрузим также все остальные стадии рака Каждый слайд имеет 3 слоя которые вы можете загрузить что соответствует понижению дискретизации на 1 4 и 16. BatchNorm2d planes block. to device models. pretrained_settings se_resnext101_32x4d pretrained initialize_pretrained_model model num_classes settings return model class CustomSEResNeXt nn. expansion num_classes def _make_layer self block planes blocks groups reduction stride 1 downsample_kernel_size 1 downsample_padding 0 downsample None if stride 1 or self. Module def __init__ self model_name se_resnext50_32x4d assert model_name in se_resnext50_32x4d super. IMAGE MASKS Selecting the level SELECTING R from RGB SELECTING BG SELECTING BENIGN LABELS train. Соответственно оценки по ISUP могут варьироваться от 6 3 3 1 стадия рака до 10 5 5 5 стадия рака. stride stride class SEResNeXtBottleneck Bottleneck ResNeXt bottleneck type C with a Squeeze and Excitation module. Что такое понижающая Downsampling и повышающая Upsampling дискретизация при обработке изображений Понижение частоты дискретизации и повышение частоты дискретизации две фундаментальные и широко используемые операции с изображениями. Однако при этом лишь стадии 3 4 и 4 3 не эквивалентны поскольку по первому большему по площади фрагменту опухоли присвоена оценка в 4 балла а вторичному 3 это третья стадия рака 3 балла по ISUP. com c prostate cancer grade assessment overview additional resources EDA предобработка данных. Conv2d width planes 4 kernel_size 1 bias False self. csv всего 10616 пациентов пустые значения отсутствуют дублированные записи по пациентам отсутствуют у каждого свой idкак и было описано всего два университета поставщика информации по данным2892 здоровых пациента остальные с заюолеваниями от 1 до 5 стадии рака в соответствии с баллами по ISUP Стоит обратить внимание что 3 4 и 4 3 равно как и 3 5 и 5 3 это разные значения потому что первая оценка присваивается фрагменту доминирующего типа раковых клеток вторая вторичному имеют разные площади сосредоточения 0 0 отсутствие рака. F1 score F мера среднее гармоническое precision и recall. AvgPool2d 7 stride 1 self. Попробуем загрузить и рассмотреть одну из биопсий image_id через OpenSlide. OpenSlide gives the resolution in centimeters so we convert this to microns. Для сжатия файлов TIFF можно использовать ряд методов включая алгоритмы Хаффмана и LZW. Между доброкачественными железами инфильтрируют маленькие железы. Downsampling это снижение пространственного разрешения при сохранении того же двухмерного 2D представления. Диагностика имеет очень важное значение в сфере лечения рака системы и тесты используемые для выявления заболевания особенно раннего спасают жизни людей помогая заблаговременно начать лечение и давая пациентам гораздо больше шансов на выживание. input_range settings input_range model. Обычное расширение TIFF также позволяет использовать изображения CMYK. pth ensemble_weight 1 ensemble model_name se_resnext50_32x4d model_weight. Conv2d planes 2 planes 4 kernel_size 3 stride stride padding 1 groups groups bias False self. На всех микрофотографиях видны пятна гематоксилина и эозина при 20 кратном увеличении линзы. format settings num_classes num_classes model. Спецификация TIFF легко расширяется хотя это происходит за счет некоторой переносимости. Итак что нам нужно сделать это взять файл изображения для чтения с помощью объекта openslide извлечь значения Red Level и затем применить к нему cmap. bn2 out out self. Индексированная и RGB т. Из существующего метода под названием Neural Architecture Search для автоматического создания новых сетей и своего собственного метода масштабирования авторы получают новый класс моделей под названием EfficientNets. Conv2d 3 64 3 stride 2 padding 1 bias False bn1 nn. load_state_dict model_zoo. Размеры каждого уровня различаются в зависимости от размеров исходного изображения. Conv2d inplanes planes kernel_size 1 bias False stride stride self. Ткань простаты преимущественно состоит из мышечных и железистых клеток а также из соединительной ткани. Биопсии могут быть представлена в разных расположениях. При этом isup 0 и данные train проверены патологами следовательно 0 0 и negative ничто иное как отсутствие рака https www. Авторы статьи предлагают новый метод составного масштабирования compound scaling method который равномерно масштабирует глубину ширину разрешение с фиксированными пропорциями между ними. Используем самую распространенную базовую метрику классификации Accuracy Metric так как она интуитивно понятна и очевидна доля правильных ответов созданного нами алгоритма. Более подробные сведения по ссылке https www. Допустимые значения 0 фон не ткань или неизвестно 1 строма соединительная ткань неэпителиальная ткань 2 здоровый доброкачественный эпителий 3 злокачественный эпителий Глисон 3 4 злокачественный эпителий Глисон 4 5 злокачественный эпителий Глисон 5 Karolinska регионы помечены. Шаблон Глисона 5 баллов может также содержать твердые листы или нити раковых клеток. relu out out self. В некоторых форматах изображений данные изображения имеют фиксированное количество возможных значений интенсивности. layer4 x return x def logits self x x self. model x return x model_name se_resnext50_32x4d model_weight. Precision можно интерпретировать как долю объектов названных классификатором положительными и при этом действительно являющимися положительными а recall показывает какую долю объектов положительного класса из всех объектов положительного класса нашел алгоритм. То есть каждая image_id и картинка к ней содержит скан ткани пациента с биопсии возможно отснятая под разным углом с разным разрешением но один. У пациента хирургическим путем извлекаются два наиболее характерных фрагмента предполагаемой опухоли. conv3 out out self. BatchNorm2d planes self. com c prostate cancer grade assessment overview additional resources. Поскольку файлы очень большие и существует так много возможных вариантов каждого типа файлов TIFF немногие веб браузеры могут отображать их без подключаемых модулей. Преобразование изображения с помощью свертки карты фрагментов Создание изображения после сверткипараметры нового изображенияСоздадим отдельный класс датасета под тренировкуСоздадим классВ обучении будет участвовать модель efficientnetB0_0Тренируем модель на подключенном виртуальном девайсеПроверка существования тренировочных изображенийПрименение предобученной сети к сформированному датасету подготовленных данных Метрика качества моделиДля оценки результатов исследования используем Accuracy и F меру. Имеет частичную потерю железистой дифференцировки. conv2 out out self. BatchNorm2d 64 relu2 nn. expansion 4 def __init__ self inplanes planes groups reduction stride 1 downsample None super SEResNetBottleneck self. features x x self. Они нужны нам для работы с определенной частью изображения неободимо различение клеток железистой и соединительной ткани насколько их контуры не похжи на нормальные насколько их стало меньше больше это и выявит стадию заболевания пациента. Чтобы упростить проверку масок мы сопоставляем метки int с цветами RGB с помощью цветовой палитры. pretrained_settings se_resnext50_32x4d pretrained initialize_pretrained_model model num_classes settings return model def se_resnext101_32x4d num_classes 1000 pretrained imagenet model SENet SEResNeXtBottleneck 3 4 23 3 groups 32 reduction 16 dropout_p None inplanes 64 input_3x3 False downsample_kernel_size 1 downsample_padding 0 num_classes num_classes if pretrained is not None settings config. Conv2d planes 4 planes 4 kernel_size 1 bias False self. CLASSES def forward self x x self. Sequential layers def features self x x self. append model разбиваем изображение биопсии на 16 частей. logits x return x def initialize_pretrained_model model num_classes settings assert num_classes settings num_classes num_classes should be but is. input_space settings input_space model. По состоянию на 2016 год в базу данных было записано около десяти миллионов URL с изображениями которые прошли ручную аннотацию для ImageNet в аннотациях перечислялись объекты попавшие на изображение и прямоугольники с их координатами. def forward self x residual x out self. Связь биопсии и шкалы Глисона. Посмотрим сколько пациентов существует с такими ошибками в нашем датасетеПосколько ошибчна всего лишь одна строка либо вместо 3 стадии рака присудили 2ю либо не 4 3 на самом деле удалим данные чтобы не путать модель Посмотрим теперь что лежит в датасете test. Conv2d inplanes planes 2 kernel_size 1 bias False self. Conv2d planes planes 4 kernel_size 1 bias False self. Предложенный нами метод показывает что компьютерное зрение наряду с молекулярным профилированием можно использовать при диагностике рака. layer3 x x self. _make_layer block planes 128 blocks layers 1 stride 2 groups groups reduction reduction downsample_kernel_size downsample_kernel_size downsample_padding downsample_padding self. fc1 x x self. Они представляют собой просто матрицы со значениями основанными на информации поставщика данных представленной выше вместо того чтобы содержать диапазон значений от 0 до 255 они увеличиваются только до максимума 6 представляя различные метки классов подробности о метках масок см. Цитоплазма бледная ядра маленькие и правильные. BatchNorm2d width self. Причины использования Файлы IFF большие и очень высокого качества. Доступны четыре типа базовых изображений TIFF двухуровневый черный и белый шкала серого палитра т. com hmendonca efficientnet pytorch https www. При развитии рака простаты в зависимости от стадии нормальная железистая ткань изображена на рисунке слева над цифрой 1 имеет бежевый оттенок деформируется и постепенно заменяется соединительной. html 6 баллов по шкале Глисона 1 балл ISUP 1 стадия рака 7 баллов по шкале Глисона 3 4 2 балла по программе ISUP 2 стадия рака 7 баллов по шкале Глисона 4 3 3 балла по программе ISUP 3 стадия рака 8 баллов по шкале Глисона 4 балла ISUP 4 стадия рака 9 10 баллов по шкале Глисона 5 баллов ISUP 5 стадия рака Если рака не обнаружено ISUP стадия рака имеет значение 0. Conv2d width width kernel_size 3 stride stride padding 1 groups groups bias False self. Система диагностирования рака по фотоснимкам на основе обученной нейросети в некоторых случаях показала лучшие результаты по сравнению с традиционными способами диагностики сообщила пресс служба МГУ имени Ломоносова 28 июля со ссылкой на статью в научном журнале Nature Cancer. pth ensemble_weight 1 model CustomSEResNeXt model_name ensemble model_name model. Цитоплазма часто темная а ядра увеличены с темным хроматином и некоторыми выступающими ядрышками. load ensemble model_weight map_location device model. Dropout dropout_p if dropout_p is not None else None self. Тренировка моделиБаза данных ImageNet проект по созданию и сопровождению массивной базы данных аннотированных изображений предназначенная для отработки и тестирования методов распознавания образов и машинного зрения. com ru post 498168 https www. pyСоздадим отдельные классы EfficientNet в которых будем обращаться по ссылкам к приложенным предобученным экземплярам моделей данной трансферной сети. 000 пикселей по осям x и y. org api python является очень удобным инструментом для работы с такими изображениями Преимущество OpenSlide в том что мы можем загружать произвольные области слайда не загружая в память все изображение. Для этого создадим функцию которая позволяет печатать увеличенные и не масштабированные изображения рядом а также всю информацию которая может быть получена из них. csv содержится информация сразу по двум оцененным по шкале Глисон участкам которая представляется в виде суммы балллов. Это дает 256 возможных уровней интенсивности. downsample downsample self. org ru ImageNet подробное описание EfficientNet B3 ModelДля предобработки данных мы использовали трансферное обучение метод машинного обучения при котором используют предварительно обученную нейронную сеть для решения аналогичной ранее поставленной перед ней проблемы. load_url settings url model. В строме видны рассеянные единичные раковые клетки. Железистая структура характерная для здоровой ткани простаты постепенно утрачивается с увеличением баллов и клетки приобретают нечеткие размазанные контуры. com c prostate cancer grade assessment overview additional resources Необходимо заметить что в нашем признаке gleason_score фигурирует помимо 0 0 рак отсутствует вариант negative причем только данные учреждения randbound. В нашем датасете train. Загрузим необходимые библиотеки и используем прямую загрузку всех необходимых данных для задачи напрямую с kaggle Класс конфигураторСоздадим отдельный класс config который задает параметры для 1 device виртуальное устройство из инфраструктуры kaggle чтобы использовать это устройство в качестве исполняемого 2 ширины и высоты изображения3 количество фрагментов изображения4 количество фич получаемых на выходе после свертки каждого слоя 6 5 режим дебага для проведения отладки Посмотрим на основной датасет train. Используем изображения которые мы рассмотрели ранее с разными баллами и стадиями рака также нормальную ткань Добавим условие визуализировать маску если она есть Различение злокачественных и незлокачественных областей с помощью МАСКИПри визуализации маски необходимо учитывать что маски разные для разных поставщиков данныхТеперь когда у нас есть функция давайте визуализируем Наложение масок на слайдыТеперь когда мы узнали как визуализировать маски и отображать их рядом давайте наложим их друг на друга. Есть также некоторые плохо сформированные маленькие железы и некоторые сросшиеся железы. Фрагмент опухоли сканируют и оцифровывают. Sigmoid def forward self x module_input x x self. Например изображение может быть определено как uint8 8 битное целое число без знака что означает что каждый пиксель может иметь значение интенсивность от 0 до 255 и каждая интенсивность является целым числом целым числом в этом диапазоне. expansion kernel_size downsample_kernel_size stride stride padding downsample_padding bias False nn. Каждый слайд нашего изображения биопсии имеет 3 уровня которые можно загрузить что соответствует понижению дискретизации на 1 4 и 16. Экспертная оценка врача остается стандартом для того чтобы поставить окончательный диагноз однако компьютеры уже сейчас способны помогать в решении этих задач отметил представитель международного коллектива ученых ведущий специалист Европейского института биоинформатики EMBL EBI Мориц Герштунг. inplanes planes block. Что такое рак простатыРак простаты карцинома простаты один из самых распространенных видов злокачественных опухолей у мужчин который развивается из клеток предстательной железы. Все они включены в шаблон Глисона 4х баллов. TIFF очень распространен для передачи цветных или полутоновых изображений в приложения для макета страницы но он менее подходит для доставки веб контент. Изображения RGB могут содержать до 16 7 миллиона цветов. Не имеет потери железистой дифференцировки. com c prostate cancer grade assessment overview additional resources Особенности данных присвоение баллов по шкале Глисон. Самая высокая оценка всегда должна быть частью оценки. Теперь посмотрим какую информацию мы можем получить из изображения после создания объекта Openslide. Другой способ интерпретировать это слои. Допустимые значения 1 фон не ткань или неизвестно 2 доброкачественная ткань строма и эпителий вместе 3 злокачественная ткань строма и эпителий вместе посмотрим на какую нибудь маску Информация метки хранится в красном R канале другие каналы установлены на ноль и могут игнорироваться. Используя небольшую вспомогательную функцию мы можем отобразить некоторую основную информацию о маске. Степень изменения клеток двух исследуемых участков измеряется по шкале от 1 до 5 чем более характерны изменения тем более агрессивна злокачественная опухоль тем большая стадия заболевания раком. Два датасета обучающий и тестовый train. Аденокарцинома предстательной железы 5 баллов по шкале Глисона. Есть попытка сформировать просвет но опухоль не может сформировать полноценные хорошо развитые железы. train_label_masks Маски сегментации показывающие какие части изображения привели к оценке ISUP. Поскольку маски имеют тот же размер что и слайды мы можем накладывать маски на ткань чтобы сразу увидеть какие области являются злокачественными. В соответствии с действующими рекомендациями Международного общества урологической патологии ISUP баллы по Глисону суммируются в баллы ISUP указывающие на стадии рака по шкале от 1 до 5 в соответствии со следующим правилом 3 и 4 балла пограничные значения для более подробного ознакомления по расчету баллов можно воспользоваться ссылкой http www. Маски не являются данными изображения как WSI. Даже сжатые файлы TIFF обычно намного больше чем аналогичные файлы GIF или JPEG. Подробное описание по ссылке https www. BatchNorm2d planes 2 self. База данных с аннотацией и URL изображений от третьих лиц доступна непосредственно через ImageNet но при этом сами изображения не принадлежат проекту. OpenSlide дает разрешение в сантиметрах поэтому мы конвертируем его в микроны Выведем на экран увеличенное изображение не увеличенное изображение 0005f7aaab2800f6170c399693a96917 1 7000 15000 image_info ffb16f062dfe8fd1161eb29ad1bd80ab 0 2800 17500 0005f7aaab2800f6170c399693a96917 0 7000 15000 image_info 003046e27c8ead3e3db155780dc5498e 0 17000 5600 image_info ffb16f062dfe8fd1161eb29ad1bd80ab 0 2800 17500 0005f7aaab2800f6170c399693a96917 0 7000 15000 image_info ff3667b139539475d4de2aa1b2325c82 0 15000 2500 image_info 003046e27c8ead3e3db155780dc5498e 0 17000 5600 image_info ffb16f062dfe8fd1161eb29ad1bd80ab 0 2800 17500 0005f7aaab2800f6170c399693a96917 0 7000 15000 image_info 00bbc1482301d16de3ff63238cfd0b34 0 3000 8000 image_info ff3667b139539475d4de2aa1b2325c82 0 15000 2500 image_info 003046e27c8ead3e3db155780dc5498e 0 17000 5600 image_info ffb16f062dfe8fd1161eb29ad1bd80ab 0 2800 17500 0005f7aaab2800f6170c399693a96917 0 7000 15000 image_info 0068d4c7529e34fd4c9da863ce01a161 0 4000 8500 image_info 00bbc1482301d16de3ff63238cfd0b34 0 3000 8000 image_info ff3667b139539475d4de2aa1b2325c82 0 15000 2500 image_info 003046e27c8ead3e3db155780dc5498e 0 17000 5600 image_info ffb16f062dfe8fd1161eb29ad1bd80ab 0 2800 17500 0005f7aaab2800f6170c399693a96917 0 7000 15000 image_info 0018ae58b01bdadc8e347995b69f99aa 0 1000 8000 image_info 0068d4c7529e34fd4c9da863ce01a161 0 4000 8500 image_info 00bbc1482301d16de3ff63238cfd0b34 0 3000 8000 image_info ff3667b139539475d4de2aa1b2325c82 0 15000 2500 image_info 003046e27c8ead3e3db155780dc5498e 0 17000 5600 image_info ffb16f062dfe8fd1161eb29ad1bd80ab 0 2800 17500 0005f7aaab2800f6170c399693a96917 0 7000 15000 Здесь мы вычисляем интервал между пикселями физический размер пикселя в изображении OpenSlide дает разрешение в сантиметрах поэтому мы преобразуем его в микроны. bn3 out if self. Размеры каждого уровня различаются в зависимости от размеров исходного изображения. load_state_dict torch. Имеет почти полную утрату железистой дифференцировки. loc image data_provider karolinska ax 0. loc image data_provider Create alpha mask Отображение 0 фон не ткань или неизвестно 1 соединительная ткань 2 здоровый эпителий 3 Gleason 3 4 Gleason 4 5 Gleason 5 Отображение 0 фон не ткань или неизвестно 1 доброкачественная 2 рак we are in validation part orig image has shape 3 1024 1024 converting to 1024 1024 3 Загружка изображения конечного class SEModule nn. Базовые изображения TIFF легко переносимы их понимают большинство графических приложений настольных издательских систем и текстовых редакторов. sigmoid x return module_input x class Bottleneck nn. Sequential nn. Диагностика и стадии рака простатыДля того чтобы установить наличие рака простаты и определить его стадию пациенту необходимо провести диагностику включающую в себя сдачу крови из вены на ПСА простато специфический антиген а если негативные результы в анализах подтверждаются далее проводится УЗИ Ультразвуковое исследование простаты БИОПСИЯ забора тканей простатыБиопсия проводится по показаниям после ПСА и УЗИ. Эти маски предназначены для помощи в разработке стратегий для выбора наиболее полезных подвыборок изображений. А в преклонном возрасте после 75 лет рак предстательной железы находят у одного из восьми мужчин. Эти маски прямо указывают какие части ткани являются здоровыми а какие злокачественными. expansion 4 def __init__ self inplanes planes groups reduction stride 1 downsample None base_width 4 super SEResNeXtBottleneck self. Поэтому используют уменьшение разрешения для больших возможностей распознавания и работы с данныеми. DATA visualization Metrics DEBUG True поскольку тестовые картинки для данного соревнования формируются в debag режиме для дипломной работы взяты тренировочные все за исключением 500 последних изображений биопсии для тестовых последние 500 из этого же файла Здесь мы вычисляем интервал между пикселями физический размер пикселя изображения. com hmendonca efficientnet pytorchhttps github. Она измеряет количество верно классифицированных объектов относительно общего количества всех объектов. С 2010 года ведётся проект ILSVRC англ. Железы сгруппированы вместе. loc image_mask data_provider karolinska SELECTING CANCEROUS LABELS elif train. ReLU inplace True layer0_modules. dropout is not None x self. avg_pool x x self. input panda open models resnext50_0. Тестовыми данными являются последние 500 строк тренировочными остальные более 10000. com ru company ods blog 328372 Accuracy Metric. Баллы по каждому из двух исследуемых участков опухоли складываются. loc image_mask data_provider radboud SELECTING NON CANCEROUS LABELS if train. Если же ситуация обратная и вторичная опухоль имеет оенку 3 а большая по пллощади первая 4 это 2 стадия ракаПодробное описание по ссылке https www. Обычно она используется для увеличения небольшой области изображения и для устранения эффекта пикселизации который возникает когда изображение с низким разрешением отображается на относительно большом кадре. Ссылки на статьи и репозиторий https habr. Для визуализации контуров железистой ткани материал пациента окрашивают гематоксилином и эозином H E Соединительная ткань приобретает оттенки цвета а железистая остается белыми и полупрозрачными просветами дырами а также разветвленными полостями. Conv2d channels reduction channels kernel_size 1 padding 0 self. relu x x self. stride stride class SENet nn. То есть 3 стадия рака по ISUP 4 3 где с 4 балла первый фрагмент 3 балла второй фрагмент меняется на 4 4 и автоматически зачисляется в 4 стадию рака по ISUP. Например биопсия содержащая 60 доминирующий тип первый участок оцененный на 4 балла по Глисону 37 вторичный тип второй участок оцененный на 3 балла по Глисону 3 третичный тип оцененный на 5 баллов по Глисону должна получить оценку 4 5 9. ReLU inplace True self. stride stride class SEResNetBottleneck Bottleneck ResNet bottleneck with a Squeeze and Excitation module. Conv2d planes planes kernel_size 3 padding 1 groups groups bias False self. __init__ self. csv EDA анализИтак посмотрим какие существуют варианты стадии в процентном соотношении и есть ли зависимость порядка по номеру картинки от стадииКонечно же в соответствии со статистикой заболеваемости пациентов рак встречается меньшего количества людей здоровых к счастью больше до 3000 с 1 стадией около 2600 чел а с разными тяжелыми случаями до 1500 пациенков на каждую стадию рака со 2й по самую тяжелую 5ю При этом больше данных по пациентам из университета karolinska по каждой стадии есть данные в процентном соотношенииПосмотрим по тому же самому принципу на распределение баллов по шкале ГлисонПоскольку стадия рака балл по ISUP напрямую определен оценкой по Глисону мы получили примерно те же самые графики визуализации Image EDAПерейдем к разбору изображений для последующего анализа картинок 1. А именно 3 4 2 стадия рака 4 3 3 стадия рака. floor planes base_width 64 groups self. bn1 out out self. Для этого мы загружаем и маску и биопсию и объединяем их с помощью PIL. 2 inplanes 128 input_3x3 True downsample_kernel_size 3 downsample_padding 1 num_classes 1000 super SENet self. std settings std def se_resnext50_32x4d num_classes 1000 pretrained imagenet model SENet SEResNeXtBottleneck 3 4 6 3 groups 32 reduction 16 dropout_p None inplanes 64 input_3x3 False downsample_kernel_size 1 downsample_padding 0 num_classes num_classes if pretrained is not None settings config. Это связанно с тем что первый участок биопсии берется с самой большей опухоли по площади где больше раковых клеток. Conv2d 3 inplanes kernel_size 7 stride 2 padding 3 bias False bn1 nn. se_module out residual out self. layer1 x x self. Промежуточные уровни могут быть созданы путем понижения дискретизации с более высоким уровнем разрешения. Зачем нужна маска для изображенияПомимо метки уровня слайда присутствующей в файле csv почти все слайды в обучающем наборе имеют связанную маску с дополнительной информацией метки. Посмотрим теперь на 1 стадию ракаОпят видим значительные различия в цвете по поставщику информации. model se_resnext50_32x4d pretrained None self. set_title background data_provider train. Conv2d channels channels reduction kernel_size 1 padding 0 self. BatchNorm2d inplanes relu3 nn. Вторичный фрагмент должен составлять от 5 до 50 всех пораженных клеток и если условие по каким о причинам не соблюдается и участок составляет менее 5 оценка по второму фрагменту увеличивается на один балл. inplanes planes groups reduction stride downsample self. Это наложение поможет нам определить различные модели роста. org ru ImageNet подробное описаниеEfficientNet класс новых моделей который получился из изучения масштабирования скейлинг scaling моделей и балансирования между собой глубины и ширины количества каналов сети а также разрешения изображений в сети. MaxPool2d 3 stride 2 ceil_mode True self. Поэтому когда вы пытаетесь визуализировать маску она будет казаться очень темной поскольку каждое значение близко к 0. Целевую переменную имеет только файл train_images. Следовательно мы можем заменить значение negative на 0 0 Как уже указывалось ранее в разделе по проблемам данных шкала Глисон при участках 3 4 и 4 3 имеет разные значения баллам по ISUP в то время как 3 5 и 5 3 а также 4 5 и 5 4 одинаковые. expansion 4 def __init__ self inplanes planes groups reduction stride 1 downsample None super SEBottleneck self. Каждое имеет расширение tiff file. Среди мужчин старше 60 лет болен уже каждый сотый. Решение медицинских задач с помощью нейросетей. Проверим еще раз на данных Рассмотрим еще раз подробно варианты присвоения баллов по вариантам 3 4 и 4 3 Видимо по какой то причине в данных существует ошибка не может быть 4 3 оценен во вторую стадию рака. train_images Цифровая патология изображения полученные на биопсии с двух участков опухоли. avg_pool x if self. Conv2d inplanes width kernel_size 1 bias False stride 1 self. Рассмотрим слайды с нормальной железистой тканью без рака по двум университетамЦвета и структура по двум университетам тканей отличаются. mean settings mean model. ReLU inplace True else layer0_modules conv1 nn. input_size settings input_size model. Это сязано с лабораторными процедурами. в описании набора данных. Сегодня поскольку цифровые технологии начинают предлагать новые и менее инвазивные стратегии борьбы с раком есть надежда что уже в обозримом будущем лечение рака перейдет на новую стадию развития и это коснется всего населения а не только людей обладающих значительными ресурсами. Многие приложения включают в себя собственные расширения но ряд независимых от приложений расширений распознается большинством программ. __init__ width math. Точно так же для шкалы серого может быть два уровня черный и белый. inplanes inplanes if input_3x3 layer0_modules conv1 nn. Аденокарцинома предстательной железы 4 балла по шкале Глисона. Палитра и полутоновые изображения ограничены 256 цветами или оттенками. На этой микрофотографии виден неправильный решетчатый рак то есть эпителиальные пласты с множественными просветами. downsample x out self. Определение стадии рака простаты по цифровой патологии биопсии. Эти маски предназначены для помощи в разработке стратегий выбора наиболее полезных подвыборок изображений. Зачем нам уровни levels изображения Размеры изображения биопсии довольно велики обычно от 5. conv1 x out self. expansion layers layers. Обычно он используется для уменьшения требований к хранению и или передаче изображений. relu out return out class SEBottleneck Bottleneck Bottleneck for SENet154. Conv2d 64 64 3 stride 1 padding 1 bias False bn2 nn. Как выглядит шкала Глисон в нашем датасете Так как к раковым относятся ткани простаты имеющие сумму Глисона выше 6 наш датасет распознает по каждому из двух участков ткани взятых на биопсии только три категории 3 4 и 5. expansion downsample nn. И при этом если человек болен то картинка имеет ва наибболее выраженных участка измененной железистой и соединительной тканей больший и меньший по площади соответственно больший по площади считается первичным участком и балл по нему в шкале записан первым а вторичный меньший балл по нему идет после символа вторым. Каждая эпителиальная единица обособлена и имеет просвет. It follows Caffe implementation and uses stride stride in conv1 and not in conv2 the latter is used in the torchvision implementation of ResNet. csv изначально расположены в одном файле train. Файлы TIFF могут быть сжаты а могут и не быть. Для выполнения задачи ML нам предоставлены следующие файлы с данными 1. Conv2d 64 inplanes 3 stride 1 padding 1 bias False bn3 nn. expansion for i in range 1 blocks layers. csv Обучающий и тестовый датасеты train. layer0 x x self. _make_layer block planes 64 blocks layers 0 groups groups reduction reduction downsample_kernel_size 1 downsample_padding 0 self. _make_layer block planes 256 blocks layers 2 stride 2 groups groups reduction reduction downsample_kernel_size downsample_kernel_size downsample_padding downsample_padding self. layer2 x x self. se_module SEModule planes 4 reduction reduction self. ReLU inplace True conv3 nn. Внешний вид желез составляет основу системы оценок Глисона. Аденокарцинома предстательной железы 3 балла по шкале Глисона. Module def __init__ self block layers groups reduction dropout_p 0. ", "id": "natalyayurina/kernel4a3b468030", "size": "25886", "language": "python", "html_url": "https://www.kaggle.com/code/natalyayurina/kernel4a3b468030", "git_url": "https://www.kaggle.com/code/natalyayurina/kernel4a3b468030", "script": "torch.nn.functional SEResNeXtBottleneck(Bottleneck) DataLoader CustomSEResNeXt(nn.Module) look_canser IPython.display plotly.express write_image carnser_or_normal accuracy_score Image OrderedDict numpy seaborn tqdm_notebook as tqdm initialize_pretrained_model find_canser EfficientNetB3(nn.Module) SENet(nn.Module) se_resnext101_32x4d f1_score check_for_images_dir plotly get_tiles tqdm_notebook torch.utils.model_zoo torch.nn Bottleneck(nn.Module) logits models image_info tqdm EfficientNet transforms mask_vizual torchvision config features SEModule(nn.Module) matplotlib.pyplot forward PIL mask_info pandas EfficientNetB0(nn.Module) _make_layer PANDADataset(Dataset) graph_objs as go graph_objs efficientnet_pytorch plotly.figure_factory torch.utils.data __len__ display Dataset __init__ SEResNetBottleneck(Bottleneck) se_resnext50_32x4d sklearn.metrics __getitem__ collections SEBottleneck(Bottleneck) ", "entities": "(('каждому участков ткани на биопсии из двух только', 'и 3 4 5'), 'выглядит') (('где балла 3 стадия рака по 4 3 с 4 балла первый фрагмент 3 второй', 'есть'), 'То') (('pyСоздадим отдельные в которых будем по', 'экземплярам моделей данной трансферной сети'), 'классы') (('На этой микрофотографии виден неправильный решетчатый рак', 'есть эпителиальные'), 'то') (('that', 'forward method'), 'class') (('255 и каждая является целым числом интенсивность целым', 'в этом диапазоне'), 'числом') (('Обычное', 'изображения позволяет использовать CMYK'), 'расширение') (('классифицированных объектов', 'всех общего количества объектов'), 'количество') (('Ткань простаты состоит и преимущественно мышечных железистых', 'из соединительной также ткани'), 'из') (('_ make_layer block', 'groups groups reduction downsample_padding downsample_padding 1 stride 2 self'), 'plane') (('опухоль', 'сформировать полноценные хорошо развитые железы'), 'просвет') (('на', 'в аннотациях перечислялись объекты ImageNet попавшие'), 'состоянию') (('они', 'в Глисона 4х шаблон баллов'), 'включены') (('и', 'быть'), 'не') (('kernel_size', '1 0 self'), 'padding') (('OpenSlide дает', 'в сантиметрах'), 'разрешение') (('pretrained', 'num_classes 1 downsample_padding 0 num_classes'), 'pretraine') (('Самая высокая', 'всегда должна быть частью оценки'), 'оценка') (('опухолей', 'фрагмента'), 'особенности') (('TIFF', 'приложения для макета страницы'), 'очень') (('классификации Accuracy Metric так как она интуитивно', 'и очевидна доля правильных ответов нами созданного алгоритма'), 'метрику') (('Поэтому используют', 'и работы'), 'уменьшение') (('Для', 'ряд методов включая алгоритмы Хаффмана и использовать LZW'), 'сжатия') (('и', 'аннотированных массивной базы изображений'), 'данных') (('ГлисонПоскольку стадия рака ISUP напрямую мы', 'EDAПерейдем'), 'EDA') (('больше на', 'заблаговременно начать особенно раннего спасают жизни людей помогая давая гораздо'), 'значение') (('inplanes planes groups reduction', 'nn'), 'return') (('типа RGB красный зеленый Изображение синий', 'определяет крупномасштабное изображение некоторые типы изображений содержат более'), 'использует') (('нами метод показывает что компьютерное Предложенный зрение', 'диагностике рака'), 'наряду') (('Европейского', 'биоинформатики EMBL EBI Мориц Герштунг'), 'стандартом') (('Если', 'ситуация обратная и вторичная'), 'оенку') (('тип Глисону должна 3 на 5 получить', '4 5 9'), 'содержащая') (('потому что', 'доминирующего типа раковых клеток вторая вторичному имеют площади первая присваивается сосредоточения'), 'всего') (('org ImageNet подробное', 'класс новых моделей'), 'ru') (('Палитра и полутоновые изображения', 'или 256 цветами оттенками'), 'ограничены') (('groups 3 1 groups', 'False self'), 'plane') (('и', 'одну из биопсий'), 'загрузить') (('ImageNet Large Scale Visual Recognition Challenge по широкомасштабному распознаванию', 'в'), 'Кампания') (('ISUP могут 3 6 3 1 стадия рака', '5 10 5 5 стадия рака'), 'оценки') (('5 баллов', 'листы или нити раковых также содержать твердые клеток'), 'Глисона') (('Среди', 'болен уже каждый 60 лет сотый'), 'мужчин') (('we', 'Загружка изображения конечного class SEModule 1024 3 nn'), 'image') (('без университетамЦвета рака и', 'двум университетам тканей по отличаются'), 'слайды') (('и эпителий злокачественная ткань и эпителий вместе на нибудь Информация метки хранится в красном R канале другие каналы на ноль и строма 3 строма могут', 'доброкачественная Допустимые значения 1 ткань или неизвестно 2 ткань'), 'не') (('blocks groups groups reduction 64 layers 0 reduction', '1 downsample_padding 0 self'), 'plane') (('рака Если 5 стадия рака', 'обнаружено ISUP стадия рака имеет'), 'баллов') (('Между доброкачественными железами инфильтрируют', 'железы'), 'маленькие') (('Conv2d inplanes', 'bias 2 kernel_size 1 False self'), 'plane') (('Поскольку маски имеют', 'размер что и'), 'тот') (('вычисляем между пикселями интервал физический', 'пикселя изображения'), 'visualization') (('Точно', 'два уровня и белый'), 'черный') (('причем только данные negative учреждения', 'gleason_score признаке помимо'), 'overview') (('Conv2d', '64 3 stride 1 padding 1 bias'), 'inplane') (('только людей обладающих значительными', 'ресурсами'), 'новые') (('se_resnext50_32x4d', 'None self'), 'pretraine') (('_ _ se_resnext50_32x4d', 'se_resnext50_32x4d'), 'assert') (('двухуровневый черный', 'четыре типа изображений Доступны базовых TIFF'), 'т') (('рисунке', 'цифрой'), 'при') (('МГУ', 'Ломоносова'), 'фотоснимкам') (('их рядом давайте наложим их друг на', 'и отображать'), 'которые') (('каждое', 'близко'), 'пытаетесь') (('Посмотрим сколько пациентов', 'Посмотрим теперь в путать модель что лежит датасете test'), 'существует') (('Для визуализации контуров железистой ткани материал пациента окрашивают', 'и эозином H E Соединительная ткань приобретает оттенки цвета остается белыми и полупрозрачными дырами железистая а'), 'гематоксилином') (('Биопсии могут быть', 'в разных расположениях'), 'представлена') (('Чтобы упростить проверку', 'сопоставляем метки int'), 'масок') (('Цитоплазма бледная ядра', 'и правильные'), 'маленькие') (('фич получаемых на выходе после свертки', 'Посмотрим на основной датасет train'), 'всех') (('память все', 'для работы'), 'инструментом') (('Conv2d', '4 planes'), 'plane') (('по 5 баллов шкале', 'предстательной железы'), 'Аденокарцинома') (('image_mask data_provider karolinska', 'CANCEROUS LABELS elif train'), 'select') (('загрузить', 'соответствует понижению'), 'слайд') (('В строме видны рассеянные', 'раковые клетки'), 'единичные') (('При этом', '0 и данные train проверены патологами'), 'isup') (('подготовленных данных Метрика', 'моделиДля оценки результатов исследования используем Accuracy и F меру'), 'изображения') (('все остальные стадии рака Каждый слайд вы можете также 3 слоя загрузить', 'соответствует понижению'), 'имеет') (('их понимают большинство', 'систем и текстовых редакторов'), 'переносимы') (('значениями основанными на', 'различные 6 представляя метки'), 'собой') (('Conv2d', 'False stride'), 'inplanes') (('ReLU True', 'conv1 else nn'), 'inplace') (('num_classes num_classes', 'num_classes settings'), 'logit') (('Цитоплазма часто темная а', 'темным и некоторыми выступающими увеличены с хроматином ядрышками'), 'ядра') (('это взять файл для помощью извлечь значения Red и сделать openslide затем', 'к нему cmap'), 'что') (('изображения', 'принадлежат проекту'), 'аннотацией') (('Промежуточные уровни', 'могут быть созданы путем с более уровнем высоким разрешения'), 'дискретизации') (('groups 1 groups', 'False self'), 'pad') (('присутствующей в файле csv почти все', 'дополнительной информацией с метки'), 'слайда') (('в разделе по данных шкала Глисон при имеет разные проблемам 3 4 4 3 значения', 'ISUP время по в то как'), 'мы') (('pretrained', 'num_classes 1 downsample_padding 0 num_classes'), 'setting') (('Спецификация TIFF', 'счет некоторой за переносимости'), 'легко') (('Тестовыми данными являются', 'тренировочными остальные 500 строк более'), 'последние') (('layers Sequential def', 'self self'), 'feature') (('1000 super SENet', '3 downsample_padding 1 num_classes'), 'inplanes') (('и', 'рака'), 'данном') (('оценен во 4 3 вторую', 'рака'), 'еще') (('растрового переменным разрешением разработанный Aldus', 'Какой изображений нам формат предоставлен'), 'как') (('глубину', 'фиксированными пропорциями между ними'), 'compound') (('Это наложение', 'различные модели роста'), 'поможет') (('BG', 'LABELS BENIGN train'), 'MASKS') (('expansion kernel_size', 'stride stride padding downsample_padding bias False nn'), 'downsample_kernel_size') (('Эти маски предназначены для в разработке стратегий', 'полезных наиболее подвыборок изображений'), 'помощи') (('А', '4 3 3 2 стадия рака 4 3 стадия рака'), 'именно') (('и клетки приобретают', 'размазанные контуры'), 'структура') (('причинам', 'фрагменту увеличивается на один 5 второму балл'), 'составлять') (('csv содержится информация двум по Глисон', 'участкам суммы представляется в виде балллов'), 'сразу') (('com ru company', 'Accuracy 328372 Metric'), 'ods') (('Между биопсиями наблюдаются', 'заметные Выведем в цвете сразу несколько изображений'), 'различия') (('stride groups 4 kernel_size 3 1 groups', 'False self'), 'plane') (('Module def _ _ init _ _ self block layers groups', 'dropout_p'), 'reduction') (('котором используют', 'поставленной перед ней аналогичной проблемы'), 'ru') (('Precision как объектов названных положительными и можно интерпретировать при', 'являющимися положительными а recall показывает какую действительно долю'), 'этом') (('Эти маски', 'части ткани являются здоровыми а указывают какие какие злокачественными'), 'прямо') (('на', 'большом кадре'), 'используется') (('Изображения', 'цифровой патологией'), 'называют') (('Conv2d planes', '4 kernel_size 1 bias'), 'plane') (('воспользоваться ссылкой', 'www'), 'соответствии') (('злокачественная', 'тем большая стадия заболевания раком'), 'клеток') (('pixel', 'image'), 'экран') (('Решение медицинских', 'помощью нейросетей'), 'задач') (('SEModule', 'reduction reduction 4 self'), 'plane') (('определяют они цвет', 'этих пикселей'), 'интенсивности') (('так много возможных вариантов каждого типа файлов TIFF', 'могут без веб браузеры отображать их подключаемых модулей'), 'существует') (('Баллы по', 'каждому из'), 'складываются') (('latter', 'ResNet'), 'follow') (('append model разбиваем', 'биопсии на 16 частей'), 'изображение') (('model num_classes initialize_pretrained_model settings', 'return model class CustomSEResNeXt nn'), 'pretraine') (('и выявит', 'заболевания пациента'), 'работы') (('Обычно', 'используется для уменьшения требований он к'), 'изображений') (('нему идет после символа', 'соединительной тканей и по первичным участком и нему и больший по площади соответственно площади считается по в'), 'этом') (('Посмотрим теперь', 'ракаОпят 1 видим'), 'стадию') (('и некоторые', 'железы'), 'маленькие') (('_ make_layer block blocks groups groups reduction 512 layers 3 stride 2 reduction', 'downsample_padding downsample_padding self'), 'plane') (('efficientnet hmendonca pytorchhttps', 'github'), 'com') (('Conv2d', 'False bn1 nn'), 'padding') (('Многие приложения', 'ряд от приложений'), 'в') (('Conv2d channels channels reduction kernel_size', '1 0 self'), 'padding') (('Conv2d 3 inplanes', '2 3 bias'), 'kernel_size') (('so we', 'microns'), 'give') (('Доброкачественные предстательные', 'складчатым эпителием'), 'железы') (('Маски', 'являются данными изображения как WSI'), 'не') (('_ make_layer block', 'stride groups groups reduction downsample_padding downsample_padding 2 2 self'), 'plane') (('УЗИ Ультразвуковое', 'тканей простатыБиопсия забора проводится'), 'установить') (('пораженных', 'оценки участка на балл'), 'клеток') (('Даже сжатые', 'намного аналогичные файлы или больше чем GIF JPEG'), 'обычно') (('форматах изображений данные изображения имеют В некоторых фиксированное', 'возможных значений интенсивности'), 'количество') (('это 3 стадия рака', 'по 3 ISUP'), 'стадии') (('скан ткани с биопсии возможно под картинка к ней содержит разным', 'разным разрешением но один'), 'то') "}