{"name": "learn to build an end to end data science project ", "full_name": " h1 Introduction h1 Libraries h1 Load Dataset h1 Missing data h1 Dealing with outliers h1 Panda Profiling h1 Categorcal features h1 Ordinal transofmraiton h1 One hot encoding h1 Bi Variate Analysis h1 Train Test Split h1 Save DataFrame in CSV file h1 Logistic Regression Model ", "stargazers_count": 0, "forks_count": 0, "description": "The business problem along with its scientific solution is focused around Fintech Industry which is erupting these days expect a lot of fun Refer this url for the full meduim article https medium. gusarova learn to build an end to end data science project for fintech part i e84bc542e92f Libraries Load Dataset Missing data Dealing with outliers Panda Profiling Categorcal features Ordinal transofmraiton One hot encoding Bi Variate Analysis sub_grade and loan_status annual_inc vs loan_status emp_length vs loan_status dti vs loan_status Train Test Split Save DataFrame in CSV file Logistic Regression Model This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. read_csv You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session Pandas options linear algebra loansr is a raw dataset containing 2 million of rows remove outlier annual income plot a chart to view to what extend outliers are removed remove outlier remove outlier remove outlier remove outlier remove outlier dropping passed columns convert annual_inc to integer data type create a new DataFrame for our processed data. com kaggle docker python For example here s several helpful packages to load data processing CSV file I O e. IntroductionThis series of articles walks you through end to end process to build a data science project based on a real business problem. ", "id": "mariiagusarova/learn-to-build-an-end-to-end-data-science-project", "size": "793", "language": "python", "html_url": "https://www.kaggle.com/code/mariiagusarova/learn-to-build-an-end-to-end-data-science-project", "git_url": "https://www.kaggle.com/code/mariiagusarova/learn-to-build-an-end-to-end-data-science-project", "script": "train_test_split pyplot pyplot as plt confusion_matrix numpy seaborn pandas_profiling sklearn.linear_model sklearn countplot ProfileReport MinMaxScaler metrics sklearn.model_selection pandas LogisticRegression matplotlib RandomizedSearchCV LabelEncoder sklearn.metrics sklearn.preprocessing ", "entities": "(('days lot', 'meduim article https full medium'), 'focus') (('IntroductionThis series', 'business real problem'), 'walk') (('It', 'kaggle python Docker image https github'), 'learn') (('outlier outlier outlier outlier passed columns', 'processed data'), 'write') "}