{"name": "live long ", "full_name": " h1 Q What Does Influence Life Expectancy the Most h1 The Best Matchers h2 Birth rate crude per 1 000 people h2 School enrollment secondary net h2 Agriculture value added of GDP h2 Combustive renewables and waste of total energy h2 Fixed telephone subscriptions per 100 people h2 Wholesale Price Index 2010 100 h2 Household final consumption expenditure per capita constant 2005 US h1 All Indicators Correlating at Least 50 h1 The End ", "stargazers_count": 0, "forks_count": 0, "description": "For the measure of statistical relationship I took determination coefficien by countries and years no aggregation. Country histogram is dreadful comparable number of countries have strong negative and strong positive correlation. Also yellow purple points in the high wage area shows it is years passing rather than wealth level that improves the result. There is a number of similar indicators fitting about the same e. Icons made by Freepik Roundicons Smashicons from www. The indicator is available for 203 countries only. different level school enrollments. ZS Combustible renewables and waste of total energy 0. loc i correlation year len year_data return corrs converts correlation into R sqared but of the same sign load data row and column sharing. Roughly there all the countries with at least 10 phone landlines per 100 people have at least 65 years life expectancy. Wealth only explains 41 of difference in life expectancy. steady reduction of agriculture fractin in world GDP 1. Or need further investigation for the criterion to tell positivey related countries form negatively related. DataFrame columns Correlation Year Count data get_two_indicators df iX iY i 0 for year in set data. Out of these 110 the majority fit perfect 80 to 100 most other fit at about 75 about 20 have weak positive or negative relationship 25 to 25 few have negative correlationGives a fresh look at the life long learning perspective. Relative abundance of old years dots in the lower left prompts the smaller contribution of agriculture is no guarantee for a better life expectancy. Top of the top indicators among those which cannot be attributed to sickness mortality things neither directly nor indirectly. Admission level of 80 and more assures at least 65 years life expectancy nomatter is it 1970ies or2010s. This is rather an artifact of several global trends coinciding. Less then 10 lines tell nothing can be anywhere between 40 and 80 years. For each of 1344 indicators available I calculated as follows 1. Combustive renewables and waste of total energy Wide spread of 45 to 75 years at almost entire domain of indicator values. Agriculture value added of GDP Looking at the spread width and not as good correlation I suggest this is merely a coincidence of two global trends 1. KD Household final consumption expenditure per capita constant 2005 US and moreNote the first five indicators correlate better than wealth the sixth row. Though country wise histogram looks good enough. The calculation processsing takes roughly half an hour. Calculated correlation1. Value2 i 1 corrs. 50 of agriculture and more assures life expectancy under 55 however in recent years there is a handful of countries reaching 50 see yelow dots On the other hand lower agriculture contribution says little expectancy can be anywhere between 40 and 75 years. Inner joined both by equality of country and year1. Out of 247 countries 100 countries fit nearly perfect 80 to 100 majority of others are 50 to 80 a handful of countries have weak positive correlation below 30 there are no countries with positive moderate or strong correlationBoth domain and range are wide making the tendency even more cinvincive. Filter country year value data for the indicator being tested1. Year Year if len year_data 2 correlation year_data. P2 Fixed telephone subscriptions per 100 people 0. All Indicators Correlating at Least 50 Either positively or negatively The EndThank you for reading Soft part imported libraries helper data processing functions helper visualization functions linear algebra data processing CSV file I O e. TODO Perform Ridge or Lasso multi vriate analysis with test set cross validationThen I listed the indicators sorted by absolute value of correlation large to small. DSE200x Mini Project Q What Does Influence Life Expectancy the Most What does help us to live longer or to die earlier Among hundreds of indicators in the data set let s find the most titghly bound to the life expectancy. I will describe only this one. Bornigly correlating indicators sorted out such as life expectancy by categories mortality rates etc. IN Birth rate crude per 1 000 people 0. And vice versa admission of 20 or less guarantees for expectancy under 65. Stored the indicator name as long as its correlation is at least 0. steady increase in the worldwide average of life expectany As both are naturally changing slow they are doomed to statistically fit. ZS Agriculture value added of GDP 0. For the Life Expectancy I took Life expectancy at birth total years indicator average for both genders. See the full list in the bottom. com Birth rate crude per 1 000 people Surprizingly and sad birth rate negatively correlates to life expectancy nearly as stron as various mortality rates see the full list in the bottom Histgram of correlations is also imressive. Fixed telephone subscriptions per 100 people Graph and histogram say indicator is positively and strongly bound to the life expectancy however it is far from linear. read_csv def years_coorelation df iX iY corrs pd. Year year_data data data. Open questions for possible futher investigation what does make exceptional countries with moderate positive relationship for each birth rate value still there is 20 years worth gap between top and bottom. NENR School enrollment secondary net 0. Overall the indicator is not that definitive and mostly controversial. On the other hand area of under 3 000 and over 70 years is densly populated. Filter country year value data for the life expectancy1. Sort of being poor is not being condemned. What does make those different School enrollment secondary net The biggest surprise of the paper. The Best Matchers Corr Detrmination Indicator Code Indicator Name 0. Please take a look below at the per country examples for how diverse the dependency is. Interestingly enough the tendency is still there in 2010s yellow dots Did anyone hear about the age of wireless phones Open question is it only about calling for ambulance in time Wholesale Price Index 2010 100 Correlation and country histogram look good Household final consumption expenditure per capita constant 2005 US Love is not the only thing money cannot buy you Almost anything above 3 000 per capita annually is all the same game between 70 and 80 years. ", "id": "subota/live-long", "size": "6908", "language": "python", "html_url": "https://www.kaggle.com/code/subota/live-long", "git_url": "https://www.kaggle.com/code/subota/live-long", "script": "math years_coorelation scatter_color matplotlib.pyplot signed_sqare pandas countries_coorelation copysign demo_indicators numpy ", "entities": "(('smaller contribution', 'life better expectancy'), 'prompt') (('I', 'genders'), 'take') (('however it', 'far linear'), 'say') (('naturally slow they', 'life'), 'increase') (('thing only buy', 'annually same 70 years'), 'be') (('what', 'still 20 years worth top'), 'question') (('correlation len year year_data', 'sign load data same row'), 'return') (('Admission level', 'life expectancy nomatter'), 'be') (('tendency', 'positive moderate'), 'fit') (('full list', 'correlations'), 'correlate') (('Filter country year value data', 'life'), 'expectancy1') (('helper data processing functions helper visualization imported functions', 'algebra data CSV file'), 'correlate') (('as long correlation', 'indicator name'), 'store') (('indicator', '203 countries'), 'be') (('I', 'years aggregation'), 'take') (('available I', '1'), 'calculate') (('this', 'merely two global trends'), 'value') (('s', 'life most titghly expectancy'), 'q') (('constant 2005 first five indicators', 'sixth row'), 'expenditure') (('secondary net', 'biggest paper'), 'make') (('little expectancy', 'agriculture other hand lower contribution'), 'be') (('Roughly there countries', 'years life at least 65 expectancy'), 'have') (('which', 'mortality sickness things'), 'top') (('Less then 10 lines', 'nothing'), 'tell') (('criterion', 'positivey related countries'), 'need') (('how dependency', 'country per examples'), 'take') (('Bornigly correlating indicators', 'categories mortality rates'), 'sort') (('wealth rather that', 'result'), 'show') (('dreadful comparable number', 'strong negative positive correlation'), 'be') (('Wealth', 'life expectancy'), 'explain') (('I', 'large small'), 'vriate') (('This', 'trends rather several global coinciding'), 'be') (('over 70 years', '3 under 000'), 'populated') (('majority fit', 'learning fresh life long perspective'), 'perfect') (('Inner', 'country'), 'join') "}