{"name": "machine learning algorithms for epileptic seizures ", "full_name": " h1 Intro Of This Notebook h1 Introduction Of Epileptic h1 Theoretical Background h1 EEG Data Recording h1 Discrete Wavelet Transform h1 Importing the libraries h1 Load the Dataset h1 Read and Show Dataset h1 Data Pre processing h2 What is Data Pre pocessing h2 1 Checking Missing Data h3 Note h1 Exploratory Data Analysis h2 What is Exploratory data analysis h1 Building Machine Learning Models h2 Splitting the Dataset into the Training set and Test set h2 Feature Scaling h1 1 Logistic Regression h1 2 Support Vector Machine SVM h1 Linear SVM h1 3 k Nearest Neighbors h1 4 Gaussian Naive Bayes h1 5 Artificial Neural Networks ANN h2 Modeling Artificial Neurons h2 Implementing Artificial Neural Networks h3 Initializing the ANN h3 Adding input layer and first hidden layer h3 Adding second hidden layer h3 Adding the output layer h3 Compiling the ANN h1 Principal Component Analysis PCA h1 Comparing Models h1 Conclusion h1 References ", "stargazers_count": 0, "forks_count": 0, "description": "The main goal of the dataset it s to be able to correctly identify epileptic seizures from EEG data so a binary classification between classes of label 1 and the rest 2 3 4 5. Modeling Artificial NeuronsArtificial neuron models are at their core simplified models based on biological neurons. So we can work very smoothly. These aren t the only type of neural network though. Support Vector Machine SVM Imgur https i. Choosing the right number of nodes and layers is important later on when optimising the neural network to work well a given problem. 128225 Introduction Of EpilepticEpilepsy is a serious brain illness that is an endemic neurological disorder all over the world. After these transformations extract data is applied input for Back propagation Naive Bayesian k Nearest Neighbor k NN Support Vector Machines SVM ANN Logistic Regression and Principal Component Analysis algorithms. The key to Artificial Neural Networks is that their design enables them to process information in a similar way to our own biological brains by drawing inspiration from how our own nervous system functions. This value is the average of the values of its k nearest neighbors. Artificial Neural Networks ANN Imgur https i. jpg As shown in the diagram above a typical perceptron will have many inputs and these inputs are all individually weighted. It is a representation of the examples as points in space mapped so that the examples of the separate categories are divided by a clear gap that is as wide as possible. Cases where the dependent variable has more than two outcome categories may be analysed in multinomial logistic regression or if the multiple categories are ordered in ordinal logistic regression. Distribution of breakdown coefficients in each sub band. The EEG signals that are contained by PCI MIO 16E DAQ card system that provides real time processing and is a data bus of computer signal processor and personal computer. k Nearest Neighbors Imgur https i. There are also feedback networks where its architecture allows signals to travel in both directions. The perceptron weights can either amplify or deamplify the original input signal. Initializing the ANN Adding input layer and first hidden layer Adding second hidden layer Adding the output layer Compiling the ANN Principal Component Analysis PCA Imgur https i. png Data preprocessing is a data mining technique that involves transforming raw data into an understandable format. Logistic Regression Imgur https i. Each file is a recording of brain activity for 23. We divided and shuffled every 4097 data points into 23 chunks each chunk contains 178 data points for 1 second and each data point is the value of the EEG recording at a different point in time. In order to assess the performance of the classifier we selected 500 EEG segments containing spike and wave complex artifacts and background normal EEG. The evaluation and treatment of neurophysiologic disorders are diagnosed with the electroencephalogram EEG. Both these two feature extraction methods are applied to the input of machine learning classification algorithms such as Artificial Neural Networks ANN Naive Bayesian k Nearest Neighbor k NN Support Vector Machines SVM Logistic Regression Principal Component Analysis. Data set represents of signals belong to several healthy and epileptic patients. For example if the input is 1 and the input s weight is 0. This allows them to capture the essence of how a biological neuron functions. For example if cancer is related to age then using Bayes theorem a person s age can be used to more accurately assess the probability that they have cancer compared to the assessment of the probability of cancer made without knowledge of the person s age. A step function will typically output a 1 if the input is higher than a certain threshold otherwise it s output will be 0. A naive Bayes classifier considers each of these features to contribute independently to the probability that this fruit is an apple regardless of any possible correlations between the color roundness and diameter features. png Naive Bayes classifiers are a family of simple probabilistic classifiers based on applying Bayes theorem with strong naive independence assumptions between the features. png Logistic regression or logit regression or logit model is a regression model where the dependent variable DV is categorical. Data preprocessing is a proven method of resolving such issues. Real world data is often incomplete inconsistent and or lacking in certain behaviors or trends and is likely to contain many errors. Comparing Models ConclusionThe aim of this study is to detect epileptic seizure using two different feature ex traction methods and comparison performance of various machine learning algorithms. com watch v sq0AhHtknBU. 6 seconds 173 Hz sampling frequency is illustrated with. So now lets take a look at what a perceptron looks like. In order to train our model let s define our independent variables X and our dependent variable y. So we have total 500 individuals with each has 4097 data points for 23. 128203 Exploratory Data Analysis 128505 What is Exploratory data analysis Imgur https i. Vascular causes traumatic causes infections and brain abscesses brain tumors nutritional deficiencies pyridoxine deficiency calcium metabolism disorders are lead causes for epilepsy. In addition to performing linear classification SVMs can efficiently perform a non linear classification using what is called the kernel trick implicitly mapping their inputs into high dimensional feature spaces. png Computers are great at solving algorithmic and math problems but often the world can t easily be defined with a mathematical algorithm. International 10 20 electrode placement system according to the data collected 12 bit analog digital conversion after the samples are recorded subsequently. Facial recognition and language processing are a couple of examples of problems that can t easily be quantified into an algorithm however these tasks are trivial to humans. As you can probably tell from the diagram it s called a feedforward network because of how the signals are passed through the layers of the neural network in a single direction. So the entire frequency range can be achieved in the optimum time frequency resolution 22 Continuous and discrete wavelet transform is analyzed in the scale and variation of parameters due to the continuous wavelet coefficients for each scale is difficult and time consuming. The maximum absolute value of coefficients in each sub band. 128204 Intro Of This NotebookThe aim of this study is to diagnose epileptic seizures by using different machine learning algorithms. com erayon seizures blob master seizures_. If k 1 then the object is simply assigned to the class of that single nearest neighbor. For this system LabView pro gramming language has been used and the EEG data used in 400 people who re ceived 200 of them are epilepsy and with 200 of them are normal. New examples are then mapped into that same space and predicted to belong to a category based on which side of the gap they fall. For example a fruit may be considered to be an apple if it is red round and about 10 cm in diameter. 128295 Building Machine Learning Models Splitting the Dataset into the Training set and Test set Feature Scaling 1. Each data point is the value of the EEG recording at a different point in time. png In statistics exploratory data analysis EDA is an approach to analyzing data sets to summarize their main characteristics often with visual methods. Transform the original n dimensional data points into k dimensions. It is a clinical result that occurs with abnormal neurological electrical discharging of brain. These weighted signals are then added together and passed into the activation function. Because the wavelet transform method changes large low frequency high frequency that is narrow for the window size. We usually refer to these artificial neurons as perceptrons. Because of classification accura cy is dependent on type of wavelet dominant frequency components of signals are determined according to the number of decomposition levels. Wavelet scale is divided into a number of points for x n process as seen in Fig. This article covers the case of a binary dependent variable that is where it can take only two values 0 and 1 which represent outcomes such as pass fail win lose alive dead or healthy sick. Implementing Artificial Neural NetworksSo now you re probably wondering what an artificial neural network looks like and how it uses these artificial neurons to process information. Calculate the covariance matrix X of data points. Wavelet coefficients contain important information about EEG signal that provide extraction of feature vector. In the case of support vector machines a data point is viewed as a p dimensional vector a list of p numbers and we want to know whether we can separate such points with a p 1 dimensional hyperplane. It is not a single algorithm for training such classifiers but a family of algorithms based on a common principle all naive Bayes classifiers assume that the value of a particular feature is independent of the value of any other feature given the class variable. The response variable is y in column 179 the Explanatory variables X1 X2. In the below code SVC stands for Support Vector Classification. So now we have 23 x 500 11500 pieces of information row each information contains 178 data points for 1 second column the last column represents the label y 1 2 3 4 5. png Principal Component Analysis PCA is a dimension reduction tool that can be used to reduce a large set of variables to a small set that still contains most of the information in the large set. com overview of exploratory data analysis with python 6213e105b00b To make this a binary problem let s turn the non seizure classes 0 while maintaining the seizure as 1. Epileptic Seizure Recognition Video https www. Often you have some questions in hand you try to validate those questions by performing EDA. png k nearest neighbors algorithm k NN is one of the simplest machine learning algorithms and is used for classification and regression. The results show that k NN ANN and SVM were the most efficient method according to test processing of both DWT and AR as feature extraction for recognition of epileptic seizures in EEG. The activation function is used to convert the input into a more useful output. EEG data set has acquired different age groups in this study. So for diagnosing of epileptic seizures from EEG signals are transformed discrete wavelet and auto regressive models. es 2014 papers IWBBIO_2014_paper_1. They are known epileptic with uncontrolled seizures and are admitted to the neurology department of the Medical Faculty Hospital of Dicle University1. Bayes theorem alternatively Bayes law or Bayes rule describes the probability of an event based on prior knowledge of conditions that might be related to the event. Standard deviation of coefficients in each sub band. The average absolute value of the ratio of adjacent bands. Statistical time frequency of EEG signals sequences are The average of the absolute value of coefficients in each sub band. 2 the input will be decreased to 0. For this purpose the frequency components of the EEG are extracted by using the discrete wavelet transform DWT and parametric methods based on autoregressive AR model. EEG signals are to ensure the accuracy of diagnosing disease that usually is taken 8 10 hours in the form of records. Epileptic Seizure Recognition Research Paper http iwbbio. The output depends on whether k NN is used for classification or regression In k NN classification the output is a class membership. EEG sig nals are used in section and 23. Gaussian Naive Bayes Imgur https i. 53 40 Hz band pass the EEG in the presence of clini cal interest for focusing range is provided. It is important that is selected appropriate wavelet decomposition level the number of detection and wavelet transform analysis of signals. We should note that there can be any number of nodes per layer and there are usually multiple hidden layers to pass through before ultimately reaching the output layer. 2 shows that how to acquire EEG data from a patient 1. 2 that is called multi resolution decomposition. Choose first k eigen vectors and that will be the new k dimensions. X178As we can see there are 178 EEG features and 5 possible classes. Suppose some given data points each belong to one of two classes and the goal is to decide which class a new data point will be in. The corresponding time series is sampled into 4097 data points. In this tutorial we re going to be looking at feedforward networks and how their design links our perceptron together creating a functioning artificial neural network. Data can be passed through the filter 0. This feature vector of EEG signals that are used as inputs for multi layer neural network classification. Calculate eigen vectors and corresponding eigen values. 5 4 Hz θ 4 8 Hz α 8 13 Hz and β 13 30 Hz. When data are not labeled supervised learning is not possible and an unsupervised learning approach is required which attempts to find natural clustering of the data to groups and then map new data to these formed groups. Data preprocessing prepares raw data for further processing. png Importing the libraries Load the Dataset Read and Show Dataset The original dataset from the reference consists of 5 different folders each with 100 files with each file representing a single subject person. Theoretical BackgroundThe aim of this study is to contribute to the diagnosis of epilepsy by taking advantage of the engineering. There are many different types of activation function but one of the simplest would be step function. The mean force coefficients of each sub band. 1 3 sequence is signal characteristic 4 6 sequence is that amount of frequency change. In k NN regression the output is the property value for the object. For in diagnosing epilepsy research is needed for better understanding of mechanisms causing epileptic disorders. jpg Each input from the input layer is fed up to each node in the hidden layer and from there to each node on the output layer. EEG Data RecordingEEG signals are separated into α β δ and θ spectral components and provide a wide range of frequency components. The EEG data used in our study were downloaded from 24 h EEG recorded from both epileptic patients and normal sub jects. Before we begin lets take a look at what a basic feedforward network looks like Imgur https i. For this reason discrete wavelet transform is used moreften than these non stationary signals. An object is classified by a majority vote of its neighbors with the object being assigned to the class most common among its k nearest neighbors k is a positive integer typically small. Sort the eigen vectors according to their eigen values in decreasing order. EEG is crucial for accurate classification of different forms of epilepsy. png Support Vector Machine SVM model is a Supervised Learning model used for classification and regression analysis. This makes them useful tools for solving problems like facial recognition which our biological brains can do easily. Checking Missing Data 128210 Note Thats great here is no missing value. I have one article on EDA https hackernoon. png Discrete Wavelet TransformWavelet transform is more advantageous spectral analyze method than other spectral analyze methods on non stationary signals. A statistical model can be used or not but primarily EDA is for seeing what the data can tell us beyond the formal modeling or hypothesis testing task. EEG spectrum contains some characteristic waveforms that fall primarily within four frequency bands as follows δ 0. The following bipolar EEG channels were selected for analysis F7 C3 F8 C4 T5 O1 and T6 O2. 128223 Data Pre processing What is Data Pre pocessing Imgur https i. In both cases the input consists of the k closest training examples in the feature space. You can say that EDA is statisticians way of story telling where you explore data find patterns and tells insights. Naive Bayes is a simple technique for constructing classifiers models that assign class labels to problem instances represented as vectors of feature values where the class labels are drawn from some finite set. The clustering algorithm which provides an improvement to the support vector machines is called support vector clustering and is often used in industrial applications either when data are not labeled or when only some data are labeled as a preprocessing for a classification pass. Epileptics Seziure Recognition Github s HelpNotebook https github. Epileptic seizures represent the most common positive signs and symptoms of brain disturbance and epilepsy is one of the most common primary brain disorders. ", "id": "harunshimanto/machine-learning-algorithms-for-epileptic-seizures", "size": "17800", "language": "python", "html_url": "https://www.kaggle.com/code/harunshimanto/machine-learning-algorithms-for-epileptic-seizures", "git_url": "https://www.kaggle.com/code/harunshimanto/machine-learning-algorithms-for-epileptic-seizures", "script": "keras.layers keras.models train_test_split sklearn.svm cross_val_score numpy seaborn Dense SVC LinearSVC GaussianNB sklearn.neighbors sklearn.naive_bayes sklearn.linear_model PCA matplotlib.pyplot Sequential sklearn.model_selection pandas LogisticRegression KNeighborsClassifier is sklearn.decomposition StandardScaler sklearn.preprocessing ", "entities": "(('that', 'feature vector'), 'contain') (('1 3 sequence', 'frequency signal characteristic 4 6 change'), 'be') (('that', 'layer network multi neural classification'), 'vector') (('we', 'complex artifacts'), 'select') (('weight', 'example'), 'for') (('NN ANN', 'EEG'), 'show') (('value', 'class variable'), 'assume') (('how it', 'information'), 'implement') (('perceptron', 'what'), 'take') (('you', 'EDA'), 'have') (('which', 'formed groups'), 'be') (('total 500 individuals', '23'), 'have') (('time Statistical frequency', 'sub band'), 'be') (('that', 'window size'), 'change') (('Data', 'further processing'), 'prepare') (('wavelet discrete transform', 'non stationary signals'), 'use') (('that', 'frequency primarily four bands'), 'contain') (('EEG', 'epilepsy'), 'be') (('exploratory data analysis EDA', 'often visual methods'), 'png') (('png Support Vector Machine SVM model', 'Learning Supervised classification analysis'), 'be') (('output', 'property object'), 'be') (('last column', 'label'), 'have') (('png Naive Bayes classifiers', 'features'), 'be') (('data mining that', 'understandable format'), 'be') (('them', 'neuron how biological functions'), 'allow') (('output', 'certain threshold'), 'output') (('we', 'p 1 dimensional hyperplane'), 'view') (('frequency components', 'AR parametric autoregressive model'), 'extract') (('inputs', 'many inputs'), 'have') (('What', 'Data Imgur https i.'), '128223') (('Choosing', 'well given problem'), 'be') (('they', 'gap'), 'map') (('weighted signals', 'activation then together function'), 'add') (('EEG following bipolar channels', 'analysis F7 C3 C4 T6 F8 T5 O1 O2'), 'select') (('Modeling Artificial NeuronsArtificial neuron models', 'biological neurons'), 'be') (('EEG data set', 'study'), 'acquire') (('activation function', 'more useful output'), 'use') (('class where labels', 'finite set'), 'be') (('deficiency calcium metabolism disorders', 'lead epilepsy'), 'cause') (('aim', 'comparison learning various machine algorithms'), 'Models') (('classification accura cy', 'decomposition levels'), 'be') (('output', 'k NN classification'), 'depend') (('that', 'large set'), 'be') (('s', 'variables independent X'), 'let') (('however tasks', 'humans'), 'be') (('2', 'patient'), 'show') (('that', 'records'), 'be') (('clinical that', 'brain'), 'be') (('k', 'most common k nearest neighbors'), 'classify') (('biological brains', 'which'), 'make') (('multiple categories', 'ordinal logistic regression'), 'analyse') (('evaluation', 'electroencephalogram EEG'), 'diagnose') (('s', '1'), 'overview') (('how design', 'together functioning artificial neural network'), 'go') (('s', '128210 Note'), 'check') (('feedforward how signals', 'single direction'), 'call') (('EEG RecordingEEG Data signals', 'frequency components'), 'separate') (('Seizure Recognition Research Epileptic Paper', 'iwbbio'), 'http') (('signals', 'directions'), 'be') (('data', 'formal modeling'), 'use') (('design', 'system how own nervous functions'), 'be') (('aren', 'neural network'), 't') (('response variable', 'column'), 'be') (('which', 'pass fail such win'), 'cover') (('it', 'red about 10 diameter'), 'consider') (('We', 'output usually multiple hidden ultimately layer'), 'note') (('code below SVC', 'Support Vector Classification'), 'stand') (('53 Hz 40 band', 'focusing range'), 'pass') (('often world', 'easily mathematical algorithm'), 'be') (('perceptron weights', 'input original signal'), 'amplify') (('EEG data', 'epileptic patients'), 'download') (('brain serious that', 'endemic neurological all world'), 'be') (('samples', '12 bit analog digital conversion'), 'system') (('feedforward basic network', 'Imgur https i.'), 'begin') (('feature extraction two methods', 'Artificial Neural Networks ANN such Naive Bayesian k'), 'apply') (('data point', 'time'), 'divide') (('200', 'them'), 'use') (('when only data', 'classification pass'), 'call') (('file', '23'), 'be') (('1 then object', 'single nearest neighbor'), 'assign') (('it', 'label'), 'goal') (('what', 'feature high dimensional spaces'), 'perform') (('data new point', 'class'), 'suppose') (('fruit', 'color roundness'), 'consider') (('wavelet 22 Continuous transform', 'scale'), 'achieve') (('that', 'k eigen first vectors'), 'choose') (('value', 'k nearest neighbors'), 'be') (('one', 'simplest'), 'be') (('input', 'feature space'), 'consist') (('represents', 'several healthy patients'), 'set') (('time corresponding series', 'data 4097 points'), 'sample') (('aim', 'different machine learning algorithms'), 'be') (('I', 'EDA https hackernoon'), 'have') (('We', 'perceptrons'), 'refer') (('aim', 'engineering'), 'be') (('that', 'event'), 'describe') (('they', 'age'), 'use') (('that', 'wavelet transform signals'), 'be') (('They', 'Dicle'), 'know') (('that', 'data computer signal processor'), 'signal') (('where you', 'insights'), 'say') (('data point', 'time'), 'be') (('Wavelet scale', 'Fig'), 'divide') (('png Discrete Wavelet TransformWavelet transform', 'non stationary signals'), 'be') (('k NN', 'classification'), 'algorithm') (('jpg input', 'output layer'), 'feed') (('world Real data', 'many errors'), 'be') (('Epileptic seizures', 'brain most common primary disorders'), 'represent') (('epilepsy diagnosing research', 'epileptic disorders'), 'need') (('transformations', 'k NN Support Vector Machines SVM ANN Logistic Regression'), 'apply') (('Data preprocessing', 'proven such issues'), 'be') (('that', 'clear gap'), 'be') (('Show original dataset', 'single subject person'), 'Load') "}