{"name": "malaria detection with fastai v2 ", "full_name": " h1 Malaria Detection h3 Install dependencies h2 EDA h2 Dataset h2 Model XResNet34 h2 Confusion Matrix ", "stargazers_count": 0, "forks_count": 0, "description": "Malaria deaths reached 435 000 in 2017. This technique remains the gold standard for laboratory confirmation of malaria. Malaria is caused by Plasmodium parasites. malaria https cdn1. edu wp content uploads 2015 03 Malaria cells_CDC. falciparum malaria can progress to severe illness often leading to death. int news room fact sheets detail malaria 2 https www. The WHO African Region carries a disproportionately high share of the global malaria burden. In a non immune individual symptoms usually appear 10 15 days after the infective mosquito bite. vivax pose the greatest threat. Clinicians seeing a malaria patient may forget to consider malaria among the potential diagnoses and not order the needed diagnostic tests. Diagnosis of malaria can be difficult Where malaria is not endemic any more such as in the United States health care providers may not be familiar with the disease. The parasites are spread to people through the bites of infected female Anopheles mosquitoes called malaria vectors. Microscopic Diagnosis Malaria parasites can be identified by examining under the microscope a drop of the patient s blood spread out as a blood smear on a microscope slide. The first symptoms fever headache and chills may be mild and difficult to recognize as malaria. gov malaria diagnosis_treatment diagnosis. If not treated within 24 hours P. There are 5 parasite species that cause malaria in humans and 2 of these species P. It is preventable and curable. Malaria DetectionMalaria is a life threatening disease caused by parasites that are transmitted to people through the bites of infected female Anopheles mosquitoes. Prior to examination the specimen is stained to give the parasites a distinctive appearance. html Install dependencies EDA Dataset Model XResNet34 Confusion Matrix. However it depends on the quality of the reagents of the microscope and on the experience of the laboratorian. jpg references 1 https www. In 2017 the region was home to 92 of malaria cases and 93 of malaria deaths. In 2017 there were an estimated 219 million cases of malaria in 90 countries. Malaria is an acute febrile illness. Laboratorians may lack experience with malaria and fail to detect parasites when examining blood smears under the microscope. ", "id": "ingbiodanielh/malaria-detection-with-fastai-v2", "size": "2386", "language": "python", "html_url": "https://www.kaggle.com/code/ingbiodanielh/malaria-detection-with-fastai-v2", "git_url": "https://www.kaggle.com/code/ingbiodanielh/malaria-detection-with-fastai-v2", "script": "auc fastai2.data.all classification_report matplotlib.pyplot fastai2.vision.all fastai2.vision.data pandas sklearn.metrics roc_curve precision_recall_curve numpy ", "entities": "(('symptoms fever first headache', 'malaria'), 'be') (('However it', 'laboratorian'), 'depend') (('region', 'malaria deaths'), 'be') (('WHO African Region', 'malaria global burden'), 'carry') (('technique', 'malaria'), 'remain') (('Laboratorians', 'microscope'), 'lack') (('that', 'Anopheles infected female mosquitoes'), 'be') (('Prior specimen', 'distinctive appearance'), 'examination') (('edu wp content', 'Malaria 2015 03 cells_CDC'), 'upload') (('any more such', 'disease'), 'be') (('parasite 5 that', 'species'), 'be') (('falciparum malaria', 'often death'), 'progress') (('drop', 'microscope slide'), 'identify') (('Malaria', 'Plasmodium parasites'), 'cause') (('malaria patient', 'needed diagnostic tests'), 'clinician') (('parasites', 'Anopheles infected female mosquitoes'), 'spread') "}