{"name": "masters final project eda ", "full_name": " h2 Kaggle LANL Earthquake Prediction Exploratory Data Analysis h3 Kevin Maher h3 Regis University MSDS696 Data Science Practicum II h3 Associate Professor Dr Robert Mason h4 May 2 2019 h4 Spring 2019 In partial fullfillment of the Master of Science in Data Science degree Regis University Denver CO h3 Introduction h3 Publication h3 Test Environment h3 Code Setup h3 Exploratory Data Analysis h3 Conclusions h3 Author Information h3 References ", "stargazers_count": 0, "forks_count": 0, "description": "Somewhat shockingly we are trying to predict an earthquake from only around 0. com Vettejeep MSDS696 Masters Final Project. Load the data this takes a while. Retrieved from https www. Code from here and below is commented out because the kernel dies Exploratory Data AnalysisLets validate the test files. Earthquakes occur when the time to failure signal blue jumps up from very near zero to a much higher value where that new higher value is the time to what is then the next quake. The test data consists of samples that are 150 000 samples long taken from earthquakes different from those in the test set. com c LANL Earthquake PredictionRouet Leduc B. A check of the test data in the time domain is presented below it is difficult to tell from such short signal bursts if they match the character of the training data. From the code below the test set big peaks seem to match the proportion with which they are found in the training data at 0. Note that the y axis scales vary for all plots. The expectation of 10 possible quakes in the test set should be considered cautiously and as only an approximation. Noise appears to mostly disappear above the 25 000th frequency line. com gpreda lanl earthquake eda and prediction Rouet Leduc B. Having validated that the test samples are 150 000 samples long it could help to examine the training data in 150 000 sample chunks. Matplotlib A 2D Graphics Environment. The problem is that the 150k sample slices are actually very short compared to the overall time between quakes and thus these big apparently meaningful signal spikes are unlikely to be present in many training or test samples. com c LANL Earthquake Prediction discussion 77526 latest 522727 van der Walt S. Frequency components of the signal could be very interesting to look at. However there is also concern about the possibility of bogus peaks in the test data that do not correlate well with an actual quake. The signal is recorded at 4MHz which is an extremely high sample rate for an acoustic sensor. This looks like it will create major problems for accurate prediction. ReferencesHunter J. The training input data consists of an acoustic signal that is over 629 million rows long. A similar situation occurs in row 4 column 2. The Preda model utilizes the real and imaginary parts of the Fourier transform. 375 seconds long plots signal and decreasing time to the next quake plot 150 000 to 30000 samples right around the earthquake plot test signals plot frequency components of the signal remove DC component otherwise it dominates the plot eliminate aliased portion of signal per Nyquist criteria plot frequency components of the signal with a gentle window remove DC component otherwise it dominates the plot eliminate aliased portion of signal per Nyquist criteria remove DC component otherwise it dominates the plot eliminate aliased portion of signal per Nyquist criteria determine is a signal contains a big peak as defined by an absolute value more than 2000. 32 seconds before failure. Code SetupThese are the needed library imports for problem setup. This spike reaches vales above 2000 and below 4000. The Jupyter environment in which this code is presented and was run is a descendant of the IPython environment originated by Pérez Granger 2007. None of the very high valued signal spikes were caught in a partial look at the test data. The laboratory test applies shear forces to a sample of earth and rock containing a fault line. There appears to be a short term high amplitude oscillation very shortly before each quake. More features and samples. Contrast this with other plots where the time to failure is many seconds away and the signal level peaks around 100. The earthquakes happen when the time to failure reaches very nearly zero and then jumps up. This means that there are 46 48 samples of lost data in each gap depending on how the gap is interpreted. Kaggle LANL Earthquake Prediction Exploratory Data Analysis Kevin Maher Regis University MSDS696 Data Science Practicum II Associate Professor Dr. 38 would contain a meaningful high valued spike. The location of the gaps are not given to challenge participants Rouet Leduc 2019. Note that there appears to be little information in the signal above the 20 000th frequency line. Define some constants for data location. Numpy is utilized to provide many numerical functions needed in the EDA van der Walt Colbert Varoquaux 2011. This noise however would almost entirely be removed by a low pass or band pass filter. Each acoustic signal value is associated with a time to failure the time when an earthquake happens. Because of the length of the data the plot samples every 100th data point. The goal of the project is to predict the time that an earthquake will occur in a laboratory test. It has been modified slightly for Kaggle and should now be working properly on Kaggle. Matplotlib is used for plotting Hunter 2007. Here are some random samples of the training data and plots of the acoustic signal along with the time to failure. It is very interesting that the signal becomes quiet in the 150k sample slice before an earthquake. If slicing the training data directly into 150k chunks then only 16 of 4194 training samples 0. PublicationIn an effort to comply with both university and Kaggle requirements this Jupyter notebook is being published on GitHub and on Kaggle. The number of earthquakes in the training set seems to be approximately proportional to the overall size relationship between the two sets. The most obvious feature is the big signal spike just before failure. Further there are not the same number of missing samples in each of the 150k long test sample files because 4096 does not evenly divide into 150 000. Computing in Science Engineering 9 90 95 DOI 10. LANL Earthquake Prediction. The author please requests a citation for the use or derivation of this work. A basic time series plot of the raw data. Below is a look at the signal just before failure an earthquake. The notebook was originally designed for a university course. SciPy Open Source Scientific Tools for Python Retrieved from http www. This may make it a difficult feature to work with and 99. SciPy is utilized to provide signal processing functions Jones E. But there also several similar such peaks that occur nearer the region centered in time between quakes. com Upvotes and or github stars appreciated This code herein has been released under the span style color 337AB7 text decoration none text underline none Apache 2. We note that these are laboratory earthquakes not real earthquakes. Many of these libraries request a citation when used in an academic paper. Phase plots for the Fourier transform. 0 open source license. It is very interesting that windowing seems to emphasize noise. This verifies that they all contain 150 000 samples as expected. An examination of the Kaggle leader board confirms this as even the best scores show significant error as of the date of this Jupyter notebook. LANL Earthquake EDA and Prediction. This is a set of plots of the Fourier transform windowed by short cosine tapers near the ends. Probably limited phase features will be all that is desired for the model perhaps just the standard deviation. ConclusionsIt appears that this will be a difficult problem and that error is likely to be high relative to the mean time to failure. However these are rare and the existence of the spikes will be taken up again later. Varoquaux G 2011. Windows are used to force the signal to be periodic in the time domain which reduces leakage effects at the signal endpoints in the Fourier transform. It is possible that the analysis of these spikes in some manner could add predictive capability to any small number of test samples that might contain these features this possibility has not been explored by this author yet. By expanding the time to failure plots it appears that the big spike in the signal before failure is remarkably consistent. Time to failure plots as a ramp because we are slowly approaching the next quake as the signal progresses in time. Thus the signal spike observed in the big picture plot above must occur more than one slice more than 150k samples before the earthquake. This data requires over 10GB of storage space on the computer s hard drive. It is difficult to translate this to a frequency because of the signal gaps noted earlier. The region just after the big peak may be especially hard to predict. 38 of signals test set signals are all 150k samples long. These plots are very common on the Kaggle site s kernels section this one is taken from Preda 2019. Data Structures for Statistical Computing in Python. com artgor earthquakes fe more features and samples McKinney W. Apparently the time to failure has limited resolution and so is represented by a stair step rather than a smooth line. There is therefore likely to be a need to examine the data in 150 000 sample chunks that represent the test signals. Phase plots show what appears to be just noise. Much of this feature generation seems to be come from work by Lukayenko 2019 and others credited by citations in his Kaggle kernel. Because Fourier transform phase information appears to be essentially noise most Fourier statistics will likely be based on magnitude information. 6 of the time the quake needs to be predicted in the absence of the major signal spike. The is a signal spike high amplitude just before an earthquake but there are also signal spikes in other places that may complicate matters. Test EnvironmentDesigned and run in a Python 3 Anaconda environment on a Windows 10 computer. This is a plot of the Fourier transform magnitude for some of the test signals. With 16 quakes in the training set we might expect 10 quakes in the test set based on their relative sizes. Pandas is very helpful for its ability to support data manipulation McKinney 2010. Find the indices for where the earthquakes occur then plotting may be performed in the region around failure. Proceedings of the 9th Python in Science Conference 51 56. It is very interesting that the high level spike in the signal occurs in row 3 column 1 in a signal only 0. The DC component was eliminated for plotting purposes because it would otherwise dominate the plot and make the other frequencies hard to see. This discloses my code which is being submitted and shared to my professor and class for grading. Also there are peaks in the frequency analysis that may be valuable to collect in some manner. There are over 629 million data rows. The idea of using the window is to avoid any start up transients that might cause ringing in filters applied to the signal. Because of the difficulty in reconstructing the missing data or knowing where it is it has been decided to proceed with continuous signal processing techniques even though that is not strictly perfect. As seen by the code output there are 10 such files within the test set that exhibit the peak behavior. The machine learning model notebook for this project will also be published in the same manner. The author s plan for modeling is to use the Preda 2019 kernel as a starting point for feature generation and add band pass and low pass filtering to generate additional features. A signal s standard deviation may prove to be a helpful predictor. 38 of 150k sample training slices. Signal noise seems to increase as time gets closer to failure though there is also a drop after the big peak. But as noted it is only present in about 0. From the above plot we can see that 16 earthquakes occur in the data. The signal was windowed by small sections taken from a Hanning window along the edges in order to not cause an impulse like transient in a potential filter at start up. There do not seem to be many obvious features in the signal to correlate with the time to system failure an earthquake. One challenge of this competition is that there are only these very few earthquakes to work with. It appears that if signal spikes could be captured in some way it might help the effort to model time to failure. While the acoustic signal is very large at over 600m rows the very small number of actual earthquakes available will make machine learning a challenge. Also note that while referred to as an FFT in the code below this is actually a Discreet Fourier Transform DFT because the signal length of 150k samples is not a number that is a power of two. Author InformationKevin Maher Email Vettejeep365 gmail. Earthquakes are deemed to have occurred where the blue line jumps up in value representing the time to the next quake. 04 seconds or so worth of data as can be noted from examining the right hand axes of the plots. Computing in Science Engineering 9 21 29 DOI 10. Still it may be best to concentrate signal analysis on frequencies below those represented by the 20 000th frequency line. IPython A System for Interactive Scientific Computing. The simulated earthquakes tend to occur somewhat periodically because of the test setup but this periodicity is not perfect or guaranteed to the modeler attempting to predict the time until an earthquake in the test data provided. Given the noise level of the signal it would appear to be impossible to attempt reconstruction of the missing data. The NumPy Array A Structure for Efficient Numerical Computation. There are only 15 complete time ramps that result in an earthquake and 2 incomplete time ramps. Robert Mason May 2 2019 Spring 2019 In partial fullfillment of the Master of Science in Data Science degree Regis University Denver CO IntroductionPresented here is an Exploratory Data Analysis EDA for the Kaggle Earthquake Prediction Challenge Rouet Leduc et. There is a 12 microsecond gap between bins. set for local environment set for local environment note to block uncomment all were 150 000 plot 150k sample slices of the training data matches size of test data 0. These do not appear much different than plots 5 or even 8 seconds before the quake that are presented above where the time to failure ramps are shown. Computing in Science Engineering 13 22 30 DOI 10. The modeling and machine learning portion of the project may be found in a separate Jupyter notebook within the github repository https github. A complicating factor is that the signal is recorded in bins that are 4096 samples in length. A great starting approach for generating features to model this problem appears to be the mass statistical feature generation used by many scripts on the Kaggle kernels section. This author will be working primarily with the traditional magnitude and phase output. ", "id": "vettejeep/masters-final-project-eda", "size": "14619", "language": "python", "html_url": "https://www.kaggle.com/code/vettejeep/masters-final-project-eda", "git_url": "https://www.kaggle.com/code/vettejeep/masters-final-project-eda", "script": "plot_acc_ttf_data matplotlib.pyplot hann tqdm_notebook pandas tqdm scipy.signal numpy ", "entities": "(('time when earthquake', 'time'), 'associate') (('4096', '150 evenly 000'), 'be') (('it', 'only about 0'), 'note') (('Code SetupThese', 'library problem needed setup'), 'be') (('even that', 'processing continuous signal techniques'), 'because') (('04 seconds', 'plots'), 'note') (('which', 'Fourier transform'), 'use') (('big spike', 'failure'), 'appear') (('38', 'meaningful high valued spike'), 'contain') (('model machine learning notebook', 'also same manner'), 'publish') (('it', 'accurate prediction'), 'look') (('similar situation', 'row'), 'occur') (('location', 'Rouet Leduc'), 'give') (('what', 'much higher value'), 'occur') (('it', 'failure'), 'appear') (('one', 'Preda'), 'be') (('Noise', 'frequency mostly 25 000th line'), 'appear') (('Numpy', 'EDA van der Walt Colbert Varoquaux'), 'utilize') (('signal', 'time'), 'time') (('impulse', 'potential filter'), 'windowe') (('Exploratory Data AnalysisLets', 'test files'), 'comment') (('None', 'test data'), 'catch') (('Apparently time', 'stair so step'), 'limited') (('that', 'acoustic signal'), 'consist') (('Frequency components', 'signal'), 'be') (('which', 'grading'), 'disclose') (('laboratory test', 'fault line'), 'apply') (('that', 'test signals'), 'be') (('Fourier essentially most statistics', 'magnitude likely information'), 'appear') (('time', 'also big peak'), 'seem') (('they', 'training data'), 'be') (('that', 'peak behavior'), 'be') (('modeling portion', 'github repository https github'), 'find') (('150 000 samples it', '150 sample 000 chunks'), 'help') (('most obvious feature', 'big signal just failure'), 'be') (('starting great approach', 'Kaggle kernels section'), 'appear') (('set', 'matches test data'), 'note') (('com artgor earthquakes', 'more features'), 'fe') (('that', 'test set'), 'consist') (('that', 'well actual quake'), 'be') (('even best scores', 'Jupyter notebook'), 'confirm') (('that', 'signal'), 'be') (('other frequencies', 'otherwise plot'), 'eliminate') (('that', 'model'), 'be') (('where earthquakes', 'failure'), 'find') (('level very high spike', '3 column 1 signal'), 'be') (('16 earthquakes', 'data'), 'see') (('where blue line', 'next quake'), 'deem') (('when time', 'very nearly zero'), 'happen') (('available machine', 'challenge'), 'make') (('author', 'primarily traditional magnitude output'), 'work') (('many seconds away signal level', '100'), 'contrast') (('Somewhat shockingly we', 'only around 0'), 'try') (('spike', '4000'), 'reach') (('Still it', 'frequency 20 000th line'), 'be') (('time only 15 complete that', 'earthquake'), 'be') (('Preda model', 'Fourier transform'), 'utilize') (('Jupyter notebook', 'Kaggle'), 'PublicationIn') (('notebook', 'university originally course'), 'design') (('expectation', 'cautiously only approximation'), 'consider') (('This', 'ends'), 'be') (('which', 'sample extremely high acoustic sensor'), 'record') (('that', 'matters'), 'be') (('Matplotlib', 'Hunter'), 'use') (('nearer region', 'quakes'), 'center') (('very windowing', 'noise'), 'be') (('quake', 'signal major spike'), '6') (('author', 'work'), 'request') (('that', '4096 length'), 'be') (('38', 'signals'), 'be') (('they', '0'), 'seem') (('This', 'test signals'), 'be') (('that earthquake', 'laboratory test'), 'be') (('SciPy', 'Jones E.'), 'utilize') (('code', 'Pérez Granger'), 'be') (('signal', 'more 2000'), 'signal') (('noise', 'pass however almost entirely low pass filter'), 'remove') (('Many', 'when academic paper'), 'request') (('very signal', 'earthquake'), 'be') (('failure ramps', '5 even 8 quake'), 'appear') (('it', 'missing data'), 'appear') (('plan', 'additional features'), 'be') (('that', 'manner'), 'be') (('One challenge', 'competition'), 'be') (('thus big apparently meaningful signal spikes', 'many training'), 'be') (('Here random samples', 'failure'), 'be') (('code herein', 'none text none Apache'), 'com') (('Thus signal spike', 'earthquake'), 'occur') (('existence', 'spikes'), 'be') (('possibility', 'author'), 'be') (('Pandas', 'data manipulation'), 'be') (('y axis scales', 'plots'), 'note') (('Much', 'Kaggle kernel'), 'seem') (('It', 'now properly Kaggle'), 'modify') (('earthquake', 'test data'), 'tend') (('difficult error', 'failure'), 'appear') (('we', 'relative sizes'), 'expect') (('number', 'two sets'), 'seem') (('they', '150 000 samples'), 'verify') (('that', 'two'), 'note') (('It', 'signal gaps'), 'be') (('how gap', 'gap'), 'mean') (('data', 'hard drive'), 'require') "}