{"name": "microanatomy of the prostate ", "full_name": " h2 Importing Packages h1 Prostate Gland h2 About This Notebook h2 What is the Prostate Gland h2 What is a Prostate Biopsy h1 Histology of the Prostate h2 Prostate Capsule and Prostate Stroma h3 Exploring Histological Structures on Prostate Biopsy Samples h4 Stroma h4 Prostatic Glands h4 Concretions h4 Adipocytes h4 Outer Connective Tissue h4 Nerve h4 Arteries and Veins h1 Other Histological Features h1 Works Cited ", "stargazers_count": 0, "forks_count": 0, "description": "It is also possible for part of the large intestine to be visible on the biopsy sample. Therefore slides from animal models have clearer anatomical structures than human slides. org wikipedia commons 8 81 Prostatehistology. They have a single large lipid droplet with a thin rim around the cytoplasm. Keep this in mind when analyzing the different biopsy samples in the study. It is also richly vascularized with blood vessels. org wikipedia commons 3 38 Adipocyte_types. http After the procedure the specimens are prepared and stained. The stroma of the prostate surrounds the glands of the prostate as seen in this picture. png Cancer Research UK uploader Creative Commons Attribution ShareAlike 4. Notice the empty appearance of where the lipid droplet was located before tissue staining. Notice the thinner wall and irregular and floppy shape of the vein. Prostatic GlandsThe lining of the prostatic glands are simple columnar epithelium with a few basal cells Michigan Histology. Display the image Close the opened slide after use Open the image does not yet read the image into memory Read a specific region of the image starting at upper left coordinate x 17800 y 19500 on level 0 and extracting a 256 256 pixel patch. Textbook of Histology E Book. edu resources male reproductive system. The walls of veins are thinner than arteries and appear irregular and floppy in shape Victoria College. edu dept bio Belltutorials Histology 20Tutorial Blood 20Vessels Histology_of_Blood_Vessels. The type of staining used with the specimens is H E Haematoxylin Eosin staining. Although the outer connective tissue appears to be ripped apart at the ends of the prostate tissue connective tissue may completely surround the nerve. Notice that the glands are lined with columnar epithelium and that the glands are seperated by connective tissue. The glands are seperated by connective tissue and the nuclei have no nucleoli Minarcik 2007. 0 International License Wikimedia ConcretionsConcretions which are also called corpora amylacea may look alarming but are benign in nature. Notice the connective tissue ripped away from the nerve. Notice the prominent nucleoli at the arrows and the lack of connective tissue between the glands. This is prostatic glands are from 019c1b40e6ec7410e8356c5d8d487954. This section is from a non cancerous prostate sample. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. AdipocytesThese are white fat cells. Nerves are located in the capsule appear in a bundle and have a generally wavy appearance. They are formed by condensation of prostatic secretions Gunasegaran 2020. The function of the secrections of the prostate is to nourish and transport sperm Gartner 2015 Kierszenbaum and Tres 2015. htm Keep this in mind when you are analyzing your data and viewing histological images from online sources and textbooks. Study Tip 3 Because of slight preparation differences between samples the same structures on different slides may have slight differences in color as seen below with the stroma images. Haematoxylin is a basic dye that dyes acidic cellular structures purplish blue The Histology Guide. org wikipedia commons thumb 4 4c Prostatic_adenocarcinoma_with_perineural_invasion. This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. Eosin is an acidic dye which stains basic cellular structures red pink. This is called perineural invasion. I hope this helps you through your journey in this competition. The top nerve image has connective tissue ripped away from it while the bottom nerve image still has some connective tissue around it. At this point image data is read from the file and loaded into memory. Kierszenbaum Abraham L. This is part of the stroma from 04201ee15d33abe4b032317792cf1040. This is an artery from 035587e63d72f8537b3fce5067bb18df. org wikipedia commons thumb 1 12 Diagram_showing_a_prostate_biopsy_CRUK_472. Yale Histology medcell. com watch v 9YuqsprhFm4 Overview of the Male Reproductive System. Works CitedBoundless Anatomy and Physiology. Notice the connective tissue and muscle fibers surrounding the nerve. If there are glands around the nerves around the prostate it is considered cancer Minarcik 2007. Arteries have thicker walls than veins and are more circular than veins. edu Histology mr himrp6. 0 International License WikimediaWhen tissues undergo the staining process the lipid droplet in the cell is extracted. Other Histological FeaturesThis is the slide 033e39459301e97e457232780a314ab7. read_csv Input data files are available in the read only. https instruction. The white adipocyte is what is present in the biopsy samples. This is adipose tissue from 019c1b40e6ec7410e8356c5d8d487954. Study Tip 4 Below are two different nerves from two different prostate samples. Display the image Close the opened slide after use. This is outer connective tissue from 060f60eeecf1ab502526a34db9caaf8e. com wouterbulten getting started with the panda dataset. Creative Commons Attribution 4. Importing Packages Prostate Gland About This NotebookIn this notebook I am going to concentrate on the histology of the healthy prostate. This may have been caused by extra tissue being extracted during the tissue biopsy. JPG Nephron Creative Commons Attribution Share Alike 3. This is part of the stroma from 0200fa88e8c01546663b9db1726936ac. Nerves in the prostate hold clinical significance because cancerous prostatic glands grow around them Minarcik 2007. Textbook of Histology and A Practical guide 4e E book. This slide is a non cancerous prostate sample. Notice the light thin pink fibers which is connective tissue and the dark pink thick fibers which are muscle fibers. The capsule is composed of connective tissue and contains smooth muscle cells and nerves. The capsule of the prostate can be observed here Prostate Cross Section Oklahoma State University. It surrounds the urethra and secretes substances into the lumen of the urethra. Code was used from Getting Started with the Panda Dataset https www. This is why the cells appear empty in the biopsy samples The Histology Guide. It is located between the bladder and the penis. Since most cells are transparent special dyes are used to visualize cells and their unique properties. Male Reproductive System. Muscle fibers may also be located in the outer connective tissue Gartner 2015. svg 563px Diagram_showing_a_prostate_biopsy_CRUK_472. Notice that the sample appears to be mostly connective tissue muscle and nerves. Histology of the Prostate Prostate Capsule and Prostate StromaThe outer part of the prostate is considered the capsule while the inner part of the prostate surrounding the glands is considered the stroma. It surrounds the glands of the prostate Gartner 2015. The function of the connective tissue is to provide structure and support to the prostate gland Boundless Anatomy and Physiology. 0 Unported license Wikimedia Arteries and VeinsArteries and veins have different structural differences because of differences in pressure from blood flow. Notice the thicker wall and circular shape of the artery. What is a Prostate Biopsy When a physician performs a prostate biopsy he or she will insert an ultrasound probe or instrument along with a needle through the rectum and into the prostate. Notice on this slide it is more difficult to distinguish between the connective tissue and the muscle fibers within the sample. Below are healthy glands in the prostate. Study Tip 2 When viewing histological slides it is sometimes better to view slides from both animal models and human slides. Clinical Correlation 2 It is abnormal to see glands even healthy glands around the nerves of the prostate. jpg Ktoike Creative Commons Attribution Share Alike 4. This is an artery and vein from 060f60eeecf1ab502526a34db9caaf8e. The number of concretions increase as the patient ages Gunasegaran 2020. When high amounts of cells have nucleoli along with glands that grow with no connective tissue between them cancer is suspected Minarcik 2007. Elsevier Health Sciences 2015. The smooth muscle fibers aids in the contraction of the prostate during ejaculation to empty the contents of the glands Michigan Histology. Below is an image of prostatic adenocarcinoma with perineural invasion. This procedure is different than how some other types of microscope slides are prepared. Outer Connective TissueThis is the outer connective tissue in the capsule. htm Below is the image of the stroma of the prostate. The stroma is also composed of connective tissue with smooth muscle fibers and surrounds the glands of the prostate Gartner 2015. JPG 640px Prostatic_adenocarcinoma_with_perineural_invasion. Michigan Histology histology. There are various types of histological sections and you can view them here IU School of Medicine. Below is an image of a white adipocyte beige adipocyte and brown adipocyte. Notice the red blood cells in the artery. The nucleus is pushed out to the side The Histology Guide. It is highly vascularized with blood vessels and contains nerves. Glands can be located within the capsule in healthy tissue Minarcik 2007. Histology of Blood Vessels Victoria College www2. Notice the intestinal glands are visible. This staining is what gives your biopsies their purple pink appearance The Histology Guide. This is a nerve from fe2e96fbf3e76e9983d1cc4d90ef957b. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 5GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session There are two ways to load the data from the PANDA dataset Option 1 Load images using openslide Option 2 Load images using skimage requires that tifffile is installed General packages Plotly for the interactive viewer see last section Open the image does not yet read the image into memory Read a specific region of the image starting at upper left coordinate x 17800 y 19500 on level 0 and extracting a 256 256 pixel patch. What is the Prostate Gland The prostate is part of the male reproductive system. Notice the glands around the nerve of the prostate. Histology and Cell Biology an introduction to pathology. Shotgun Histology Prostate. http This is a nerve from 019c1b40e6ec7410e8356c5d8d487954. This is part of the large intestine from cd894e213f1522b7dfc41d457dc4899b. All of the images from the data are from non cancerous prostate biopsies unless stated otherwise. Perineural invasion and risk of lethal prostate cancer. This occurs because prostate cancer has a tendency to invade and grow along the nerves of the prostate Zareba et al. Elsevier Health Sciences 2020. Clinical Correlation 1 It is abnormal to see the nucleoli in the nucleus in a high amounts of cells in the glands. This connective tissue is similar to the connective tissue in the stroma of the prostate but has thicker fiber bundles and its bundles are arranged differently. Below is a slide of prostate cancer. jpg NIH Public Domain Wikimedia Exploring Histological Structures on Prostate Biopsy Samples StromaAs explained above the stroma is composed of connective tissue with smooth muscle fibers. jpg 239px Micrograph_of_acinar_adenocarcinoma_of_the_prostate_with_double_and_marginated_nucleoli. They may also be seen in clusters. edu histology male_reproductive_system_lab. These glands secrete proteolytic enzymes and citric acid that prevents the coagulation of semen Yale Histology. Cancer Epidemiology and Prevention Biomarkers 26. Other times tissues are removed from a human during autopsy or from an animal during a necropsy undergoes sectioning and is cut into thin slices using an instrument with a sharp blade called a microtome. Prostate Biopsy Procedure Purpose Side Effects Recovery. org wikipedia commons thumb 8 8f Micrograph_of_acinar_adenocarcinoma_of_the_prostate_with_double_and_marginated_nucleoli. This is a section from cd894e213f1522b7dfc41d457dc4899b. This is a cluster of concretions from 00412139e6b04d1e1cee8421f38f6e90. There may be red blood cells in the lumen of the blood vessels. Keep this in mind when analyzing different biopsy samples in the study. 0 International WikipediaStudy Tip 1 Notice from the image the process and angle at which the biopsy is performed. NerveThis is a nerve from the outer connective tissue. com prostate cancer what is prostate biopsy. Histological slides from animal models are not significantly anatomically different from human histological slides and may have better preparation than human slides. Samples are taken from multiple parts of the prostate with the guidance of the ultrasound probe Felson 2019. This is a concretion from 00412139e6b04d1e1cee8421f38f6e90. ", "id": "rmicrobe/microanatomy-of-the-prostate", "size": "12785", "language": "python", "html_url": "https://www.kaggle.com/code/rmicrobe/microanatomy-of-the-prostate", "git_url": "https://www.kaggle.com/code/rmicrobe/microanatomy-of-the-prostate", "script": "numpy matplotlib.pyplot display IPython.display plotly.graph_objs pandas Image ", "entities": "(('explained', 'muscle smooth fibers'), 'compose') (('Clinical 1 It', 'glands'), 'Correlation') (('how other types', 'microscope slides'), 'be') (('It', 'blood also richly vessels'), 'vascularize') (('stroma', 'prostate Gartner'), 'compose') (('connective tissue', 'away nerve'), 'notice') (('Therefore slides', 'human slides'), 'have') (('Close', '256 pixel 0 256 patch'), 'display') (('Glands', 'healthy tissue'), 'locate') (('what', 'purple pink appearance'), 'be') (('This', '060f60eeecf1ab502526a34db9caaf8e'), 'be') (('Histological slides', 'human slides'), 'be') (('This', '0200fa88e8c01546663b9db1726936ac'), 'be') (('This', '00412139e6b04d1e1cee8421f38f6e90'), 'be') (('capsule', 'prostate'), 'observe') (('muscle smooth fibers', 'glands'), 'aids') (('why cells', 'biopsy samples'), 'be') (('cancer', 'them'), 'have') (('citric that', 'semen Yale Histology'), 'secrete') (('nerve bottom image', 'it'), 'have') (('transparent special dyes', 'cells'), 'use') (('it', 'animal models'), 'Tip') (('also part', 'biopsy sample'), 'be') (('last section', '256 pixel 0 256 patch'), 'list') (('notebook I', 'healthy prostate'), 'Importing') (('Outer TissueThis', 'outer connective capsule'), 'Connective') (('stroma', 'picture'), 'surround') (('This', 'cd894e213f1522b7dfc41d457dc4899b'), 'be') (('tissue', 'staining'), 'notice') (('when you', 'online sources'), 'keep') (('nuclei', 'nucleoli'), 'seperate') (('fiber thicker bundles', 'prostate'), 'be') (('read_csv Input data files', 'read'), 'be') (('Below', 'prostate'), 'htm') (('walls', 'shape Victoria College'), 'be') (('All', 'prostate non cancerous biopsies'), 'be') (('Nerves', 'generally wavy appearance'), 'locate') (('H E Haematoxylin Eosin', 'specimens'), 'be') (('Arteries', 'more veins'), 'have') (('org wikipedia commons', '1 12 Diagram_showing_a_prostate_biopsy_CRUK_472'), 'thumb') (('prostatic glands', '019c1b40e6ec7410e8356c5d8d487954'), 'be') (('It', 'prostate Gartner'), 'surround') (('she', 'prostate'), 'be') (('They', 'cytoplasm'), 'have') (('function', 'prostate gland'), 'be') (('This', '035587e63d72f8537b3fce5067bb18df'), 'be') (('connective dark pink thick which', 'light thin pink fibers'), 'notice') (('basic that', 'Histology blue Guide'), 'be') (('This', 'tissue biopsy'), 'cause') (('specimens', 'procedure'), 'http') (('what', 'biopsy samples'), 'be') (('it', 'muscle sample'), 'notice') (('This', '04201ee15d33abe4b032317792cf1040'), 'be') (('number', 'patient ages'), 'increase') (('This', 'outer connective 060f60eeecf1ab502526a34db9caaf8e'), 'be') (('This', '019c1b40e6ec7410e8356c5d8d487954'), 'http') (('It', 'kaggle python Docker image https github'), 'come') (('which', 'corpora also nature'), '0') (('same structures', 'stroma below images'), 'Tip') (('inner part', 'glands'), 'consider') (('They', 'prostatic secretions'), 'form') (('Study 4 Below', 'prostate two different two different samples'), 'Tip') (('you', 'IU here School Medicine'), 'be') (('This', '019c1b40e6ec7410e8356c5d8d487954'), 'be') (('org wikipedia commons', '8 8f'), 'thumb') (('prostate', 'male reproductive system'), 'be') (('lipid droplet', 'cell'), '0') (('glands', 'connective tissue'), 'notice') (('acidic which', 'basic cellular structures red pink'), 'be') (('section', 'prostate non cancerous sample'), 'be') (('Clinical 2 It', 'prostate'), 'correlation') (('function', 'prostate'), 'be') (('nucleus', 'Histology Guide'), 'push') (('image data', 'memory'), 'read') (('this', 'competition'), 'hope') (('NerveThis', 'outer connective tissue'), 'be') (('It', 'nerves'), 'vascularize') (('capsule', 'muscle smooth cells'), 'compose') (('cancerous prostatic glands', 'them'), 'hold') (('Prostatic GlandsThe lining', 'basal cells Michigan simple columnar a few Histology'), 'be') (('Code', 'Panda Dataset https www'), 'use') (('prostate cancer', 'prostate'), 'occur') (('it', 'prostate'), 'consider') (('biopsy', 'which'), '0') (('This', 'fe2e96fbf3e76e9983d1cc4d90ef957b'), 'be') (('Samples', 'ultrasound probe'), 'take') (('It', 'bladder'), 'locate') (('outer connective tissue', 'completely nerve'), 'surround') (('It', 'urethra'), 'surround') (('Other times tissues', 'sharp blade'), 'remove') (('org wikipedia commons', '4c 4 Prostatic_adenocarcinoma_with_perineural_invasion'), 'thumb') (('Unported license Wikimedia Arteries', 'blood flow'), 'have') (('Muscle fibers', 'also outer connective tissue'), 'locate') "}