{"name": "moa correlation analysis use igraph ", "full_name": " h1 What is about h1 Load data h1 First look at features correlations h1 Analysis with graphs h2 High correlation threshold 0 78 h2 Medium correlation threshold 0 6 h1 Analyse several thresholds ", "stargazers_count": 0, "forks_count": 0, "description": "78 and these genes connected between each other by correlation see details below. Construct a graph from it nodes are connected if 1 in matrix. 3 730PSCan there be some biological interpreation for that big group PSWe use igraph packagesome tutorial examples can be found here https www. It seems surprising that there is the only one group but not several correlated clusters of features. 6 the group of correlated gens grows to 243 genes while other remain uncorrellated both between themselves and big group. What is about Analysis of correlated features for MoA context. 2When we decrease threshold correlation threshold threshold say to 0. 78 Medium correlation threshold 0. The size of the group depends on how high correlation threshold we put but the picture above does not change. More details 1There is group of 34 genes which are quite strongly correllated Genes 37 38 50 58 63 72 121 123 131 147 185 186 195 228 248 257 261 328 349 369 386 406 410 417 439 460 489 569 629 672 731 744 760 761 strongly means that correlation threshold is 0. com alexandervc igraph cheatsheet Load data First look at features correlations We see that gene is either correlated with ALL viabilities or not correlated again with ALL What does it mean biologically Some genes are crucial for cell survival some not Analysis with graphs Take a correlation matrix and change it with threshold if above put 1 if below put 0. 6 Analyse several thresholds. Look at that graph for several thresholds and see the pattern there seems to be only one group of correlated features all other stands separate. Observations Roughly speaking there seems to be the only ONE group of highly correlated genes all other genes are uncorreled between that group and themselves also. In particular we try to select groups of correllated genes using graph utils. 3 Changing correlation threshold statistics Threshold Correlated component size 0. All other genes are correlated below threshold BOTH between each other and main group. High correlation threshold 0. ", "id": "alexandervc/moa-correlation-analysis-use-igraph", "size": "2234", "language": "python", "html_url": "https://www.kaggle.com/code/alexandervc/moa-correlation-analysis-use-igraph", "git_url": "https://www.kaggle.com/code/alexandervc/moa-correlation-analysis-use-igraph", "script": "seaborn pandas matplotlib.pyplot numpy ", "entities": "(('other genes', 'group'), 'seem') (('other genes', 'BOTH other group'), 'correlate') (('genes', 'details'), 'see') (('packagesome tutorial igraph examples', 'use'), 'be') (('picture', 'correlation how high threshold'), 'depend') (('760 correlation 37 38 50 58 63 72 121 123 131 147 185 186 195 228 248 257 261 328 369 386 406 410 417 439 460 489 569 629 672 731 744 strongly threshold', 'quite strongly Genes'), 'mean') (('particular we', 'graph utils'), 'try') (('It', 'only one several correlated features'), 'seem') (('there only one group', 'other stands'), 'look') (('2When we', '0'), 'decrease') (('other', 'both themselves'), 'grow') (('below', '0'), 'look') (('Construct', 'nodes matrix'), 'connect') (('correlation threshold 3 Changing Threshold', 'component size'), 'statistic') (('What', 'MoA context'), 'be') "}