{"name": "molecular geometry feature engineering eda ", "full_name": " h1 Molecular Geometry Feature Engineering h1 Feature Evaluation h1 EDA h2 Flatness Metric h2 Bond Angle with Molecule Plane h2 Bond Angle with Molecule Principle Axis ", "stargazers_count": 0, "forks_count": 0, "description": "Recall that the higher this metric the less flat a molecule is. jpg Molecular Geometry Feature Engineering The shape of molecules is principally related to the quantum mechanical properties of electron interactions. Molecules without a clear 2D plane of best fit tetrahedral structures like methane for example may yield angle measurements that are not informative. Let s start with a molecule that has a high flatness metric. Let s examine a bond with a high angle between itself and the plane of best fit. com uploads photos 2013_web_banners5. You may want to experiment and use a threshold of molecular flatness above which angle measurements are discarded. Bond Angle with Molecule PlaneThese features look a lot stronger. This kernel also performs a simple PCA with SVD to extract the principal axis of each molecule along with the angle subtended by each bond with it. This molecule has a complex shape that cannot easily be mapped to a 2D plane. This kernel uses Singular Value Decomposition SVD to calculate the 2D plane of best fit for all molecules containing 4 or more atoms and then calculates both the mean normalised distance of all atoms from this plane to provide a measure of flatness for the molecule. I m putting the finished file into a dataset so check in the comments section for a link if you don t want to engineer them yourself. Most of the hydrogen hydrogen bonds in this molecule lie orthogonal to the principal axis. This can be done with molecules of at least 3 atoms. Again molecules without a clear orientation may yield arbitrary results however this kernel contains plenty of ideas to get you started. EDA Flatness MetricThe flatness metric in isolation clearly isn t a strong feature and could probably be improved by removing hydrogen bonds from its calculation. Let s examine a molecule where the reverse is true. This molecule fits perfectly onto a 2D plane. Let s try one with a very low flatness metric. com borisdee how to easy visualization of molecules to show some feature examples. I have calculated flatness in such a way that 0 represents a totally flat molecule. Feature EvaluationNow we can examine some of the results. If I m not mistaken it looks like it belongs to the acetylene family. There are some aspects that might be useful for example 2JHH and 1JHC bonds with a low flatness metric don t display high scalar coupling constants. Bond Angle with Molecule Principle AxisAgain a mixed bag with a few areas that might benefit histogram splitting algorithms like LightGBM. 2JHH bonds for example show their lowest values with low bond axis angle values. This molecule which looks suspiciously like a poodle is flat along the axis of its larger atoms there s an idea for further feature engineering but one of the hydrogen hydrogen bonds is orthogonal to this. This is the weakest feature so far and I ll be working on improving it. PCA has in this case identifed one of two lines that could be thought of as the principal axis and the method will have to be refined. There are undoubtedly many ways this approach can be extended with some more specific feature engineering but this kernel will hopefully be a useful primer to get you started. The hydrogen nitrogen bond in this molecule lies almost exactly on the principal axis. This is a very flat molecule and all its atomic bonds lie on its principal axis. 1JHC 2JHN and 3JHN bonds clearly show useful trends. I ll be using the visualisation library demonstrated in this excellent kernel https www. Now let s look at a molecule with a high angle between one of its bonds and its principal 1D axis. Molecules comprising 3 atoms or fewer are always flat so this measure is not informative for them I have filled in these values with np. Good luck in the competition Select a molecule Get atomic coordinates Get atomic symbols Display molecule quick PCA via singular value decomp obtain principal eigenvector of molecule axis obtain plane with minimum sum distance from nuclei obtain structure and bond information for each molecule number of constituent atoms nuclei coords principal axis of molecular alignment obtain flatness metric and plane angles for binds if nuclei 3 calculate best fitting 2D plane calculate distances of each atom from plane append mean distance to molecule list obtain angle subtended by each atomic bind and plane obtain atom index numbers for this bond get 3D coords bond vector angle subtended by bond vector and molecule plane standardise to degrees 90 not needed but somewhat easier to visualise for smaller molecules flatness and plane angle measurements are not informative obtain atom index numbers for this bond get 3D coords bond vector angle subtended by bond vector and molecule principal axis standardise to degrees 90 not needed but somewhat easier to visualise. Will this affect its coupling constant relative to other H H bonds Let s look at an atom with a small angle between its 2D plane and one of its bonds. Electron interaction also mediates the strength of the nuclear coupling constant between bound atoms so features derived from their 3D distribution may prove useful. The angles subtended by this plane and the atomic bonds in the molecule are then calculated. Some caution should be used with the latter feature. These features take a long time to process around 12 hours in total. ", "id": "bigironsphere/molecular-geometry-feature-engineering-eda", "size": "4405", "language": "python", "html_url": "https://www.kaggle.com/code/bigironsphere/molecular-geometry-feature-engineering-eda", "git_url": "https://www.kaggle.com/code/bigironsphere/molecular-geometry-feature-engineering-eda", "script": "svd Atoms get_plane numpy PCA_SVD view numpy.linalg matplotlib.pyplot ase tqdm_notebook pandas tqdm tqdm_notebook as tqdm ", "entities": "(('it', 'acetylene family'), 'look') (('s', 'best fit'), 'let') (('that', 'high flatness metric'), 'let') (('s', 'very low flatness metric'), 'let') (('that', '2D easily plane'), 'have') (('suspiciously poodle', 'this'), 'be') (('Now s', 'bonds'), 'let') (('Bond Angle', 'Molecule PlaneThese features'), 'look') (('Most', 'principal axis'), 'lie') (('method', 'principal axis'), 'identife') (('weakest so far I', 'it'), 'be') (('This', 'at least 3 atoms'), 'do') (('jpg Molecular Geometry Feature shape', 'electron interactions'), 'Engineering') (('features', 'total'), 'take') (('you', 'ideas'), 'yield') (('kernel', 'it'), 'perform') (('molecule', '2D perfectly plane'), 'fit') (('that', 'algorithms'), 'bag') (('that', 'high scalar coupling constants'), 'be') (('hydrogen nitrogen bond', 'almost exactly principal axis'), 'lie') (('I', 'kernel https excellent www'), 'use') (('Feature EvaluationNow we', 'results'), 'examine') (('0', 'totally flat molecule'), 'calculate') (('angle measurements', 'which'), 'want') (('caution', 'latter feature'), 'use') (('coords bond vector 3D angle', 'principal degrees'), 'select') (('where reverse', 'molecule'), 'let') (('s', 'bonds'), 'affect') (('very flat atomic bonds', 'principal axis'), 'be') (('so features', '3D distribution'), 'mediate') (('kernel', 'molecule'), 'use') (('hopefully useful you', 'feature more specific engineering'), 'be') (('I', 'np'), 'be') (('2JHH bonds', 'bond angle low axis values'), 'show') (('you', 'don them'), 'put') (('that', 'angle measurements'), 'yield') (('3JHN bonds', 'clearly useful trends'), 'show') (('atomic bonds', 'molecule'), 'calculate') "}