{"name": "morphological postprocessing on unet lb 0 429 ", "full_name": " h2 In this notebook we explain our morphological postprocessing step that improved our score from 0 421 to 0 429 on LB h1 Plan h1 What we need h1 Clean Masks h2 Problem 1 dirty masks h2 Problem 2 dirty at border h2 Approach V1 h2 Approach V2 h1 Problem 3 not everything gets filled h1 Problem 4 some cells get connected h1 Ideas h1 Good Markers h1 Approach v1 h2 Problem 1 building markers on initial mask when we have better mask h2 Problem 2 some markers are to large and connected h2 Problem 3 still some barely connected markers are left h2 Problem 4 we are dropping markers on many images with small cells h2 Ideas h1 Good distance h2 Idea h2 Watershed h2 Problem 1 some cells are dumped h2 Problem 2 some artifacts from mask cleaning remain h2 Problem 3 some cells are oversemgmented and small cell chunks remain h1 LB Test set predictions ", "stargazers_count": 0, "forks_count": 0, "description": "Also there are artifacts that aren t supposed to be there Ideas work more with dilation do better around borders drop some cells after watershed with drop_artifact functionGo ahead and try to improve it. And nowe lets erode the markersok thats not bad if we now compare those markers with the labels we get the followingSo the markers and cleaned mask look really good Problem 3 still some barely connected markers are leftUnfortunately for some images the markers are not eroded enough and are left connected look at the orange blob at the bottom right corner in the forth column. Let s now cut it with our contours and see what we getWe got a lot of artifacts but we are getting places. In this notebook we explain our morphological postprocessing step that improved our score from 0. Let s do that with the following drop_artifacts functionNot bad at all Let s put it all together in one functionIt is still not perfect for instance the following problems still arise Problem 3 not everything gets filledLook at the blue cell on the yellow and blue cells on the left Problem 4 some cells get connectedLook at this large blob at the top. htm but there is a ton of stuff online so google it if you feel like it. Problem 1 building markers on initial mask when we have better maskThere is no point in using initial masks when we worked so hard on making them better right Let s use our results from the first step Problem 2 some markers are to large and connectedUnfortunately it is not perfect. Voila This solution works reasonably well. However when we drop them and those oversegmentations happen in the middle of the cell we might end up with a hole. Let s deal with it one problem at a time starting with the two small cell problem. First we binarize both the mask and contours using global otsu thresholding method Then we go ahead and combine binarized masks and contours and fill the holes that remainedNow that we filled the holes in the cells we can detach them again because we have the contour informationThere is a problem with this approach. The floor is yours Good MarkersLet s now try end extract good markers for our watershed. Let s try thatBoom It looks really nice. We ll deal with the second problem by going over all the resulting cells and calculating the coverage of the cell with the original binaraized image region. Problem 4 we are dropping markers on many images with small cells Ideas play with binary closing opening involve contours and or centers in this we will asume that lost markers are in facet small cells that don t need to be divided and we will get back all the cells that were dropped in watershed use local maxima on distance transform Good distanceHere I have no better idea than to use the binary distance from the background. 429 on LBTo see the full end to end pipeline go to https github. Let s try the simplest option without any tweaks Problem 1 some cells are dumped Problem 2 some artifacts from mask_cleaning remainUnfortunatelly some cells are dropped some cells are oversegmented and some artifacts from the mask cleaning still remain. Here is an interesting link https homepages. Approach v1In this approach we will simply cut the masks with the contours and use that as markers. But that I will leave for you to create If you liked the solution and would like to see how it works as a part of the end to end pipeline please go to https github. If we have to connected cells and we have one connected marker for those cells watershed will not detach it. Let s put it all together in a functionIt works to a certain extend but it removes things that where not connected and or things around borders Approach V2Let s start by binarizing and filling the holes againNow we will use binary_closing to fill what wasn t closed with fill holes. Ok putting it all together gives us Problem 3 some cells are oversemgmented and small cell chunks remainNow some small pieces of cells may remain at this point or the cells could get oversegmented. In order to get there we can use binary_erosion Let s first do what we knowFor instance the two markers at the top left are still connected and will be treated as a single marker by the watershed. html What we need Clean binary masks Good nicely detached markers Good distance Clean Masks Problem 1 dirty masks Problem 2 dirty at borderWe can immediately see that some of our cells are are not very smooth and there are holes in them. When it comes to artifacts left we will recycle the idea of dropping cells that weren t visible on the initial image. If we could clean up those small artifacts we would be almost golden. Approach V1Let s build a function that calculates the average size of the nuclei. First we have slightly smaller cells like the blue one on the right edge and we created some new cells like the one at the top edge. There are two problems with this result. com c data science bowl 2018 discussion 47590 Cheers and good luck LB Test set predictions threshold combine contours and masks and fill the cells close what wasn t closed before join the connected cells with what we had at the beginning threshold combine contours and masks and fill the cells close what wasn t closed before open to cut the real cells from the artifacts join the connected cells with what we had at the beginning drop all the cells that weren t present at least in 25 of area in the initial mask threshold threshold threshold. By the way do you know why the cells that are visible on the mask are sometimes dropped in the watershed I will not answer it know but simply solve it by adding the dropped cells to the output. We are left with artifacts. We need to make them better smaller and positioned more in the center of nuceli. Let s deal with that via morphological transformations. We will deal with that by dropping to small to be a cell blobs. Luckily we can use binary_openning with a larger structural element. Some tweaking should improve it but beware that for other images it might decrease the score. If nothing was there at the beginning nothing should be there now. com neptune ml data science bowl 2018Lets look at our inputs maps contoursand outputs ground truthto get some intuition into what is possibleBoth masks and contours seem reasonably good and sometimes like in image 5 it is very beneficial to use both Plan We will use marker based watershed to detach nuclei and combine that with some morphological cleaningIf you don t know what it is check this link http cmm. We will need to to choose the structural element for our postprocessingLet s work on image 5Now let s proceed to cleaning. Only difference is that now we need to iterate over connected components and apply drop artifacts to each component. That is why we will iterate over every connected component and apply binary_fill_hole to it to remove that problem. We will need two helper functions pad_mask and crop_mask to deal with problems around the edges ok lets go for itYeah we closed everything but it is way more than we wanted. Let s use binary_openning to drop them. Of course there is still a lot of room for improvement. Simple but really effective. Feel free to improve on that Idea investigate imposing some gradients on original image or good clean mask WatershedNow that we have good masks markersa and distance we can proceed to the watershed algorithm. We can simply join the result with the original binarized mask. The good thing is we can deal with some of those problems by using ideas we have already tried. For cells that get oversegmented we should implement a function that glues those oversegmented cells together rather than drop them. If it is the first time you hear about them it s a good moment to do some reading. Remember that some cells that are touching are detached by watershed. com neptune ml data science bowl 2018To stay up to date with new features and fully open sourced solution with predictions read our data science bowl journal thread https www. ", "id": "jakubczakon/morphological-postprocessing-on-unet-lb-0-429", "size": "7800", "language": "python", "html_url": "https://www.kaggle.com/code/jakubczakon/morphological-postprocessing-on-unet-lb-0-429", "git_url": "https://www.kaggle.com/code/jakubczakon/morphological-postprocessing-on-unet-lb-0-429", "script": "product relabel watershed_v3 good_distance_v1 good_markers_v3 numpy drop_small threshold_otsu good_markers_v1 watershed_v1 scipy.ndimage mean_blob_size drop_artifacts clean_mask_v1 pad_mask clean_mask_v2 add_dropped_water_blobs watershed_v2 fill_holes_per_blob label2rgb sklearn.externals matplotlib.pyplot clean_mask_v3 pandas drop_artifacts_per_label skimage.morphology skimage.filters joblib ipywidgets itemfreq scipy.stats skimage.color crop_mask good_markers_v2 plot_list good_markers_v4 itertools ", "entities": "(('it', 'good reading'), 's') (('work', 'functionGo ahead it'), 'be') (('cells', 'point'), 'give') (('we', 'places'), 'let') (('link', 'cmm'), 'ml') (('that', 'together rather them'), 'implement') (('we', 'ideas'), 'be') (('wasn t', 'fill holes'), 'let') (('how it', 'https github'), 'leave') (('com data science bowl 2018To', 'data science bowl journal thread https www'), 'neptune') (('now we', 'component'), 'be') (('that', '0'), 'explain') (('artifacts', 'mask cleaning'), 'let') (('you', 'it'), 'htm') (('that', 'mask threshold threshold initial threshold'), 'bowl') (('Good MarkersLet', 'watershed'), 'be') (('we', 'hole'), 'end') (('again we', 'informationThere approach'), 'binarize') (('pipeline', 'https github'), 'see') (('We', 'original binarized mask'), 'join') (('nothing', 'there beginning'), 'be') (('immediately some', 'very them'), 'html') (('why we', 'problem'), 'be') (('them', 'nuceli'), 'need') (('we', 'it'), 'detach') (('I', 'background'), 'drop') (('4 cells', 'top'), 'let') (('We', 'small'), 'deal') (('it', 'first step'), 'be') (('way we', 'everything'), 'need') (('Luckily we', 'larger structural element'), 'use') (('s', 'cell two small problem'), 'let') (('that', 'nuclei'), 'build') (('we', 'watershed algorithm'), 'feel') (('that', 'watershed'), 'remember') (('approach we', 'markers'), 'Approach') (('it', 'score'), 'improve') (('that', 'initial image'), 'leave') (('we', 'small artifacts'), 'clean') (('instance two markers', 'watershed'), 'use') (('s', 'morphological transformations'), 'let') (('We', 'image original binaraized region'), 'deal') (('markers', 'forth column'), 'erode') (('we', 'top edge'), 'have') (('it', 'output'), 'know') (('s', 'image'), 'need') "}