{"name": "mtg gathering the colors ", "full_name": " h3 Introduction h3 Settings h3 Read Data h3 Remove Outliers h3 Preprocess Color h3 Co occurrences h3 Correlation Heatmap h3 Interactive Time Series of Releases h3 Cumulative Color Proportion Over Time h3 Creatures h3 Mana distribution h3 Power distribution h3 Toughness distribution h3 Interactive 2D Histogram of Power vs Toughness h3 Radar chart factory h3 Radar Chart h4 Radar Charts Mono color decks h4 Radar Charts Dual color decks h4 Radar Charts Tri color decks h4 Radar Charts Multi color decks ", "stargazers_count": 0, "forks_count": 0, "description": "Notice how multi colored creatures tend to survive longer. And Black Blue and Green White are more frequent. Toughness distributionX axis starts at toughness 0. And to reduce data size we limit the data to columns specified in keeps. Recommened use zoom in for a better resolution exit zoom mode into pan mode hover over the markers for counts Cumulative Color Proportion Over TimeWe can also look at the cumulative color proportions over time releases. For simple visualizations we have to make some simplifications. We ll assign colors to exhibits A and B below but not to C. Blue has relatively little mana 1 creatures. Eldrazi creatures that need a specific color mana to cast but is Deviod of a color type. I think this is dirty data. Settings Read Data Remove Outliers Preprocess Colors Co occurrences Correlation Heatmap Interactive Time Series of Releases Cumulative Color Proportion Over Time New in version 13 Mana distribution Power distribution Toughness distribution Interactive 2D Histogram of Power vs Toughness Radar charts SettingsWe define a mapping between the colorIdentity and color columns so that we can combine the information from both when we categorize cards by color. Exhibit A the edge case when colors is missing but colorIdentity is not 1. Truly colorless artifact creatures like Juggernaut. Multi color creatures tend to cost more to cast since they usually have better abilities. org examples api radar_chart. spine_type must be left right top bottom or circle. Interactive Time Series of ReleasesWe can look at the color distribution over time releases. Green has more power 4 which is expected since it relies more on creatures to win. IntroductionIn this notebook we give a high level look into the 5 core mana colors. Radar Charts Dual color decksValues are percentages so 100 artifacts does not mean there are lots of artifacts of that color. Truly colorless artifacts like Leonin Scimitar. Green s creatures are spread across the mana costsThis is consistent with its reliance on creatures in its strategy. Interactive 2D Histogram of Power vs ToughnessI could not get the colors to work correctly but the hover text is alphabetical by color. Black has more expendable creatures congruent with its abilities to interact with the graveyard. White has relatively more enchantments to buff the creatures. Black and red have more toughness 2. the axes frame to draw correctly for a polygon frame. Most start with 1 mana. Artifacts that do not need colored mana to cast but activations associated with colored mana. There should not be a gap at 0. In the middle of 2007 Wizards of the Coast changed its strategy. Red has relatively low number of creatures with 2 mana but more with 3 or 4 mana. Exhibit C the edge case when both colors and colorIdentity are missing 1. For example Serra Angel needs white mana to cast and should count as white for Protection From White. Red emphasizes more on speed mana cost and attack instead of sustainability. Blue has less creatures and more instant spells to control the board state. Unlike other colors blue peaks earlier at power 1. Notice how there were less multi colored cards in the beginning compared to colorless cards. Radar Charts Tri color decksValues are percentages so 100 artifacts does not mean there are lots of artifacts of that color. get counts calculate evenly spaced axis angles rotate theta such that the first axis is at the top unit circle centered on 0. 5 use 1 line segment to connect specified points define draw_frame method FIXME markers at x 0 y 0 get doubled up The following is a hack to get the spines i. Each radar shows the distribution of cards into 5 types with every circle denoting 10. Radar Charts Mono color decksColorless cards are more or less artifacts. I m not a MTG expert so maybe there is some rule I m not aware of. This is further evidence of its reliance on instants and sorceries instead of creatures. Power distributionX axis starts at power 0. remove promo cards that aren t used in normal play Edit 2016 09 30 Could be null because it s too new to have a ruling on it. Exhibit B the edge case when colorIdentity is missing but colors is not 1. Radar chart factoryCode from http matplotlib. Co occurrences Correlation HeatmapEasier to see that Blue and Green combos are relatively rare. Exception is Colorless which start at 0. In 2008 multi colored decks became better established with clearly defined play styles and decks. Green has more toughness 5 which is expected since it relies more on creatures for protection. html Radar ChartWe will look at how the distribution of card types varies by mana color. Since then the color distribution has been fairly stable. I used cumulative proportions to smooth over the variations that could be present in individual releases. Radar Charts Multi color decksValues are percentages so 100 artifacts does not mean there are lots of artifacts of that color. In addition since it relies more on enchantments the inherent power of the creatures are not as high. White has lots of power 2 which are probably variations of humans. Red has relatively thicker tail which is expected since it emphasizes attack. Creatures Mana distributionX axis is a little weird. Green focuses on creatures. close off polygon by repeating first vertex Do not double count creatures Some double counting of artifacts and enchantments exist but it s rare. It started to release more frequently with less cards per release. There are also relatively more colorless artifacts with power 0. remove cards that are banned in any game type remove tokens without types Power and toughness that depends on board state or mana cannot be resolved Combine colorIdentity and colors Include colorless and multi color. Is there a better way of grouping. Some data fu to get all cards into a single table along with a couple of release columns. Read Data Remove Outliers Preprocess ColorA core part of Magic The Gathering MTG is how different rules interact with each other. For example Counterspell seems to me like the typical blue spell. ", "id": "willieliao/mtg-gathering-the-colors", "size": "5731", "language": "python", "html_url": "https://www.kaggle.com/code/willieliao/mtg-gathering-the-colors", "git_url": "https://www.kaggle.com/code/willieliao/mtg-gathering-the-colors", "script": "math numpy.random tools aes Spine _gen_axes_patch FigureFactory as FF init_notebook_mode PolarAxes radar_factory set_varlabels download_plotlyjs _close_line draw_circle_patch numpy seaborn matplotlib.path Path plotly RadarAxes(PolarAxes) matplotlib.projections.polar FigureFactory fill matplotlib.projections unit_poly_verts random plotly.tools matplotlib.pyplot _gen_axes_spines ceil plotly.offline plot pandas plotly.graph_objs draw_poly_patch iplot register_projection matplotlib.spines ggplot ", "entities": "(('White', 'creatures'), 'have') (('Edit 2016 09 it', 'it'), 'remove') (('Red', 'more with 3 mana'), 'have') (('how distribution', 'mana color'), 'look') (('Counterspell', 'typical blue spell'), 'seem') (('such first axis', '0'), 'get') (('Combine colorIdentity', 'colorless'), 'resolve') (('how different rules', 'other'), 'Read') (('it', 'attack'), 'have') (('zoom', 'time releases'), 'look') (('we', 'simplifications'), 'have') (('so maybe I', 'MTG expert'), 'm') (('Power distributionX', 'axis power'), 'start') (('it', 'more creatures'), 'have') (('they', 'usually better abilities'), 'tend') (('hover correctly text', 'color'), 'get') (('when we', 'color'), 'read') (('it', 'artifacts'), 'close') (('Serra Angel', 'White'), 'need') (('creatures', 'strategy'), 'spread') (('so 100 artifacts', 'color'), 'chart') (('that', 'colored mana'), 'artifact') (('that', 'individual releases'), 'use') (('radar', '10'), 'show') (('Blue', 'relatively little mana 1 creatures'), 'have') (('This', 'instants'), 'be') (('We', 'below C.'), 'assign') (('so 100 artifacts', 'color'), 'be') (('spines', 'x'), 'define') (('Interactive Time Series', 'time releases'), 'look') (('It', 'release'), 'start') (('Red', 'speed mana cost'), 'emphasize') (('axis', 'Creatures Mana distributionX'), 'be') (('it', 'protection'), 'have') (('Eldrazi that', 'color type'), 'creature') (('Exhibit edge when colors', '1'), 'c') (('Radar', 'http matplotlib'), 'chart') (('colored decks', 'play better clearly defined styles'), 'establish') (('we', 'core mana 5 colors'), 'introductionin') (('2 which', 'probably humans'), 'have') (('Black', 'graveyard'), 'have') (('Blue', 'board more instant state'), 'have') (('inherent power', 'creatures'), 'be') (('Toughness distributionX', 'axis toughness'), 'start') (('we', 'keeps'), 'limit') "}