{"name": "my first kaggle project ", "full_name": " h2 Checking correlations h2 Tickets and Cabins h2 Titles ", "stargazers_count": 0, "forks_count": 0, "description": "23567 Letters only e. Then we will split out the Ticket Number and the Ticket identifier by using that last space. com startupsci titanic data science solutionsSee what files I have available to me. read_csv visualization machine learning This is the numeric columns only This is the object columns Warning the colors legend are wrong for Every 10th ticket after sorting alphabetically fix data bins based on number of digits Automatic groups Manual groups just to set a value Keep PassengerId for prediction Logistic Regression Support Vector Machines Gaussian Naive Bayes Perceptron Linear SVC Stochastic Gradient Descent Decision Tree Random Forest using random forest. Is it just luck due to small numbers or is there something there Tickets and Cabins The tutorial doesn t got through this but I want to try to extract what I can from the ticket and cabin information. Note this can only be done for features without empty values. In particular is there any reason that the male female ratios switched on C. 330877 17463 2631 Numbers and letters e. LINE Let s extract the number part and the letter part. We will work with a copy of the dataframe to easily fix mistakes in the notebook without having to start over. Does ticket group add anything new that Pclass doesn t already add Here on I am going to follow the tutorial more closely so I can get to the end Titles data tools linear algebra data processing CSV file I O e. Checking correlations Here I check how various types of data are correlated. Let s try and start by loading the data into a pandas dataframe. I don t really understand this last graph. I am very closely following this Python tutorial 1. This is my first attempt on Kaggle. At first gland I notice the tickets have three types Numbers e. ", "id": "mathjason/my-first-kaggle-project", "size": "1353", "language": "python", "html_url": "https://www.kaggle.com/code/mathjason/my-first-kaggle-project", "git_url": "https://www.kaggle.com/code/mathjason/my-first-kaggle-project", "script": "IPython.display sklearn.svm numpy seaborn SGDClassifier subprocess SVC LinearSVC GaussianNB sklearn.neighbors sklearn.naive_bayes sklearn.tree sklearn.linear_model matplotlib.pyplot DecisionTreeClassifier pandas RandomForestClassifier LogisticRegression Perceptron KNeighborsClassifier display check_output Markdown sklearn.ensemble ", "entities": "(('We', 'notebook'), 'work') (('male female ratios', 'C.'), 'be') (('how various types', 'data'), 'check') (('I', 'me'), 'solutionsSee') (('this', 'empty values'), 'note') (('numeric only This', 'random forest'), 'machine') (('Titles data tools', 'algebra data processing CSV file'), 'add') (('t', 'really last graph'), 'don') (('I', 'Python very closely tutorial'), 'follow') (('s', 'pandas dataframe'), 'let') (('tickets', 'three types'), 'notice') (('s', 'number part'), 'let') (('I', 'information'), 'be') (('Then we', 'Ticket last space'), 'split') "}