{"name": "object oriented titanics ", "full_name": " h1 Contents h1 OBJECT ORIENTED PROGRAMMING h1 Design Prencible h1 Convention for Coding Style h1 Starting Point of Object Oriented Programming Class h1 First Example KaggleMember class h1 Inheritance h1 WORKING ON TITANIC DATASET h1 Information class h1 Preprocess class h1 PreprocessStrategy class h1 GridSearchHelper class h1 Visualizer class h1 ObjectOrientedTitanic class h1 Testing h1 Create ObjectOrientedTitanic object h1 Display Information in R Style h1 Define preprocess strategy h1 Visualize h1 Get GridSearchCV Results ", "stargazers_count": 0, "forks_count": 0, "description": "The first argument of every class method including init is always a reference to the current instance of the class. Design Prencible Design princeble of object oriented programming is modularity abstraction encapsulation. Instance An individual object of a certain class. For this reason code design can be improved according to the comments to be made for the kernel. Information class Go to Contents Menu 0. Visualizer class Go to Contents Menu 0. Convention for Coding Style The official Style Guide for Python Code http www. ObjectOrientedTitanic class Go to Contents Menu 0. When creating kaggler2 object three parameters were sent to constructor function kaan can grand master. It is important to note that The word self can be replaced with another word based on user preference. Create ObjectOrientedTitanic object 2. WORKING ON TITANIC DATASET Now let s work on the Titanic dataset using classesDifferent classes have been created for the operations on the Titanic dataset Information Preprocess PreprocessStrategy GridSearchHelper ObjectOrientedTitanic Information This class prints summary information about the data set on the screen. Each class consists of a description that contains the properties and functions of the objects. WORKING ON TITANIC DATASET 2. PreprocessStrategy Preprocessing is important in the Titanic data set. Visualizer class 2. The fourth parameter has a default value. Class variables are defined outside of class functions. But it give high competion accuracy score. In the sixth line another instance variable is assigned a value. Inheritance One of the most important aspects of OOP is the ability to use previously written code. ObjectOrientedTitanic class 2. Book rather than book or Books Functions sould be a lowercase verb and separeted by underscore for multple words e. Numbers are given at the end of each line to make the descriptions easier eg line1 First we create a class named KaggleMember using the class key word. Let s create object using KaggleMember classLet s examine the codes above. Constructor functions are invoked on every instance of the class and are generally used to assign initial values. product_id Constant sould be uppercase noun and separeted by underscore for multiple words e. However since most programming languages require the addition of parentheses symbols after the class name the use of parentheses has been preferred in this class definitionIn the second line the class variable named kaggle_member_count is defined. Note that after each object is created the number of objects created is correctly given even though the function kaggler1. Preprocess The preprocessing on the data set is done using this class. In the above example the constructor function has four different parameters self name surname level. Design Prenciples 1. Instance variable A variable that is defined inside a method and belongs only to the current instance of a class. Design Goals The key point in the object oriented paradigma is designing code structure. This input control is a small example for Robustness mentioned above. Classes should be singular and capitalized e. Constructor A special funciton which is called when a new instance of class created. They will be shared by all the instances of the class. Define preprocess strategy Go to Contents Menu 0. An object obj that belongs to a class Circle for example is an instance of the class Circle. Visualize 2. OBJECT ORIENTED PROGRAMMING The key point in the object oriented paradigma is object. In lines 4 5 6 and 8 the initial assignments of instance variables were made with values from the constructor function. When creating kaggler3 object three parameters were sent to constructor function King man. Convention for Coding Style 1. By convention this argument is always named self. Preprocess class Go to Contents Menu 0. For the example above it will take the value None. Modularity is organizing principle of code into various functional units Abstraction is to simplisfication a complex inner machanism to fundemantel parts Encapsulation mean that class inner details have not to be known by outer users Go to Contents Menu 0. Create ObjectOrientedTitanic object Go to Contents Menu 0. MAX_SIZE Go to Contents Menu 0. It is strongly recommended that tabs be avoidedUse meaningful names for variables funcitons classes etc. Python allows class definition without adding parentheses eg KaggleMember. Each object is an instance of class. display_number_of_member prints the number of members. The function kaggler1. However it is a good programming practice to write class variables just below the class name. The remaining lines contain the functions used. Starting Point of Object Oriented Programming Class A class play as fundemental role for abstraction in OOP. Typically a class includes Instance variables also known as data members Methods also known as member functions Go to Contents Menu 0. Adaptability or evolvability or portability is ability to run on different hadware and operating systems. PreprocessStrategy class 2. Let s understand how it is by examining the following code. Two different classes are defined in the above code. Visualize Go to Contents Menu 0. The word self should be written as the first parameter of each function created in the Python class definition. level variable according to the value of the level parameter. In fact every object we created in Python inherits methods from object which is super class of all Python class. Inheritance is a perfect way to go. Inheritance 1. Information class 2. The function prints the information of the object kaggler1. Preprocess class 2. One is implicitly inherited while the other is explicitly inherited. Object oriented programming is largely based on personal experience and is open to development. For this reason if the fourth parameter is not sent when the function is called it will get its default value. You can append when you run the kernel Because of depricating warning for RandomForestClassifier which is not appended. The methods of the three classes are the same. GridSearchHelper Class for parameter optimization for machine learning algorithms. Mebmer functions also known as methods perform set of actions with implementations that are common to all instances of that class. org dev peps pep 0008 Python code blocks are typically indented by 4 spaces. For this reason these parameters must be sent when the function is called. Display Information in R Style Go to Contents Menu 0. Design Goals 1. Three different KaggleMember objects were created. The PreprocessStrategy class was created to develop different pre processing strategies. Instance variables are owned by the specific instances of a class. The methods and attributes we have described are at the end of the list. Note that when values are assigned to variables different inputs are transformed into the desired form. Variables sould be lowercase noun and separeted by underscore for multiple words e. Display R Type Information 2. First Example KaggleMember class 1. Starting Point of Object Oriented Programming Class 1. Many thanks for upvotes and feedbacks ____ Contents 1. The second and third parameters have no default value. This means for two different instances the instance variables are usuallydifferent. We can select any of two Radian Viz figure Run all machine learning algorithms defined in object. GridSearchHelper class Go to Contents Menu 0. Class variable A variable that is shared by all instances of a class. Then the display_member_info function of the kaggler1 object is called. Testing Go to Contents Menu 0. GridSearchHelper class 2. Design goals of object oriented paradigms are robustness adaptability and reusability Robustness is capablity of handling unexpexted input. A function has been used for value assignment. The function assigns the value of the self. The aim of this kernel is to provide a solution for data science projects by using an Object Oriented Programming OOP approach. At the bottom of the KaggleMember class a class variable defined for learning purposesConstructor function is defined in line 3. PreprocessStrategy class Go to Contents Menu 0. There are three parameters that come after self. OBJECT ORIENTED PROGRAMMING 1. Therefore they have the same value for every instance. The methods and attributes of the KaggleMember class are shown below. In Python the constructor function has a special name __init __. Get GridSearchCV Results 2. If there are user defined methods in the class the dir function will show them too. Attributes also known as fields instance variables or data members determine the information for each instance. Comments and criticisms will provide a better code design. display_number_of_member is called. Reusability is opportunity of using same code as a component of different systems. You can append when you run the kernel for ensemble concat train and test data Create instance of objects There are currently two strategy type strategy1 strategy2. Get GridSearchCV Results Notes Please note this kernel is currently in progress but open to feedback and upvotes o____o Thanks class member object members Implicitly inheritance Explicityl inheritance linear algebra data processing Getting sum of missing values for each feature Feature missing values are sorted from few to many Returning missing values 1 indicate axis 1 column 1 indicate axis 1 column None mean that all feature will be dummied Because of depricating warning for Decision Tree which is not appended. Using the predefined dir function the methods belong to MyDefinedClass YourDefinedClass and object is predefined class in Python are printed on the screen. First Example KaggleMember class Let s have some code to understand above definitionsLet s explain the code above. The same process is performed for each object When creatin Kaggler1 object three parameters were sent to constructor function SeRKaN peldek expert. Class variables are attributes which are owned by the class itself. The bracket symbols are added at the end of the class name. Define preprocess strategy 2. Go to Contents Menu 0. ObjectOrientedTitanic The class for which all classes are managed. ", "id": "serkanpeldek/object-oriented-titanics", "size": "11153", "language": "python", "html_url": "https://www.kaggle.com/code/serkanpeldek/object-oriented-titanics", "git_url": "https://www.kaggle.com/code/serkanpeldek/object-oriented-titanics", "script": "RandianViz show_result display_member_info _get_train_and_test get_clf_and_params _get_all_data MyDefinedClass sklearn.svm numpy _base_feature_engineering preprocessing _get_missing_values _get_dummies info SVC strategy sklearn.neighbors drop sklearn.tree _label_encoder add sklearn.linear_model Information() _set_level fillna display_number_of_member feature_engineering matplotlib.pyplot _base_strategy _strategy2 DecisionTreeClassifier save_result ObjectOrientedTitanic() RadViz KaggleMember() machine_learning _feature_engineering1 sklearn.model_selection pandas Preprocess() RandomForestClassifier LogisticRegression _initialize_clf_and_params _strategy1 Visualizer VotingClassifier KNeighborsClassifier GridSearchHelper() information __init__ yellowbrick.features LabelEncoder GridSearchCV visualize PreprocessStrategy() fit_predict_save sklearn.ensemble YourDefinedClass(object) sklearn.preprocessing ", "entities": "(('Display Information', 'Contents Menu'), 'go') (('when you', 'objects'), 'append') (('class variable', 'line'), 'define') (('Variables', 'words multiple e.'), 'be') (('Class variables', 'class outside functions'), 'define') (('constructor function', 'four different parameters'), 'have') (('three parameters', 'peldek expert'), 'perform') (('instance variable', 'value'), 'assign') (('it', 'value'), 'take') (('class variable', 'class'), 'require') (('that', 'objects'), 'consist') (('PreprocessStrategy class', 'Contents Menu'), 'go') (('robustness reusability Robustness', 'unexpexted input'), 'be') (('s', 'code'), 'let') (('strongly tabs', 'variables funcitons avoidedUse meaningful classes'), 'recommend') (('However it', 'class just name'), 'be') (('remaining lines', 'functions'), 'contain') (('Therefore they', 'instance'), 'have') (('OBJECT ORIENTED key point', 'object oriented paradigma'), 'programming') (('word self', 'Python class definition'), 'write') (('s', 'codes'), 'let') (('They', 'class'), 'share') (('ObjectOrientedTitanic class', 'Contents Menu'), 'go') (('Style official Guide', 'www'), 'convention') (('Reusability', 'different systems'), 'be') (('Create ObjectOrientedTitanic object', 'Contents Menu'), 'go') (('three that', 'self'), 'be') (('preprocessing', 'class'), 'preprocess') (('PreprocessStrategy Preprocessing', 'data Titanic set'), 'be') (('Adaptability', 'different hadware'), 'be') (('Then display_member_info function', 'kaggler1 object'), 'call') (('org dev Python code pep 0008 blocks', 'typically 4 spaces'), 'peps') (('we', 'list'), 'be') (('Design key point', 'code structure'), 'goal') (('classes', 'which'), 'ObjectOrientedTitanic') (('6 initial assignments', 'constructor function'), 'make') (('Design Prencible Design princeble', 'object oriented programming'), 'be') (('when values', 'desired form'), 'note') (('Book', 'multple words e.'), 'be') (('number', 'objects'), 'note') (('Python', 'eg KaggleMember'), 'allow') (('Constructor functions', 'generally initial values'), 'invoke') (('Define preprocess strategy', 'Contents Menu'), 'go') (('instance variables', 'two different instances'), 'mean') (('dir function', 'them'), 'show') (('that', 'class Circle'), 'be') (('function', 'self'), 'assign') (('Two different classes', 'above code'), 'define') (('code design', 'kernel'), 'improve') (('Constant sould', 'words multiple e.'), 'product_id') (('predefined class', 'screen'), 'print') (('which', 'class'), 'be') (('argument', 'convention'), 'name') (('Attributes', 'instance'), 'determine') (('first argument', 'class'), 'be') (('Inheritance One', 'previously written code'), 'be') (('class inner details', 'Contents Menu'), 'organize') (('methods', 'KaggleMember class'), 'show') (('it', 'competion accuracy high score'), 'give') (('which', 'Python super class'), 'inherit') (('bracket symbols', 'class name'), 'add') (('three parameters', 'constructor function King man'), 'object') (('Comments', 'code better design'), 'provide') (('First we', 'class key word'), 'give') (('data members also Methods', 'Contents Menu'), 'include') (('word self', 'user preference'), 'be') (('Class variable that', 'class'), 'variable') (('second parameters', 'default value'), 'have') (('Object oriented programming', 'development'), 'base') (('constructor function', 'special name'), 'have') (('methods', 'three classes'), 'be') (('PreprocessStrategy class', 'processing different pre strategies'), 'create') (('display_number_of_member', 'members'), 'print') (('fourth parameter', 'default value'), 'have') (('We', 'object'), 'select') (('that', 'class'), 'function') (('when function', 'reason'), 'send') (('which', 'RandomForestClassifier'), 'append') (('which', 'Decision Tree'), 'GridSearchCV') (('how it', 'following code'), 'let') (('function', 'object kaggler1'), 'print') (('work', 'screen'), 'working') (('function', 'value assignment'), 'use') (('three parameters', 'grand master'), 'send') (('that', 'class'), 'variable') (('it', 'default value'), 'for') (('GridSearchHelper class', 'Contents Menu'), 'go') (('aim', 'Oriented Programming OOP Object approach'), 'be') (('input control', 'small Robustness'), 'be') (('Instance variables', 'class'), 'own') (('when new instance', 'class'), 'funciton') "}