{"name": "one stop understanding eda efficientunet ", "full_name": " h1 HuBMAP Hacking the Kidney h3 Let s understand the problem statement first h3 Domain Knowledge h4 1 What is Glomerulus h4 2 PAS Periodic acid Schiff Stain Microscopy h4 3 FTU Functional Tissue Unit h3 Let s understand the DATA now h4 TIFF File Format h4 RLE h3 Evaluation Metric h4 Dice Coefficient h4 Jaccard Score h4 Relation between Dice Coefficient and Jaccard Score h4 J D 2 D h3 Let s do the EDA now h4 File Structure h3 Training Image Analysis h4 Width and Height Distribution h4 Image Utilitity Functions h3 Training Images With Glomerulis h3 Glomerulis h4 Basic Statistics h4 Glomerulis Per Image h4 Glomeruli Width Height and Area Distribution h4 Glomerulis by Size h4 Five Smallest Glomerulis h4 Five Largest Glomerulis h3 SUB EffUNet5 TPU EfficientUNet 512x512 h3 References ", "stargazers_count": 0, "forks_count": 0, "description": "The train set includes annotations in both RLE encoded RLE is explained later in the notebook and unencoded JSON forms. csv files shows the format of the submissions files consisting of the test image id and an rle encoded masks. Training Image AnalysisWidth and Height DistributionThe training images do not have consistent dimensions. PAS Periodic acid Schiff Stain MicroscopyPAS is a histology stain that detects complex sugars in tissue sections. csv for each training image id. It is composed of a renal corpuscle and a renal tubule. The IsLocked field is the same across file types locked in glomerulus unlocked for anatomical structure and is not signal bearing. JSON files are structured as follows A type Feature and object type id PathAnnotationObject. expand_dims mask 1 Plot full image Plot glomeruli images PUBLIC_TFREC use created tfrecords for public test set with MIN_OVERLAP 300 tiling 1024 512 ignore other private test data FULL do not use tfrecords just full submission compute mask sum for each image METRICS True False whether to run prediction when committing. The size of the images varies greatly as well. csv contains additional information about each image such as image size and anonymized patient data. I suppose this can be used for pretraining. Glomeruli can be observed as the circular areas of dark stain. FTU Functional Tissue Unit FTU or functional tissue unit is a three dimensional maximally connected block of cells centered around a capillary such that each cell in this block is within diffusion distance from any other cell in the same block. TIFF File FormatTag Image File Format abbreviated TIFF or TIF is a computer file format for storing raster graphics images popular among graphic artists the publishing industry and photographers. csv is in Running Length Encoding format. This encoding comes in pairs of pixel values as follows 1. They have on of the following shapes height width channel channel height width 1 1 channel height width Image Utilitity FunctionsTraining Images With GlomerulisGlomerulisBasic StatisticsGlomerulis Per ImageGlomeruli Width Height and Area DistributionGlomerulis by SizeFive Smallest GlomerulisFive Largest GlomerulisSUB EffUNet5 TPU EfficientUNet 512x512In the code below I will try to use TPU EfficientUNet 512x512 with freeze pretrained SUB EffUNet5. I believe I used some terminologies that are confusing. The private test set is larger than the public test set. So lets understand these terms and get some Domain Knowledge. com roydatascience hubmap sub effunet5 tpu efficientunet 512x512 Libraries Number of glomeruli to display for each image Number of glomberuli to save as tiff files. For this task we are given historical images of kidney and annotation information representing the glomerular segmentation. HuBMAP Hacking the KidneyLet s understand the problem statement firstThe aim of this competition is to develop a segmentation problem to identify Glomerulus in the kidney. Let s understand the DATA now The Dataset is comprised of very large TIFF files TIFF is described later in the notebook. Number of pixels from the starting pixel. This index has become arguably the most broadly used tool in the validation of image segmentation algorithms created with AI but it is a much more general concept which can be applied sets of data for a variety of applications including NLP. The Dice coefficient can be used to compare the pixel wise agreement between a predicted segmentation and its corresponding ground truth. Paitient Data HuBMAP 20 dataset_information. Although it s easy to interpret it is extremely sensitive to small samples sizes and may give erroneous results especially with very small samples or data sets with missing observations. com kwk100 hubmap exploratory data analysis edahttps www. The annotations denote segmentations of glomeruli. The resulting aldehydes react with the Schiff reagent to produce the purple magenta color exhibited by these images. The training set has 8 files. In short each nephron in your kidneys has a microscopic filter called a glomerulus that is constantly filtering your blood. For this we have to train a segmentation model that takes PAS kidney image input and identify the segments of glomeruli FTU in the PAS stained microscopy data. Both training and public test sets include anatomical structure segmentations. The renal corpuscle consists of a tuft of capillaries called a glomerulus and an encompassing Bowman s capsule. Jaccard ScoreThe Jaccard similarity index sometimes called the Jaccard similarity coefficient compares members for two sets to see which members are shared and which are distinct. This has to be corrected when loading the images. The public test set has 5 files. The formula to find the Index is Jaccard Index the number in both sets the number in either set 100Relation between Dice Coefficient and Jaccard ScoreJ D 2 DLet s do the EDA now File StructureThe files in the root of the dataset are shown below. Glomerulus a cluster of nerve endings spores or small blood vessels in particular a cluster of capillaries around the end of a kidney tubule where waste products are filtered from the blood. ndim 2 mask np. It s a measure of similarity for the two sets of data with a range from 0 to 100. What is Glomerulus First we understand what Nephron is. Note that these fields are the same between all files and do not offer signal. Utility Functions Processing Directory Contents Training Images Test Images Train CSV The masks indicating a glomeruli FTUs are stored in rle format in the train. The higher the percentage the more similar the two populations. The nephron is the microscopic structural and functional unit of the kidney. Referenceshttps www. WILL RUN predictions during submission in any case len folds_to_predict. csv The sample_submission. TIFF is a flexible adaptable file format for handling images and data within a single file by including the header tags size definition image data arrangement applied image compression defining the image s geometry. A geometry containing a Polygon with coordinates for the feature s enclosing volume Additional properties including the name and color of the feature in the image. RLEThe masks provided in the train. So to specify 10 pixels starting from pixel number 200 would be written as 200 10Evaluation MetricDice CoefficientDice coefficient is a statistical tool which measures the similarity between two sets of data. Sample_Submission. Periodic acid is used to break specific bonds within these sugars. This will help to improve the existing algorithms used to detect functional tissue units FTUs across different tissue preparation pipelines. The dataset consists of 2 directories that contain training and test images and 3 csv files with additional information about the images. I suppose there will be 7 files. ", "id": "vera666/one-stop-understanding-eda-efficientunet", "size": "6336", "language": "python", "html_url": "https://www.kaggle.com/code/vera666/one-stop-understanding-eda-efficientunet", "git_url": "https://www.kaggle.com/code/vera666/one-stop-understanding-eda-efficientunet", "script": "_parse_image overlay_image_mask load_dataset rle_to_image overlay_image_mask_original global_shift_mask numpy efficientnet tqdm read_image tensorflow read_mask get_tile analyze_image Window matplotlib.pyplot rle_encode_less_memory make_grid pandas tqdm.notebook read_image_mask get_dataset get_image_id plot_glom rasterio.windows get_particles ", "entities": "(('TIFF File FormatTag Image File Format', 'publishing industry'), 'abbreviate') (('This', 'tissue preparation different pipelines'), 'help') (('that', 'images'), 'consist') (('that', 'constantly blood'), 'have') (('that', 'terminologies'), 'believe') (('Dice coefficient', 'predicted segmentation'), 'use') (('histology that', 'tissue sections'), 'be') (('test data 300 1024 512 other private FULL', 'prediction'), 'PUBLIC_TFREC') (('csv', 'Running Length Encoding format'), 'be') (('we', 'glomerular segmentation'), 'give') (('statistical which', 'data'), 'be') (('which', 'two sets'), 'call') (('it', 'data missing observations'), 'be') (('header tags size definition image data arrangement', 'geometry'), 'be') (('fields', 'signal'), 'note') (('File StructureThe now files', 'dataset'), 'set') (('csv', 'image such size'), 'contain') (('train set', 'JSON forms'), 'include') (('waste where products', 'blood'), 'Glomerulus') (('annotations', 'glomeruli'), 'denote') (('It', '100'), 's') (('test private set', 'test public set'), 'be') (('nephron', 'microscopic structural kidney'), 'be') (('this', 'pretraining'), 'suppose') (('image Number', 'tiff files'), 'sub') (('that', 'microscopy data'), 'have') (('such cell', 'same block'), 'be') (('Glomeruli', 'dark stain'), 'observe') (('So lets', 'Domain Knowledge'), 'understand') (('resulting aldehydes', 'images'), 'react') (('renal corpuscle', 'capillaries'), 'consist') (('This', 'when images'), 'have') (('Training Image AnalysisWidth', 'Height training consistent dimensions'), 'have') (('It', 'renal corpuscle'), 'compose') (('IsLocked field', 'anatomical structure'), 'be') (('freeze', 'SUB'), 'have') (('Periodic acid', 'sugars'), 'use') (('size', 'images'), 'vary') (('TIFF', 'later notebook'), 'let') (('firstThe aim', 'kidney'), 'hack') (('FTUs', 'train'), 'Functions') (('training', 'test structure public anatomical segmentations'), 'include') (('JSON files', 'type Feature'), 'structure') (('much more general which', 'NLP'), 'become') (('encoding', '1'), 'come') (('com kwk100 hubmap exploratory data analysis', 'www'), 'edahttps') (('i rle', 'masks'), 'show') "}