{"name": "optical flow estimation using raft ", "full_name": " h1 What s Optical flow h1 RAFT introduction h1 Run RAFT on sample images h1 Run on NFL video h1 Have a nice football flow ", "stargazers_count": 0, "forks_count": 0, "description": "org wiki Optical_flow In this competition each player motion can be essential for detecting the helmet impact. com princeton vl RAFT licensed under the BSD 3 Clause License Briefly RAFT has below features Recurrent optical flow estimation Compute pixel wise correlation between pair wise input images and reuse it in the following recurrent step Lightweight rapid inference and high accuracy RAFT architecture image from https github. 12039 https github. RAFT introductionI introduce the model RAFT Recurrent All Pairs Field Transforms for Optical Flow which is originally introduced in ECCV2020 by Teed et. Run on NFL videoRAFT seems to capture the motion of each player. Have a nice football flow weights_path kaggle input raft pytorch raft things. Run RAFT on sample imagesThe first and second columns are input paired images and right column is the predicted optical flow. png This is my explanation slide https speakerdeck. pth map flow to rgb image convert BGR RGB. com princeton vl RAFT https github. I m going to introduce a deep learning model for optical flow estimation. in Princeton University and prized Best Paper Award. com princeton vl RAFT raw master RAFT. com daigo0927 raft recurrent all pairs field transforms for optical flow in Japanese. What s Optical flow Optical flow or optic flow is the pattern of apparent motion of objects surfaces and edges in a visual scene caused by the relative motion between an observer and a scene. ", "id": "daigohirooka/optical-flow-estimation-using-raft", "size": "1467", "language": "python", "html_url": "https://www.kaggle.com/code/daigohirooka/optical-flow-estimation-using-raft", "git_url": "https://www.kaggle.com/code/daigohirooka/optical-flow-estimation-using-raft", "script": "raft.core.utils numpy RAFT viz matplotlib.pyplot RAFTConfig glob raft.core.utils.utils flow_viz PIL InputPadder raft.config raft.core.raft tqdm load_image Image ", "entities": "(('Run', 'player'), 'seem') (('com princeton vl RAFT', 'accuracy RAFT architecture https high github'), 'feature') (('Optical flow Optical flow', 'observer'), 'be') (('I', 'flow optical estimation'), 'm') (('which', 'Teed et'), 'introduce') (('pairs field', 'Japanese'), 'recurrent') (('player motion', 'helmet impact'), 'Optical_flow') (('first columns', 'sample imagesThe'), 'be') "}