{"name": "panda tiles tf keras cohen kappa loss baseline ", "full_name": " h1 PANDA baseline h2 Tiles of image h2 Load data h2 Model h2 Train the model h2 Inference ", "stargazers_count": 0, "forks_count": 0, "description": "com iafoss panda 16x128x128 tiles PANDA keras baseline from Noble https www. CohenKappa metric and WeightedKappaLoose are used as implemented in TensorFlow Addons 0. Version 2 Top layers from block7b_add and above from EfficientNetB3 base model are also trained. data frame with the image_id encode label list pretrained weights with ImageNet set more layers trainable pretrained weights with ImageNet. Lower layers are fixed at ImageNet weights. QWKs for train and validation set are both 0. Tiles of imageLoad whole slide image WSI and select 16 128x128 tiles from each image according to the number of tissure pixels. The generated data in a batch ModelModel based on EfficientNetB3 Plot of the top layers from EfficientNetB3 base model. Train the model Inference path to save model pretrained model from efficientnet package version for the model to be saved 16 128x128 tiles are selected from each image and mask a fast image augmentation library This function selects tiles of size x for image of and mask based on the maximum number of tissue pixels. Load essential modules. Check TensorFlow and TensorFlow Addons version. ValueError axes don t match array Version 4 Load saved weights from Version 1 using the same model as Version 1. Update to TensorFlow 2. Check GPUs availability. com nobletp panda keras baseline Thank you for sharing This model uses quadratic weighted kappa QWK as loss and metric as implemented in TensorFlow Addons. Then set more layers trainable. Lower layers from EfficientNetB3 are fixed at ImageNet weights. Load dataAugmentationGet statistics of images composed of tiles. 0 and TensorFlow Addons 0. Version 1 Only the top fully connected layer is trained. PANDA baselineThis notebook got inspirations from PANDA 16X128X128 tiles from Iafoss https www. Layer block7b_add and above layers are trained. ", "id": "yjiaowla/panda-tiles-tf-keras-cohen-kappa-loss-baseline", "size": "1510", "language": "python", "html_url": "https://www.kaggle.com/code/yjiaowla/panda-tiles-tf-keras-cohen-kappa-loss-baseline", "git_url": "https://www.kaggle.com/code/yjiaowla/panda-tiles-tf-keras-cohen-kappa-loss-baseline", "script": "albumentations tensorflow_addons train_test_split get_compiled_model tile glue_to_one numpy PANDA_Sequence(Sequence) efficientnet.tfkeras on_epoch_end Sequence get_statistics plot_tiles mem_use(K.callbacks.Callback) tensorflow tensorflow.keras.utils matplotlib.pyplot Sequential sklearn.model_selection pandas Model tensorflow.keras __len__ __init__ get_uncompiled_model __getitem__ ", "entities": "(('data frame', 'ImageNet'), 'pretraine') (('com panda 16x128x128 PANDA iafoss keras', 'Noble https www'), 'tile') (('QWKs', 'train set'), 'be') (('Lower layers', 'ImageNet weights'), 'fix') (('com nobletp panda keras', 'TensorFlow Addons'), 'baseline') (('notebook', 'Iafoss https 16X128X128 www'), 'get') (('Tiles', 'tissure pixels'), 'tile') (('Layer', 'layers'), 'train') (('Version 2 Top layers', 'EfficientNetB3 base model'), 'train') (('function', 'tissue pixels'), 'train') (('CohenKappa metric', 'TensorFlow Addons'), 'use') (('ValueError don t match array Version 4 Load', 'Version'), 'axis') "}