{"name": "panda challenge comprehensive data exploration ", "full_name": " h1 Prostate cANcer graDe Assessment PANDA Challenge h1 Contents h1 Understanding Data Files h1 Load Required Packages h1 Load all the Data Files h4 Let s look at the Columns of each dataframes h1 Check for Missing Data h1 Exploratory Data Analysis h3 BokehJS h4 Let s Do a lite Analysis on the Gleason Score h4 Let s now do a collective exploration on the distribution of ISUP Grade and Gleason Score Values h4 Discussion h4 Now let us look at how the Gleason Score is distributed bas on the two data sources h4 Now that we have done a some good amount of exploration on the data files let s look ta the Image Files h1 Images of Microscopy Scans of Prostate Biopsy Samples h3 Using OpenSlide to load the data h4 Let s try to read a single patch By giving the name of the file h2 Visualise the Label Masks h4 Visualizing masks using matplotlib h2 Overlaying Masks on the Slides h1 Analysis on the Image Characterstics h2 Let s see the Characterstics on a Single image slide h2 Let s load all Characterstics for all the images h3 Let s create a Scatter Plot for Height and Width h3 More analysis on the distribution of the Height and Width h3 Width vs Data Provider h3 Height vs Data Provider h3 Width vs ISUP Grade h3 Height vs ISUP Grade h3 Width vs Gleason Score h3 Height vs Gleason Score h3 Height and Width Distribution Side by Side h3 Let s Visualise the Levels h1 Conclusion h1 References ", "stargazers_count": 0, "forks_count": 0, "description": "Let s check now the train data in train_images and train_label masks folders. Let s now do a collective exploration on the distribution of ISUP Grade and Gleason Score Values. png attachment Screen 20Shot 202020 04 08 20at 202. The full versions will be available to your submitted notebooks. Note that slightly different procedures were in place for the images used in the test set than the training set. Screen 20Shot 202020 04 08 20at 202. Diagnosis of PCa is based on the grading of prostate tissue biopsies. The cardnality of both the intersections is equal with the data dimmensions. For example using matplotlib and a custom color map we can quickly visualize the different cancer regions Overlaying Masks on the SlidesAs the masks have the same dimension as the slides we can overlay the masks on the tissue to directly see which areas are cancerous. These markings are not part of the tissue but were made by the pathologists who originally checked this case. This overlay can help you identifying the different growth patterns. Hi Kagglers We are here again with another amazing competition In this notebook let us try and explore the data given for Prostate cANcer graDe Assessment PANDA Challenge. The goal is to predict isup_grade for each image in test set. We saw how we can do a simple exploratory data analysis that gives us great insights If you liked the Kernal then don t forget to hit the Upvote Also Suggestion are always Welcomed Post your Doubts and Suggestions on the Comment Section. For Karolinska next in terms of frequency are samples with Gleason score 3 3 3 4 4 4. They used different scanners with slightly different maximum microscope resolutions and worked with different pathologists for labeling their images. jpg With more than 1 million new diagnoses reported every year prostate cancer PCa is the second most common cancer among males worldwide that results in more than 350 000 deaths annually. There are noticable color differences between the biopsies this is very common within pathology and is caused by different laboratory procedures. For details on how the gleason and ISUP systems compare see the Additional Resources tab. Visualise the Label Masks Visualizing masks using matplotlib Given that the masks are just integer matrices you can also use other packages to display the masks. Let s see how ISUP grade is distributed with respect of Data provider. The grading process consists of finding and classifying cancer tissue into so called Gleason patterns 3 4 or 5 based on the architectural growth patterns of the tumor Fig. se en meb are the two data providers as well as the organisers of the competition. This can also be illustrated using a heat map Looks really awesome Now let us look at how the Gleason Score is distributed bas on the two data sources We can observe that all of the 0 0 Gleason score data samples are from Karolinska while from Radboud we have most of negative data. The column gleason_score is only present in train data that is not present either in test with image_id data_provider or in sample submission image_id isup_grade csv. The severity of the cancer on a 0 5 scale. Visualise the Label Masks p7 8. org isup proposed a novel validated grading system for clear cell renal cell carcinoma ccRCC and papillary renal cell carcinoma pRCC that has been implemented by the World Health Organization WHO. This rotation has no clinical value and is only dependent on how the biopsy was collected in the lab. References PANDA Challenge Starting EDA http www. csv A valid submission file. Let s Do a lite Analysis on the Gleason_ScoreThe above plot clearly illustrates that the data is imbalanced with respect of Gleason Score values distribution. Note In the example below you can also observe a few pen markings on the slide Dark green patches. All exams with ISUP grade 3 have Gleason score 4 3. Most of the 2 5 ISUP Grade samples are originated from Radboud. These tissue samples are examined by a pathologist and scored according to the Gleason grading system. Now that we have done a some good amount of exploration on the data files let s look ta the Image Files Images of Microscopy Scans of Prostate Biopsy SamplesWe will write a function that will take each image name and then combine it with the image path and displays the images. Load Required Packages Load all the Data Files Let s look at the Columns of each dataframesTest and Sample Submission. Biopsies can be in different rotations. Conclusion p10 11. Not all training images have label masks and there may be false positives or false negatives in the label masks for a variety of reasons. Loading Required Packages p2 3. These pen markings are available on some slides in the training set. Valid values are 0 background non tissue or unknown 1 stroma connective tissue non epithelium tissue 2 healthy benign epithelium 3 cancerous epithelium Gleason 3 4 cancerous epithelium Gleason 4 5 cancerous epithelium Gleason 5 Karolinska Regions are labelled. Using OpenSlide to load the dataIn the following sections we will load data from the slides with OpenSlide. com gpreda panda challenge starting eda PANDA EDA Better Visualization Simple Baseline http www. Each is a large multi level tiff file. We are gonna see the count of the data providers Radboud University Medical Center http www. Some of the training set images have stray pen marks on them but the test set slides are free of pen marks. The benefit of OpenSlide is that we can load arbitrary regions of the slide without loading the whole image in memory. This is a notebooks only competition the downloadable test. In 2012 the International Society of Urologic Pathologists ISUP http isupweb. An alternate cancer severity rating system with more levels than the ISUP scale. Valid values are 1 background non tissue or unknown 2 benign tissue stroma and epithelium combined 3 cancerous tissue stroma and epithelium combined sample_submission. These masks are provided to assist with the development of strategies for selecting the most useful subsamples of the images. The mask values depend on the data provider Radboud Prostate glands are individually labelled. All exams with ISUP grade 4 have Gleason score 4 4 majority 3 5 or 5 3. csv and sample_submission. jpg attachment what is a PSA test_745x510_njaecd. Discussion All exams with ISUP grade 0 have Gleason score 0 0 or negative. csv files have only 3 rows samples. All exams with ISUP grade 2 have Gleason score 3 4. Overlaying Masks on the Slides p8 9. train_label_masks Segmentation masks showing which parts of the image led to the ISUP grade. For Radboud next in terms of frequency most frequent are samples with Gleason score 4 3 3 3 3 4 4 4 4 5. After the biopsy is assigned a Gleason score it is converted into an ISUP grade on a 1 5 scale. That means there is No Missing Data All images indexed in train data has corresponding tiff images and tiff label masks. Exploratory Data Analysis BokehJSBokehJS is the in browser client side runtime library that users of Bokeh ultimately interact with. Images of Microscopy Scans of Prostate Biopsy Samples p6 7. org api python Let s try to read a single patch By giving the name of the fileWe can also create a small function that will give us the meta data about the slides Running the cell below loads seven example biopsies using OpenSlide. Each slide has 3 levels you can load corresponding to a downsampling of 1 4 and 16. You can expect roughly 1 000 images in the hidden test set. 000 pixels in both x and y. All exams with ISUP grade 5 have Gleason score 4 5 majority 5 4 or 5 5. Check for Missing Values p4 5. Analysis on the Imgae Characterstics p9 10. This system is based primarily on the nucleoli assessment of the tumors as follows 1 Grade 1 Inconspicuous nucleoli at 400 magnification and basophilic Grade 2 Clearly visible nucleoli at 400 magnification and eosinophilic Grade 3 Clearly visible nucleoli at 100 magnification Grade 4 Extreme pleomorphism or rhabdoid and or sarcomatoid morphologyLet s do a little analysis on the ISUP grade The above graph illustrates that majority of data samples in training set have ISUP grade values 0 or 1 total 50 and the rest of the data samples have associated ISUP grades from 2 to 5 with all ranging in the 11 12 each. I hope you find this notebook useful and your UPVOTES would be very much appreciated. gleason_score Train only. The key to decreasing mortality is developing more precise diagnostics. Intermediate levels can be created by downsampling a higher resolution level. Analysis on the Image Characterstics Let s see the Characterstics on a Single image slide In the output we can see the metadata like the File id Dimensions Microns per pixel etc. nl en research and Karolinska Institute http ki. The dimensions of each level differ based on the dimensions of the original image. Let s load all Characterstics for all the images Warning While you run the below code Don t think your kernel isn t responding This takes a little time We have succesfully added the width height spacing and level_count Let s create a Scatter Plot for Height and Width More analysis on the distribution of the Height and WidthLet s create a function that can create visuals by taking the features as input Width vs Data Provider Height vs Data Provider Width vs ISUP Grade Height vs ISUP Grade Width vs Gleason Score Height vs Gleason Score Height and Width Distribution Side by Side Let s Visualise the Levels ConclusionThat s it We reached the end of our exercise. This library is written primarily in TypeScript and is one of the unique things about the Bokeh plotting system. References p11 Understanding Data FilesLet s look at the data files given and understand what data they have and what they represent. csv have been truncated. com rohitsingh9990 panda eda better visualization simple baseline Render and show the vbar plot Create alpha mask Mapping 0 background 1 stroma 2 benign epithelium 3 Gleason 3 4 Gleason 4 5 Gleason 5 Mapping 0 background 1 benign 2 cancer. You can read more about the OpenSlide python bindings in the documentation https openslide. Exploratory Data Analysis p5 6. isup_grade Train only. Before we dive deep into the data let us know a little more about the competition. Want to interactively view a slide We have added an interactive viewer to this notebook in the last section. Understanding Data Files p1 2. csv image_id ID code for the image. Some things you can notice The image dimensions are quite large typically between 5. Now we will compare the intersections of sets of resulted lists. For this we will remove the suffix and extension from label masks and will remove the extension from image list. All exams with ISUP grade 1 have Gleason score 3 3. To do this we load both the mask and the biopsy and merge them using PIL. train test _images The images. It helps me keep Motivated Prostate cANcer graDe Assessment PANDA Challenge Prostate cancer diagnosis using the Gleason grading system what is a PSA test_745x510_njaecd. data_provider The name of the institution that provided the data. Both the Karolinska Institute and Radboud University Medical Center contributed data. to generate great visualisations but let s also give BokehJS a try Install BokehJS with Pip if you don t have it Let s start with checking the distribution of data_provider isup_grade and gleason_score in the training data train_df. We can use Matplotlib Seaborn Plotly etc. Most of the 0 1 ISUP Grade samples are originated from Karolinska. Check for Missing DataLet s check for the missing values in the data. ", "id": "risabbiswas19/panda-challenge-comprehensive-data-exploration", "size": "12214", "language": "python", "html_url": "https://www.kaggle.com/code/risabbiswas19/panda-challenge-comprehensive-data-exploration", "git_url": "https://www.kaggle.com/code/risabbiswas19/panda-challenge-comprehensive-data-exploration", "script": "show_masks Rectangle show numpy seaborn tqdm_notebook Spectral8 tqdm figure matplotlib.patches plot_distribution_grouped bokeh.plotting matplotlib.pyplot print_slide_details output_notebook ColumnDataSource overlay_mask_on_slide pandas show_images bokeh.palettes ", "entities": "(('full versions', 'submitted notebooks'), 'be') (('masks', 'images'), 'provide') (('Segmentation parts', 'ISUP grade'), 'train_label_masks') (('how gleason', 'Additional Resources tab'), 'see') (('they', 'what'), 'p11') (('s', 'dataframesTest'), 'Load') (('slightly different procedures', 'training set'), 'note') (('This', 'only downloadable test'), 'be') (('ISUP', 'Urologic Pathologists'), 'http') (('dimensions', 'original image'), 'differ') (('count', 'Radboud University Medical www'), 'go') (('we', 'PIL'), 'load') (('who', 'originally case'), 'be') (('us', 'competition'), 'let') (('We', 'exercise'), 'let') (('s', 'training data'), 'generate') (('Better Visualization Simple Baseline', 'www'), 'challenge') (('directly areas', 'tissue'), 'visualize') (('nl research', 'Karolinska ki'), 'http') (('that', 'sample submission'), 'be') (('tissue samples', 'Gleason grading system'), 'examine') (('this', 'laboratory different procedures'), 'be') (('Now we', 'resulted lists'), 'compare') (('cardnality', 'data dimmensions'), 'be') (('Intermediate levels', 'resolution higher level'), 'create') (('They', 'images'), 'use') (('Discussion', 'ISUP grade'), 'exam') (('ISUP how grade', 'Data provider'), 'let') (('integer just you', 'masks'), 'visualise') (('test set slides', 'pen marks'), 'have') (('2 Gleason', '3 4'), 'score') (('key', 'more precise diagnostics'), 'develop') (('it', '1 5 scale'), 'assign') (('we', 'memory'), 'be') (('users', 'Bokeh'), 'be') (('You', 'test hidden set'), 'expect') (('image dimensions', 'quite typically 5'), 'be') (('5 Gleason', '4 5 majority'), 'score') (('Missing images', 'tiff corresponding images'), 'mean') (('Diagnosis', 'tissue prostate biopsies'), 'base') (('clearly data', 'Gleason Score values distribution'), 'let') (('training images', 'reasons'), 'have') (('rohitsingh9990 panda com eda', 'baseline better simple Render'), 'visualization') (('Most', 'Karolinska'), 'originate') (('us', 'Prostate cANcer graDe Assessment PANDA Challenge'), 'hi') (('we', 'negative data'), 'illustrate') (('We', 'last section'), 'want') (('We', 'Plotly etc'), 'use') (('worldwide that', '350 more than 000 deaths'), 'jpg') (('only how biopsy', 'lab'), 'have') (('we', 'OpenSlide'), 'use') (('4 Gleason', '4 4 majority'), 'score') (('3 Karolinska 2 healthy benign epithelium 3 cancerous epithelium 4 cancerous 4 5 cancerous Gleason 5 Regions', 'stroma 0 background non unknown 1 connective non epithelium tissue'), 'be') (('s', 'train_images'), 'let') (('grading process', 'tumor Fig'), 'consist') (('you', '1 4'), 'have') (('we', 'etc'), 'let') (('Radboud University Medical Karolinska Institute Center', 'data'), 'contribute') (('s', 'ISUP Grade'), 'let') (('we', 'image list'), 'remove') (('3 Gleason', '4 3'), 'score') (('pen markings', 'training set'), 'be') (('Bokeh', 'system'), 'write') (('all', '11 12'), 'base') (('1 Gleason', '3 3'), 'score') (('what', 'Gleason grading system'), 'help') (('that', 'data'), 'data_provider') (('goal', 'test set'), 'be') (('you', 'growth different patterns'), 'help') (('Gleason', '3'), 'be') (('don then t', 'Comment always Welcomed Section'), 'forget') (('Most', 'Radboud'), 'originate') (('that', 'images'), 'do') (('that', 'OpenSlide'), 'let') (('You', 'documentation https'), 'read') (('cell carcinoma papillary renal that', 'World Health Organization'), 'propose') "}