{"name": "panda eda better visualization simple baseline ", "full_name": " h2 About this notebook h1 1 Dive deep into domain knowledge h3 Q1 What is Prostate Cancer h3 Q2 How it is tested and detected h3 Q3 Where does GLEASON score fit in all of this h3 Q4 I got it but What is ISUP grade now h3 Q5 How has the Gleason scores been generated in the dataset h1 2 Getting started with the PANDA dataset h2 3 Loading Dataset h3 Output Variables h3 Note There are no test images publically available h2 4 Basic EDA h3 4 1 Checking for data provider distribution h3 4 2 Checking for isup grade distribution h3 4 3 Checking for gleason score distribution h3 4 4 Let s check for relative distribution of isup grade and data provider h3 4 5 Let s check for relative distribution of gleason score and data provider h3 4 6 Let s check for relative distribution of isup grade and gleason score h2 5 Quickly displaying few images h2 6 Loading label masks h3 Visualizing masks using matplotlib h3 Displaying images and masks for each isup grade category h2 Overlaying masks on the slides h2 Exploring images with pen markers h2 Simple Baseline h3 Ending note Please upvote this kernel if you like it It motivates me to produce more quality content ", "stargazers_count": 0, "forks_count": 0, "description": "These masks directly indicate which parts of the tissue are healthy and which are cancerous. Note that slightly different procedures were in place for the images used in the test set than the training set. If you use Qupath and the images do not load try changing the file extension to. Examples of open source viewers that can open the PANDA dataset are ASAP https github. This is a standard way of staining the originally transparent tissue to produce some contrast. These markings are not part of the tissue but were made by the pathologists who originally checked this case. This overlay can help you identifying the different growth patterns. If a DRE or PSA test detects an abnormality your doctor may recommend further tests to determine whether you have prostate cancer such as Ultrasound If other tests raise concerns your doctor may use transrectal ultrasound to further evaluate your prostate. The most common scale used to evaluate the grade of prostate cancer cells is called a Gleason score. 000 whole slide images WSI of prostate biopsies from Radboud University Medical Center and the Karolinska Institute. ASAP can also overlay the masks on top of the images using the Overlay functionality. com rohitsingh9990 panda resize and save image mask overlay notebook scriptVersionId 32614926 https www. Rest of the data samples have associated ISUP grades from 2 to 5 with all ranging in the 11 12 each. Exploring images with pen markersIt is mentioned here https www. org api python Few Insights The image dimensions are quite large typically between 5. Each epithelial unit is separate and has a lumen. The information in the masks differ from the two centers Radboudumc Prostate glands are individually labelled. There are noticable color differences between the biopsies this is very common within pathology and is caused by different laboratory procedures. For details on how the gleason and ISUP systems compare see the Additional Resources tab. A Benign prostate glands with folded epithelium The cytoplasm is pale and the nuclei small and regular. Few gleason_score like 3 3 and 0 0 are more frequent while others like 3 5 and 5 3 are very rare in this dataset. The glands are hollow structures which can be seen as white holes or branched cavities in the WSI. There are also some poorly formed small glands and some fused glands. Let s take a look on few of these images. Q2 How it is tested and detected Prostate screening tests might include Digital rectal exam DRE During a DRE your doctor inserts a gloved lubricated finger into your rectum to examine your prostate which is adjacent to the rectum. The severity of the cancer on a 0 5 scale. com c prostate cancer grade assessment data that in training dataset there are few images with pen markers on them. Gleason scoring combines two numbers and can range from 2 nonaggressive cancer to 10 very aggressive cancer though the lower part of the range isn t used as often. The samples are made up of glandular tissue and connective tissue. This rotation has no clinical value and is only dependent on how the biopsy was collected in the lab. epithelial sheets with multiple lumina. Prostate cancer is one of the most common types of cancer in men. All exams with ISUP grade 3 have Gleason score 4 3. Also in gleason_score category 3 3 karolinska is major data provider. A small probe about the size and shape of a cigar is inserted into your rectum. B Prostatic adenocarcinoma Gleason Pattern 3 has no loss of glandular differentiation. There is an attempt to form lumina but the tumor fails to form complete well developed glands. The label masks of Karolinska were semi autotomatically generated based on annotations by a pathologist. com c prostate cancer grade assessment discussion 145574 discussion thread it is clear that there are 100 images which do not have any mask in the mask directory. Loading Dataset Output Variables isup_grade The target variable. Biopsies can be in different rotations. Overlaying masks on the slidesAs the masks have the same dimension as the slides we can overlay the masks on the tissue to directly see which areas are cancerous. Simple BaselineRefrence to my other works for this competition https www. Note In the example below you can also observe a few pen markings on the slide dark green smudges. This microphotograph shows irregular cribriform cancer i. com c prostate cancer grade assessment discussion 145850 Help taken from following kernel https www. It motivates me to produce more quality content There are two ways to load the data from the PANDA dataset Option 1 Load images using openslide Option 2 Load images using skimage requires that tifffile is installed General packages Plotly for the interactive viewer see last section Location of the training images image and mask directories Location of training labels Create alpha mask Mapping 0 background 1 stroma 2 benign epithelium 3 Gleason 3 4 Gleason 4 5 Gleason 5 Mapping 0 background 1 benign 2 cancer. As with the slides itself the label masks can be opened using OpenSlide. The appearance of the glands forms the basis of the Gleason grading system. These pen markings are available on some slides in the training set. Gleason Pattern 5 may also contain solid sheets or strands of cancer cells. Valid values are 0 background non tissue or unknown 1 stroma connective tissue non epithelium tissue 2 healthy benign epithelium 3 cancerous epithelium Gleason 3 4 cancerous epithelium Gleason 4 5 cancerous epithelium Gleason 5 Karolinska Regions are labelled. Dispersed single cancer cells are seen in the stroma. Valid values 0 background non tissue or unknown 1 benign tissue stroma and epithelium combined 2 cancerous tissue stroma and epithelium combined The label masks of Radboudumc were semi automatically generated by several deep learning algorithms contain noise and can be considered as weakly supervised labels. Collecting a sample of prostate tissue If initial test results suggest prostate cancer your doctor may recommend a procedure to collect a sample of cells from your prostate prostate biopsy. com kaggle media competitions PANDA Screen 20Shot 202020 04 08 20at 202. Some of the training set images have stray pen marks on them but the test set slides are free of pen marks. The benefit of OpenSlide is that we can load arbitrary regions of the slide without loading the whole image in memory. 4 Let s check for relative distribution of isup_grade and data_provider inference In isup_grade category 0 and 1 most of the data is provided by karolinska. On the other hand radbound is major data provider for 4 4 4 3 4 5 5 4 5 5 5 3 3 5. 3 Checking for gleason_score distribution inference From above graph it is clear that gleason_score distribution is not uniform. An alternate cancer severity rating system with more levels than the ISUP scale. com rohitsingh9990 panda resnext inference https www. Prostate biopsy is often done using a thin needle that s inserted into the prostate to collect tissue. All exams with ISUP grade 4 have Gleason score 4 4 majority 3 5 or 5 3. The label information is stored in the red R channel the other channels are set to zero and can be ignored. com gpreda panda challenge starting eda https www. Tip Want to view the slides in a more interactive way Using a WSI viewer you can interactively view the slides. Q5 How has the Gleason scores been generated in the dataset Each WSI in this challenge contains one or in some cases two thin tissue sections cut from a single biopsy sample. The glands are grouped together. Want to interactively view a slide We have added an interactive viewer Interactive viewer for slides to this notebook in the last section. 2 Checking for isup_grade distribution inference Majority of data samples in train set have ISUP grade values 0 or 1 total 50. In gleason_score category negative all the data is provided by radbound. All exams with ISUP grade 2 have Gleason score 3 4. 6 Let s check for relative distribution of isup_grade and gleason_score inference All exams with ISUP grade 0 have Gleason score 0 0 or negative. Dataset is not balanced in terms of gleason_score. It s normal for a small amount of PSA to be in your bloodstream. This kernel will be a work in Progress and I will keep on updating it as the competition progresses If you find this kernel useful Please consider Upvoting it it motivates me to write more Quality content 1. Usually prostate cancer grows slowly and is initially confined to the prostate gland where it may not cause serious harm. The glandular structure characteristic of healthy prostate tissue is progressively lost with increasing grade. Each slide has 3 levels you can load corresponding to a downsampling of 1 4 and 16. All microphotographs show hematoxylin and eosin stains at 20x lens magnification. Loading label masksApart from the slide level label present in the csv file almost all slides in the training set have an associated mask with additional label information. Dive deep into domain knowledge So lets start with the domain knowledge and Address the first question Q1 What is Prostate Cancer Prostate cancer is cancer that occurs in the prostate a small walnut shaped gland in men that produces the seminal fluid that nourishes and transports sperm. Getting started with the PANDA datasetThis notebook shows a few methods to load and display images from the PANDA challenge dataset. 5 Let s check for relative distribution of gleason_score and data_provider inference In gleason_score category 0 0 all the data is provided by karolinska. D Prostatic adenocarcinoma Gleason Pattern 5 has an almost complete loss of glandular differentiation. Visualizing masks using matplotlib Given that the masks are just integer matrices you can also use other packages to display the masks. Q3 Where does GLEASON score fit in all of this When a biopsy confirms the presence of cancer the next step is to determine the level of aggressiveness grade of the cancer cells. 000 pixels in both x and y. All of these are included in Gleason Pattern 4. All exams with ISUP grade 5 have Gleason score 4 5 majority 5 4 or 5 5. com iamleonie panda eda visualizations suspicious data Domain knowledge info taken from https www. If your doctor finds any abnormalities in the texture shape or size of the gland you may need further tests. Prostate specific antigen PSA test A blood sample is drawn from a vein in your arm and analyzed for PSA a substance that s naturally produced by your prostate gland. png Note There are no test images publically available. The cytoplasm is often dark and the nuclei enlarged with dark chromatin and some prominent nucleoli. gleason_score Train only. In isup_grade category 3 4 and 5 most of the data is provided by radbound. com tanulsingh077 prostate cancer in depth understanding eda modelmore to come will update soon Ending note Please upvote this kernel if you like it. Quickly displaying few imagesIn the following sections we will load data from the slides with OpenSlide https openslide. The grading system recognizes three categories 3 4 and 5. Intermediate levels can be created by downsampling a higher resolution level. A higher grade indicates a more aggressive cancer that is more likely to spread quickly. About this notebookIn this notebook I will start with complete explanation of everything you need know related to Prostate Cancer and its detection and I will built on that to explain the dataset and perform extensive EDA. The dataset consists of around 11. The label masks are stored in an RGB format so that they can be easily opened by image readers. Small glands infiltrate between benign glands. C Prostatic adenocarcinoma Gleason Pattern 4 has partial loss of glandular differentiation. The dimensions of each level differ based on the dimensions of the original image. 1 Checking for data provider distribution 4. Q4 I got it but What is ISUP grade now According to current guidelines by the International Society of Urological Pathology ISUP the Gleason scores are summarized into an ISUP grade on a scale from 1 to 5 according to the following rule Gleason score 6 ISUP grade 1 Gleason score 7 3 4 ISUP grade 2 Gleason score 7 4 3 ISUP grade 3 Gleason score 8 ISUP grade 4 Gleason score 9 10 ISUP grade 5 If there is no cancer in the sample we use the label ISUP grade 0 in this competition. Dataset is not balanced in terms of isup_grade. A laboratory pathologist examines a sample of your cancer to determine how much cancer cells differ from the healthy cells. You can read more about the OpenSlide python bindings in the documentation https openslide. However while some types of prostate cancer grow slowly and may need minimal or even no treatment other types are aggressive and can spread quickly. For example using matplotlib and a custom color map we can quickly visualize the different cancer regions Displaying images and masks for each isup_grade categoryCheck for images without masks as from this https www. Prior to scanning the tissue is stained with haematoxylin eosin H E. com computationalpathologygroup ASAP and QuPath https qupath. The tissue sample is analyzed in a lab to determine whether cancer cells are present. All exams with ISUP grade 1 have Gleason score 3 3. To do this we load both the mask and the biopsy and merge them using PIL. However if a higher than normal level is found it may indicate prostate infection inflammation enlargement or cancer. com rohitsingh9990 panda resnext inference ensemble lb 0 66 https www. The probe uses sound waves to create a picture of your prostate gland. The organizers left us with a Note as described below. ", "id": "rohitsingh9990/panda-eda-better-visualization-simple-baseline", "size": "14218", "language": "python", "html_url": "https://www.kaggle.com/code/rohitsingh9990/panda-eda-better-visualization-simple-baseline", "git_url": "https://www.kaggle.com/code/rohitsingh9990/panda-eda-better-visualization-simple-baseline", "script": "plot_relative_distribution load_and_resize_image seaborn display_images matplotlib.pyplot display plot_count display_masks load_and_resize_mask IPython.display Image plotly.graph_objs overlay_mask_on_slide pandas numpy ", "entities": "(('org api Few image dimensions', 'quite typically 5'), 'python') (('grade', 'prostate cancer cells'), 'call') (('B', 'glandular differentiation'), 'have') (('we', '0 competition'), 'get') (('doctor', 'prostate prostate biopsy'), 'recommend') (('hollow which', 'branched WSI'), 'be') (('Intermediate levels', 'resolution higher level'), 'create') (('0 0 data', 'karolinska'), 'let') (('Dataset', 'gleason_score'), 'balance') (('almost all slides', 'label additional information'), 'have') (('we', 'memory'), 'be') (('5 Gleason', '4 5 majority'), 'score') (('that', 'tissue'), 'do') (('tumor', 'complete well developed glands'), 'be') (('probe', 'prostate gland'), 'use') (('only how biopsy', 'lab'), 'have') (('I', 'extensive EDA'), 'about') (('doctor', 'further prostate'), 'detect') (('tissue two thin sections', 'biopsy single sample'), 'Q5') (('appearance', 'Gleason grading system'), 'form') (('3 Gleason', '4 3'), 'score') (('next step', 'cancer cells'), 'score') (('you', 'growth different patterns'), 'help') (('it', 'Quality more content'), 'be') (('which', 'tissue'), 'indicate') (('how gleason', 'Additional Resources tab'), 'see') (('other channels', 'zero'), 'store') (('D Prostatic adenocarcinoma', 'glandular differentiation'), 'have') (('slightly different procedures', 'training set'), 'note') (('we', 'PIL'), 'load') (('notebook', 'PANDA challenge dataset'), 'show') (('cancer how much cells', 'healthy cells'), 'examine') (('we', 'OpenSlide https'), 'display') (('images', 'file extension'), 'try') (('more others', '5 very dataset'), 'be') (('organizers', 'Note'), 'leave') (('microphotograph', 'cribriform cancer irregular i.'), 'show') (('cancer cells', 'lab'), 'analyze') (('mask Location', '3 3 4 4 5 Gleason 5 Mapping 0 background 1 benign 2 cancer'), 'motivate') (('that', 'PANDA dataset'), 'be') (('Dataset', 'isup_grade'), 'balance') (('which', 'rectum'), 'include') (('Gleason scoring', 'range isn t'), 'combine') (('grading system', 'three categories'), 'recognize') (('structure glandular characteristic', 'progressively increasing grade'), 'lose') (('small probe', 'rectum'), 'insert') (('s', 'ISUP grade'), 'let') (('s', 'images'), 'let') (('C Prostatic adenocarcinoma', 'glandular differentiation'), 'have') (('data', 'radbound'), 'provide') (('Small glands', 'benign glands'), 'infiltrate') (('Gleason Pattern', 'cancer cells'), 'contain') (('label masks', 'pathologist'), 'generate') (('epithelial unit', 'lumen'), 'be') (('microphotographs', '20x lens magnification'), 'show') (('cytoplasm', 'often dark chromatin'), 'be') (('that', 'seminal fluid'), 'deep') (('dimensions', 'original image'), 'differ') (('it', 'prostate infection inflammation enlargement'), 'find') (('Exploring', 'pen markersIt'), 'mention') (('who', 'originally case'), 'be') (('4 most', 'radbound'), 'provide') (('gleason_score distribution', 'graph'), 'check') (('1 most', 'karolinska'), 'let') (('test set slides', 'pen marks'), 'have') (('com c prostate cancer grade assessment discussion', 'kernel https 145850 www'), 'help') (('you', 'further tests'), 'need') (('We', 'last section'), 'want') (('4 Gleason', '4 4 majority'), 'score') (('you', '1 4'), 'have') (('custom color we', 'https www'), 'visualize') (('1 Gleason', '3 3'), 'score') (('All', 'Gleason Pattern'), 'include') (('You', 'documentation https'), 'read') (('they', 'image easily readers'), 'store') (('small amount', 'bloodstream'), 's') (('Prostate cancer', 'men'), 'be') (('even other types', 'slowly minimal'), 'be') (('this', 'laboratory different procedures'), 'be') (('you', 'it'), 'update') (('cytoplasm', 'prostate Benign folded epithelium'), 'gland') (('you', 'interactively slides'), 'want') (('3 3 karolinska', 'gleason_score Also category'), 'be') (('information', 'centers Radboudumc Prostate two glands'), 'label') (('100 which', 'mask directory'), 'prostate') (('2 Gleason', '3 4'), 'score') (('cancer Dispersed single cells', 'stroma'), 'see') (('that', 'more aggressive cancer'), 'indicate') (('samples', 'glandular tissue'), 'make') (('label masks', 'OpenSlide'), 'open') (('directly areas', 'tissue'), 'overlay') (('3 Karolinska 2 healthy benign epithelium 3 cancerous epithelium 4 cancerous 4 5 cancerous Gleason 5 Regions', 'stroma 0 background non unknown 1 connective non epithelium tissue'), 'be') (('that', 'naturally prostate gland'), 'test') (('all', '11 12'), 'associate') (('where it', 'serious harm'), 'grow') (('integer just you', 'masks'), 'visualize') (('pen markings', 'training set'), 'be') (('ASAP', 'Overlay functionality'), 'overlay') (('This', 'contrast'), 'be') (('tissue tissue label unknown 1 benign epithelium combined 2 cancerous masks', 'weakly supervised labels'), 'combine') (('2 Checking', 'ISUP grade values'), 'have') "}