{"name": "panda tissue detection size optimization 70 ", "full_name": " h1 Tissue Detection and Size Optimization h2 Objective h2 Results h1 Getting Strated with the Numpy Images h2 Basic Slide Downsample h2 As Numpy Array h1 Detecting Tissue h2 Leveraging Academic Research h1 Sensitivity Exploration h1 Cutting out all space except for the identified Tissue h1 Getting Bounding Boxes h3 Starting with simple boxes h2 Getting Simple Rectangle Bounding Box h2 Min Rectagle Bounding Boxes h1 Cropping the Image h2 Basic cropping h2 Crop with Smart Bounding and Rotation to Minimum Size h2 Remove space between countors in final bounding box h1 Whole Pipeline Start Here for Code Only h1 Baseline for Corpus 67 8 h1 Next Steps ", "stargazers_count": 0, "forks_count": 0, "description": "Results I have another notebook https www. Additionally I have made the pre processed images https www. To achieve this we adopt a threshold based segmentation method to automatically detect the background region. For speed of commiting the notebook I have it set to only 5 in this notebook. Getting Bounding Boxes Starting with simple boxesThe first method experimented with finds a minimum bounding rectangle for all of the identified countors. Checking Effectiveness on lower downsamples All imports Setup code https stackoverflow. Returns Binary mask as numpy 2D array RGB slide image in the used downsampling level in case the user is visualizing output examples and downsampling factor. 1 Dayong Wang Aditya Khosla Rishab Gargeya Humayun Irshad Andrew H. Base Notebook Currently Here https www. This can be used as a preprocessing step in order to remove large swaths of the images that do not conatin meningful data for prediciton. Baseline for Corpus 67. pdf lends itself nicely to the detection on Prostate Cells in the PANDA challenge esepcially in the area of pre processing. Inspired by method used by Wang et al. The baseline is set at 5000 and should be adjusted down to capture more potential issue and adjusted up to be more agressive with trimming the slide. com dannellyz panda tissue detection size optimization 70 Tissue Detection Intro and First Application Base Dataset Generation https www. As the below examples illustrate the choosen downsample has a big imapct on the size of the representation Detecting TissueThis notebook draws on the work of Luís https github. An excerpt from the paper explaining the methodology To reduce computation time and to focus our analysis on regions of the slide most likely to contain cancer metastasis we first identify tissue within the WSI and exclude background white space. jpeg attachment tissue_logo. com dannellyz tissue detection bounding box metadata eda viz Exploring features from bounding boxes discovery on the slides Tissue Detection and Size Optimization Objective This notebook leverages academic research and previous repositories in pathology to idnetiify regions of interst ROIs in provided slides and optimally crop the full image to contain a the maximum amount of tissue informaiton while minimizing the overall size. com luisvalesilva wsipre work available on Github. Cutting out all space except for the identified TissueOnce we have identified a given sensitivity and the areas it identifies as tissue we can then cut out the rest of the image. The higher the downsampling rate the less resolution the image will have. Sensitivity ExplorationWhen considering what sensitivty to choose we dont want a high enough number to remove noise but also a low enough number to make sure we capture all of the tissue. Beck Deep Learning for Identifying Metastatic Breast Cancer arXiv 1606. jpeg Tissue Detection is a key aspect to research in the domain of computer vision applied to cancer classification. Leveraging Academic ResearchPreviously pubilshed work in the domain of Deep Learning for Identifying Metastatic Breast Cancer https arxiv. Remove space between countors in final bounding boxNow that we have everything but the minimum bounding boxes we can cut any blank space between the inner most areas of the contours. My main focus in this competition so far has been exploring previous work done in this domain and furthering its application towards this dataset. Getting Simple Rectangle Bounding BoxThis example makes a simple rectangle that captures all of the identified countors Min Rectagle Bounding BoxesWith the goal of minimizing the total area of the images the next method implemented concatenates all tissue contours found and builds a cumulative minimum boudning rectanlge. 8 Here we try to get a average for the reduciton capacity of this code across the data corpus. com dannellyz tissue detect td conv png 512x512 Notebook to export images to zip file Scaling Bounding Boxes https www. com a 28759496 Create mask where white is what we want black otherwise Draw filled contour in mask Extract out the object and place into output image Set up dictionary for plotting Open Slide Get returns from detect_tissue Add Base Slide to verbose print Get Tissue Only Slide Add Tissue Only to verbose print Get minimal bounding rectangle for all tissue contours Crop with getSubImage Add Bounding Boxes to verbose print Crop empty space Remove by row Remove by column Add Space Cut Boxes to verbose print Get size change Nested in funciton to not take up more memory and allow mulitprocessing. It also greatly improves speed and memory capacity. com wouterbulten getting started with the panda dataset Visualizing masks using matplotlib. com luisvalesilva and his WSIPRE https github. As you can see even thought we have cut out all non tissue parts of the slide the size has not changed. com a 11172032 Select the min downsampling factor Between the input value and the available values from the slide Set the level of the slide by the downsampling Read and convert to numpy array Set up example slide Open slide as wsi Get a downsample of the whole slide image to fit in memory Convert from RGB to HSV color space Compute optimal threshold values in each channel using Otsu algorithm Make mask boolean Base Example Sensitivity Tests https stackoverflow. Timing the processing and making it more efficient3. For visuals the bounding boxes were left but in the full pipeline below they are removed. Downsample Example http dicom. Returns Binary mask as numpy 2D array RGB slide image in the used downsampling level in case the user is visualizing output examples Downsampling factor. The method def draw_tissue_polygons from WSIPRE allows for vizualizaiton of this deteciton Parameters wsi OpenSlide AnnotatedOpenSlide class instance The whole slide image WSI to detect tissue in. com dannellyz panda preprocessing tissue detection available as well. Initial research leads to a conclusion of 3000 but I want to do more work on this in next steps. We start with a simple rectangluar crop Crop with Smart Bounding and Rotation to Minimum SizeTo better reduce size we take the Smart Bounding Box we calulated and rotate the image to minimize the size while keeping everything within the bounding box. This work informs the method def detect_tissue Find RoIs containing tissue in WSI. I have run the sampler over the whole corpus and come out with 68. com dannellyz tissue detect scaling bounding boxes 4xfaster 4x speed increase to base notebook Tissue Dection Metadata Analysis https www. Notebooks in this collection include the following. to start this walk through we use a very high downsampling in order to prove the concept and at the end with a low downsampling to show the effectiveness. org Dicom DICOMWSI sup145_fromword_files image010. We do this by sampling from the whole and taking an average of the recoded size reduciton. For this notebook we will be working with the slides as Numpy Arrays. gif As Numpy ArrayOnce the image has been downsampled there are many ways it could be represented as best described in the Notebook Getting Started with the PANDA Dataset Using Matplotlib https www. com dannellyz tissue detect png 512x512 pre process that takes the lessons from this process and directly applies them to the data corpus as pre processing. Cropping the Image Basic cropping Now that ROIs have been indentified we can now crop the image based on the bounding boxes. sensitivity int The desired sensitivty of the model to detect tissue. downsampling_factor int The desired factor to downsample the image by since full WSIs will not fit in memory. Generate mask locating tissue in an WSI. 05718 Parameters wsi OpenSlide AnnotatedOpenSlide class instance The whole slide image WSI to detect tissue in. Since Prostate Biopsies are not orientated in a specific way this does not effect prediciton. The image s closest level downsample is found and used. Exploring how this methodology effects the mask slides2. Whole Pipeline Start Here for Code OnlyNow that we have explained each of the steps along the way we can put the whole pipeline together. Getting Strated with the Numpy Images Basic Slide DownsampleDownsampling is a process to take the Whole Slide Image WSI and get lower lever representations of the slide. jsp tp arnumber 4310076 and the final mask images are generated by combining the masks from H and S channels. In particular we first transfer the original image from the RGB color space to the HSV color space then the optimal threshold values in each channel are computed using the Otsu algorithm https ieeexplore. ", "id": "dannellyz/panda-tissue-detection-size-optimization-70", "size": "8552", "language": "python", "html_url": "https://www.kaggle.com/code/dannellyz/panda-tissue-detection-size-optimization-70", "git_url": "https://www.kaggle.com/code/dannellyz/panda-tissue-detection-size-optimization-70", "script": "statistics display_downsample mean getSubImage detect_tissue numpy skimage draw_tissue_polygons sensitivity_test Pool tqdm tissue_cutout matplotlib.pyplot get_disk_size pandas tqdm.notebook baseline_check downsample plot_figures morphology otsu_filter multiprocessing detect_and_crop ", "entities": "(('Academic ResearchPreviously', 'Metastatic Breast Cancer https arxiv'), 'leverage') (('threshold then optimal values', 'Otsu algorithm https ieeexplore'), 'transfer') (('they', 'full pipeline'), 'leave') (('jpeg Tissue Detection', 'cancer classification'), 'be') (('full WSIs', 'memory'), 'int') (('we', 'background white space'), 'excerpt') (('pre that', 'pre processing'), 'detect') (('RoIs', 'WSI'), 'inform') (('how methodology', 'mask'), 'explore') (('Tissue Size Optimization notebook', 'overall size'), 'detection') (('we', 'Numpy Arrays'), 'work') (('We', 'size recoded reduciton'), 'do') (('com dannellyz panda', 'tissue detection'), 'available') (('also low enough we', 'tissue'), 'ExplorationWhen') (('it', 'processing'), 'time') (('otherwise Draw', 'mulitprocessing'), 'com') (('com dannellyz tissue', 'notebook Tissue Dection Metadata Analysis https www'), 'detect') (('com dannellyz tissue', 'zip file Scaling Bounding Boxes https www'), 'detect') (('that', 'prediciton'), 'use') (('main focus', 'dataset'), 'explore') (('Results I', 'notebook https www'), 'have') (('pdf', 'pre processing'), 'lend') (('Parameters', 'slide image whole tissue'), 'allow') (('baseline', 'more slide'), 'set') (('notebook', 'Luís https github'), 'have') (('size', 'slide'), 'change') (('minimum bounding', 'identified countors'), 'get') (('we', 'image'), 'identify') (('tissue contours', 'boudning cumulative minimum rectanlge'), 'make') (('we', 'whole pipeline'), 'start') (('it', 'notebook'), 'for') (('we', 'effectiveness'), 'use') (('I', '68'), 'run') (('we', 'bounding boxes'), 'crop') (('user', 'output examples Downsampling factor'), 'mask') (('we', 'bounding box'), 'start') (('jsp tp mask 4310076 final images', 'H channels'), 'arnumber') (('we', 'contours'), 'cut') (('Setup', 'https stackoverflow'), 'check') (('Notebooks', 'following'), 'include') (('I', 'next steps'), 'lead') (('Strated', 'slide'), 'be') (('It', 'also greatly speed capacity'), 'improve') (('many it', 'Matplotlib https www'), 'gif') (('this', 'prediciton'), 'orientate') (('Here we', 'data corpus'), '8') (('user', 'output examples'), 'mask') (('Additionally I', 'images https pre processed www'), 'make') (('we', 'background automatically region'), 'adopt') "}