{"name": "pipeline for stain normilized training keras ", "full_name": " h3 Pipeline for Stain Normilized Training Keras ", "stargazers_count": 0, "forks_count": 0, "description": "During the transformation however I had problems with the some images leading to a singular matrix during the conversion. 05931 Stain normalization of histopathology images using generative adversarial networks http https ieeexplore. Pipeline for Stain Normilized Training Keras With this kernel you can train a Deep Neural Network with stain normalized images. com Peter554 StainTools Demonstration of images where I could not perform stain normalization because they lead to a singular matrix during the conversion. Show example stain transformation Convert from cv2 standard of BGR to our convention of RGB. The basic idea is to convert train and test images to the similar color space. All source images are transformed on the basis of a randomly selected target image. Train Test Test cleaned Remove error mages from the training set Remove error images from the test set Reduce train set for demonstration only Split data set to train and validation sets Use stratify df label to get balance ratio 1 1 in train and validation sets Check balancing Train List Validation List Test list Test cleaned Test error id dictionary Example of images where you will have trouble with stain normalization Functions for generators Augmentation Horizontal flips 50 images Hrizontal flips 50 images Crop some of the images by 0 10 of their height width Translate images by 20 to 20 on x and y axis independently Rotate images by 45 to 45 degrees apply augmenters in random order STAIN NORMALIZATION FUNCTIONS Convert to range 0 1. Stain Normalization on the fly Chose any random target iamge for stain normalization Perform stain normalization Train Generator Train the model Plot validation and accuracies over epochs Predict cleaned stain normalized test data Predict error test data without stain normalization. I found these images in the train and test set. Here are some papers describing Stain Normalization Neural Stain Normalization and Unsupervised Classification of Cell Nuclei in Histopathological Breast Cancer Images http https arxiv. 03815 The importance of stain normalization in colorectal tissue classification with convolutional networks http https arxiv. org document 8363641 I took and changed the main functions from https github. Check it s not empty Convert to OD and ignore background Eigenvectors of cov in OD space orthogonal as cov symmetric The two principle eigenvectors Make sure vectors are pointing the right way Project on this basis. Angular coordinates with repect to the prinicple orthogonal eigenvectors Min and max angles the two principle colors Order of H and E. Perform stain normalization Import Pretrained Models Load pretrained model Concatenate Pretrained Models Classifier Read and convert images to rgb Convert from cv2 standard of BGR to our convention of RGB. ", "id": "robotdreams/pipeline-for-stain-normilized-training-keras", "size": "1187", "language": "python", "html_url": "https://www.kaggle.com/code/robotdreams/pipeline-for-stain-normilized-training-keras", "git_url": "https://www.kaggle.com/code/robotdreams/pipeline-for-stain-normilized-training-keras", "script": "is_image convert_OD_to_RGB keras.layers keras.models train_test_split Activation get_stain_matrix DenseNet169 keras sklearn.utils keras.preprocessing.image numpy get_tissue_mask MaxPooling2D Concatenate augmenters Dropout Adam normalize_matrix_rows ImageDataGenerator BatchNormalization TissueMaskException(Exception) Dense randint cv2 preprocess_input chunker convert_RGB_to_OD mapping GlobalAveragePooling2D keras.layers.normalization keras.callbacks imgaug read_image keras.optimizers random matplotlib.pyplot ModelCheckpoint GlobalMaxPooling2D Sequential shuffle sklearn.model_selection pandas get_concentrations applications is_uint8_image get_id_from_file_path Model Input augmentation augmenters as iaa keras.applications.densenet train_gen stain_normalization Flatten ", "entities": "(('Here papers', 'https arxiv'), 'be') (('Rotate axis independently images', 'random order'), 'clean') (('Plot validation', 'stain normalization'), 'choose') (('I', 'train'), 'find') (('Import Pretrained Models Load', 'RGB'), 'perform') (('importance', 'https arxiv'), '03815') (('Min', 'H'), 'angle') (('basic idea', 'color similar space'), 'be') (('vectors', 'basis'), 'check') (('Stain normalization', 'https ieeexplore'), '05931') (('however I', 'conversion'), 'have') (('they', 'conversion'), 'Demonstration') (('source images', 'target randomly selected image'), 'transform') (('org 8363641 I', 'https github'), 'document') (('you', 'stain normalized images'), 'train') "}