{"name": "pneumonia detection using cnn 92 6 accuracy ", "full_name": " h1 What is Pneumonia h1 Importing the necessary libraries h1 Description of the Pneumonia Dataset h1 Loading the Dataset h1 Data Visualization Preprocessing h1 Data Augmentation h1 Training the Model h1 Analysis after Model Training ", "stargazers_count": 0, "forks_count": 0, "description": "Risk factors include cystic fibrosis chronic obstructive pulmonary disease COPD asthma diabetes heart failure a history of smoking a poor ability to cough such as following a stroke and a weak immune system. Training the Model Analysis after Model Training Some of the Correctly Predicted Classes Some of the Incorrectly Predicted Classes This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. Reshaping images to preferred size Normalize the data resize data for deep learning With data augmentation to prevent overfitting and handling the imbalance in dataset set input mean to 0 over the dataset set each sample mean to 0 divide inputs by std of the dataset divide each input by its std apply ZCA whitening randomly rotate images in the range degrees 0 to 180 Randomly zoom image randomly shift images horizontally fraction of total width randomly shift images vertically fraction of total height randomly flip images randomly flip images. Randomly shift images horizontally by 10 of the width 4. Randomly Zoom by 20 some training images3. Pneumonia is usually caused by infection with viruses or bacteria and less commonly by other microorganisms certain medications or conditions such as autoimmune diseases. The disease may be classified by where it was acquired such as community or hospital acquired or healthcare associated pneumonia. Chest X ray blood tests and culture of the sputum may help confirm the diagnosis. Randomly flip images horizontally. Some popular augmentations people use are grayscales horizontal flips vertical flips random crops color jitters translations rotations and much more. Randomly shift images vertically by 10 of the height 5. The diagnoses for the images were then graded by two expert physicians before being cleared for training the AI system. png attachment image. of training examples we will use data augmentation Previewing the images of both the classes We perform a grayscale normalization to reduce the effect of illumination s differences. What is Pneumonia Pneumonia is an inflammatory condition of the lung affecting primarily the small air sacs known as alveoli. All chest X ray imaging was performed as part of patients routine clinical care. There are 5 863 X Ray images JPEG and 2 categories Pneumonia Normal. Approaches that alter the training data in ways that change the array representation while keeping the label the same are known as data augmentation techniques. In order to account for any grading errors the evaluation set was also checked by a third expert. The idea is to alter the training data with small transformations to reproduce the variations. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. Symptoms typically include some combination of productive or dry cough chest pain fever and difficulty breathing. Data Augmentation In order to avoid overfitting problem we need to expand artificially our dataset. For the data augmentation i choosed to 1. For the analysis of chest x ray images all chest radiographs were initially screened for quality control by removing all low quality or unreadable scans. The severity of the condition is variable. Moreover the CNN converges faster on 0. By applying just a couple of these transformations to our training data we can easily double or triple the number of training examples and create a very robust model. Diagnosis is often based on symptoms and physical examination. png Importing the necessary libraries Description of the Pneumonia Dataset The dataset is organized into 3 folders train test val and contains subfolders for each image category Pneumonia Normal. Once our model is ready we fit the training dataset. Chest X ray images anterior posterior were selected from retrospective cohorts of pediatric patients of one to five years old from Guangzhou Women and Children s Medical Center Guangzhou. read_csv Input data files are available in the. Randomly rotate some training images by 30 degrees 2. Loading the Dataset Data Visualization Preprocessing The data seems imbalanced. We can make your existing dataset even larger. For example running this by clicking run or pressing Shift Enter will list all files under the input directory Any results you write to the current directory are saved as output. ", "id": "madz2000/pneumonia-detection-using-cnn-92-6-accuracy", "size": "3500", "language": "python", "html_url": "https://www.kaggle.com/code/madz2000/pneumonia-detection-using-cnn-92-6-accuracy", "git_url": "https://www.kaggle.com/code/madz2000/pneumonia-detection-using-cnn-92-6-accuracy", "script": "classification_report keras.layers keras.models train_test_split confusion_matrix get_training_data keras.preprocessing.image numpy seaborn Dropout ImageDataGenerator BatchNormalization Dense keras.callbacks MaxPool2D ReduceLROnPlateau matplotlib.pyplot Sequential sklearn.model_selection pandas Conv2D sklearn.metrics Flatten ", "entities": "(('chest radiographs', 'low quality'), 'screen') (('idea', 'variations'), 'be') (('chest X ray imaging', 'clinical care'), 'perform') (('Symptoms', 'chest pain productive fever'), 'include') (('we', 'very robust model'), 'double') (('asthma', 'such stroke'), 'include') (('Chest X ray blood tests', 'diagnosis'), 'help') (('we', 'training dataset'), 'be') (('i', '1'), 'choose') (('Diagnosis', 'often symptoms'), 'base') (('Pneumonia Pneumonia', 'alveoli'), 'be') (('Randomly', '30 degrees'), 'rotate') (('We', 'differences'), 'use') (('evaluation set', 'also third expert'), 'in') (('diagnoses', 'AI system'), 'grade') (('read_csv Input data files', 'the'), 'be') (('It', 'python docker image https kaggle github'), 'train') (('grayscales horizontal vertical flips', 'crops color jitters translations rotations'), 'be') (('you', 'output'), 'list') (('dataset', 'image category'), 'png') (('Chest X ray images anterior posterior', 'Guangzhou one to five years old Women'), 'select') (('severity', 'condition'), 'be') (('Randomly Zoom', 'images3'), 'training') (('where it', 'such community'), 'classify') (('we', 'artificially dataset'), 'augmentation') (('data', 'Dataset Data Visualization'), 'load') (('vertically fraction', 'randomly images'), 'resize') (('Pneumonia', 'such autoimmune diseases'), 'cause') (('that', 'data augmentation techniques'), 'approach') "}