{"name": "predicting mulliken charges with acsf descriptors ", "full_name": " h1 Introducing Atom Centered Symmetry Functions Application to the prediction of Mulliken charges h1 1 What is a descriptor h1 2 Atom Centered Symmetry Functions ACSF h2 2 1 Understanding the cutoff function h2 2 2 The most basic two body radial ACSF G 1 i h2 2 3 Going further the radial two body ACSF G i 2 h1 3 Taking care of business the Mulliken charges h1 Wrapping up ", "stargazers_count": 0, "forks_count": 0, "description": "csv file of the challenge resulting in a 5. There is one G 1 for each atom in the molecule and it s a real number. This problem can be solved by employing instead the radial symmetry function G 2. They are called G 4 and G 5 for those who follow yes there s also a G 3 but it s a radial function and I m not using it in this kernel. On the contrary the potential energy of the molecule is a global property so we might instead use a global descriptor. Now let s calculate G 1_C for the carbon atom. Remember that the cutoff function penalizes atoms that are far and favors atoms that are close The problem with the G 1 ACSF is that it has to be calculated with different values of the cutoff radius R_c in order to be truly interesting but at the same time cannot be used with too low values of R_c because of numerical issues that are out of the scope of this kernel. We then see that the cutoff function is maximal and equals 1. Below are the parameters that I ve used in case you wish to build them For all ACSF functions rcut 10. It s just the sum of the plain cutoff functions with respect to each neighboring atom j G_i 1 sum limits_ j 1 N_ rm atom f_c R_ ij It s called a two body ACSF because it involves pairs of atoms as opposed to the three body ACSF that involves triplets of atoms. All ACSF are built on top of this function which acts as a weight function that favors what is close to the atom and penalizes what is far. Their mathematical expressions is not very useful very barbaric so I won t write them. OK so what now Now we are going to use the ACSF to predict the Mulliken charges of the molecules in the test set with a frightening MAE 3. And others The descriptors can be global or local depending on whether they represent the entire molecule global or the environment around each atom local. As an example let s consider a simple molecule methanol CH _3 OH. The symmetry functions bispectrum and Coulomb matrix are all local descriptors one descriptor for each atom in the molecule. You may have already heard about these descriptors maybe because I m mentioning them in almost all of my posts. and it s time we took a look at them For this kernel I choose to focus on the Mulliken charges but of course this can be applied to any of the properties mentioned above however with some subtleties that I will explain. Taking care of business the Mulliken chargesWhy use ACSF to predict the Mulliken charges Let s take a look at Wikipedia Mulliken charges arise from the Mulliken population analysis and provide a means of estimating partial atomic charges. The descriptors take care of that for you Finally let s output the file so that everyone can get these predicted charges I hope you enjoyed this little notebook CheersBoris D. We use a local descriptor to predict a local atomic property. Therefore no need to do any data augmentation in order to train your models on the same molecule that has been rotated translated etc. Notice how the hydrogen atom located on the oxygen atom has the lowest G 1 2. 26953861 because it is the atom that has the lowest number of atoms in the close vicinity. We do that using descriptors. Let s calculate G 2 for each atom of our methanol molecule The result is a matrix one row for each atom one column for each pair or parameters eta and R_s. Let s try to understand it by plotting it for different values of R_c So how does that work Let s consider one atom of a given molecule. Therefore several attempts have been made to try and approximate these properties for the test set see for instance this kernel https www. Depending on the quantity that we want to predict we will use global or local descriptors. So that s why the ACSF are perfectly designed to predict the Mulliken charges though we could also have used the SOAP descriptors but this will be the topic of another kernel Don t be hasty young padawan. The physical interpretation of G 2_i is that it quantifies atomic pair interactions at a distance R_s away from atom i. 0G2 eta Rs couples g2_params 1 2 0. Side note Be careful with ExtraTreesRegressor because it overfits like crazy if max_depth is left unspecified. These ACSF have been merged into the structures. It is also called the fingerprint of a molecule. among which The symmetry functions by Behler and Parrinello Phys. But better be safe than sorry I have added a few more. This is what a descriptor does. There are two types of ACSF radial and angular functions which describe the radial distances and angular angles distribution of the neighboring atoms respectively. Let s continue Our predicted Mulliken charges have a MAE of approximately 10 2 We could probably do better with a more advanced model and cross validation scheme but it s already great as it is We re on the same order of magnitude as the DFT here. For instance the Mulliken charge is a local property since there is one charge for each atom so that it s better to use a local descriptor. To do that we use the get_all_distances method which returns the distances of all of the atoms with every other atom We re good to go Let s calculate G 1_C Let s calculate the G 1 array which contains the G 1 of all atoms in the molecule The result is one number for each atom in the molecule with larger values indicating more atoms in the vicinity. where R_ ij is the distance between atoms i and j and if this distance is greater than a cutoff radius R_c then the cutoff function becomes zero. 01 2 1 6 0. Then we notice that the farther away we are going from our atom the more the cutoff function decreases until it reaches zero when the distance reaches the cutoff radius that we have set. So what I ve done is that I ve spent 2 weeks building a set of 245 symmetry functions for each atom in each molecule I have used G 1 and G 2 for the radial part and G 4 for the angular part. During the last decade a number of different descriptors have been established and every month a new descriptor pops out claiming it is superior to all the previous ones. Mulliken charges are local atomic properties as opposed for instance to the potential energy which is a global molecular property. 0 and we ll be sure to include all the atoms in the neighborhood of each atom. com c champs scalar coupling overview challenge is that the Mulliken charges are only available for the training set. They are based on a function called the cutoff function. The bispectrum by Bartok et al. On the contrary far from the atom the cutoff function has a low value meaning that we consider everything there as of low importance. The physical interpretation of G 1_i is the coordination number of atom i within the cutoff radius. First let s identify which one is the carbon atom It s the first on the list Now we get the distances between this atom and every other atoms. If maths is not your cup of tea this function might look barbaric. It is actually possible to machine learn these properties using only the structural information contained in the structures. Going further the radial two body ACSF G_i 2 The G 2 ACSF is an improvement over G 1. In practice G 2 is computed for several combinations of eta and R_s therefore each atom will have a series of G 2 values. Definition of the cutoff function Define x Plot the function with different cutoff radii Create the methanol molecule Number of atoms in the molecules Definition of a vectorized cutoff function Calculate G1 Define the G2 function Set a list of six eta Rs tuples Compute the six G2 corresponding to the six eta Rs tuples Load all relevant files We need to free a bit of memory for Kaggle servers. Now we re ready to train our model which will be an ExtraTreesRegressor. And so are the dipole moments magnetic shield tensor potential energies etc. In other words close to the atom the cutoff function is maximal meaning that we consider everything close to the atom as of high importance. Understanding the cutoff function The cutoff function is expressed as follows f_c R_ ij left begin array ll 0. Wrapping upLet s put everything in a nice dataframe Out of curiosity let s take a look at one random molecule Looking at the predictions there s something very interesting that you may notice some Mulliken charges are identical Is it a numerical artifact or does it have a physical meaning Let s visualize the molecule We see that the molecule is H C C H which is a symmetric molecule there s a symmetry plane right in the middle of the molecule among others. The accuracy metrics will be the mean absolute error which is OK for the Mulliken charges I guess. It is expressed as G_i 2 sum limits_ j 1 N_ rm atom exp left eta R_ ij R_s 2 right times f_c R_ ij It is better than G 1 because it doesn t need to be evaluated at different cutoff radii. Kudos to artgor for this function. Here we see that the MAE on the train and cv sets are similar so that we re not overfitting. While the cartesian system may seem like a simple and unequivocal descriptor of atomic configurations it actually suffers a major drawback the list of coordinates is ordered arbitrarily and two structures might be mapped to each other by a rotation reflection or translation so that two different lists of atomic coordinates can in fact represent the same or very similar structures. I like it because it has the same units as what we re calculating. 104 136403 2010 https doi. 01 4 1 Note that between 50 and 100 symmetry functions per atom were proven to be enough to accurately describe atomic local environments. The Coulomb matrix by Rupp et al. Atom Centered Symmetry Functions ACSF ACSF are local descriptors that are rather easy to understand and are very powerful because they contain a lot of information on the chemical environment around each atom. Contrary to G 1 the G 2 ACSF allows the region close to the reference atom to be covered. While a set of G 1 and G 2 functions can describe accurately the radial distribution of the neighboring atoms it is not possible to distinguish different angular distributions. Consequently they are generally superior to functions of type G 1. This is the power of descriptors they reproduce the invariances with respect to permutational rotational reflectional and translational symmetries. 98 146401 2007 https doi. But what if we had a way to machine learn these properties and predict them for all the atoms molecules of the test set This would allow us to subsequently use them as input features for the prediction of the scalar coupling. 01 4 1 1 4 1 0. When the distance from the center of this atom equals zero it means that we are located on this atom. The cutoff radius can be kept at a large value for all functions while the radial resolution is now determined by the parameter eta. Create train and test sets from the structure file containing ACSF Drop useless columns Add Mulliken charges to training set Create train and cv sets Hypothesis Testing Test set Train set CV set Extra Tree Plotiplot perfect fit line Need to reload the initial structure file for my function to work properly. The cutoff function can be seen as describing the importance of the environment of an atom at a given distance. It s as simple as that. As for the parameter R_s it can be used to improve the description of specific interatomic distances. And because of this symmetry plane the C atoms have identical charges as do both of the H atoms. The most basic two body radial ACSF G 1_i G 1_i is the most basic radial function that describes the environment of an atom i. 01 6 G4 eta ksi lambda triplets g4_params 1 4 1 0. Let s go Before running the model let s ensure that the cv and train sets have similar statistics We re all good. All you need to know is that The physical interpretation of G 4_ ij and G 5_ ij is that they quantify the angles between all triplets of atoms in the molecule. As with the radial functions the angular functions yield a single real value independent of the actual number of neighbors. 5 left cos left pi frac R_ ij R_c right 1 right rm for quad R_ ij leq R_c 0 rm for quad R_ ij R_c end array right. 5GB file that we re keeping private for now until we re through with playing with these little things. To find the ideal cutoff radius R_c let s check what is the maximum distance between two atoms We can therefore use R_c 3. Introducing Atom Centered Symmetry Functions Application to the prediction of Mulliken chargesGreetings everyone One thing that you probably noticed in the Predicting Molecular Properties https www. Therefore additional atom centered angular symmetry functions were also introduced. The important words are in bold partial atomic charges. What is a descriptor The problem that we are facing is how to appropriately represent an atomic environment In the challenge we are provided with the cartesian positions of each atom in the molecules. 108 058301 2012 https doi. com asauve estimation of mulliken charges with open babel by Alexandre. Therefore it describes poorly the environment very close to each atom. Therefore a good representation is invariant with respect to permutational rotational reflectional and translational symmetries while retaining the faithfulness of the cartesian representation. ", "id": "borisdee/predicting-mulliken-charges-with-acsf-descriptors", "size": "13485", "language": "python", "html_url": "https://www.kaggle.com/code/borisdee/predicting-mulliken-charges-with-acsf-descriptors", "git_url": "https://www.kaggle.com/code/borisdee/predicting-mulliken-charges-with-acsf-descriptors", "script": "sklearn.ensemble molecule borisdee_kaggle_functions matplotlib.pyplot get_G2 ExtraTreesRegressor pandas sklearn.metrics mean_absolute_error fc ase.build fc_vect numpy ", "entities": "(('very very so I', 'them'), 'be') (('left cos', 'R _ 0 quad ij'), 'leave') (('radius cutoff then function', 'cutoff'), 'be') (('Now s', 'carbon atom'), 'let') (('we', 'molecules'), 'be') (('We', '3'), 'find') (('We', 'DFT'), 'let') (('now Now we', 'frightening MAE'), 'go') (('we', 'atom'), 'equal') (('two different lists', 'same very structures'), 'seem') (('Mulliken charges', 'training only set'), 'be') (('It', 'also molecule'), 'call') (('global we', 'instead global descriptor'), 'be') (('Consequently they', 'type G'), 'be') (('I', '4 angular part'), 'be') (('it', 'previous ones'), 'establish') (('it', 'different angular distributions'), 'be') (('we', 'atom'), 'be') (('It', 'structures'), 'be') (('maybe I', 'posts'), 'hear') (('crazy max_depth', 'ExtraTreesRegressor'), 'be') (('we', 'high importance'), 'in') (('most basic radial that', 'atom i.'), 'be') (('important words', 'bold partial atomic charges'), 'be') (('angular functions', 'neighbors'), 'as') (('symmetry 01 4 1 50 functions', 'accurately atomic local environments'), 'note') (('Wikipedia Mulliken charges', 'partial atomic charges'), 'take') (('s', 'given molecule'), 'let') (('it', 'molecule'), 'be') (('s', 'simple molecule methanol'), 'let') (('radial resolution', 'parameter now eta'), 'keep') (('both', 'H atoms'), 'have') (('physical interpretation', 'cutoff radius'), 'be') (('result', 'eta'), 'let') (('We', 'similar statistics'), 'let') (('H C C which', 'others'), 'put') (('you', 'little notebook'), 'take') (('1 it', 'cutoff different radii'), 'express') (('cutoff function', 'given distance'), 'see') (('Therefore it', 'very close atom'), 'describe') (('which', 'potential energy'), 'be') (('they', 'molecule'), 'be') (('you', 'Predicting Molecular Properties https probably www'), 'introduce') (('radial I', 'kernel'), 'call') (('ACSF', 'structures'), 'merge') (('Therefore good representation', 'cartesian representation'), 'be') (('we', 'train'), 'see') (('that', 'close vicinity'), '26953861') (('They', 'function'), 'base') (('hydrogen how atom', '1 lowest G 2'), 'notice') (('I', 'Mulliken charges'), 'be') (('we', 'little things'), 'file') (('that', 'kernel'), 'remember') (('symmetry functions bispectrum', 'molecule'), 'be') (('result', 'vicinity'), 'let') (('R _ ij', '0'), 'express') (('we', 'global descriptors'), 'depend') (('they', 'permutational rotational reflectional symmetries'), 'be') (('it', 'atom away i.'), 'be') (('G_i G 2 ACSF', 'G'), 'go') (('it', 'local descriptor'), 'be') (('we', 'what'), 'like') (('We', 'local atomic property'), 'use') (('which', 'model'), 're') (('Now we', 'atom'), 'let') (('it', 'specific interatomic distances'), 'use') (('Therefore several attempts', 'instance'), 'make') (('region', 'reference atom'), 'allow') (('therefore atom', 'G 2 values'), 'compute') (('that', 'atoms'), 's') (('input', 'scalar coupling'), 'learn') (('We', 'Kaggle servers'), 'Plot') (('what', 'atom'), 'build') (('I', 'that'), 's') (('rather very they', 'atom'), 'be') (('function', 'structure initial file'), 'set') (('they', 'atom local'), 'be') (('ACSF functions', '10'), 'be') (('this', 'kernel Don t'), 's') (('we', 'that'), 'notice') (('problem', 'symmetry instead radial function'), 'solve') (('which', 'angles neighboring angular atoms'), 'be') (('cutoff then function', '1'), 'see') (('better sorry I', 'a few more'), 'add') (('we', 'there low importance'), 'have') (('function', 'tea'), 'look') (('that', 'same molecule'), 'need') "}