{"name": "predict the crime category knn logistic ", "full_name": " h1 Hello People Here we will look for the solution of the problem using K nearest neighbor algorithm h1 Understanding the data ", "stargazers_count": 0, "forks_count": 0, "description": "Let s read the test data now Test data does not have the target variable and the resolution Replacing the day of weeks All the numeric columns have no missing values. Hello People Here we will look for the solution of the problem using K nearest neighbor algorithmThis notebook has the following structure 1. Resolution how the crime incident was resolved only in train. Understanding the features and the problems2. Understanding the Data3. Read and explore the train data2. There is no strong correlation of category with any numeric value Calculate the skew Let s use knn algorithm on numeric columns Logistic Regression. Y LatitudeLet s try to find some correlations between the target variable and the numeric variables but before that first remove the resolution column and describe the numeric columns to look for any missing values in the data. Train data has the following columns 1. PdDistrict name of the Police Department District6. target variable There are multiple categorical values. Display the first few rows of the data Get the shape of the data just to know how many rows and columns it contains Any results you write to the current directory are saved as output. Address the approximate street address of the crime incident 8. Dates timestamp of the crime incident2. Model the Data using KNN Understanding the dataIt s important to understand all the columns before we move further. DayOfWeek the day of the week5. Modeling the Data KNN Algorithm Load the important libraries neede linear algebra data processing CSV file I O e. It looks like a multi class classification problem. read_csv Input data files are available in the. This is the target variable you are going to predict. Category category of the crime incident only in train. Descript detailed description of the crime incident only in train. ", "id": "nitinvijay23/predict-the-crime-category-knn-logistic", "size": "1251", "language": "python", "html_url": "https://www.kaggle.com/code/nitinvijay23/predict-the-crime-category-knn-logistic", "git_url": "https://www.kaggle.com/code/nitinvijay23/predict-the-crime-category-knn-logistic", "script": "OrderedDict sklearn.linear_model KNeighborsClassifier pandas sklearn.neighbors collections LogisticRegression numpy ", "entities": "(('you', 'output'), 'get') (('PdDistrict name', 'Police Department'), 'District6') (('crime how incident', 'only train'), 'resolution') (('s', 'columns Logistic numeric Regression'), 'be') (('neede', 'algebra data processing CSV file'), 'model') (('read_csv Input data files', 'the'), 'be') (('It', 'class classification multi problem'), 'look') (('we', 'columns'), 'Model') (('Descript', 'only train'), 'detailed') (('notebook', 'following structure'), 'People') (('numeric columns', 'missing values'), 'let') "}