{"name": "prostate cancer in depth understanding eda model ", "full_name": " h1 About this Notebook h1 References h1 Domain Knowledge 101 h3 Q1 What is Prostate Cancer h3 Q2 How it is tested and detected h3 Q3 Where does GLEASON score fit in all of this h3 Q4 I didn t understand What is GLEASON score Please explain in detial h3 Q5 I got it but What is ISUP grade now h3 Q6 How has the Gleason scores been generated in the dataset h1 Preliminaries h3 LET s now Look at the test file h1 EDA h1 Image EDA h2 Q1 What is tff format and Why it is used h2 Q2 What are image levels h2 Q3 What is Down sampling and Up sampling in Image processing h3 Now Let s Look at the Zoomed Images having different ISUP and gleason score h2 Understanding Masks h3 Q What are masks h3 Q What happens when we visualize masks using the techniques we know h2 Q A black canvas is displayed Surprised Wondering what that means The Masks for Train are in RGB format right as said by organizers h2 Differentiating between cancerous and non cancerous areas using MASKS h2 Overlaying masks on the slides h1 What s Next h1 END NOTES ", "stargazers_count": 0, "forks_count": 0, "description": "Let s Verify if its the case SO we can clearly see that our understanding was correct. These masks directly indicate which parts of the tissue are healthy and which are cancerous. Just watch the video below Q5 I got it but What is ISUP grade now According to current guidelines by the International Society of Urological Pathology ISUP the Gleason scores are summarized into an ISUP grade on a scale from 1 to 5 according to the following rule Gleason score 6 ISUP grade 1 Gleason score 7 3 4 ISUP grade 2 Gleason score 7 4 3 ISUP grade 3 Gleason score 8 ISUP grade 4 Gleason score 9 10 ISUP grade 5 If there is no cancer in the sample we use the label ISUP grade 0 in this competition. Four types of baseline TIFF images are available bilevel black and white gray scale palette i. Q2 What are image levels In some image formats the image data has a fixed amount of possible intensities. Baseline TIFF images are highly portable most graphics desktop publishing and word processing applications understand them. Upsampling is the increasing of the spatial resolution while keeping the 2D representationof an image. This is a standard way of staining the originally transparent tissue to produce some contrast. A common extension of TIFF also allows for CMYK images. I thought I knew EDA very well but indeed I was wrong. I also want to emphasize the fact that there is no need to be scared of Kaggle competitions I mean as a rookie we don t have anything to loose we can try out different things without fear and that s what I am doing and you can do too. Note that in the second example eventhough a biopsy contains cancer not all epithelial tissue has to be cancerous. This overlay can help you identifying the different growth patterns. com c prostate cancer grade assessment discussion 145219 EDAIt s time that I start doing my favourite thing Let s Start with the targetWe see that the isup_grade 0 and 1 i. If a DRE or PSA test detects an abnormality your doctor may recommend further tests to determine whether you have prostate cancer such as Ultrasound If other tests raise concerns your doctor may use transrectal ultrasound to further evaluate your prostate. The most common scale used to evaluate the grade of prostate cancer cells is called a Gleason score. e EDA and getting Insights from data and then I build around this core by learning from some very great kernels posted on competitions. However I wonder What the label Negative means when we already have 0 0 for no cancer. e count and percentage on the countplot of seaborn from Rohit s kernels. For instance an image may be defined as uint8 unsigned integer 8 bit which means that each pixel can have a value intensity between 0 255 and each intensity is a whole number integer in that range. indexed and RGB i. Each epithelial unit is separate and has a lumen. There are noticable color differences between the biopsies this is very common within pathology and is caused by different laboratory procedures. RGB images may store up to 16. OpenSlide gives the resolution in centimeters so we convert this to microns. A Benign prostate glands with folded epithelium The cytoplasm is pale and the nuclei small and regular. e 3 4 and 4 3 as we had learned in the video these both have different meanings. loc image data_provider karolinska Create alpha mask Mapping 0 background 1 stroma 2 benign epithelium 3 Gleason 3 4 Gleason 4 5 Gleason 5 Mapping 0 background 1 benign 2 cancer. Thus Biopsies can contain a mix of cancerous and healthy tissue. The glands are hollow structures which can be seen as white holes or branched cavities in the WSI. There are also some poorly formed small glands and some fused glands. Let s check what is the ISUP grade for these gleason scores That s Quite Interesting they both map to zero ISUP grade. Q2 How it is tested and detected Prostate screening tests might include Digital rectal exam DRE During a DRE your doctor inserts a gloved lubricated finger into your rectum to examine your prostate which is adjacent to the rectum. At this point image data is read from the file and loaded into memory. Gleason scoring combines two numbers and can range from 2 nonaggressive cancer to 10 very aggressive cancer though the lower part of the range isn t used as often. The samples are made up of glandular tissue and connective tissue. I wonder why there are two labels mapping to the same thing let s also check their numberThat s Quite a big number it s 2892 10616 27 oercent of the total data We have seem from the figure showing mappings of ISUP from gleason that 3 4 and 4 3 map to different ISUP scores while other pairs like 3 5 and 5 3 4 5 and 5 4 map to same ISUP let s verify it Hence it is indeed the case It is due to this reason modeling this as a predictive problem for gleason score then converting it into ISUP is a much better strategy than to model it as ISUP predictive problem directly Let s also check if 3 4 and 4 3 gleason scores maps to 2 and 3 respectivelyWe can see that 3 4 maps to one unique Isup i. This rotation has no clinical value and is only dependent on how the biopsy was collected in the lab. epithelial sheets with multiple lumina. I will keep on updating this kernel with my new findings learning process explained techniques etc in order to help everyone who is just beginning I hope you Liked my kernel. e black and white Q3 What is Down sampling and Up sampling in Image processing Downsampling and upsampling are two fundamental and widely used image operations withapplications in image display compression and progressive transmission. Prostate cancer is one of the most common types of cancer in men. A small probe about the size and shape of a cigar is inserted into your rectum. An RGB red green blue type image uses three layers to define colour a single layer would define a large scale image some image types contain more than 3 layers. B Prostatic adenocarcinoma Gleason Pattern 3 has no loss of glandular differentiation. There is an attempt to form lumina but the tumor fails to form complete well developed glands. Another way to interpret this would be layers. Biopsies can be in different rotations. Even compressed TIFF files are usually much larger than similar GIF or JPEG files. com akensert panda drawing rectangles work in progressWe will now visualize the cancerous and non cancerous areas of an image using image_masks and since we know masks are different for different data providers we will have to take into account in the function we builtNow that we have our function let s visualize Overlaying masks on the slidesNow That we have learned how to visualize masks and display them side by side Let s Overlay them on one anotherAs the masks have the same dimension as the slides we can overlay the masks on the tissue to directly see which areas are cancerous. e no cancer has the most number of values and that s what expected in case of most medical datasets the target class will always be underrepresented and that s also the most important challenge when performing machine learning tasks on Medical DATANow let s Look at how much data is provided by which data providerI learned about adding the numerical values i. The mask values depend on the data provider Radboud Prostate glands are individually labelled Valid values are 0 background non tissue or unknown 1 stroma connective tissue non epithelium tissue 2 healthy benign epithelium 3 cancerous epithelium Gleason 3 4 cancerous epithelium Gleason 4 5 cancerous epithelium Gleason 5 Karolinska Regions are labelled Valid values are 1 background non tissue or unknown 2 benign tissue stroma and epithelium combined 3 cancerous tissue stroma and epithelium combined Q What happens when we visualize masks using the techniques we know Q A black canvas is displayed Surprised Wondering what that means The Masks for Train are in RGB format right as said by organizers. This microphotograph shows irregular cribriform cancer i. patches here https medium. The TIFF specification is readily extensible though this comes at the price of some of its portability. The appearance of the glands forms the basis of the Gleason grading system. Gleason Pattern 5 may also contain solid sheets or strands of cancer cells. Dispersed single cancer cells are seen in the stroma. Collecting a sample of prostate tissue If initial test results suggest prostate cancer your doctor may recommend a procedure to collect a sample of cells from your prostate prostate biopsy. A number of methods may be used to compress TIFF files including the Huffman and LZW algorithms. Because the files are so large and because there are so many possible variations of each TIFF file type few web browsers can display them without plug ins. I am learning with every passing day I try to do atleast what I am good at i. This happens for the following two reasons The label information is stored in the red R channel the other channels are set to zero and can be ignored. Palette and gray scale images are limited to 256 colors or shades. org api python Now Let s see what all information can we get out of an image after creating an Openslide object This Function prints Zoomed and Non Zoomed images side by side and also all the information that can be derived from it You can read about what every function does in the documentation of Open slide You can play around with the read_region to zoom in different parts of an image and by little modifications you can build a function that takes in multiple images and displays their zoomed and non Zoomed Images side by side Now Let s Look at the Zoomed Images having different ISUP and gleason_scoreLooking at the images we can see and try to apply what we learned in the video for giving gleason_scoreOBSERVATIONS The image dimensions are quite large typically between 5. An upvote is a gesture of appreciation and encouragement that fills me with energy to keep improving my efforts be kind to show one STAY TUNED DATA visualization Open the image does not yet read the image into memory Read a specific region of the image starting at upper left coordinate x 17800 y 19500 on level 0 and extracting a 256 256 pixel patch. mallika transform your graphs with seaborn ea4fa8e606a6After learning go ahead and play around the parameters of ax. So that gives 256 possible intensity levels. The second mask is from Karolinska the region that contains cancer is higlighted in green. Prostate biopsy is often done using a thin needle that s inserted into the prostate to collect tissue. It is typically used to reduce the storage and or transmission requirements of images. Many applications incorporate their own extensions but a number of application independent extensions are recognized by most programs. The glands are grouped together. There are always a lot of great kernels regarding different ways of solving the problems but only a few handful address the problems of domain knowledge and getting started. What is GLEASON score Please explain in detialDon t Worry I got you Pal. com wouterbulten getting started with the panda datasetThe benefit of OpenSlide is that we can load arbitrary regions of the slide without loading the whole image in memory. Similarly for a grayscale there can be two levels i. e 2 but to our surprise 4 3 maps to two different values hence we have some mislablled info here Let s go ahead and check thatWe can see there is one mislabelled information like that let s go ahead and drop this Also negative and 0 0 are same labels only from different data providers and are interchangeable Let s go ahead and change negative to 0 0 LET s now Look at the test fileThey are only 3 images in the test and they too are hidden and we have access to them only when we are submitting for information on how to submit on hidden test set read here https www. The first mask is from Radboudumc and shows two different grades of cancer shown in yellow and orange. Downsampling isthe reduction in spatial resolution while keeping the same two dimensional 2D representation. It s normal for a small amount of PSA to be in your bloodstream. Usually prostate cancer grows slowly and is initially confined to the prostate gland where it may not cause serious harm. If you prefer something like matplotlib you can also use plt. The glandular structure characteristic of healthy prostate tissue is progressively lost with increasing grade. Each slide has 3 levels you can load corresponding to a downsampling of 1 4 and 16. All microphotographs show hematoxylin and eosin stains at 20x lens magnification. D Prostatic adenocarcinoma Gleason Pattern 5 has an almost complete loss of glandular differentiation. I am a beginner on Kaggle and this is my first Image Computer Vision related competition. Applying the color map fixes the problem by assigning each label between 0 and 6 a distinct color. Q3 Where does GLEASON score fit in all of this When a biopsy confirms the presence of cancer the next step is to determine the level of aggressiveness grade of the cancer cells. 000 pixels in both x and y. All of these are included in Gleason Pattern 4. It is typically used for zooming in on a small region of an image and foreliminating the pixelation effect that arises when a low resolution image is displayed on arelatively large frameNow that we know all this we are good to go. com rohitsingh9990 panda eda better visualization simple baseline Domain Knowledge 101So lets start with the domain knowledge and Address the first question Q1 What is Prostate Cancer Prostate cancer is cancer that occurs in the prostate a small walnut shaped gland in men that produces the seminal fluid that nourishes and transports sperm. BUT since we are complete beginners let s first understand the format of image that is provided to us and all the image related jargons that we will be using further Q1 What is. Reasons for Usage IFF files are large and of very high quality. If your doctor finds any abnormalities in the texture shape or size of the gland you may need further tests. imshow to directly show a mask without converting it to an RGB image. Prostate specific antigen PSA test A blood sample is drawn from a vein in your arm and analyzed for PSA a substance that s naturally produced by your prostate gland. The cytoplasm is often dark and the nuclei enlarged with dark chromatin and some prominent nucleoli. That is what my strategy is all about. I have learned everything about the visualizations from here https www. They are just matrices with values based on the data provider information provided above instead of containing a range of values from 0 to 255 they only go up to a maximum of 6 representing the different class labels check the dataset description for details on mask labels. Yes you right in thinking there can be two values for gleason score 7 i. You can learn more about ax. We will look at only 6 examples for better visualsLastly I will add heights and widths of images to my dataframe as it will help with my baseline We can see that width and height have almost similar distribution let s now quickly load some images using openslide and try to interpret them We saw as an example of how we can load data using openslide and then visualize a specific area and in our choice of pixel distribution We will now see how we can see openslide to gather information about the images What s NextThis is my first encounter with image data and I am also learning everything at the same data. test and ask any queries in the comment sectionOne tip for Better visualization always go through the documentation of the function you are using to visualize and play with all the parameters it takes you will surprise yourself with suprisingly new thingsNow Let s Look at the gleason score distribution as wellFrom this graph it is also clear that the data will be baised towards non cancer examples Image EDANow we can finally move on to Image EDA. The grading system recognizes three categories 3 4 and 5. Intermediate levels can be created by downsampling a higher resolution level. A higher grade indicates a more aggressive cancer that is more likely to spread quickly. Differentiating between cancerous and non cancerous areas using MASKSIdea Credits https www. com wouterbulten getting started with the panda dataset https www. So what we need to do is to grab read the image file using openslide object take out the values of Red Level and then apply cmap to itUsing a small helper function we can display some basic information about a mask. Display the image Close the opened slide after use Here we compute the pixel spacing the physical size of a pixel in the image. Small glands infiltrate between benign glands. Q6 How has the Gleason scores been generated in the dataset Each WSI in this challenge contains one or in some cases two thin tissue sections cut from a single biopsy sample. C Prostatic adenocarcinoma Gleason Pattern 4 has partial loss of glandular differentiation. The dimensions of each level differ based on the dimensions of the original image. Understanding Masks Q What are masks Apart from the slide level label present in the csv file almost all slides in the training set have an associated mask with additional label information. In this notebook I will start with complete explanation of everything you need know related to Prostate Cancer and its detection and I will built on that to explain the dataset perform EDA and then Build a baseline model This kernel will be a work in Progress and I will keep on updating it as the competition progresses and I learn more and more things about the data If you find this kernel useful Please consider Upvoting it it motivates me to write more Quality content References https www. About this NotebookI have always seen that Kaggle competitions require a lot of domain knowledge and the main problems of a Kaggle beginner is not lack of Machine learning Knowledge but more often than not it is lack of domain knowledge. TIFF is very common for transporting color or gray scale images into page layout applications but is less suited to delivering web content. A laboratory pathologist examines a sample of your cancer to determine how much cancer cells differ from the healthy cells. com wouterbulten getting started with the panda datasetUpdates I have shared few more insights about the data I have explained how to create the image visualizations in detail I have explained everything there is about the mask provided to us for train setThis is what you can expect in future versions of this kernel New unique and improved Visualizations New Insights about the Data Baseline Model Complete Explanation of DEEP LEARNING TECHNIQUES to be used END NOTESThis notebook is work in progress. You can read more about the OpenSlide python bindings in the documentation https openslide. Q4 I didn t understand. However while some types of prostate cancer grow slowly and may need minimal or even no treatment other types are aggressive and can spread quickly. PreliminariesNow Let s Begin by Importing the data Now that we know everything about ISUP_grade and Gleason_score let s look at how many unique values they have got as per our guesses ISUP must have 6 unique values 1 5 grades and 0 for non cancer and Gleason_score should have 8 values in total 2 10 for scores Interesting Right We were right about ISUP but gleason score has 11 unique values. For each pixel there are 3 intensity levels 1 for each colour are defined and together using a kind of mixing of the colours they define the colour of that pixels. I will be using openslide to display images as I learned it in this competition from a very informative kernel https www. Want to interactively view a slide We have added an interactive viewer to this notebook in the last section. Now that we have learned how to visualize masks let s build a function which prints an image and its mask side by side provided that there is a mask So we are successful we can easily use this function to visualize on more than example by doing something like this Observations The images above shows two example masks from the dataset. IMAGE MASKS Selecting the level SELECTING R from RGB SELECTING BG SELECTING BENIGN LABELS SELECTING CANCEROUS LABELS SELECTING NON CANCEROUS LABELS if train. Prior to scanning the tissue is stained with haematoxylin eosin H E. To more easily inspect the masks we map the int labels to RGB colors using a color palette. hese masks are provided to assist with the development of strategies for selecting the most useful subsamples of the images. The tissue sample is analyzed in a lab to determine whether cancer cells are present. To do this we load both the mask and the biopsy and merge them using PIL. However if a higher than normal level is found it may indicate prostate infection inflammation enlargement or cancer. The probe uses sound waves to create a picture of your prostate gland. Since Kaggle provide us so many days for a competition we can always start from zero and end up learning all of the state of the art techniques just by following along a competition. TIFF files may or may not be compressed. ZOOMED FUGURE UNZOOMED FIGURE Making Openslide Object Here we compute the pixel spacing the physical size of a pixel in the image OpenSlide gives the resolution in centimeters so we convert this to microns Reading the image as before betweeen x 1780 to y 1950 and of pixel size 256 256 Displaying Image Visualizing Only six Examples Here we compute the pixel spacing the physical size of a pixel in the image. tff format and Why it is used Tagged Image File Format TIFF is a variable resolution bitmapped image format developed by Aldus now part of Adobe in 1986. The masks are not image data like the WSIs. Therefor when you try to visualize the mask it will appear very dark as every value is close to 0. ", "id": "tanulsingh077/prostate-cancer-in-depth-understanding-eda-model", "size": "21934", "language": "python", "html_url": "https://www.kaggle.com/code/tanulsingh077/prostate-cancer-in-depth-understanding-eda-model", "git_url": "https://www.kaggle.com/code/tanulsingh077/prostate-cancer-in-depth-understanding-eda-model", "script": "IPython.display plotly.express Image numpy seaborn display_masks plotly mask_img display_images matplotlib.pyplot IFrame overlay_mask_on_slide pandas graph_objs as go graph_objs plotly.figure_factory display get_values differentiate_cancerous YouTubeVideo ", "entities": "(('I', 'same data'), 'add') (('grade', 'prostate cancer cells'), 'call') (('only when we', 'test how hidden set'), 'have') (('B', 'glandular differentiation'), 'have') (('we', '0 competition'), 'get') (('doctor', 'prostate prostate biopsy'), 'recommend') (('hollow which', 'branched WSI'), 'be') (('What', 'further Q1'), 'let') (('Intermediate levels', 'resolution higher level'), 'create') (('scale Palette gray images', '256 colors'), 'limit') (('number', 'Huffman algorithms'), 'use') (('we', 'memory'), 'be') (('LEARNING notebook', 'progress'), 'wouterbulten') (('So that', 'intensity 256 possible levels'), 'give') (('that', 'tissue'), 'do') (('tumor', 'complete well developed glands'), 'be') (('that', 'green'), 'be') (('Tagged Image File Format TIFF', '1986'), 'be') (('epithelial tissue', 'cancer'), 'note') (('only how biopsy', 'lab'), 'have') (('tissue two thin sections', 'biopsy single sample'), 'Q6') (('probe', 'prostate gland'), 'use') (('doctor', 'further prostate'), 'detect') (('they', 'pixels'), 'be') (('you', 'also plt'), 'use') (('Quite they', 'ISUP zero grade'), 'let') (('very well indeed I', 'EDA'), 'think') (('appearance', 'Gleason grading system'), 'form') (('GLEASON detialDon t Worry I', 'Pal'), 'score') (('next step', 'cancer cells'), 'score') (('image types', 'more than 3 layers'), 'use') (('you', 'growth different patterns'), 'help') (('we', 'color palette'), 'inspect') (('which', 'tissue'), 'indicate') (('more often it', 'domain knowledge'), 'see') (('TIFF', 'web less content'), 'be') (('D Prostatic adenocarcinoma', 'glandular differentiation'), 'have') (('we', 'PIL'), 'load') (('way', 'this'), 'be') (('directly areas', 'tissue'), 'visualize') (('cancer how much cells', 'healthy cells'), 'examine') (('image dimensions', 'quite typically 5'), 'python') (('TIFF Even compressed files', 'usually much similar GIF'), 'be') (('microphotograph', 'cribriform cancer irregular i.'), 'show') (('cancer cells', 'lab'), 'analyze') (('other channels', 'zero'), 'happen') (('which', 'rectum'), 'include') (('Reasons', 'very high quality'), 'be') (('Gleason scoring', 'range isn t'), 'combine') (('is', 'image operations image display two fundamental widely compression'), 'q3') (('grading system', 'three categories'), 'recognize') (('structure glandular characteristic', 'progressively increasing grade'), 'lose') (('image data', 'possible intensities'), 'q2') (('small probe', 'rectum'), 'insert') (('255 intensity', 'number whole range'), 'define') (('C Prostatic adenocarcinoma', 'glandular differentiation'), 'have') (('then I', 'competitions'), 'EDA') (('very value', '0'), 'appear') (('Small glands', 'benign glands'), 'infiltrate') (('file web type few browsers', 'plug ins'), 'be') (('Gleason Pattern', 'cancer cells'), 'contain') (('gleason 4 3 scores', 'Isup one unique i.'), 'wonder') (('we', 'just competition'), 'start') (('epithelial unit', 'lumen'), 'be') (('microphotographs', '20x lens magnification'), 'show') (('cytoplasm', 'often dark chromatin'), 'be') (('It', 'images'), 'use') (('dimensions', 'original image'), 'differ') (('it', 'prostate infection inflammation enlargement'), 'find') (('Thus Biopsies', 'cancerous tissue'), 'contain') (('I', 'https www'), 'learn') (('that', 'seminal fluid'), 'start') (('readily this', 'portability'), 'be') (('Four types', 'baseline TIFF images'), 'be') (('I', 'kernel https very informative www'), 'use') (('both', 'different meanings'), 'have') (('Applying', 'distinct color'), 'fix') (('I', 'i.'), 'learn') (('pixel', 'image'), 'object') (('you', 'further tests'), 'need') (('We', 'last section'), 'want') (('we', 'mask'), 'be') (('Upsampling', '2D representationof'), 'be') (('desktop highly portable most graphics publishing', 'word processing them'), 'be') (('we', 'this'), 'use') (('you', '1 4'), 'have') (('when we', 'cancer'), 'wonder') (('pixel', 'image'), 'display') (('number', 'most programs'), 'incorporate') (('common extension', 'CMYK also images'), 'allow') (('All', 'Gleason Pattern'), 'include') (('You', 'documentation https'), 'read') (('almost all slides', 'label additional information'), 'understand') (('small amount', 'bloodstream'), 's') (('masks', 'image WSIs'), 'be') (('Prostate cancer', 'men'), 'be') (('even other types', 'slowly minimal'), 'be') (('we', 'Image finally EDA'), 'go') (('this', 'Kaggle'), 'be') (('you', 'what'), 'want') (('mallika', 'ax'), 'transform') (('image data', 'memory'), 'read') (('this', 'laboratory different procedures'), 'be') (('s', 'isup_grade'), 's') (('cytoplasm', 'prostate Benign folded epithelium'), 'gland') (('Masks', 'right organizers'), 'depend') (('you', 'kernel'), 'keep') (('data providerI', 'numerical values'), 'e') (('cancer Dispersed single cells', 'stroma'), 'see') (('that', 'more aggressive cancer'), 'indicate') (('samples', 'glandular tissue'), 'make') (('images', 'dataset'), 'learn') (('that', 'naturally prostate gland'), 'test') (('so we', 'microns'), 'give') (('class different labels', 'mask labels'), 'be') (('hese masks', 'images'), 'provide') (('where it', 'serious harm'), 'grow') (('gleason score', '11 unique values'), 'let') (('TUNED DATA image', '256 pixel 0 256 patch'), 'be') (('it', 'Quality content References https more www'), 'start') (('This', 'contrast'), 'be') (('first mask', 'yellow'), 'be') "}