{"name": "protein where art thou ", "full_name": " h3 Nucleoplasm occurs most frequently in the data When comparing the single locations with the combined locations one can see that there must be a frequent co labeling of the nucleoplasm with other organelles Those might be other nuclear sites like nucleoli or nuclear speckles but also others for example the most frequent co labeling occurs with cytosol h3 Huge differences in the label Have to come up with appropiate sampeling strategy Going to try a combination of undersampling high count labels and artificial increasing amoung of samples for low count labels i e image augmentation h1 EDA summary h2 Looking at a couple of images shows that images were aquired using various magnifications Also density of the cells and the overall cellshape varies Different cell types can vastly differ see HumanProteinAtlas ENSG00000167552 TUBA1A in the content of tubulins which are the major constituent of microtubule e g uniprot Q71U36 These differences could possibly be problematic when using those as references in order to determine the subcellular localization of the POI Might be worth to cluster images based on the auxiliary channels prior to training h2 Lets further take a quick look at an overlay of the channels to appreciate nature s beauty h1 Cell segmentation h3 Segmentation of single cells could increase predictive power of ML algorithms since the global distribution of proteins can vary Looking at various images we saw that the amount and size of cells and therefore the POI shows a great deal of variance The relative position of the POI in it s respective cell is of much more importance Let us try some segmentation methods Combining the nuclear microtubule and ER staining gives us a comprehensive picture of the cell So we will start by using a combination of those three channels for the segmentation h1 Using the complete composit image seemingly has the problem that the ER staining is leading to a very grainy thresholding of the image Could try with stronger closing but probably could lead to problems when actually segmenting the cells We will try another thing Therefore we will threshold based on the nuclei this should be much easier to do Afterwards we can measure the area of the nuclei and make a crude segmentation or at least image classification based on this h3 It is to note that depending on the closing kernel this would allow us to acutally not only identify the nucleus but also the nucleoli It might be good to take a look at the protein of interest and if we could eliminate certain labels after a classification of images based on overlaps of POI and certain cellular compartments e g if no overlap of POI and nucleus all the nuclear labels should be 0 in any case h3 Lets take a closer look look at some of the images in order to validate if this approach actually works ", "stargazers_count": 0, "forks_count": 0, "description": "Those might be other nuclear sites like nucleoli or nuclear speckles but also others for example the most frequent co labeling occurs with cytosol. Looking at various images we saw that the amount and size of cells and therefore the POI shows a great deal of variance. Lets further take a quick look at an overlay of the channels to appreciate nature s beauty Cell segmentation Segmentation of single cells could increase predictive power of ML algorithms since the global distribution of proteins can vary. Also density of the cells and the overall cellshape varies. In order to not over or underrespresent those labels an appropiate sampling strategy is mandatory. Looking at a couple of images shows that images were aquired using various magnifications. Nucleoplasm occurs most frequently in the data. The investigation of correaltion of certain subcellular compartments shows that endosomes and lysosomes are highly correlated Fig2. So we will start by using a combination of those three channels for the segmentation. These differences could possibly be problematic when using those as references in order to determine the subcellular localization of the POI. Different cell types can vastly differ see HumanProteinAtlas ENSG00000167552 TUBA1A in the content of tubulins which are the major constituent of microtubule e. It is to note that depending on the closing kernel this would allow us to acutally not only identify the nucleus but also the nucleoli. Target column shows the subcellular localization of an protein of interest POI. When comparing the single locations with the combined locations one can see that there must be a frequent co labeling of the nucleoplasm with other organelles. Nucleoplasm is by far the most common label while Peroxisomes Endosomes Lysosomes Microtubule ends and Rods Rings are scarce Fig3. image augmentation EDA summaryWe are dealing with a training dataset which contains 31072 unique entries. Combining the nuclear microtubule and ER staining gives us a comprehensive picture of the cell. Have to come up with appropiate sampeling strategy. The frequency of the labels is highly variable. Could try with stronger closing but probably could lead to problems when actually segmenting the cells. It might be good to take a look at the protein of interest and if we could eliminate certain labels after a classification of images based on overlaps of POI and certain cellular compartments e. Let us try some segmentation methods. Afterwards we can measure the area of the nuclei and make a crude segmentation or at least image classification based on this. Using the complete composit image seemingly has the problem that the ER staining is leading to a very grainy thresholding of the image. if no overlap of POI and nucleus all the nuclear labels should be 0 in any case. This is not further suprising since they look very similiar. We will look at this in a little bit more detail when investigating the actual images. A POI can be located at more than one subcellular compartment. Might be worth to cluster images based on the auxiliary channels prior to training. The relative position of the POI in it s respective cell is of much more importance. Lets take a closer look look at some of the images in order to validate if this approach actually works function which fills dataframe based on target label Function that shows a given number of random imgs test opencv threshold methods. Going to try a combination of undersampling high count labels and artificial increasing amoung of samples for low count labels i. Huge differences in the label. Those entries are labeled with an id which relates to the respective images and a Target column. However localization at more than two compartments becomes increasingly unlikely Fig1. Also cytokinetic bridge and mictrotubules microtubule ends show a positive correlation. We will try another thing. Therefore we will threshold based on the nuclei this should be much easier to do. ", "id": "weegee/protein-where-art-thou", "size": "3938", "language": "python", "html_url": "https://www.kaggle.com/code/weegee/protein-where-art-thou", "git_url": "https://www.kaggle.com/code/weegee/protein-where-art-thou", "script": "missingno seaborn show_random_img matplotlib.pylab pandas fill_rows numpy ", "entities": "(('which', 'respective images'), 'label') (('us', 'acutally only nucleus'), 'be') (('Combining', 'cell'), 'give') (('However localization', 'more than two compartments'), 'become') (('one', 'other organelles'), 'see') (('global distribution', 'proteins'), 'take') (('differences', 'POI'), 'be') (('co most frequent labeling', 'cytosol'), 'be') (('Target column', 'interest POI'), 'show') (('ER staining', 'image'), 'have') (('endosomes', 'highly Fig2'), 'show') (('Rods Rings', 'most common label'), 'be') (('which', '31072 unique entries'), 'deal') (('sampling appropiate strategy', 'over labels'), 'be') (('respective cell', 'much more importance'), 's') (('we', 'certain cellular e.'), 'be') (('images', 'various magnifications'), 'show') (('So we', 'segmentation'), 'start') (('Also cytokinetic bridge microtubule', 'positive correlation'), 'end') (('POI', 'more than one subcellular compartment'), 'locate') (('nuclear labels', 'case'), 'be') (('that', 'imgs test opencv threshold random methods'), 'take') (('therefore POI', 'variance'), 'see') (('We', 'when actual images'), 'look') (('Nucleoplasm', 'most frequently data'), 'occur') (('this', 'nuclei'), 'threshold') (('frequency', 'labels'), 'be') (('Afterwards we', 'image at least this'), 'measure') (('which', 'microtubule major e.'), 'differ') "}