{"name": "protect gbr icevision training ", "full_name": " h1 Tensorflow Help Protect the Great Barrier Reef h1 Introduction h2 Why this Competition h2 Goal of Competition h1 Sponsors h2 TensorFlow h2 CSIRO h2 GBRF h2 More Details h2 Let s dive in h1 Install Libraries h1 Import Libraries h1 Initialize Constants h1 Data Preprocessing h1 Data Visualization h2 Weights and Biases h2 Pandas Profiling h2 IceVision h1 Modelling h2 Data Parser h2 Data Loader h2 Metrics h2 Training h1 Inference h3 If you come this far you could ve got some insights from this notebook An upvote would be very helpful Kindly comment if there are any doubts or mistakes ", "stargazers_count": 0, "forks_count": 0, "description": "Kindly comment if there are any doubts or mistakes Check https www. Weights and Biases is useful in many applications such as Experiment Tracking Hyperparameter Tuning Data Visualization Data and model Versioning Collaborative Reports Go to offocial website for more tutorials and Documentation Pandas Profiling Pandas profiling is an open source Python module with which we can quickly do an exploratory data analysis with just a few lines of code. An upvote would be very helpful. CSIRO works with leading organisations around the world. CSIRO The Commonwealth Scientific and Industrial Research Organisation is an Australian Government agency responsible for scientific research. Besides if this is not enough to convince us to use this tool it also generates interactive reports in web format that can be presented to any person even if they don t know programming. It orchestrates the end to end deep learning workflow allowing to train networks with easy to use robust high performance libraries such as Pytorch Lightning and Fastai IceVision Unique Features Data curation cleaning with auto fix Access to an exploratory data analysis dashboard Pluggable transforms for better model generalization Access to hundreds of neural net models Acccss to multiple training loop libraries Multi task training to efficiently combine object detection segmentation and classification models Go to offocial website for documentation h1 style font family Lucida Console Courier New monospace background rgb 44 169 201 background linear gradient 180deg rgba 44 169 201 1 0 rgba 1 94 125 1 100 border radius 20px font size 30px text align center Modelling Data ParserData LoaderMetricsTraining h1 style font family Lucida Console Courier New monospace background rgb 44 169 201 background linear gradient 180deg rgba 44 169 201 1 0 rgba 1 94 125 1 100 border radius 20px font size 30px text align center Inference Download File If you come this far you could ve got some insights from this notebook. h1 style background rgb 44 169 201 background linear gradient 180deg rgba 44 169 201 1 0 rgba 1 94 125 1 100 border radius 20px font size 30px Tensorflow Help Protect the Great Barrier Reef Introduction Why this Competition Australia s stunningly beautiful Great Barrier Reef is the world s largest coral reef and home to 1 500 species of fish 400 species of corals 130 species of sharks rays and a massive variety of other sea life. Sponsors TensorFlow TensorFlow is a free and open source software library for machine learning and artificial intelligence. Goal of Competition The goal of this competition is to accurately identify starfish in real time by building an object detection model trained on underwater videos of coral reefs. More DetailsCheck competition page for detailsLet s dive in h1 style font family Lucida Console Courier New monospace background rgb 44 169 201 background linear gradient 180deg rgba 44 169 201 1 0 rgba 1 94 125 1 100 border radius 20px font size 30px text align center Install Libraries h1 style font family Lucida Console Courier New monospace background rgb 44 169 201 background linear gradient 180deg rgba 44 169 201 1 0 rgba 1 94 125 1 100 border radius 20px font size 30px text align center Import Libraries h1 style font family Lucida Console Courier New monospace background rgb 44 169 201 background linear gradient 180deg rgba 44 169 201 1 0 rgba 1 94 125 1 100 border radius 20px font size 30px text align center Initialize Constants h1 style font family Lucida Console Courier New monospace background rgb 44 169 201 background linear gradient 180deg rgba 44 169 201 1 0 rgba 1 94 125 1 100 border radius 20px font size 30px text align center Data Preprocessing h1 style font family Lucida Console Courier New monospace background rgb 44 169 201 background linear gradient 180deg rgba 44 169 201 1 0 rgba 1 94 125 1 100 border radius 20px font size 30px text align center Data Visualization Weights and Biases Checkout Dashboard created for this notebook Weights and Biases is a set of Machine Learning tools used for experiment tracking dataset versioning and collaborating on ML projects. It can be used across a range of tasks but has a particular focus on training and inference of deep neural networks. GBRF The Great Barrier Reef Foundation is an Australian non profit organisation established in 1999 to help protect and preserve the Great Barrier Reef. Unfortunately the reef is under threat in part because of the overpopulation of one particular starfish the coral eating crown of thorns starfish or COTS for short. Go to offocial website for documentation IceVision IceVision is the first agnostic computer vision framework to offer a curated collection with hundreds of high quality pre trained models from torchvision MMLabs and soon Pytorch Image Models. com debarshichanda pytorch w b pawpularity training for more details. ", "id": "shanmukh05/protect-gbr-icevision-training", "size": "9573", "language": "python", "html_url": "https://www.kaggle.com/code/shanmukh05/protect-gbr-icevision-training", "git_url": "https://www.kaggle.com/code/shanmukh05/protect-gbr-icevision-training", "script": "Style Fore IPython.display numpy icevision.all record_id seaborn Back pandas_profiling __iter__ parse_fields tqdm matplotlib.pyplot ProfileReport kaggle_secrets PGBRParser(Parser) IFrame pandas get_newpath get_filename __len__ UserSecretsClient __init__ get_oldpath colorama ", "entities": "(('Sponsors TensorFlow TensorFlow', 'source software machine free learning'), 'be') (('Industrial Commonwealth Scientific Organisation', 'Government Australian responsible scientific research'), 'CSIRO') (('Unfortunately reef', 'starfish'), 'be') (('Great Barrier Reef Foundation', 'Great Barrier Reef'), 'GBRF') (('experiment tracking dataset', 'ML projects'), 'dive') (('even they', 't know programming'), 'generate') (('far you', 'notebook'), 'orchestrate') (('It', 'deep neural networks'), 'use') (('CSIRO', 'world'), 'work') (('Go', 'torchvision MMLabs'), 'be') (('we', 'code'), 'be') (('goal', 'coral reefs'), 'goal') (('Competition Why Australia', 'sea massive other life'), 'rgb') "}