{"name": "pulmonary fibrosis progression eda lung segment ", "full_name": " h3 for using interactive features please fork it and then run h2 If you want to know details about the Pulmonary Fibrosis Progression check out my other kernel Pulmonary Fibrosis for Non Med People which contains detailed information about the the disease symptoms causes and many more If you like this kernel please upvote h3 Table of content ", "stargazers_count": 0, "forks_count": 0, "description": "Let s run the code below and display an example of isolating the lung from the chest 2D Visualizations Techniques Non Interactive When visualizing data I find very beneficial to visualize each process of your script. However male patients are mostly sick near the age of 70 7. So if you want to use the slider window to browse through the slices fork the code and run it manually in interactive mode Interactive 2 Another way to visualize the CT Angiograms in a bit lively fashion is to use gif images. Interactive Patient Lookup FVC Decay Go to TOCIf you run the following cell you will get an dropdown menu where you can select any patient ID and it will show you the details present for that patient in the training data frame. Lung SegmentationGo to TOCFor the lung segmentation let s select any patient randomly and then we will see the CT Scans of that patient. Study of Gender vs SmokingStatus 8 9632 9. Interactive Patient Lookup CT Scans 11 9632 12. Bronchioles are air passages inside the lungs that branch off like tree limbs from the bronchi the two main air passages into which air flows from the trachea windpipe after being inhaled through the nose or mouth. for using interactive features please fork it and then run https www. Gender Distribution 5 9632 6. Interactive Patient Lookup CT Scans Go to TOCHere from the dropdown menu please select any patient id and it will show you 16 CT Scans over time for that particular patient. We observe that the age distribution starts from near 50 years and it tops to 90 years. Now using the disk size 20 we again we perform closing operation on all the corresponding segmentation mask and produce output in the following section of code. Before selecting any particular filter let s see the segmentation quality of the filters and then we can select the desired filter. Hilarious thing is that 5 of the patients are still smoking. let s see the average age of patients based on their sex. With this view in mind we can run closing operation so that it will fill up those portions. Gender DistributionGo to TOCIt seems that among the unique patients 78 are Male and rest of them are female. This will not only help you understand each step of your code but it makes for a very nice clean presentation. Age Distribution vs Smoking StatusGo to TOC10. Age Distribution vs SmokingStatus 9 9632 10. However among the previous 3 GIFs one of the most important is the Lung Segmentation Mask. Study of SmokingStatus 7 9632 8. Age Distribution of the PatientsGo to TOCNow let s have a look at the patients age distributions. png 1569348761 If you want to know details about the Pulmonary Fibrosis Progression check out my other kernel Pulmonary Fibrosis for Non Med People https www. So it is highly efficent and accurate for storing CT scan slides. org uploads 1 2 2 7 122798879 editor kaggle v01 clipped_2. However among the patients about 27 of the patients have never smoked in their life. plotly imports Let s have a look at the detailed info about the dataframes Creating unique patient lists and their properties. Observations 9632 Smoking Status doesn t change over time. Creating Individual Patient Profiles 4 9632 5. We need to close those gaps so that we can segment the whole lung portion. However it is observed that the average age of male and female patients are almost same. Study of SmokingStatus Go to TOCIt seems that almost 70 of the patients are ex smokers at some point of their lives they smoked. Basically GIFs are a series of images shown at an preconfigured interval automatically. Remember it s an interactive notebook. Interactive Patient Lookup FVC Decay 10 9632 11. Creating Individual Patient Profiles Go to TOCLet s create a dataframe that will contain all the unique patient IDs. The bronchioles deliver air to tiny sacs called alveoli where oxygen and carbon dioxide are exchanged. Age Distribution of the Patients 6 9632 7. Sumarizing the Unique Patient Profile 12 Part 2 Lung Segmentation 9632 13. Therefore the given data about the pulmonary fibrosis is mainly of the older people. Unfortunately this is not helpful for those that want to scan through each image and get a better understanding of the data. Load Dataframes 1 9632 2. So smoking status for a single patient is always unique. They are vulnerable to conditions like asthma bronchiolitis cystic fibrosis and emphysema that can cause constriction and or obstruction of the airways. We will use both fill_lung_structures True and fill_lung_structures False to isolate the lung and the internal structures. Study of Gender vs SmokingStatusGo to TOC9. com redwankarimsony pulmonary fibrosis for non med people which contains detailed information about the the disease symptoms causes and many more. Number of PatientsGo to TOC4. 9632 Age of the patient doesn t change over time Whatever the age in the beginning of the diagnosis even after more than 52 weeks patient s age didn t change in the dataframe. Improvement Pick multiple background labels from around the patient More resistant to trays on which the patient lays cutting the air around the person in half Fill the air around the person Method of filling the lung structures that is superior to something like morphological closing For every slice we determine the largest solid structure This slice contains some lung Make the image actual binary Invert it lungs are now 1 Remove other air pockets inside body There are air pockets get masks isolate lung from chest sanity check pick random slice slide through dicom images using a slide bar. Segmentation of Lung 13 1. It will show you all the information of that patient from the train data frame and also plot the gradual fibrosis progression over time. Train and Test Dataframe DetailsGo to TOC3. Number of Patients 3 9632 4. Sumarizing the Unique Patient ProfileGo to TOC Part 2 13. The code below will in essence visually convey a story on how you segmented your data 9632 original image 9632 the binary mask that covers the lung 9632 highlighting internal structures of the lung using one of the masks Interactive 1 There are really only a few ways to display multiple images on jupyter notebook manually plot each image one by one or make a plot with multiple columns and rows to display in one figure. Lets use some thresholding and morphological operations to segment just the lung from the chest By running the code below you are using skimage functions from above to create a mask that covers the lung. Train and Test Dataframe Details 2 9632 3. 0 is treated as background which we do not want Pick the pixel in the very corner to determine which label is air. Table of contentPart 1 EDA 9632 1. In order to use the interactive feature you have to fork it and run it in your own instance in interactive mode. However the upper side of GIF is that it stores images in lossless compression. Therefore we can select the desired filters from here and just multiply that with the original image to get lung segmentation from these. Creating new rows Creating the dataframe for the patient info Creating the main histogram Creating the best fitting line with mean and standard deviation Labeling of plot interactive IntSlider ToggleButtons show_ct_scans patient_ids 0 Set outside of scan pixels to 0 The intercept is usually 1024 so air is approximately 0 Convert to Hounsfield units HU set path and load files sanity check skimage image processing packages not actually binary but 1 and 2. If you like this kernel please upvote. It plots the decrease of FVC over time. Load DataframesGo to TOC2. You can see there are several images where we can see that the mask only selects the tissue portion of the lung but it is not considering the air vessels thorugh the lungs i. With the code below you create an interactive slide bar that lets you scroll through the images But the catch is that you have to run the code in interactive window. ", "id": "redwankarimsony/pulmonary-fibrosis-progression-eda-lung-segment", "size": "10107", "language": "python", "html_url": "https://www.kaggle.com/code/redwankarimsony/pulmonary-fibrosis-progression-eda-lung-segment", "git_url": "https://www.kaggle.com/code/redwankarimsony/pulmonary-fibrosis-progression-eda-lung-segment", "script": "plotly.express segment_lung_mask ball interact  # numpy interactive seaborn skimage binary_closing pandas_profiling regionprops ToggleButtons show_ct_scans dicom_animation IPython chart_studio.plotly IntSlider matplotlib.pyplot opening binary_dilation plotly.graph_objs plotly.offline pandas closing largest_label_volume iplot skimage.morphology disk plot_comparison ipywidgets load_scan morphology patient_lookup display label get_pixels_hu explore_dicoms skimage.measure measure ", "entities": "(('which', 'disease symptoms causes'), 'com') (('bit lively fashion', 'gif images'), 'so') (('where oxygen dioxide', 'tiny sacs'), 'deliver') (('Observations', 'Smoking Status t 9632 time'), 'change') (('you', 'interactive window'), 'create') (('9632 Age', 'dataframe'), 'change') (('that', 'unique patient IDs'), 'create') (('it', 'portions'), 'run') (('that', 'airways'), 'be') (('Basically GIFs', 'preconfigured interval'), 'be') (('it', 'lossless compression'), 'be') (('Therefore given data', 'mainly older people'), 'be') (('1569348761 you', 'Pulmonary Non Med People https www'), 'png') (('org', '7 editor kaggle v01 1 2 122798879 clipped_2'), 'upload') (('it', 'lungs'), 'see') (('again we', 'code'), 'perform') (('I', 'script'), 'let') (('Male', 'them'), 'seem') (('we', 'lung whole portion'), 'need') (('they', 'lives'), 'go') (('it', '90 years'), 'observe') (('it', 'training data frame'), 'go') (('smoking So status', 'single patient'), 'be') (('i it', 'particular patient'), 'go') (('that', 'nose'), 'be') (('data 9632 original 9632 binary that', 'one figure'), 'convey') (('it', 'very nice clean presentation'), 'help') (('s', 'patient unique lists'), 'let') (('usually so air', 'load sanity check skimage image processing path packages'), 'create') (('air masks', 'slide bar'), 'Fill') (('Lung Segmentation Mask', 'most important'), 'be') (('5', 'patients'), 'be') (('label', 'very corner'), 'treat') (('It', 'time'), 'show') (('s', 'patients age distributions'), 'let') (('about 27', 'life'), 'smoke') (('randomly then we', 'patient'), 'SegmentationGo') (('However male patients', '70'), 'be') (('that', 'lung'), 'use') (('that', 'data'), 'be') (('Therefore we', 'these'), 'select') (('average age', 'sex'), 'let') (('you', 'interactive mode'), 'in') (('average age', 'male patients'), 'observe') (('So it', 'CT scan highly slides'), 'be') (('We', 'False lung'), 'use') (('then we', 'desired filter'), 'let') "}