{"name": "pytorch cnn from scratch ", "full_name": " h3 Read data h3 set up the model h3 Train the model ", "stargazers_count": 0, "forks_count": 0, "description": "transforms provides common image transformations transforms. conv5 x celu Read data Simple custom generator set up the model Train the model Accuracy Check CSV submission Hyper parameters Device configuration gpu or cpu Splitting data into train and val 10 of train data are used for validation torchvision. Compose composes several transforms together Convert a tensor to PIL Image Python Imaging Library randomly flips randomly flips rotates the image by angle in 1 20 DataLoader combines a dataset and a sampler and provides an iterable over the given dataset there are 128 samples per batch to load DataLoader shuffles train data every epoch and doesnt shuffle valid data Base class for my neural network ancestor constructor call nn. RandomRotation 20 30self. Conv2d applies a 2D convolution out_channels of previous layer should be equal to in_channels of current layer BatchNorm2d normalizes outputs of each layer pooling function is 2D max 2D average pooling linear transformation to the incoming data first convolutional layer then batchnorm then activation then pooling layer LeakyReLU as activation function Cross entropy as loss function AdaMax is used as gradient descent optimization algorithm Forward pass backpropagation method for grad calculating Backward and optimize value of Loss function after each epochs Test the model eval mode batchnorm uses moving mean variance instead of mini batch mean variance Save the model checkpoint. ", "id": "danilaot/pytorch-cnn-from-scratch", "size": "207", "language": "python", "html_url": "https://www.kaggle.com/code/danilaot/pytorch-cnn-from-scratch", "git_url": "https://www.kaggle.com/code/danilaot/pytorch-cnn-from-scratch", "script": "torch.nn.functional TensorDataset torchvision.transforms DataLoader torch.nn torch.utils.data train_test_split matplotlib.pyplot Dataset __len__ __init__ SimpleCNN(nn.Module) MyDataset(Dataset) forward sklearn.model_selection pandas __getitem__ numpy ", "entities": "(('Accuracy Check CSV submission Hyper', 'validation torchvision'), 'conv5') (('network ancestor neural constructor', 'nn'), 'convert') (('batch instead mini mean variance', 'model checkpoint'), 'apply') (('transforms', 'image transformations common transforms'), 'provide') "}