{"name": "red panda lb 0 76 ", "full_name": " h1 Loading the Important Libraries h1 Fixing Config h1 Create Folds h1 Building Dataset h1 Plotting some Images h1 Processing The Images h1 Building Model h1 Defining Training and Validation epochs h1 Defining Training Loop h1 Training with 5 Fold CV h1 Plotting the Losses and the Metric h1 Making submission to leaderboard ", "stargazers_count": 0, "forks_count": 0, "description": "png The following kernel uses a dataset of Prostate Tissue images and predicts the ISUP Grade of the PCa. The key to decreasing mortality is developing more precise diagnostics. Tiled Regularization4. reshape 1 targets targets. 225 Defining train and test transforms model enetv2 efficientnet b0 5. So the image has been greedily tiled into 16 smaller images of regions where non white pixels were more concentrated. DataFrame f model_name _Training_Loss train_losses f model_name _Training_Acc train_accs f model_name _Validation_Loss valid_losses f model_name _Validation_Acc valid_accs Make Train and Valid DataFrame from fold Build and load Dataset Initialize model loss and optimizer opt4 optim. These tissue samples are examined by a pathologist and scored according to the Gleason grading system. Diagnosis of PCa is based on the grading of prostate tissue biopsies. EffecientNet Implementation2. Plotting some ImagesAs you see a lot of white space still remains but that is necessary in order not to miss out actual data. Tiling of the Images3. COLOR_BGR2RGB Image net standard mean and std mean 0. 99 temp_tr_loss temp_val_loss temp_val_metric fit_model model efficientnet b2 train_iterator valid_iterator opt4 loss_criterion device epochs 2 tr_loss temp_tr_loss val_loss temp_val_loss val_metric temp_val_metric test_data Build_Dataset test_df resize 256 256 mode test augmentations test_transforms test_iterator DataLoader test_data batch_size 2 num_workers 4 y_pred get_predictions model test_iterator device test_df isup_grade y_pred test_df. to device optimizer optim. reshape 1 return pd. With more than 1 million new diagnoses reported every year prostate cancer PCa is the second most common cancer among males worldwide that results in more than 350 000 deaths annually. Another point to notice is that to the human eye the images are extremely indistinguishable and a very eduacted and experienced eye is required to actually grade the images. 5 each and then the entire concatenated image is flipped with 0. One can imagine that mistakes are very plausible in such scenarios and hence perfecting automation of the detecting becomes not only a helping hand software but a necessity in the medical sector Processing The Images Building Model Defining Training and Validation epochs Defining Training Loop Training with 5 Fold CV Plotting the Losses and the Metric Making submission to leaderboard image cv2. com kaggle media competitions PANDA Screen 20Shot 202020 04 08 20at 202. The images are normalized using the Mean and Standard Deviation calculated on them previously. to device loss_criterion nn. To sum it up the clever ideas to look out for in the implementation 1. parameters print f The model has count_parameters model trainable parameters preds preds. To add a pre model regularizing effect each individual tile is flipped horizontally and vertically with a probability of 0. Learning Rate Scheduler Loading the Important Libraries Fixing Config Create Folds Building DatasetBecause a majority of the image is white space passing the image directly to the network may result in the model not working upto its full potential as it tries to find patterns in the white space where there are none. ", "id": "sicmunduscreatusest/red-panda-lb-0-76", "size": "2258", "language": "python", "html_url": "https://www.kaggle.com/code/sicmunduscreatusest/red-panda-lb-0-76", "git_url": "https://www.kaggle.com/code/sicmunduscreatusest/red-panda-lb-0-76", "script": "extract DataLoader IPython.display model model as enet enetv2(nn.Module) count_parameters albumentations.pytorch Image tqdm_notebook as tqdm ToTensorV2 seaborn numpy evaluate train epoch_time tqdm_notebook nn models tqdm transforms sklearn torchvision Build_Dataset(Dataset) StratifiedKFold get_predictions matplotlib.pyplot forward PIL metrics sklearn.model_selection pandas submit efficientnet_pytorch torch.optim fit_model seed_everything torch.utils.data __len__ display Dataset __init__ optim torch lr_scheduler __getitem__ ", "entities": "(('images', 'them'), 'normalized') (('each then entire concatenated image', '0'), '5') (('individual tile', '0'), 'add') (('Diagnosis', 'tissue prostate biopsies'), 'base') (('tissue samples', 'Gleason grading system'), 'examine') (('y_pred 2 4 get_predictions', 'test_iterator device'), '99') (('still that', 'actual data'), 'plot') (('extremely very eduacted eye', 'actually images'), 'be') (('worldwide that', '350 more than 000 deaths'), 'report') (('where non white pixels', 'regions'), 'tile') (('mistakes', 'Metric Making image cv2'), 'imagine') (('it', 'white space'), 'Loading') (('key', 'more precise diagnostics'), 'develop') (('count_parameters model trainable parameters', 'preds'), 'f') (('png following kernel', 'PCa'), 'use') "}