{"name": "reshampling credit card data ", "full_name": " h1 Data Understanding h1 Data Reshampling h1 Logistic Regression Model h1 Model Evaluation h3 Please Upvote this kernel if it is useful for you ", "stargazers_count": 0, "forks_count": 0, "description": "Please Upvote this kernel if it is useful for you. 17 obseravations are detected as Fraud We can see there are only less variable which are weakly correalted with class May be this is because data is already reduced to lower domension using PCA and other Feature engineering method and these varables are explaining significant variance in data Data ReshamplingHere i am reshampling data using SMOTE method because dataset is imbalaned. Logistic Regression Model Model Evaluation Model is validated we can see accuracy at both train and test set is almost sam which means model is not overfitting ROC AUC score is also enough good 0. There is no missing value Dataset is highly imbalanced only 0. Information given in data is sesitive so i think data has been preprocessed with technique such as PCA or Factor Analysis So we need not to put extra effort on Data Cleaning and Wrangling. Class is target variable where as others are predictor variable. Data UnderstandingThere is 284807 observation of 31 variable. Out of 284807 only 492 observations are detected Fraud so this data is highly imbalanced we will use different sampling technique to increase accuracy. ", "id": "ravichaubey1506/reshampling-credit-card-data", "size": "1205", "language": "python", "html_url": "https://www.kaggle.com/code/ravichaubey1506/reshampling-credit-card-data", "git_url": "https://www.kaggle.com/code/ravichaubey1506/reshampling-credit-card-data", "script": "seaborn sklearn sklearn.linear_model matplotlib.pyplot train_test_split train_test_split as tts metrics imblearn.combine pandas sklearn.model_selection SMOTETomek LogisticRegression numpy ", "entities": "(('Factor So we', 'Data Cleaning'), 'be') (('kernel it', 'you'), 'Upvote') (('ROC AUC score', 'model'), 'validate') (('Data UnderstandingThere', '284807 31 variable'), 'be') (('highly we', 'accuracy'), 'detect') (('dataset', 'SMOTE method'), 'detect') "}