{"name": "retina data exploration ", "full_name": " h1 Library imports h1 Prepare input data h2 Read and process images h2 Prepare the data from a list of files h2 The following code h1 Build CNN with ResNet architechture h2 Step1 Define Identity Block h2 Step2 Define convolution Block h2 Step3 Pull the model together h1 A generic convolutional neural network model h2 Create and compile the mini Resnet model h2 Train the mini Resnet model h2 Make predictions using the mini ResNet model h1 Training the Generic CNN models ", "stargazers_count": 0, "forks_count": 0, "description": "read_csv normalizes the histogram of images imi minval will turn the color range between 0 imrange and the scaleing will stretch the range between 0 255 read image from file convert 2 grayscale turn it into a binary image find contours find the biggest area find the bounding rect crop image resize to im_size X im_size size brighter image deemer image add all the images an labels Input data files are available in the. prepares the list of image files and corresponding labels2. Step3 Pull the model together A generic convolutional neural network model Create and compile the mini Resnet model Train the mini Resnet model Make predictions using the mini ResNet model Training the Generic CNN models This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. And this is not specific to a class label this has to do with lighting conditions when the picture was taken. We need to make sure that all images have the same range of values i. Library imports Prepare input data Read and process images The following function reads an image from a file autocrops it and scales it to 128X128. I suspect that histogram equalization may loose some defining features of disease classes. You ll need this later to add back to the main path. Prepare the data from a list of files The following function Reads an image from a fils flips it from left to right flips it upside down add all three images and their labes to the dataset The following code1. First component of main path Second component of main path 3 lines Third component of main path 2 lines Final step Add shortcut value to main path and pass it through a RELU activation 2 lines defining name basis Retrieve Filters Save the input value First component of main path Second component of main path 3 lines Third component of main path 2 lines Final step Add shortcut value to main path and pass it through a RELU activation 2 lines Define the input as a tensor with shape input_shape Zero Padding Stage 1 Stage 2 Stage 3 Stage 4 Stage 5 AVGPOOL output layer Create model Define the input as a tensor with shape input_shape Zero Padding Stage 1 Stage 2 Stage 3 Stage 4 dense layer output layer Create model Create and compile the ResNet models train the resnet model summarize history for accuracy summarize history for loss Create and compile the generic CNN models train the general cnn model summarize history for loss. We also need to do additional processing. prepares training and testing data for modeling Build CNN with ResNet architechture Step1 Define Identity Block Input to the shortcut has the same dimension as the output activation. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. Step2 Define convolution Block In this case there is a CONV2D layer in the shortcut path. For instance I noticed that some of the images are too dim compared to the others. ensure that the base of the color histogram stretches from 0 255. histogram normalization i. The CONV2D layer is used to resize the shortcut input to a different dimension so that the dimensions match up in the final addition needed to add the shortcut value back to the main path. Note that this is not the same as histogram equalization where the shape of the histogram is flattened over a full base. For example running this by clicking run or pressing Shift Enter will list all files under the input directory Create a list of image files and labels store the filenames here store the labels here Shuffle the files and labels combine the lists shuffle two lists together to keep order unzip the shuffled lists Train test devide 70 30 size of the images training data test data GRADED FUNCTION identity_block defining name basis Retrieve Filters Save the input value. reads and processes images in those files 3. ", "id": "tsantra/retina-data-exploration", "size": "1877", "language": "python", "html_url": "https://www.kaggle.com/code/tsantra/retina-data-exploration", "git_url": "https://www.kaggle.com/code/tsantra/retina-data-exploration", "script": "numpy.random ZeroPadding2D AveragePooling2D keras.layers Activation keras.models keras.utils.data_utils IPython.display keras seed plot_model keras.utils.vis_utils numpy MaxPooling2D SVG BatchNormalization get_file Dense normalize_histograms preprocess_input layer_utils glorot_uniform layers identity_block keras.initializers tensorflow Add matplotlib.pyplot GlobalMaxPooling2D set_random_seed read_and_process_image pandas Conv2D load_model keras.preprocessing Model convolutional_block Input keras.applications.imagenet_utils keras.utils genCNN model_to_dot imshow ResNetS Flatten image prepare_data ", "entities": "(('where shape', 'full base'), 'note') (('histogram equalization', 'disease classes'), 'suspect') (('It', 'python docker image https kaggle github'), 'pull') (('following function', 'dataset'), 'prepare') (('some', 'too others'), 'notice') (('Retrieve Filters', 'input value'), 'list') (('data labels Input files', 'the'), 'normalize') (('You', 'later back main path'), 'need') (('cnn general model', 'loss'), 'component') (('prepares', 'output activation'), 'have') (('dimensions', 'back main path'), 'use') (('when picture', 'lighting conditions'), 'be') (('process following function', '128X128'), 'prepare') (('We', 'also additional processing'), 'need') (('images', 'values i.'), 'need') "}