{"name": "rsna str 3d stacking 3d plot segmentation ", "full_name": " h1 DICOM Processing and Segmentation in Python h2 Import Packages h3 Setting paths h2 Helper function h2 Save the loaded images in npy format h3 Displaying Images h3 Critiquing the Histogram h2 Displaying an Image Stack h2 Resampling h2 Segmentation h3 Single Slice Example At Each Step h3 A few observations h3 Apply Masks to All Slices h3 Acknowledgements h3 In the meantime check out my other ongoing works in this same competition ", "stargazers_count": 0, "forks_count": 0, "description": "This would be a good time to save the processed data. Different labels are displayed in different colors After just the lungs are left we do another large dilation in order to fill in and out the lung mask one last dilation 10 10. Save the loaded images in npy format Displaying ImagesThe first thing we should do is to check to see whether the Houndsfeld Units are properly scaled and represented. com redwankarimsony rsna str pulmonary embolism dummy sub CT Scans DICOM files Windowing Explained https www. If you want to see an static image of the 3D mesh plot use the function plt_3d. Here we ll use the patient ID 6897fa9de148 from that dataset. Machine learning algorithms work a lot better when you can narrowly define what it is looking at. com redwankarimsony rsna str dicom gif npy RSNA STR Pulmonary Embolism EDA https www. The remainder of the Quest is dedicated to visualizing the data in 1D by histogram 2D and 3D. Using the metadata from the DICOM we can figure out the size of each voxel as the slice thickness. That means you can t rotate and twist different axis for better view. We don t want to accidentally clip the lung. Determine current pixel spacing spacing map float scan 0. com gzuidhof for his excellent work on DICOM image processing. If you need a refresher here s a quick list of a few useful ones sourced from Wikipedia. Import Packages Setting pathsThen let s specify a specific DICOM study we can take a closer look. Python has all the tools from pre packaged imaging process packages handling gigabytes of data at once to byte level operations on a single voxel. com redwankarimsony rsna str 3d stacking 3d plot segmentation edit run 42517982 RSNA STR DICOM GIF npy https www. com png middle 265 2655834_work in progress icon. Apply Masks to All SlicesThe single slice example seemed to work pretty well. There is only a small bit of bone seen as a tiny sliver of height between 700 3000 This observation means that we will need to do significant preprocessing if we want to process lesions in the lung tissue because only a tiny bit of the voxels represent lung. org wiki Hounsfield_scale The transformation is linear. PixelSpacing Make the colormap single color since the axes are positional not intensity. Downsides of using this mask appropach is you can miss hilar perihilar disease fairly easily. com redwankarimsony ct scans dicom files windowing explained RSNA STR PE Gradient Sigmoid Windowing https www. ResamplingAlthough we have each individual slices it is not immediately clear how thick each slice is. com redwankarimsony rsna str pe gradient sigmoid windowing RSNA STR 3D Stacking 3D Plot Segmentation https www. Because a CT slice is typically reconstructed at 512 x 512 voxels each slice represents approximately 370 mm of data in length and width. Here in the following part I just have showed a 3D plot of the segmented bone just by using morphological analysis. However the magic that occurs behind the scenes is no easy feat so let s explore some of that magic. In this quest we will be starting from raw DICOM images. load_scan will load all DICOM images from a folder into a list for manipulation. Looks like things check out. The below code will Standardize the pixel value by subtracting the mean and dividing by the standard deviation Identify the proper threshold by creating 2 KMeans clusters comparing centered on soft tissue bone vs lung air. get_pixels_hu converts raw values into Houndsfeld units https en. Helper functionHere we make two helper functions. It takes less time but it is non interactive. Caution You can only see the interactive 3D plot after you commit the notebook in the kaggle notebook viewer. We will extract voxel data from DICOM into numpy arrays and then perform some low level operations to normalize and resample the data made possible using information in the DICOM headers. Fortunately this is in the DICOM header. Displaying an Image StackWe don t have a lot of screen real estate so we ll be skipping every 3 slices to get a representative look at the study. Let s take a look at the actual images. Because air really only goes to 1000 so there must be some sort of artifact. SliceThickness scan 0. Let s now apply the mask to all the slices in this CT and show a few examples. Single Slice Example At Each StepWe want to make sure the algorithm doesn t accidentally exclude the region of interest due to its soft tissue nature. 7 350 previously default value plotly_3d v f Standardize the pixel values Find the average pixel value near the lungs to renormalize washed out images To improve threshold finding I m moving the underflow and overflow on the pixel spectrum Using Kmeans to separate foreground soft tissue bone and background lung air threshold the image First erode away the finer elements then dilate to include some of the pixels surrounding the lung. Using Erosion and Dilation which has the net effect of removing tiny features like pulmonary vessels or noise Identify each distinct region as separate image labels think the magic wand in Photoshop Using bounding boxes for each image label to identify which ones represent lung and which ones represent every thing else Create the masks for lung fields. com author howard for his excellent implementation of segmentation Franklin Heng https medium. The voxel values in the images are raw. Both the rescale intercept and rescale slope are stored in the DICOM header at the time of image acquisition these values are scanner dependent so you will need external information. DICOM Processing and Segmentation in PythonDICOM is a pain in the neck. In order to display the CT in 3D isometric form which we will do below and also to compare between different scans it would be useful to ensure that each slice is resampled in 1x1x1 mm pixels and slices. One way to do this is by creating different models for different parts of a chest CT. SegmentationIf you are interested in chest CTs because you re interested in picking up lung cancers you re not alone. Acknowledgements Guido Zuidhof https www. Howard Chen https www. colormap rgb 255 105 180 rgb 255 255 51 rgb 0 191 255 Fancy indexing verts faces to generate a collection of triangles ax. I you really want to see an interactive 3D mesh plot just use the function plotly_3d and comment out plt_3d. After the commit even the interactive 3d plot takes a huge time 12 mins with my 4Mbps internet to load. Apply mask onto the original image to erase voxels outside of the lung fields. HU s are useful because it is standardized across all CT scans regardless of the absolute number of photons the scanner detector captured. Substance HU Air 1000 Lung 500 Fat 100 to 50 Water 0 Blood 30 to 70 Muscle 10 to 40 Liver 40 to 60 Bone 700 cancellous bone to 3000 cortical bone Let s now create a histogram of all the voxel data in the study. Critiquing the HistogramThe histogram suggests the following There is lots of air the reason why there are lot of values close to 1000 HU There is some lung denoted by the presence of values near 500 HU There s an abundance of soft tissue mostly muscle liver etc but there s also some fat. Convert to int16 from sometimes int16 should be possible as values should always be low enough 32k Set outside of scan pixels to 1 The intercept is usually 1024 so air is approximately 0 Convert to Hounsfield units HU This is a good time to save the new data set to disk so we don t have to reprocess the stack every time. Therefore it is often useful to pre process the image data by auto detecting the boundaries surrounding a volume of interest. For instance a convolutional network for lungs would perform better than a general purpose network for the whole chest. csv file given which has some slices that have Pulmonary Embolism PE. It also happens to be very helpful. Therefore so long as you have a slope and an intercept you can rescale a voxel value to HU. The lung lesion is properly preserved in the ROI and it appears to work wel from lung bases all the way to the apices. For reference Substance HU Air 1000 Lung 500 Fat 100 to 50 Water 0 Blood 30 to 70 Muscle 10 to 40 Liver 40 to 60 Bone 700 cancellous bone to 3000 cortical bone Now if we have some values less than 1000 HU then we have something strange. Loop over the image files and store everything into a list. com hengloose a comprehensive starter guide to visualizing and analyzing dicom images in python 7a8430fcb7ed for his master class explanation on segmentation and 3d plotting. Processing raw DICOM with Python is a little like excavating a dinosaur you ll want to have a jackhammer to dig but also a pickaxe and even a toothbrush for the right situations. png In the meantime check out my other ongoing works in this same competition RSNA STR Pulmonary Embolism Dummy Sub https www. Let s take a look at a chest CT stack from the first patient in the train. Finally we will create segmentation masks that remove all voxel except for the lungs. 0 mm slices and each voxel represents 0. Tune the threshold in the following code block in order to get your desired part segmented. So let s test this out on a single slice. As clinical radiologists we expect post processing even taking them for granted. com redwankarimsony rsna str pulmonary embolism eda reload_ext signature matplotlib inline Print out the first 5 file names to verify we re in the right folder. A few observationsIf we were to apply a machine learning algorithm to the image stack the algorithm would have a much easier time to identify a primary lung lesion. ", "id": "redwankarimsony/rsna-str-3d-stacking-3d-plot-segmentation", "size": "8828", "language": "python", "html_url": "https://www.kaggle.com/code/redwankarimsony/rsna-str-3d-stacking-3d-plot-segmentation", "git_url": "https://www.kaggle.com/code/redwankarimsony/rsna-str-3d-stacking-3d-plot-segmentation", "script": "skimage.transform Poly3DCollection init_notebook_mode download_plotlyjs numpy sklearn.cluster skimage make_lungmask mpl_toolkits.mplot3d.art3d glob plotly tqdm plotly_3d matplotlib.pyplot resample make_mesh plotly.offline resize plot plotly.graph_objs pandas KMeans iplot sample_stack __version__ load_scan plt_3d plotly.figure_factory morphology air_removal_mask get_pixels_hu measure ", "entities": "(('We', 'accidentally lung'), 'don') (('s', 'a few examples'), 'let') (('immediately how slice', 'individual slices'), 'have') (('you', 'lung cancers'), 'be') (('you', 'hilar perihilar disease'), 'be') (('ones', 'lung fields'), 'think') (('following', 'soft tissue'), 'suggest') (('auto boundaries', 'interest'), 'be') (('you', 'HU'), 'long') (('4Mbps internet', '12 mins'), 'take') (('easy so s', 'magic'), 'be') (('com redwankarimsony str embolism dummy sub CT pulmonary Scans', 'Windowing Explained https www'), 'rsna') (('you', 'better view'), 'mean') (('remainder', 'histogram 2D'), 'dedicate') (('One way', 'chest CT'), 'be') (('This', 'good processed data'), 'be') (('scanner you', 'external information'), 'intercept') (('we', 'DICOM raw images'), 'start') (('it', 'way apices'), 'preserve') (('we', 'right folder'), 'Print') (('then we', 'something'), 'have') (('you', 'notebook kaggle viewer'), 'caution') (('Helper functionHere we', 'helper two functions'), 'make') (('load_scan', 'manipulation'), 'load') (('it', 'less time'), 'take') (('convolutional network', 'whole chest'), 'perform') (('s', 'train'), 'let') (('below code', 'lung air'), 'standardize') (('com redwankarimsony rsna str dicom gif', 'RSNA Embolism EDA https STR Pulmonary www'), 'npy') (('we', 'slice thickness'), 'figure') (('slice', 'length'), 'represent') (('you', 'also even right situations'), 'be') (('we', 'one last dilation'), 'display') (('air', 'so artifact'), 'go') (('algorithm', 'lung primary lesion'), 'be') (('static image', 'function'), 'want') (('desired part', 'order'), 'tune') (('that', 'lungs'), 'create') (('slice', 'mm pixels'), 'be') (('255 Fancy indexing 255 105 180 255 51 rgb 0 191 255 verts', 'triangles ax'), 'rgb') (('com author', 'segmentation Franklin Heng https medium'), 'howard') (('com png', 'progress icon'), 'middle') (('get_pixels_hu', 'units Houndsfeld https'), 'convert') (('We', 'DICOM headers'), 'extract') (('algorithm doesn', 'tissue soft nature'), 'Example') (('scanner detector', 'photons'), 'be') (('I', 'just morphological analysis'), 'show') (('so we', 'don stack'), 'be') (('that', 'Pulmonary Embolism PE'), 'file') (('we', 'closer look'), 'Setting') (('DICOM Processing', 'neck'), 'be') (('com redwankarimsony ct scans', 'RSNA STR PE Gradient Sigmoid Windowing https www'), 'dicom') (('you', 'Wikipedia'), 's') (('s', 'study'), 'Lung') (('only tiny bit', 'lung'), 'be') (('we', 'study'), 'display') (('First away finer elements', 'lung'), 'plotly_3d') (('mesh really interactive 3D plot', 'plt_3d'), 'want') (('So s', 'single slice'), 'let') (('it', 'narrowly what'), 'work') (('str 3d', 'RSNA STR DICOM GIF npy https 42517982 www'), 'run') (('Here we', 'dataset'), 'use') (('Houndsfeld Units', 'npy format'), 'be') (('axes', 'colormap single color'), 'make') (('Python', 'single voxel'), 'have') (('post processing', 'even them'), 'expect') "}