{"name": "rsna super cool eda and pytorch baseline train ", "full_name": " h2 RSNA STR Plumonary Embolism Detection h3 What is plumonary Embolism h3 What causes Plumonary Embolism h3 Reason for blood clots h3 symptoms of plumonary embolism h2 1 What is the competition about h2 2 Metrics Weighted Log loss h3 2 1 Exam Study level weighted log loss h3 2 2 Image level weighted log loss h3 2 3 All the labels must be logically consistent h3 Importing Libraries h3 Getting data h3 Basic Physics Behind CT scan h3 Hounsfield Unit h3 window and level h3 voxel size h3 Metadata of Image h2 3 EDA h3 3 1 Check Row and Columns range h3 3 2 Distribution of Pixel Spacing Columns and Rows h3 3 3 Distribution of Pixel Area h3 3 4 Distribution of Window width h3 3 5 Distribution of KVP h3 3 6 Distribution of TableHeight h3 3 7 Distribution of XRay h3 3 8 countplot of modality and rotation direction h3 3 9 Distribution of Image Raw and Rescaled values h2 4 Visulizing Images h4 What is DICOM image h3 4 1 Single Image h3 4 2 Grid of sorted images of some random patient h3 4 3 Animation h3 4 4 3d Reconstruction h2 Pytorch Baseline Model ", "stargazers_count": 0, "forks_count": 0, "description": "All the labels in the submission file must be logically consistent or your submission will be disqualified. 2346625767 RV LV Ratio 1 0. jpg Plumonary Embolism is the blood clot that is formed in the artery of the lungs. 5 nor can there be a predicted probability of Indeterminate 0. The symptoms of plumonary embolism depends on the size of blood clot. 4 Distribution of Window width 3. 6 Distribution of TableHeight 3. window and level Gray scale has 256 different units to represent colours but our eyes are not able to see small changes in colour in gray images. It is a very serious disease which causes death of one third people who go undiagnosed or undetectedwith the disease. com health deep venous thrombosis The blood clot which causes plumonary embolism are formed in legs or pelvis. com wp content uploads 2019 10 lung pulmo embolism 1500 1280x640. Main reason for the blood clot is deep vein thrombosis https www. weight of the label j be wj. Now if that was not confusing enough for you there is another catch. image_log_loss w qi yik log pik 1 yik log 1 pik The total loss is the average of all image and exam loss divided by the average of all row weights. 1042944785 Central PE 0. anxiety clammy or bluish skin chest pain that may extend into your arm jaw neck and shoulder fainting irregular heartbeat lightheadedness rapid breathing rapid heartbeat restlessness spitting up blood weak pulseRead more about Plumonary Embolism here https www. Code for checking consitency of the submission is provided here https www. 2 Distribution of Pixel Spacing Columns and Rows 3. Let me know if any information or code is incorrect i will correct it and if you find this notebook usefull please UPVOTE 2. 1 Single Image 4. here it means pixelspacing in x and y direction and slice thickness in z direction There are two type of voxel isotropic in which step in all sides are same and non isotropic steps are different. 5 is considered as being positive for PE will count as a positive imageAt the exam level we have1. Location of each image is as StudyInstanceUID SeriesInstanceUID SOPInstanceUID. png https a360 rtmagazine. 09202453988 Chronic 0. org articles attenuation coefficient lang us of tissue is calculated. qi be the ratio of positive images to total images. 5 both cannot have p 0. 8 countplot of modality and rotation directionIt means all the Modality are CT and rotation direction are CW 3. 5 then at least one of these labels must be assigned p 0. org wiki Godfrey_Hounsfield got Nobel Price for his part in making CT scanners Task of CT scanner is to find density of different tissues in our body now to convert this density to gray scale image Hounsfield came up with a way of linear transforming the density to gray scale image. What causes Plumonary Embolism Plumonary Embolism is caused due to the blood clot formed deep in the vein of our body. Similarly if no image is positive p 0. Visulizing Images What is DICOM image DICOM Digital Image and Communication in Medecine is a standard developed andmaintained by National Electrical Manufacturers Association NEMA for storingand transfering the medical images like CT computerised Tomography Magnetic resonanse image MRI and other types of medical images. 5 Distribution of KVP 3. exam_log_loss wj yij log pij 1 yij log 1 pij Then mean is taken over the log_loss for all such labels j. What is the competition about Here we are provided with the CT Plumonary angiography CTPA which is common type of medical imaging. com anthracene host confirmed label consistency check which will be used in this notebook Importing Libraries Getting data There are four labels in training set which are just for information and requires no predictions OA Constrast QA Motion True filling defect not PE and Flow artifact. com watch v KZld 5W99cI feature youtu. 06257668712 RV LV Ratio 1 0. evaluation https www. What is meant by logically consistent. 1 Exam Study level weighted log lossyij be the label for the exam i and label j. It can be only one of these and it must be present if at least one image is positive. 0736196319 Negative for PE. 5 in other words it is inconsistent to say chronic has p 0. 9 Distribution of Image Raw and Rescaled values 4. Reason for blood clots. Label Weight Negative for PE 0. This 1000 to 1000 range is adjueste for 256 gray values to come up with image. 1042944785 Acute Chronic 0. To get the average of all rows weights sum the weights of all images and all exam level labels and divide by number of rows. 4 3d Reconstructionwell I though it would work Pytorch Baseline Model supress warnings get all StudyInstanceUID get all SeriesInstanceUID get all SOPInstanceUID removing the extention vtk is used because dicom is giving some error. Negative Indeterminate Positive and it can only be one of these. smaller voxel sizes give better image. Injury Damage bone fracture tissue damage etc. where i is exam number and k is image number. Level is center of this window. jpg 3Fh 3D400 26la 3Den us 26w 3D700 26v 3D1 201710231815 h 400 la en US w 700 Metadata of Image 3 EDA 3. Hounsfield Unit is calculated by considering density of water as 0 unit and air as 1000 unit and all other density are transformed accordingly. RSNA STR Plumonary Embolism Detection What is plumonary Embolism image. 2 Image level weighted log lossyik 1 if PE is present in the image else 0. But immediate treatment could help prevent permenant lung damage. if any image on the exam is positive one of these must have p 0. 1877300613 Left PE 0. com health pulmonary embolus. In 1979 Godfrey Hounsfield https en. At the image level any image with predicted probability 0. 5 then there must be one and only one negative or indeterminate with p 0. yij 1 if present else 0 and pijis the predicted probability. We can adjust this window size according to our need to get better view of particular tissue we want to observer. symptoms of plumonary embolism. Metrics Weighted Log loss The metrics used by the competion is weighte log loss which is weighted over some labels. We have to predict total 10 labels 9 for exam study level and 1 for image level. Inactivity sitting for long period of time or lyinig on bed because of illness. Right left central if any image is predicted positive p 0. 1 Check Row and Columns rangeThere are 512 rows and columns in all 10000 images so it might be safe to assume that all the images follows same. so submission file should have number of rows equal to number of images number of exam study label number of exam study labels for exam study level. As the values spectral composition of the x ray depands on various parameters and voltage Hounsfield unit makes it easier to compare CT scans from different machines. 7 Distribution of XRay 3. 5 and acute chronic has p 0. watch this https www. 5 more than one of these labels may be assigned p 0. Data Contains hundereds of such images and we have to use our model to predict wether the image has PE or Not. When no images are predicted positive then none of these labels may be assigned p 0. dcm let us perform sanity check wether StudyInstanceUID SeriesInstanceUID and SOP instance UID in data match with actual folders Basic Physics Behind CT scan. attenuation factor is a measure of by how much strength of the beam is reduced when it is passed through certain material. Normally body parts lies in the range 1000 ex air in lungs to 1000. be video for more info voxel size voxel is basically 3d version of pixel as pixel is representation of image in 2d voxel is a 3d representation. Medical Condition There are some medical condition which can cause blood clot to form in our body. Main symptoms is shortness of breath which can be gradual or sudden. 3 All the labels must be logically consistent. 5 it is also possible that neither has p 0. 3 Distribution of Pixel Area 3. If any image is predicted positive there cannot also be a predicted probability of Negative 0. 2 Grid of sorted images of some random patient 4. so the weighted log loss is given by. so instead of spreading whole Hounsfield Range to a gray image we select window of Hounsfield and spread 256 values between these Hounsfield values everything below this range is black and above the range is white. Now the weigtage of the label PE present or not is w 0. 0736196319 Indeterminate 0. As different body parts have different attenuation factor it helps to seprate those parts easily. So Idea behind CT computed tomography scan is that when a x ray beam is passed through a tissue attenuation factor https radiopaedia. com mtree image upload f_auto q_auto f_jpg fl_attachment ce531 fig07 voxel dentalcare 2F 2Fmedia 2Fdentalcareus 2Fprofessional education 2Fce courses 2Fcourse0501 0600 2Fce531 2Fimages 2Fce531 fig07 voxel. com c rsna str pulmonary embolism detection overview evaluation page. 06257668712 Right PE 0. Acute Chronic Acute Chronic it cannot be both chronic acute and chronic so only one can have p 0. DICOM is very good protocol and intresting to read further click here https en. ", "id": "maunish/rsna-super-cool-eda-and-pytorch-baseline-train", "size": "9812", "language": "python", "html_url": "https://www.kaggle.com/code/maunish/rsna-super-cool-eda-and-pytorch-baseline-train", "git_url": "https://www.kaggle.com/code/maunish/rsna-super-cool-eda-and-pytorch-baseline-train", "script": "albumentations.pytorch.transforms Counter Style reconstruct DataLoader albumentations Fore convert_to_rgb IPython.display plotly.express show_grid get_x_y_cordinate delayed torch.functional numpy ToTensorV2 seaborn Back pydicom matplotlib.animation dist train_loop torch.nn distribution_of_image_values models tqdm RsnaDataset(Dataset) torchvision highlight_cols get_value Dict KFold matplotlib.pyplot typing show_image Parallel __getitem__ tqdm.auto get_meta_features plotly.graph_objs plotly.offline pandas sklearn.model_selection numpy_support valid_loop iplot joblib sanity_check vtk.util torch.optim plotly.figure_factory seed_everything torch.utils.data __len__ HTML Dataset __init__ run show_animation get_img collections colorama ", "entities": "(('average', 'rows'), 'get') (('symptoms', 'blood clot'), 'depend') (('plumonary embolism', 'legs'), 'thrombosis') (('5 more than one', 'labels'), 'assign') (('qi', 'total images'), 'be') (('everything', 'range'), 'value') (('body Normally parts', '1000'), 'lie') (('anxiety skin chest bluish that', 'blood Plumonary pulseRead more Embolism'), 'clammy') (('we', 'exam level'), 'consider') (('us', 'folders Basic CT actual Physics scan'), 'let') (('it', 'parts'), 'help') (('immediate treatment', 'lung permenant damage'), 'help') (('logically submission', 'submission file'), 'be') (('scale image gray Hounsfield', 'scale gray image'), 'get') (('then none', 'labels'), 'assign') (('at least one image', 'only these'), 'be') (('image', 'PE'), 'hundered') (('Main reason', 'blood clot'), 'be') (('rotation direction', 'modality'), 'mean') (('Plumonary Embolism Plumonary Embolism', 'body'), 'cause') (('which', 'common medical imaging'), 'be') (('9 Distribution', 'Image Raw'), 'value') (('image', 'p'), 'have') (('Location', 'image'), 'be') (('weighte log which', 'labels'), 'weight') (('images', '512 10000 images'), 'be') (('also neither', '0'), 'be') (('Right central image', 'positive p 0'), 'leave') (('pij 1 yij', 'such labels'), 'log') (('voltage Hounsfield it', 'different machines'), 'make') (('Code', 'submission'), 'provide') (('2Fdentalcareus 2F 2Fmedia 2Fprofessional education', '2Fcourse0501'), 'upload') (('Now that', 'you'), 'be') (('notebook', 'it'), 'let') (('Hounsfield Unit', '1000 unit'), 'calculate') (('Medical medical which', 'body'), 'Condition') (('total loss', 'row weights'), 'image_log_loss') (('here it', 'sides'), 'mean') (('log weighted lossyij', 'j.'), 'be') (('which', 'PE'), 'confirm') (('we', 'particular tissue'), 'adjust') (('dicom', 'error'), '3d') (('256 gray values', 'image'), 'be') (('We', 'image level'), 'have') (('who', 'disease'), 'be') (('DICOM', 'very good further click'), 'be') (('then at least one', 'labels'), '5') (('What', 'other medical images'), 'be') (('blood that', 'lungs'), 'be') (('which', 'breath'), 'be') (('lossyik 1 PE', 'image'), 'weight') (('us', 'tissue'), 'lang') (('basically 3d version', '2d voxel'), 'be') (('submission so file', 'exam study level'), 'have') (('chronic', '0'), 'be') (('chronic only one', 'p'), 'chronic') (('x ray when beam', 'tissue attenuation factor https radiopaedia'), 'compute') (('eyes', 'gray images'), 'have') (('image', 'also predicted Negative'), 'be') (('it', 'only these'), 'be') (('when it', 'certain material'), 'be') "}