{"name": "sartorius indepth eda explanation model ", "full_name": " h1 Sartorius InDepth EDA Explanation Model W B h2 Contents h3 If you find this notebook useful do give me an upvote it helps to keep up my motivation This notebook will be updated frequently so keep checking for furthur developments h2 Competition Overview h2 Alzheimer s disease h2 Brain Tumor h2 Libraries h2 Weights and Biases W B h2 Global Config h2 Load Datasets h2 Tabular Exploration h2 Distribution Plots h2 Image View h2 Basic Image Exploration h2 Intermediate Image Exploration h2 Advanced Image Exploration h2 Instance Mask Viz h2 U Net Model h2 References h1 More Plots and Models coming soon ", "stargazers_count": 0, "forks_count": 0, "description": "csv a sample submission file in the correct format train train images in PNG format test test images in PNG format. Global Config global config 7. Libraries libraries 5. Brain tumors can begin in your brain primary brain tumors or cancer can begin in other parts of your body and spread to your brain as secondary metastatic brain tumors What are the Key Symptoms General signs and symptoms caused by brain tumors may include New onset or change in pattern of headaches Headaches that gradually become more frequent and more severe Unexplained nausea or vomiting Vision problems such as blurred vision double vision or loss of peripheral vision Gradual loss of sensation or movement in an arm or a leg Difficulty with balance Speech difficulties Feeling very tired Confusion in everyday matters Difficulty making decisions Inability to follow simple commands Personality or behavior changes Seizures especially in someone who doesn t have a history of seizures Hearing problems What are the Causes Primary brain tumors originate in the brain itself or in tissues close to it such as in the brain covering membranes meninges cranial nerves pituitary gland or pineal gland. Cell Segmentation Run Length Decoding https www. Neurons are damaged lose connections to each other and eventually die. In adults primary brain tumors are much less common than are secondary brain tumors in which cancer begins elsewhere and spreads to the brain. None of this metadata is provided for the test set. Advanced Image Exploration advanced image exploration 14. As the disease progresses memory impairments worsen and other symptoms develop. Early signs include difficulty remembering recent events or conversations. In Alzheimer s disease tau proteins change shape and organize themselves into structures called neurofibrillary tangles. gov types brain LibrariesWeights and Biases W B Weights Biases is the machine learning platform for developers to build better models faster. org diseases conditions alzheimers disease symptoms causes syc 20350447 Brain tumor Symptoms and causes Mayo Clinic https www. When these fragments cluster together they appear to have a toxic effect on neurons and to disrupt cell to cell communication. Additional Resources for better Understanding What is Alzheimer s Disease Symptoms Causes alz. Tangles Tau proteins play a part in a neuron s internal support and transport system to carry nutrients and other essential materials. LIVECell is the predecessor dataset to this competition. The damage most often starts in the region of the brain that controls memory but the process begins years before the first symptoms. com ayuraj sartorius instance mask viz with w b More Plots and Models coming soon Let s have a Talk Reach out to me on LinkedIn https www. More specifically you ll use phase contrast microscopy images to train and test your model for instance segmentation of neuronal cells. net cancer types brain tumor symptoms and signs Brain Cancer Brain Tumor Symptoms Causes Treatments https my. com alzheimers default. filters are also good edge detectors roberts scharr etc. Intermediate Image Exploration intermediate image exploration 13. Note the use of wandb. What are the Key Symptoms Memory loss is the key symptom of Alzheimer s disease. org health diseases 6149 brain cancer brain tumor Brain Tumors Patient Version National Cancer Institute https www. Intermediate Image Exploration K Means Clustering Matching Features Advanced Image Exploration Rudimentary Transforms Edge Detection Texture Sobel Edge Detection A Sobel filter is one means of getting a basic edge magnitude gradient image. com in ishandutta0098 import timm Activate pandas progress apply bar Wandb Login 336 336 wandb config Get complete image paths for train and test datasets simple k means clustering quick look at color value histograms for pixel matrix from first image a sobel filter is a basic way to get an edge magnitude gradient image can also apply sobel only across one direction. The mutations tell the cells to grow and divide rapidly and to continue living when healthy cells would die. The hidden test set is roughly 240 images. com julian3833 sartorius starter baseline torch u net Sartorius Instance Mask Viz with W B https www. At first a person with Alzheimer s disease may be aware of having difficulty remembering things and organizing thoughts. The data between bands is really correlated typical with visible imagery and why most satellite image analysts prefer to at least have near infrared values. ai ishandutta sartorius workspace user ishandutta U Net Model Dataset Class References Alzheimer s disease https www. If successful you ll help further research in neurobiology thanks to the collection of robust quantitative data. LIVECell_dataset_2021 A mirror of the data from the LIVECell dataset. Load Datasets load datasets 8. Basic Image Exploration basic image exploration 12. Weights and Biases weights and biases 6. Tabular Exploration Train Head Train Info Train Dataset Size Column wise Unique Values Number of Images in Each Directory Distribution Plots Cell Type Distribution Plate Time Distribution Elapsed TimeDelta Distribution Image View Training Images Training Semi Supervised Images Test Images Mask Plots Basic Image Exploration Dimensions and 2D Histogram Just look at image dimensions confirm it s 3 band RGB byte scaled 0 255. By the late stage of the disease the brain has shrunk significantly. Can be useful to threshold and find prominent linear features etc. Additional Resources for better Understanding Brain Tumor Types Risk Factors and Symptoms Healthline Brain Tumor Symptoms and Signs Cancer. Only a few test set images are available for download the remainder can only be accessed by your notebooks when you submit. org diseases conditions brain tumor symptoms causes syc 20350084 text A 20brain 20tumor 20is 20a tumors 20are 20cancerous 20 malignant. Researchers may be able to use this to more easily measure the effects of disease and treatment conditions on neuronal cells. Many different types of brain tumors exist. Instance Mask Viz instance mask viz 15. Image Initialize W B The config variable is to show that you can pass in any dict hyperparameters Empty mask Fill mask Log to W B Close W B run. A cell s DNA contains the instructions that tell a cell what to do. You can use W B s lightweight interoperable tools to quickly track experiments version and iterate on datasets evaluate model performance reproduce models visualize results and spot regressions and share findings with colleagues. The number of images is small but the number of annotated objects is quite high. The result is a mass of abnormal cells which forms a tumor. In this notebook I will use Weights and Biases s amazing features to perform wonderful visualizations and logging seamlessly. Some brain tumors are noncancerous benign and some brain tumors are cancerous malignant. use an anisotropic version. Competition Overview Description In this competition you ll detect and delineate distinct objects of interest in biological images depicting neuronal cell types commonly used in the study of neurological disorders. com ihelon cell segmentation run length decoding Sartorius Starter Baseline Torch U net https www. Alzheimer s Disease alzheimers disease 3. org alzheimers dementia what is alzheimers Alzheimer s Disease Fact Sheet National Institute on Aging https www. To easen out the process I am providing the foundations of the mentioned diseases and proposed treatments to give a stronger domain understanding. Files train. Alzheimer s disease is the most common cause of dementia a continuous decline in thinking behavioral and social skills that affects a person s ability to function independently. Scatter plots are a go to to look for clusters and separatbility in the data but these are busy and don t reveal density well so we switch to using 2d histograms instead. and you can control direction i. For any image specific classification clustering etc. This notebook will be updated frequently so keep checking for furthur developments. Set up W B in 5 minutes then quickly iterate on your machine learning pipeline with the confidence that your datasets and models are tracked and versioned in a reliable system of record. Researchers trying to understand the cause of Alzheimer s disease are focused on the role of two proteins Plaques Beta amyloid is a fragment of a larger protein. gov health alzheimers disease fact sheet Alzheimer s disease Symptoms stages causes and treatments https www. csv IDs and masks for all training objects. com articles 159442 Dementia and Alzheimer s Disease Health Center WebMD https www. id unique identifier for object annotation run length encoded pixels for the identified neuronal cell width source image width height source image height cell_type the cell line plate_time time plate was created sample_date date sample was created sample_id sample identifier elapsed_timedelta time since first image taken of sample sample_submission. Image View image view 11. The IoU of a proposed set of object pixels and a set of true object pixels is calculated as IoU A B A B A B The competition uses a couple of medical terms which many people will be unfamiliar with. Distribution Plots distribution plots 10. The loss of neurons spreads in a somewhat predictable pattern to other regions of the brains. Sartorius InDepth EDA Explanation Model W B Contents1. These clusters form larger deposits called amyloid plaques which also include other cellular debris. Instance Mask Viz Check out the run page here rightarrow https wandb. Competition Overview competition overview 2. Tabular Exploration tabular exploration 9. Global ConfigLoad Datasets Understanding the Structure of the Dataset Goal of Competition In this competition we are segmenting neuronal cells in images. The training annotations are provided as run length encoded masks and the images are in PNG format. A family member or friend may be more likely to notice how the symptoms worsen. train_semi_supervised unlabeled images offered in case you want to use additional data for a semi supervised approach. The tangles disrupt the transport system and are toxic to cells. Several other similar filters in skimage. Brain Tumor brain tumor 4. Brain changes associated with Alzheimer s disease lead to growing trouble with Memory Thinking and Reasoning Making Judgements and Decisions Planning and Performing Familiar Tasks Changes in Personality and Behaviour Preserved Skills What are the Causes At a basic level brain proteins fail to function normally which disrupts the work of brain cells neurons and triggers a series of toxic events. U Net Model unet model 16. You will find extra data for the SH SHY5Y cell line plus several other cell lines not covered in the competition dataset that may be of interest for transfer learning. transforms we ll want to collapse spatial dimensions so that we have a matrix of pixels by color channels. References references If you find this notebook useful do give me an upvote it helps to keep up my motivation. As a result new drugs could be discovered to treat the millions of people with these leading causes of death and disability. Evaluation Metric This competition is evaluated on the mean average precision at different intersection over union thresholds. Alzheimer s disease What is Alzheimer s Disease Alzheimer s disease is a progressive neurologic disorder that causes the brain to shrink atrophy and brain cells to die. Primary brain tumors begin when normal cells develop changes mutations in their DNA. Successful models will do this with a high level of accuracy. htm Brain Tumor What is Brain Tumor A brain tumor is a mass or growth of abnormal cells in your brain. ", "id": "ishandutta/sartorius-indepth-eda-explanation-model", "size": "19182", "language": "python", "html_url": "https://www.kaggle.com/code/ishandutta/sartorius-indepth-eda-explanation-model", "git_url": "https://www.kaggle.com/code/ishandutta/sartorius-indepth-eda-explanation-model", "script": "torch.backends.cudnn wandb_mask functional as F DataLoader albumentations sampler plot_masks plotly.express (HorizontalFlip termcolor albumentations.pytorch numpy getImagePaths ToTensorV2 seaborn colored cluster set_seed sobel_h VerticalFlip torch.nn tqdm matplotlib.patches sklearn bag ReduceLROnPlateau config display_multiple_img KFold matplotlib.pyplot dask plot_distribution mpl_toolkits.mplot3d CellDataset(Dataset) greycoprops sklearn.model_selection pandas functional tqdm.notebook skimage.filters torch.optim skimage.feature torch.utils.data rle_decode __len__ Dataset greycomatrix __init__ build_masks sobel Axes3D plot_masks_all __getitem__ diagnostics torch.optim.lr_scheduler ", "entities": "(('so we', '2d histograms'), 'be') (('Successful models', 'accuracy'), 'do') (('model performance', 'spot share colleagues'), 'use') (('Causes Primary brain tumors', 'pituitary gland'), 'begin') (('you', 'robust quantitative data'), 'help') (('gov health alzheimers fact sheet disease Symptoms', 'causes'), 'disease') (('datasets', 'record'), 'set') (('many people', 'which'), 'calculate') (('I', 'domain proposed stronger understanding'), 'easen') (('notebook', 'frequently so furthur developments'), 'update') (('normally which', 'toxic events'), 'lead') (('Tangles Tau proteins', 'nutrients'), 'play') (('loss', 'brains'), 'spread') (('number', 'annotated objects'), 'be') (('images', 'PNG format'), 'provide') (('person', 'thoughts'), 'be') (('sample_date date sample', 'sample sample_submission'), 'd') (('Brain Tumor brain tumor', 'brain'), 'Tumor') (('org diseases conditions alzheimers disease symptoms', 'Mayo Clinic https www'), 'cause') (('Early signs', 'recent events'), 'include') (('you', 'neurological disorders'), 'description') (('None', 'test set'), 'provide') (('which', 'tumor'), 'be') (('we', 'images'), 'dataset') (('rapidly when healthy cells', 'cells'), 'tell') (('Evaluation competition', 'union thresholds'), 'Metric') (('band RGB 3 byte', '2D image Just dimensions'), 'number') (('Key Symptoms Memory loss', 'key Alzheimer disease'), 'be') (('edge magnitude gradient basic image', 'only one direction'), 'com') (('mask Fill Empty mask', 'run'), 'B') (('that', 'ability'), 'be') (('it', 'motivation'), 'reference') (('when normal cells', 'DNA'), 'begin') (('LIVECell', 'competition'), 'be') (('machine learning developers', 'better models'), 'LibrariesWeights') (('we', 'color channels'), 'transform') (('cancer', 'elsewhere brain'), 'be') (('Plaques Beta amyloid', 'larger protein'), 'try') (('Many different types', 'brain tumors'), 'exist') (('signs Brain Cancer Brain Tumor Treatments', 'my'), 'Causes') (('satellite image why most analysts', 'at least near infrared values'), 'correlate') (('other symptoms', 'memory impairments worsen'), 'progress') (('that', 'transfer learning'), 'find') (('Disease Alzheimer alzheimers', '3'), 'disease') (('I', 'wonderful visualizations'), 'use') (('More specifically you', 'neuronal cells'), 'use') (('Neurons', 'other'), 'damage') (('brain', 'disease'), 'by') (('Researchers', 'treatment neuronal cells'), 'be') (('when you', 'only notebooks'), 'be') (('new drugs', 'death'), 'discover') (('together they', 'cell communication'), 'appear') (('process', 'first symptoms'), 'start') (('20a tumors', '20tumor 20350084 text 20brain 20is'), 'cause') (('is', 'Disease alz'), 'Resources') (('Advanced Image Exploration Rudimentary Transforms Edge Detection Texture Sobel Edge Detection A Sobel filter', 'edge magnitude gradient one basic image'), 'mean') (('that', 'what'), 'contain') (('specific classification', 'etc'), 'for') (('amyloid which', 'also other cellular debris'), 'form') (('tangles', 'cells'), 'disrupt') (('soon s', 'LinkedIn https www'), 'viz') (('edge also good detectors', 'scharr etc'), 'be') (('you', 'semi supervised approach'), 'image') (('org alzheimers what', 'Disease Fact Sheet National Aging https Alzheimer www'), 'dementia') (('com ihelon cell segmentation', 'Starter https Sartorius Baseline Torch U net www'), 'run') "}