{"name": "scatter plots of ip over time per channel part 2 ", "full_name": " h1 Scatter Plots of IP over Time per Channel part 2 ", "stargazers_count": 0, "forks_count": 0, "description": "time x axis ip y axis channel 1 per plot is_attributed color Color key green test set test supplement the original full test set blue is_attributed 0 red is_attributed 1Days are quite clearly visible by the new block of IPs that were sampled by TalkingData for each day. The embedded files are actually a little larger than shown in the Notebook you can right click rarr View Image to see the full size. They show the interaction between ip channel time is_attributed. Note that the test set green day 4 does contain new IP addresses but all in the lowest range of IPs up to 126413. For more details on the IP encoding see False Leak discussion by Andy Harless 1 Be careful about IPs as a Signal kernel by Yulia 2 IP Download Rates kernel by CPMP 3 The plots are pregenerated by some old Java code I have which is not shared here only the output partly as a test in autogenerating Jupyter Notebooks using the nbformat module. I selected the most interesting plots to share then ran into the problem that notebooks are limited to 1Mb of source code so I ve split them into two kernels. com yuliagm be careful about ips as a signal 3 https www. com cpmpml ip download rates 4 https www. Scatter Plots of IP over Time per Channel part 2These are some scatter plots of clicks over time. This is not clear from these plots. com jtrotman scatter plots of ip over time per channel part 1. I think the plots alone are worth sharing they contain useful insights into the IP behaviour over time. The test set at the end has only low IP values as already revealed 1 shared 2 by others 3. This is part 2 part 1 4 is here. com c talkingdata adtracking fraud detection discussion 52374 2 https www. ", "id": "jtrotman/scatter-plots-of-ip-over-time-per-channel-part-2", "size": "1935", "language": "others", "html_url": "https://www.kaggle.com/code/jtrotman/scatter-plots-of-ip-over-time-per-channel-part-2", "git_url": "https://www.kaggle.com/code/jtrotman/scatter-plots-of-ip-over-time-per-channel-part-2", "script": "HTML IPython.core.display ", "entities": "(('They', 'channel time'), 'show') (('you', 'full size'), 'be') (('com cpmpml', 'download https ip 4 www'), 'rate') (('test', 'others'), 'have') (('Scatter Plots', 'time'), 'be') (('so I', 'two kernels'), 'select') (('which', 'nbformat module'), 'see') (('test', '126413'), 'note') (('alone they', 'time'), 'think') (('that', 'day'), 'axis') (('com yuliagm', 'https signal 3 www'), 'be') "}