{"name": "sciplex2 part 3f hdac family of genes ", "full_name": " h1 What is about h2 Conclusions Findings h3 1 h3 2 h3 3 h2 Further info on genes h3 SIRT11 h3 KIF11 motor protein essential in mitosis h4 Dataset reminder h1 Load information files genes annotations cells info etc h1 Load count matrix and convert it to sparse matrix csr matrix h1 Create columns with information on each cell drug dose etc h1 Normalization and log h1 Look at duplicates h1 Preliminaries h1 get independence pvalue chi2 h1 Info on genes h1 get top correlated genes h1 Statistics on top correlated h1 Correlation analysis h1 Plot expressions of top selected genes h1 UMAP visualization h1 Color by genes h1 Top correlated with selected genes h1 Further analysis h1 Color by KIF1 top correlated but get completely different localization h1 SIRT1 and TP53 h1 Histone genes info ", "stargazers_count": 0, "forks_count": 0, "description": "24 hours across SEVEN doses. The index row number of cell in that file corresponds to its index in the countmatrix after transforming csv file with count matrix to sparse countmatrix Count matrix in list of edges format cell ids genes ids are in the files respectively GSM4150377_sciPlex2_A549_Transcription_Modulators_UMI. count_made_zeros str count_made_zeros Non binarized. KIF11 motor protein essential in mitosisKinesin 5 is a molecular motor protein that is essential in mitosis. 2It is quite strange that top correlated genes with it are almost all NEGATIVELY CORRELATED although correlations are quite low and it changes from using logged and normalization or not The exception includes KIF11 gene which is marker of G2 M phase. txt contains information on cell drugs doses etc. 17 We do not see ANTI correlation of SIRT1 and P53 Further info on genes SIRT11https en. Exposed to 4 different compounds DEXA nutlin BMS SAHA HDAC. 5 6 7 SIRT1 stands for sirtuin silent mating type information regulation 2 homolog 1 S. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session header None shape len genes len cells. get summary No summary KIF11 g_inf. 24262 cells x 58347 genes GSM4150377_sciPlex2_pData. toarray Consistency check. describe S phase of cell cycle expressed gene indices for top expressed convert top expressed to numpy array from sparse some strange reindex to extract correlation vector from matrix I do not know why matrix her range len genes. SIRT1 is an enzyme located primarily in the cell nucleus that deacetylates transcription factors that contribute to cellular regulation reaction to stressors longevity. org wiki Histone_deacetylase cite_note Milazzo_2020 2 Names of HDAC genes This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. read_csv Input data files are available in the read only. It is second top expressed gene about 6K cells and total 13K expressed. sum axis 1 CCNE1 CCNE2 list_selected_genes g_inf. get summary No summary g_inf. Check that n_umi is exactly the m. get summary No summary list_selected_genes_ordered CCNE1 CCNE2 CDK2 list_selected_genes_ordered CDKN1A LINC01021 MALAT1 NEAT1 TP53I3 FDXR TMSB10 drug. 17 SIRT1 also stimulates autophagy by preventing acetylation of proteins via deacetylation required for autophagy as demonstrated in cultured cells and embryonic and neonatal tissues. 18 This function provides a link between sirtuin expression and the cellular response to limited nutrients due to caloric restriction. cerevisiae referring to the fact that its sirtuin homolog biological equivalent across species in yeast S. copy count_made_zeros str count_made_zeros Non binarized 0 drug. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. There are 24262 rows one row one cell. org wiki Sirtuin_1Sirtuin 1 also known as NAD dependent deacetylase sirtuin 1 is a protein that in humans is encoded by the SIRT1 gene. get summary No summary display t. The term kinesin 5 has been recommended based on a standardized nomenclature adopted by the scientific community. Dataset reminder It is the second toy subdataset while sciPlex3 is the main very huge subdataset. Named from studies in the early days of discovery it is also known as kinesin family member 11 encoded by the KIF11 gene 5 or as BimC Eg5 or N 2 based on the founding members of this kinesin family. org wiki Histone_deacetylase HDAC1 HDAC2 HDAC3 HDAC4 HDAC5 HDAC6 HDAC7 HDAC8 HDAC9 HDAC10 HDAC11 SIRT1 SIRT2 SIRT3 SIRT4 SIRT5 SIRT6 SIRT7 Conclusions Findings. txt Load information files genes annotations cells info etc. 20 SIRT1 along with HDAC1 and the AP 1 promoter complex within D1 type dopaminergic medium spiny neurons appears to be closely involved in the pathogenesis of addiction. iloc a i b i np. get summary No summary g_inf map_location g_inf. iloc a i b i list_selected_genes range 10 100 10 0 droping columns same as make them zeros but does not create memory alloc prob CCNE1 CCNE2 CDK2 list_selected_genes_ordered CDKN1A LINC01021 MALAT1 NEAT1 TP53I3 FDXR TMSB10 drug. Here only one cell line A549 human lung adenocarcinoma. 1SIRT1 is quite evidently more expressed in SAHA drugged cells SAHA is HDACi. 19 SIRT1 plays a role in activating T helper 17 cells which contribute to autoimmune disease efforts to activate SIRT1 therapeutically may trigger or exacerbate autoimmune disease. txt GSM4150377_sciPlex2_A549_Transcription_Modulators_gene. 4 Kinesin 5 proteins are members of kinesin superfamily which are nanomotors that move along microtubule tracks in the cell. Load count matrix and convert it to sparse matrix csr_matrix Create columns with information on each cell drug dose etc Normalization and log Look at duplicates Preliminaries get_independence_pvalue_chi2 Info on genes get_top_correlated_genes Statistics on top correlated Correlation analysis Plot expressions of top selected genes UMAP visualization Color by genes Top correlated with selected genes Further analysis Color by KIF1 top correlated but get completely different localization SIRT1 and TP53 Histone genes info https en. count_made_zeros str count_made_zeros Non binarized g_inf. matrix GSM4150377_sciPlex2_A549_Transcription_Modulators_cell. 3In mammals SIRT1 has been shown to deacetylate and thereby deactivate the p53 protein. In mammals SIRT1 has been shown to deacetylate and thereby deactivate the p53 protein. What is about Here we analyse sciPlex2 subdataset looking at HDAC genes. ", "id": "alexandervc/sciplex2-part-3f-hdac-family-of-genes", "size": "4409", "language": "python", "html_url": "https://www.kaggle.com/code/alexandervc/sciplex2-part-3f-hdac-family-of-genes", "git_url": "https://www.kaggle.com/code/alexandervc/sciplex2-part-3f-hdac-family-of-genes", "script": "chi2_contingency seaborn TruncatedSVD csr_matrix scipy.stats matplotlib.pyplot sklearn.decomposition scipy.sparse pandas get_top_correlated_genes get_independence_pvalue_chi2 numpy ", "entities": "(('it', 'kinesin family'), 'know') (('txt', 'etc'), 'contain') (('read_csv Input data files', 'read'), 'be') (('17 SIRT1', 'cultured cells'), 'stimulate') (('CCNE1 CCNE2 CDK2', 'memory alloc prob'), 'iloc') (('CCNE1 CCNE2 CDK2', 'summary'), 'get') (('None', 'len genes len cells'), 'list') (('count_made_zeros str count_made_zeros Non', 'g_inf'), 'binarized') (('function', 'caloric restriction'), '18') (('20 SIRT1', 'addiction'), 'appear') (('that', 'cell'), 'be') (('It', 'kaggle python Docker image https github'), 'milazzo_2020') (('sirtuin', 'yeast S.'), 'cerevisiae') (('txt Load information files', 'annotations cells info etc'), 'gene') (('I', 'range len why genes'), 'express') (('6 7 SIRT1', 'mating type information sirtuin silent regulation'), '5') (('that', 'stressors longevity'), 'be') (('1SIRT1', 'cells quite evidently more SAHA drugged SAHA'), 'be') (('which', 'therapeutically autoimmune disease'), 'play') (('TP53 Histone', 'info https'), 'matrix') (('Here we', 'HDAC genes'), 'be') (('SIRT1', 'p53 thereby protein'), 'show') (('count_made_zeros str count_made_zeros Non', '0 drug'), 'copy') (('P53 Further info', 'genes'), '17') (('1 that', 'SIRT1 gene'), 'be') (('mammals 3In SIRT1', 'p53 thereby protein'), 'show') (('term kinesin', 'scientific community'), 'recommend') (('which', 'G2 M phase'), 'include') (('ids', 'files'), 'correspond') (('motor 5 molecular that', 'mitosis'), 'be') "}