{"name": "sigmoid fitting with known parameters for china ", "full_name": " h1 Sigmoid vs Polynomial Linear ", "stargazers_count": 0, "forks_count": 0, "description": "com jorijnsmit ridge regression of confirmed cases and fatalities. However these functions became too awkward and most importantly I could not guide them in any way. Both this study and Gilles Vandewiele https www. Sigmoid vs Polynomial LinearI initially started out with a polynomial linear regression model using Ridge here https www. Based on this explainer on YouTube about exponential growth https www. com watch v Kas0tIxDvrg I knew sigmoids were the true functions I was trying to fit. If I would have had more time I would have tried to categorise continents countries etc according to what phase I believe they are currently in early or late phase and if I considered them high risk or outliers e. com casras covid19 eda and exponential curve fitting predict. com marychin check non cumulative confirmedcases fatalities. A notebook which does this quite well already automatically is claudiu https www. Hubei Italy New York. nl en news news overview 11 03 2020 eindhoven data scientists take on corona data to predict growth of new infections. com casras s notebook COVID19 EDA and exponential curve fitting predict https www. Through this notebook https www. matplotlib notebook artifact s in the dataset https www. com group16 sigmoid per country I came in contact with this research project at TU Eindhoven https www. com group16 s notebook were the main inspiration sources for rewriting my linear notebook to sigmoid fitting. ", "id": "jorijnsmit/sigmoid-fitting-with-known-parameters-for-china", "size": "1425", "language": "python", "html_url": "https://www.kaggle.com/code/jorijnsmit/sigmoid-fitting-with-known-parameters-for-china", "git_url": "https://www.kaggle.com/code/jorijnsmit/sigmoid-fitting-with-known-parameters-for-china", "script": "get_curve main tqdm matplotlib.pyplot scipy.optimize append_predictions known_popt sigmoid predict_curve pandas curve_fit plot_curve tqdm.notebook numpy ", "entities": "(('I', 'TU Eindhoven https www'), 'sigmoid') (('true I', 'com Kas0tIxDvrg'), 'watch') (('which', 'this'), 'be') (('matplotlib notebook artifact', 'https dataset www'), 's') (('curve fitting', 'https www'), 'casras') (('Sigmoid', 'https Ridge here www'), 'start') (('notebook', 'fitting'), 'com') (('too most importantly I', 'way'), 'become') (('data 11 03 2020 eindhoven scientists', 'new infections'), 'take') (('them', 'currently early phase'), 'have') "}