{"name": "siim covid 19 box detect dcm metadata ", "full_name": " h1 SIIM FISABIO RSNA COVID 19 Detection h3 Libraries h3 Handy Functions h1 1 Metadata h2 1 1 train study analysis h3 Target labels distribution h3 How many instances per label h2 1 2 train image analysis h3 How many images have some sort of abnormality h3 How many images per each study h3 Create the full train dataset h1 2 Images h3 WHAT ARE CT SCANS h3 Typical Appearance h3 Atypical Appearance h3 Indeterminate Appearance h3 Negative for Pneumonia h2 2 2 Magic save images bounding boxes to W B h1 3 Extract Metadata from dcm h2 3 1 Store and Save Metadata h2 3 2 Let s Analyse the new information h3 Patient s Gender h3 Location of X rays h3 MONOCHROME1 or MONOCHROME2 That s the question h1 My Specs ", "stargazers_count": 0, "forks_count": 0, "description": "an image can have positive value for only 1 label. then we don t need a bounding box How many images per each study Majority of studies have only 1 images. That being said we have 230 studies that have multiple images available up to 9. You can find his full notebook with explanations here https www. com ayuraj visualize bounding boxes interactively. dcm paths Loop through the information Fix inverted images Below function available in functions section Check for bounding box and add if it s the case For no bbox the list is nan Retrieve the bounding box Plot the image Save to W B Resize the image Resize the coordinates Get a few example ids image_id Read in datas Retrieve resized information Read data file Get image data Get image coordinates Fix inverted radiograms resize Map each label to a number And each number to a label Log each image Save images to W B Dashboard Dictionary to store the information from the image String columns p. MetadataOur data consists of images. com ayuraj experiment tracking with weights and biases Note If this line throws an error try using wandb. If there is nothing weird. csv contains one row for each study including correct labels. target one of our targets is to predict is the radiography is negative_for_pneumonia has typical appearance has indeterminate appearance or it s just atypical. Typical Appearance Atypical Appearance Indeterminate Appearance Negative for Pneumonia 2. keys meta_train_data meta_train_data. 1 Store and Save Metadata 3. Let s look at an example of 10 images below you can see how all the code outputs in the W B Dashboard https wandb. It will ask for the API key to login which you can get from your W B profile click on Profile Settings scroll to API keys. csv files containing custom information for each radiography. DataFrame data dicts columns example. If some abnormalities are found provide the bounding boxes. id there are 6 054 unique ids there are no duplicates 2. dcm file and storing them into a sepparate dataframe. 2 Let s Analyse the new information Patient s Gender Location of X rays MONOCHROME1 or MONOCHROME2 That s the question. 8 images have nothing unusual in them and 1 is labeled as Indeterminate Appearance. good luck Libraries Link to my W B Dashboard here https wandb. dcm Important We can create more metadata more information on the images from the information stored in the. Extract Metadata from. ImagesGood now that we ve explored the metadata and the target labels we can start focusing on the good stuff meaning the CT scans. After EDA my W B Dashboard https wandb. tqdm all_paths try d get_observation_data path dicts. StudyInstanceUID corresponds 1 1 to new_id created for train_study. SIIM FISABIO RSNA COVID 19 DetectionThis is an object detection and classification problem meaning that for each instance we ll have to predict a bounding box and a class. OK Covid 19 sympthoms look very similar to other viral or bacterial pneumonias chest radiographs hence it s much harder to correctly and I might add quickly diagnose. 17 CSS STYLE Libraries Environment check Secrets Custom colors Set Style Get the list of dictionaries Get the exact x and y coordinates Save coordinates Save data to W B Dashboard Read in metadata Head of our 2 training metadata Process id Data for plots Plotting Virus png Save plots into W B Dashboard Get data and transform frequencies to percentages Plot Process id Data for plotting Plot Virus png Crate df Plot Merge all info together Get. csv containing one row for each image including both correct labels and any bounding boxes in a dictionary format Important An image can have multiple bounding boxes. Metadata structure 1. WHAT ARE CT SCANS A Computerized Tomography scan CT or CAT scan uses computers and rotating X ray machines to create cross sectional images of the body. They can show the soft tissues blood vessels and bones in various parts of the body. class imbalance is present especially for Indeterminate Appearance and Atypical Appearance Target labels distribution Now let s see how the labels we ll have to predict are layed out. image_id is unique in the image_train data. append d except Exception as e exceptions 1 continue meta_train_data pd. There can be multiple images per study How many images have some sort of abnormality To have a bounding box we need to have something weird detected in the scan. The rest 50 is split in order into negative for pneumonia 28 indeterminate 17 and the rest atypical. 2 train_image analysis Findings 1. 2 Magic save images bounding boxes to W B Thank you very much to Ayush who inspired the following experiment. ai andrada siim covid19 workspace user andrada 3. How many instances per label Note 50 of our images have typical appearance. 1 train_study analysis Findings 1. Let s also look at the study id 0fd2db233deb which has most of the images available. input siim covid19 detection train 00792b5c8852 1f52bcb3143e 3fadf4b48db3. For example there aren t any images which are both negative_for_pneumonia and indeterminate appearance in the same time. Competition Goal Categorize chest radiographs as negative for pneumonia typical indeterminate or atypical for COVID 19. So I encourage everybody to try have fun and. csv index False print Metadata processed saved successfuly Save data to W B Dashboard Import Get the Data Plotting Get the Data Plotting Get the Data Plotting. The Exploratory Dashboard in W B My Specs Z8 G4 Workstation 2 CPUs 96GB Memory NVIDIA Quadro RTX 8000 RAPIDS version 0. Handy Functions 1. Below I am extracting all features stored in each. dcm example get_observation_data p print example all_paths glob. ai andrada siim covid19 workspace user andrada looks like this Create the full train datasetThis is also how the final_label will need to look before submission. It s only one or the other. These images provide more detailed information than normal X ray images. There are images with multiple bounding boxes 4. input siim covid19 detection train exceptions 0 dicts for path in tqdm. Fun Bonus Z by HP is providing the top student team with a ZBook G8 Data Science Workstation I have been working on these for quite some time and I absolutely LOVE it. ai andrada siim covid19 How to use W B Experiment Tracking with Weights and Biases https www. ", "id": "andradaolteanu/siim-covid-19-box-detect-dcm-metadata", "size": "6132", "language": "python", "html_url": "https://www.kaggle.com/code/andradaolteanu/siim-covid-19-box-detect-dcm-metadata", "git_url": "https://www.kaggle.com/code/andradaolteanu/siim-covid-19-box-detect-dcm-metadata", "script": "fix_inverted_radiograms pearsonr IPython.core.display IPython.display offset_png css_styling OffsetImage display_html numpy sklearn.cluster show_dcm_info seaborn skimage _show_on_single_plot create_wandb_hist wandb_bbox show_values_on_bars get_image_metadata save_dataset_artifact return_coords matplotlib.patches matplotlib.offsetbox matplotlib.pyplot kaggle_secrets AnnotationBbox pandas KMeans get_observation_data color apply_voi_lut morphology matplotlib scipy.stats resize_img_and_coord HTML UserSecretsClient create_wandb_plot measure pydicom.pixel_data_handlers.util ", "entities": "(('Computerized Tomography scan scan', 'body'), 'scan') (('abnormalities', 'bounding boxes'), 'provide') (('append d', 'meta_train_data 1 pd'), 'continue') (('StudyInstanceUID', 'train_study'), 'correspond') (('you', 'API keys'), 'ask') (('Important image', 'bounding multiple boxes'), 'csv') (('com ayuraj', 'boxes'), 'visualize') (('I', 'absolutely it'), 'provide') (('we', 'bounding box'), 'covid') (('They', 'body'), 'show') (('dcm We', 'the'), 'Important') (('That', 'MONOCHROME1'), 'let') (('much correctly I', 'pneumonias chest very other viral radiographs'), 'look') (('png', 'Plot Virus png Crate Plot info'), 'check') (('image', 'only 1 label'), 'have') (('rest', 'pneumonia 28 indeterminate 17'), 'split') (('Fix', 'image'), 'path') (('So I', 'fun'), 'encourage') (('csv', 'correct labels'), 'contain') (('Below I', 'each'), 'extract') (('csv index False Metadata processed', 'Data Plotting'), 'print') (('1', 'Indeterminate Appearance'), 'have') (('Specs Z8 GB Memory G4 Workstation 2 CPUs 96 Quadro', 'RAPIDS 8000 version'), 'Dashboard') (('we', 'weird scan'), 'be') (('which', 'indeterminate same time'), 't') (('also how final_label', 'submission'), 'look') (('target we', 'CT scans'), 'ImagesGood') (('50', 'typical appearance'), 'Note') (('who', 'following experiment'), 'save') (('we', 'Indeterminate especially Appearance'), 'be') (('images', 'X ray normal images'), 'provide') (('How many images', 'only 1 images'), 'need') (('You', 'explanations'), 'find') (('it', 'indeterminate appearance'), 'be') (('that', 'up to 9'), 'say') (('look', 'code W B Dashboard https how wandb'), 'let') (('line', 'wandb'), 'tracking') (('most', 'images'), 'let') (('image_id', 'image_train data'), 'be') "}