{"name": "simple helmet mapping visualized ", "full_name": " h1 Video with Predictions h2 Process prediction videos h1 Display example videos ", "stargazers_count": 0, "forks_count": 0, "description": "com its7171 nfl baseline simple helmet mappingNote in the output videos If incorrect the ground truth box helmet boxes are black and predictions are white. Correct preidctions have green boxes Impact helmet boxes are red if incorrect and yellow if correct note these predictions are weighted 1000x compared to a non impact helmet box prediction Video with Predictions Process prediction videos Display example videos copied from https www. calculate the area of inters 3. unique 3 submission_df. calculate the overlaps between pred_box and gt_box Keep sub_labels for review this would be 0. I often find inspiration about how a model can be improved by visualizing it s predictions. com robikscube nfl helmet assignment getting started guide Read label from CSV Maximum of 22 boxes per frame. Only one label allowed per frame. 33 Black Red Yellow Green White White Add frame and video columns Get stats about current state in frame CORRECT Ground Truth Box Prediction Box Freeze for 60 frames on impacts Not all browsers support the codec we will re load the file at tmp_output_path and convert to a codec that is more broadly readable using ffmpeg Add video column to sub_labels scaling factor for display. Check for unique boxes 1. This function combines a model s validation predictions with the assoicated video. In this notebook I provide a function video_with_predictions. csv index False copied from https www. get the coordinate of inters 2. com robikscube nfl helmet assignment getting started guide Estimated video frame sample_keys random. sample list tracking gameKey. The predictions I m modeling come from the great baseline here https www. calculate the area of union print uni 4. ", "id": "robikscube/simple-helmet-mapping-visualized", "size": "767", "language": "python", "html_url": "https://www.kaggle.com/code/robikscube/simple-helmet-mapping-visualized", "git_url": "https://www.kaggle.com/code/robikscube/simple-helmet-mapping-visualized", "script": "dist_rot video_with_predictions dist_for_different_len pyplot pyplot as plt IPython.display Video add_isCorrect_col accuracy_score numpy sklearn.cluster add_track_features merge_sub_labels dist add_xy Pool calculate_metric_weighted tqdm NFLAssignmentScorer find_nearest rotate_arr tqdm.auto pandas KMeans mapping_df multiprocessing matplotlib check_submission display get_iou_df __init__ filter_to_top_label_match norm_arr sklearn.metrics score ", "entities": "(('I', 'm great baseline'), 'come') (('that', 'display'), 'get') (('predictions', 'com its7171 output nfl baseline simple videos'), 'helmet') (('I', 'function video_with_predictions'), 'provide') (('com robikscube nfl helmet assignment', 'frame'), 'start') (('it', 'often inspiration'), 'find') (('this', 'gt_box Keep review'), 'calculate') (('sample_keys', 'video Estimated frame'), 'guide') (('Display example videos', 'https www'), 'have') (('function', 'assoicated video'), 'combine') "}