{"name": "single image super resolution gan srgan pytorch ", "full_name": " h2 Introduction h3 In this notebook we use SRGAN to perform Super Resolution on CelebA dataset h4 h4 Image Source Photo Realistic Single Image Super Resolution Using a Generative Adversarial Network C Ledig et al h3 Libraries h3 Settings h3 Define Dataset Class h3 Get Train Test Dataloaders h3 Model Architecture h4 h4 Image Source Photo Realistic Single Image Super Resolution Using a Generative Adversarial Network C Ledig et al h3 Define Model Classes h3 Train Super Resolution GAN SRGAN h3 Work in Progress h3 Note The order of the below saved images are from left to right Original HR Bicubic Interpolated SRGAN Generated ", "stargazers_count": 0, "forks_count": 0, "description": "Define Model Classes Train Super Resolution GAN SRGAN Work in Progress. Introduction In this notebook we use SRGAN https arxiv. 04802 to perform Super Resolution on CelebA dataset http mmlab. image width number of image channels Normalization parameters for pre trained PyTorch models Transforms for low resolution images and high resolution images First layer Residual blocks Second conv layer post residual blocks Upsampling layers nn. Image Source Photo Realistic Single Image Super Resolution Using a Generative Adversarial Network C. Note The order of the below saved images are from left to right Original HR Bicubic Interpolated SRGAN Generated load pretrained models number of epochs of training name of the dataset size of the batches adam learning rate adam decay of first order momentum of gradient adam decay of second order momentum of gradient epoch from which to start lr decay number of cpu threads to use during batch generation high res. Libraries Settings Define Dataset Class Get Train Test DataloadersModel ArchitectureImage Source Photo Realistic Single Image Super Resolution Using a Generative Adversarial Network C. image height high res. Upsample scale_factor 2 Final output layer Initialize generator and discriminator Set feature extractor to inference mode Losses Load pretrained models Optimizers Configure model input Adversarial ground truths Generate a high resolution image from low resolution input Adversarial loss Content loss Total loss Loss of real and fake images Total loss Testing Configure model input Adversarial ground truths Generate a high resolution image from low resolution input Adversarial loss Content loss Total loss Loss of real and fake images Total loss Save image grid with upsampled inputs and SRGAN outputs Save model checkpoints. ", "id": "balraj98/single-image-super-resolution-gan-srgan-pytorch", "size": "1125", "language": "python", "html_url": "https://www.kaggle.com/code/balraj98/single-image-super-resolution-gan-srgan-pytorch", "git_url": "https://www.kaggle.com/code/balraj98/single-image-super-resolution-gan-srgan-pytorch", "script": "torch.nn.functional torchvision.transforms save_image plotly.graph_objects DataLoader torchvision.models train_test_split plotly.express torch.autograd discriminator_block numpy Image tqdm_notebook as tqdm tqdm_notebook torch.nn vgg19 tqdm GeneratorResNet(nn.Module) Variable ImageDataset(Dataset) make_grid matplotlib.pyplot ResidualBlock(nn.Module) forward PIL sklearn.model_selection pandas FeatureExtractor(nn.Module) Discriminator(nn.Module) torch.utils.data __len__ Dataset __init__ __getitem__ torchvision.utils ", "entities": "(('loss Testing Configure model ground Total Adversarial truths', 'SRGAN model checkpoints'), 'Load') (('Libraries Settings Define Dataset Class', 'Train Test DataloadersModel ArchitectureImage Source Photo Realistic Single Image Super Generative Adversarial Network C.'), 'get') (('First conv Residual blocks Second layer', 'nn'), 'transform') (('we', 'SRGAN https arxiv'), 'introduction') (('Define Model Train Super Resolution GAN', 'SRGAN Progress'), 'class') (('Generated models load pretrained number', 'batch generation high res'), 'note') "}