{"name": "stain normalization ", "full_name": " h2 Stain Normalization ", "stargazers_count": 0, "forks_count": 0, "description": "Here is the list of papers describing this process Neural Stain Normalization and Unsupervised Classification of Cell Nuclei in Histopathological Breast Cancer Images http https arxiv. de en automated classification for breast cancer histopathology images 15030090 A METHOD FOR NORMALIZING HISTOLOGY SLIDES FOR QUANTITATIVE ANALYSIS http http wwwx. 05931 Stain normalization of histopathology images using generative adversarial networks http https ieeexplore. Perform stain normalization. edu mn sites default files macenko2009. pdf Save train labels to dataframe Save test labels to dataframe True positive diagnosis True negative diagnosis Train List Test list STAIN NORMALIZATION FUNCTIONS Convert to range 0 1. fr lomn Cours CV BME HistoPatho LongPapers DestainingLong2014. Show example stain transformation Convert from cv2 standard of BGR to our convention of RGB. The basic idea is to convert train and test images to the similar color space. org document 8363641 A Nonlinear Mapping Approach to Stain Normalization in Digital Histopathology Images Using Image Specific Color Deconvolution http https w3. Check it s not empty Convert to OD and ignore background Eigenvectors of cov in OD space orthogonal as cov symmetric The two principle eigenvectors Make sure vectors are pointing the right way Project on this basis. 03815 The importance of stain normalization in colorectal tissue classification with convolutional networks http https arxiv. Angular coordinates with repect to the prinicple orthogonal eigenvectors Min and max angles the two principle colors Order of H and E. Stain Normalization I have read some papers about stain normalization of histology images and would like to share some functions that perform this transformation. pdf Automated Classification for Breast Cancer Histopathology Images Is Stain Normalization Important http https www. ", "id": "robotdreams/stain-normalization", "size": "1354", "language": "python", "html_url": "https://www.kaggle.com/code/robotdreams/stain-normalization", "git_url": "https://www.kaggle.com/code/robotdreams/stain-normalization", "script": "get_tissue_mask is_image normalize_matrix_rows convert_OD_to_RGB TissueMaskException(Exception) sklearn.utils matplotlib.pyplot get_stain_matrix cv2 convert_RGB_to_OD mapping shuffle get_concentrations pandas is_uint8_image numpy ", "entities": "(('importance', 'https arxiv'), '03815') (('Min', 'H'), 'angle') (('that', 'transformation'), 'read') (('pdf Automated Classification', 'Breast Cancer Histopathology Images'), 'be') (('basic idea', 'color similar space'), 'be') (('vectors', 'basis'), 'check') (('METHOD', 'QUANTITATIVE ANALYSIS http'), 'en') (('Stain normalization', 'https ieeexplore'), '05931') (('Here list', 'https arxiv'), 'be') (('org Nonlinear Mapping 8363641 Approach', 'https w3'), 'document') "}