{"name": "step by guide to predict red wine quality eda ", "full_name": " h1 RED WINE QUALITY DATA ANALYSIS h2 ABOUT DATASET h1 FEATURES DESCRIPTION h1 Insights From Above Figure h1 CONCLUSION h1 If you like the kernel Please share your views in comments section and Give an Upvote ", "stargazers_count": 0, "forks_count": 0, "description": "The entire dataset is grouped into two categories red wine and white wine. We discussed how we can perform EDA techniques such as data loading data wrangling data transformation correlation between variables regression analysis and building classical ML models based on the datasets. Alcohol Vs Quality In above Figure showing some dots outside of the graph. Alcohol has a weak positive correlation with the pH value. The label is in the range of 0 to 10. That gives deeper insight into the alcohol column. we can see that alcohol distribution is positively skewed with the quality of the red wine. Moreover the regression line is depicted in the figure illustrating the correlation between them. RED WINE QUALITY DATA ANALYSIS ABOUT DATASETThe Wine Quality dataset contains information about various physicochemical propertiesof wines. Eachwine has a quality label associated with it. Most of the outliers as shown in Figure 12. In the nextsection we are going to download and load the dataset into Python and perform an initialanalysis to disclose what is inside it. Quality It indicates the quality of the wine which is ranged from 1 to 10. Citric acid and density have a strong positive correlation with fixed acidity. Density It indicates the density of the wine and is measured in g dm3. Few of them are normally distributed where other are rightly skewed. 7 are around wine with quality 5 and 6. The range of value is between 0 to 14. Check the snippet given here The output verifies that alcohol is positively skewed. Here the higher the value is the better the wine. Citric acid It indicates the amount of citric acid in the wine. FEATURES DESCRIPTION Fixed acidity It indicates the amount of tartaric acid in wine and is measured in g dm3 Volatile acidity It indicates the amount of acetic acid in the wine. The above figures show the distribution of the features. The range of each feature is also not huge. This chemical works as an antioxidant and antimicrobial agent. Sulphates It indicates the amount of potassium sulphate in the wine. pH It indicates the pH value of the wine. It is measured in g dm3. Alcohol versus pH This Figure shows that alcohol is weakly positively related to the pH values. stats as shown here MODEL DEVELOPMENT AND EVALUATION HANDLING IMBALANCED DATACONCLUSIONIn this kernel I have used the Wine Quality dataset provided by UCI to perform EDA. Spacial Thanks to harshjain123If you like the kernel Please share your views in comments section and Give an Upvote Statistical Analysis datatype information check for missing values check for missing values count plot of quality variable lets see whether our data has outliers or not create box plots lets see whether our data has outliers or not create box plots Method 1 Method 2 Lets see how alcohol concentration is distributed with respect to the quality of the red wine. We can remove the outliers by passing an argument showoutliers False The higher the alcohol concentration is the higher the quality of the wine. We can verify this using the skew method from scipy. It is also measured in g dm3 Free sulfur dioxide It measures the amount of sulfur dioxide SO2 in free form. 0 which indicates very high acidity and 14 indicates basic acidity. It is also measured in g dm3. Import Required Libraries and Read the Dataset Descriptive Statistics DATA PREPROCESSING EXPLORATORY DATA ANALYSIS here we can see that we have average wine simple data Now we going to plot swarmplot to see data distribution by the above plot we can see three is lots of otliers so we gonn remove them Now you can see all outliers removed FIND CORRELATED COLUMNS Insights From Above Figure Alcohol is positively correlated with the quality of the red wine. It is also measured in g dm3 Residual sugar It indicates the amount of sugar left in the wine after the fermentation process is done. It is also measured in g dm3 Total sulfur dioxide It measures the total amount of SO2 in the wine. Alcohol It indicates the alcohol content in the wine. pH has a negative correlation with density fixed acidity citric acid and sulfates. Dist plot of all features create dist plot integer columns Import Model libraries transform the dataset classify function train the model cross validation. We can quantify the correlation using Pearson regression from scipy. ", "id": "vipin20/step-by-guide-to-predict-red-wine-quality-eda", "size": "5045", "language": "python", "html_url": "https://www.kaggle.com/code/vipin20/step-by-guide-to-predict-red-wine-quality-eda", "git_url": "https://www.kaggle.com/code/vipin20/step-by-guide-to-predict-red-wine-quality-eda", "script": "get_correlation pearsonr train_test_split SMOTE xgboost warnings accuracy_score numpy cross_val_score seaborn cross_validate skew ExtraTreesClassifier recall_score imblearn.over_sampling f1_score classify sklearn.tree matplotlib.pyplot DecisionTreeClassifier precision_score sklearn.model_selection pandas RandomForestClassifier scipy.stats mod_outlier sklearn.metrics sklearn.ensemble ", "entities": "(('range', 'feature'), 'be') (('RED WINE QUALITY DATA Wine Quality dataset', 'propertiesof various physicochemical wines'), 'analysis') (('what', 'it'), 'go') (('normally where other', 'them'), 'distribute') (('Citric acid', 'fixed acidity'), 'have') (('alcohol how concentration', 'red wine'), 'thank') (('chemical', 'antioxidant agent'), 'work') (('It', 'wine'), 'Sulphates') (('We', 'scipy'), 'verify') (('pH', 'density acidity citric fixed acid'), 'have') (('It', 'wine'), 'pH') (('fermentation process', 'wine'), 'measure') (('regression Moreover line', 'them'), 'depict') (('Citric It', 'wine'), 'acid') (('entire dataset', 'two categories'), 'group') (('output alcohol', 'snippet'), 'check') (('It', 'wine'), 'Alcohol') (('CORRELATED', 'red wine'), 'see') (('That', 'alcohol column'), 'give') (('We', 'scipy'), 'quantify') (('Alcohol', 'pH value'), 'have') (('alcohol False The concentration', 'the higher wine'), 'remove') (('It', 'wine'), 'measure') (('how we', 'datasets'), 'discuss') (('alcohol distribution', 'red wine'), 'see') (('It', 'free form'), 'measure') (('It', 'wine'), 'description') (('I', 'EDA'), 'stat') (('plot integer columns Import Model dist libraries', 'model cross validation'), 'create') (('which', '10'), 'indicate') (('alcohol', 'pH weakly positively values'), 'alcohol') (('Eachwine', 'it'), 'have') (('14', 'basic acidity'), '0') (('It', 'g dm3'), 'density') (('above figures', 'features'), 'show') "}