{"name": "straight foward regressor model build ", "full_name": " h1 Exploratory Data Analysis h1 Univariate Analysis h1 Bivariate Analysis h1 Multivariate Analysis h1 Model Preparation h1 Final thoughts ", "stargazers_count": 0, "forks_count": 0, "description": "This dataset is probably unbalanced d Univariate Analysisthere are no outliers concercing temperature Bivariate Analysis season 1 springer 2 summer 3 fall 4 winter weathersit clear weather has the highest cnt type 4 weather not present in the dataset 1 Clear Few clouds Partly cloudy 2 Mist Cloudy Mist Broken clouds Mist Few clouds Mist 3 Light Snow Light Rain Thunderstorm Scattered clouds Light Rain Scattered clouds 4 Heavy Rain Ice Pallets Thunderstorm Mist Snow FogWhile the registered rents are majority during the week the casual rents are majority during the weekendsThe data suggests a different rent profile between registered and casual hence they are our individual targets 2 hum outliers 0 and 20 must be dropped Multivariate AnalysisAgain there is a noticeble variation in registered x temp by year Model PreparationThe target is splitted in casual and registered separetally instead of cnt Final thoughtsIt was possible to achieve a very high prediction score with a straight forward machine learning model. Exploratory Data Analysisthere are only 3 ocorrencies in weathersits so one value was not verified in this 2 years period The rent count varies a lot according to the season. The original dataset show a high quality there is no missing value and just a few outliers to handle. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session two years data the original readme file says the temperature is normalized by the max 41 Celsius but this value is not found in this dataset 1. Because the dataset is unbalanced between years 0 and 1 two possible approaches to improve the general score are Enlarge the dataset to additional years. Apply an over sampling method to year 0 on the cnt feature like SMOTE Synthetic Minority Oversampling Technique prior to fitting the data to the regressor models. Winter is the lowest fall is the highest instant and registered are relatively high correlated which means the total rent increased from year 0 to year 1. The highest R2 Scores a2e 0. Thank you for reading my notebook. 85 to the registered and casual targets respectively. read_csv Input data files are available in the read only. 0 so it probably is a subset dataframe shape data info because there is no phisycal unit associated to the windspeed it will be dropped althouth it can be infered it won t be trusted NULL or NA check unique values unnormalize temp and atem data also round hum to 2 decimals get a sample temp and hum are max values heatmap values closer to 1. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. 0 means higher correlation between two parameters categorical columns temp variable highest correlation to cnt check ouliers 3sigma method loc ouliers registered variable check ouliers 3sigma method loc ouliers casual variable check ouliers 3sigma method loc ouliers output df from univariate analysis weekday rent histograms drop visual outliers output df from bivariate analysis output df from multivariate analysis these features are not relevant for the model dummy enconding method k 1 dummy variables NOT one hot encode method k dummy variables k 1 dummies drop_first True REGISTERED target CASUAL target. The data suggests a different rent profile between these targets hence they are let separate on purpose. This Python 3 environment comes with many helpful analytics libraries installed Hidden Input Output It is defined by the kaggle python Docker image https github. GradientBoostingRegressor but are not presented in this notebook in order to keep it clean. While the registered rents are majority during the week the casual rents are majority during the weekends. Any comments are welcome. Other regressors were tried eg. ", "id": "ludmarmatos/straight-foward-regressor-model-build", "size": "2424", "language": "python", "html_url": "https://www.kaggle.com/code/ludmarmatos/straight-foward-regressor-model-build", "git_url": "https://www.kaggle.com/code/ludmarmatos/straight-foward-regressor-model-build", "script": "seaborn mean_squared_error matplotlib.pyplot train_test_split mean_absolute_error sklearn.model_selection pandas sklearn.metrics ExtraTreesRegressor sklearn.ensemble r2_score RandomForestRegressor numpy ", "entities": "(('rent count', 'season'), 'be') (('original dataset', 'high quality'), 'show') (('GradientBoostingRegressor', 'it'), 'present') (('value', 'dataset'), 'list') (('target', 'machine learning straight forward model'), 'be') (('total rent', '0 year'), 'be') (('k 1 dummy variables', 'encode k one hot dummy variables'), 'mean') (('read_csv Input data files', 'read'), 'be') (('hum', 'closer 1'), '0') (('casual rents', 'weekends'), 'be') (('It', 'kaggle python Docker image https github'), 'come') (('dataset', 'additional years'), 'be') (('hence they', 'purpose'), 'suggest') "}