{"name": "student performance full beginner clean eda ", "full_name": " h1 Student Performance Full Beginner EDA h1 Students Performance in Exams EDA h2 This is my 2nd EDA Kernel please do comment down how you like this kernel and do upvote if you like the work ", "stargazers_count": 0, "forks_count": 0, "description": "gif Marks secured by the students in various subjects Reading Dataset Information about dataset Making Result Columns Using Student Different Marks Obtain Visualizing Student Marks using Seaborn KDEPlot Ploting Categorical Features Ploting Categorical Features with Result Calculating and adding new features Total_marks and Percentage specifying grades 90 100 A 83 91 A 75 82 B 67 74 B 59 66 C 51 58 C 43 50 D 35 42 D 0 34 F Mapping this Grades into new feature Grading 1. pyplot Api and made this code snippet. Styling DataFrame on the basis of Results all cells in a row Swarmplot of Grades with Numemrical features Conditional Plot using seaborn FacetGrid Strip Plot of Categorical Features with Continuous Features Box Plot of Categorical Features with Continuous Features Violin Plot of Categorical Features with Continuous Features Categorical Count Plot Correlation of marks Features HeatMap Plot of Dataset df This is my 2nd EDA Kernel please do comment down how you like this kernel and do upvote if you like the work students marks plot cats X Result countplot grading plot with numeric features this is my secound EDA dataset and i have gone through the seaborn and matplotlib. Styling DataFrame on the basis of Results last cell in a row 2. com rT ES17CDQwAAAAC homer simpsons. Student Performance Full Beginner EDA Students Performance in Exams EDA Simpson Studing https c. ", "id": "ankitkalauni/student-performance-full-beginner-clean-eda", "size": "1312", "language": "python", "html_url": "https://www.kaggle.com/code/ankitkalauni/student-performance-full-beginner-clean-eda", "git_url": "https://www.kaggle.com/code/ankitkalauni/student-performance-full-beginner-clean-eda", "script": "seaborn Grading colorrow matplotlib.pyplot pandas matplotlib.gridspec numpy ", "entities": "(('Student Performance Full Beginner', 'Simpson Studing https c.'), 'EDA') (('EDA secound i', 'seaborn'), 'feature') "}