{"name": "student performance eda and visualization ", "full_name": " h2 AIM To Study the effect of various factors on students reading writing and maths score h3 Importing Required Libraries h3 Reading the data h3 Dataset Summary h4 Checking the number of Null Values h3 Checking each columns features h4 1 Gender h4 2 Race Ehtnicity of People h4 3 Parent s level of Education h4 4 Different types of lunches h4 5 Types of Test Prepration Course h2 Exploratory Data Analysis h4 1 Pairplot h4 2 Heatmap h3 Plotting the distribution of students marks h4 1 Math Score h4 2 Reading Score h4 3 Writing Score h3 Analyzing Maximum and Minimum marks of Students h4 1 Maximum Minimum score in Math h4 2 Maximum Minimum score in Reading h4 3 Maximum Minimum score in Writing h4 4 Number of students having maximum score in Math h4 5 Number of students having maximum score in Reading h4 6 Number of students having maximum score in Writing h4 7 Number of Students having maximum marks in all three categories h4 7 Number of Students having minimum marks in all three categories h3 Data Visualization and Interpretation h4 1 Bar Plot of Scores according to gender h4 2 Bar plot of Scores on the basis of Race Ethnicity h4 3 Bar plots of Scores on the basis of Test Prepration Course h4 4 Bar Plots of Scores on the basis of Parent s Education Level h4 5 Bar Plots of Scores on the basis of Types of Luch h4 i Math Score h4 ii Reading Score h4 iii Writing Score h4 7 Marks breakdown according to Race Ethnicity h4 i Math Score h4 ii Reading Score h4 iii Writing Score h4 8 Marks breakdown on the basis of Parent s Education Level h4 i Math Score h4 ii Reading Score h4 iii Writing Score h3 Implementing a Grading system for marks obtained h4 Plotting Grade Statistics h4 Number of students having maximum grade in Maths h4 Number of students having maximum grade in Reading h4 Number of students having maximum grade in Writing h4 Number of students having maximum grade in all three categories h4 Number of students having minimum grade in all three categories h3 Classifying Students as Passed or Failed ", "stargazers_count": 0, "forks_count": 0, "description": "Writing Score 7. Bar plot of Scores on the basis of Race Ethnicity People from group E have higher score in all three categories where as people from group A have the lowest score in all three categories 3. Bar Plots of Scores on the basis of Types of Luch Students who availed standard luch have scored higher in all the three categories compared to students who have taken free reduced lunch. A Excellent Student who scores 82 marks or higher in a subject 3. Writing Score 8. Maximum Minimum score in Math 2. Min tells us the minimum value of that feature. The number of candidates who just got a qualifying grade P and passed is the highest in maths. Math Score ii. P Pass Student who scores 35 marks or higher in a subject 8. Reading Score iii. 1 of students passed in all the three subjects. Marks breakdown according to Race Ethnicity i. Writing Score Implementing a Grading system for marks obtained The grading system is described as follows 1. Race Ehtnicity of People 3. Heatmap There is strong correlation between a student s reading score writing score reading score math score and writing score math score Plotting the distribution of students marks 1. C Average Student who scores 46 marks or higher in a subject 7. Types of Test Prepration Course Exploratory Data Analysis 1. Bar Plots of Scores on the basis of Parent s Education Level Student s whose parents have a Master s degree have scored higher compared to others whereas Student s whose parent s went to high school have obtained low marks compared to others 5. A Very Good Student who scores 73 marks or higher in a subject 4. O Outstanding Student who scores 91 marks or higher in a subject 2. Number of Students having maximum marks in all three categories 7. Writing Score Most students have their writing score in the range of 60 to 80 Analyzing Maximum and Minimum marks of Students 1. B Above Average Student who scores 55 marks or higher in a subject 6. Maximum Minimum score in Writing 4. Bar Plot of Scores according to gender Males have higher math score than Females whereas Females have higher scores in reading and writing than Males 2. AIM To Study the effect of various factors on students reading writing and maths score I hope you find this kernel helpful and some UPVOTES would be very much appreciated Importing Required Libraries Reading the data Dataset Summary Checking the number of Null Values There are no Null values in any of the columns The features described in the above data set are 1. Number of students having maximum score in Writing 7. Bar plots of Scores on the basis of Test Prepration Course Students who have completed the Test Prepration Course have scores higher in all three categories than those who haven t taken the course 4. Max tells us the maximum value of that feature. F Fail Student who scores less than 35 marks in a subject Plotting Grade Statistics Plot Summary Most of the students have got a B in Maths and Reading Section whereas in Writing Section almost equal number of students have got A and B grade. Marks breakdown on the basis of Parent s Education Level i. Number of students having maximum score in Reading 6. Marks break down according to Gender i. Number of Students having minimum marks in all three categories Data Visualization and Interpretation 1. 9 students failed in atleast one of the three subjects Suggestions are welcome. B Good Student who scores 64 marks or higher in a subject 5. Different types of lunches 5. Count tells us the number of NoN empty rows in a feature. Checking each columns features 1. Mean tells us the mean value of that feature. Number of students having maximum score in Math 5. Math Score Most students have their math score in the range of 60 to 80 2. 25 50 and 75 are the percentile quartile of each features. Reading Score Most students have their reading score in the range of 60 to 80 3. Std tells us the Standard Deviation Value of that feature. Parent s level of Education 4. Number of students having maximum grade in Maths Number of students having maximum grade in Reading Number of students having maximum grade in Writing Number of students having maximum grade in all three categories Number of students having minimum grade in all three categories Classifying Students as Passed or Failed A student is classified failed if he she has failed in any one of three subjects otherwise he she is classified as passed. Maximum Minimum score in Reading 3. ", "id": "ahmadjaved097/student-performance-eda-and-visualization", "size": "5233", "language": "python", "html_url": "https://www.kaggle.com/code/ahmadjaved097/student-performance-eda-and-visualization", "git_url": "https://www.kaggle.com/code/ahmadjaved097/student-performance-eda-and-visualization", "script": "seaborn get_grade matplotlib.pyplot pandas numpy ", "entities": "(('Suggestions', 'three subjects'), 'fail') (('P Pass who', 'subject 8'), 'student') (('described', 'data above set'), 'AIM') (('writing score', 'Students'), 'write') (('Most students', '60 to 80'), 'have') (('Most', 'A grade'), 'get') (('Math Most students', '60 to 80'), 'score') (('grading system', '1'), 'obtain') (('B Good who', 'subject 5'), 'Student') (('Min', 'feature'), 'tell') (('Mean', 'feature'), 'tell') (('25 50', 'percentile features'), 'be') (('C Average who', 'subject 7'), 'student') (('who', 'subject 2'), 'o') (('Very Good who', 'subject 4'), 'Student') (('who', 'free reduced lunch'), 'score') (('Max', 'feature'), 'tell') (('Std', 'feature'), 'tell') (('who', 'maths'), 'be') (('Excellent who', 'subject 3'), 'Student') (('she', 'three subjects'), 'fail') (('s', 'others'), 's') (('1', 'three subjects'), 'pass') (('who', 'subject'), 'Above') (('who', 'course'), 'have') (('Females', 'Males'), 'have') (('Count', 'feature'), 'tell') (('where people', 'three categories'), 'have') "}