{"name": "student academic performance analysis ", "full_name": " h1 Content h1 1 Introduction h1 Why is it important to analyze student performance h1 2 Loading libraries and data h1 3 Quick look at the data h2 Attribute Information h1 4 Visualize missing values h1 5 Data Prep h1 6 Data Visualization ", "stargazers_count": 0, "forks_count": 0, "description": "Data Preparation 8 Creating new columns 9 Grading System 10 6. Students who had the standard lunch have performed very well. Let s Dive Into Student Performance Stu. While a few students who did not complete their test preparations have not performed so well. More number of boys received D and E grade. Healthy students are better learners. Loading libraries and data 3. Data Visualization 11 1. Data Prep For a particular course the total marks is 100. There is average success in all three course. Also there are very few who completed their test preparation but still scored low percentage. Many factors can influence a student s performance including the influence of the parents educational background test preparation student health and so on. The average score in both courses reading and writing is around 70. From the above visualization we infer that most student have scored in the range of 60 to 80 which is constituting to the overall percentage as well. From the visualization above it is quite evident that the female students have performed exceptionally well Students whose parents hold a master s degree have a higher overall percentage. Visualize missing values 7 5. More female students received A and B Grade relative to male students. Let s get started 2. Introduction This data set consists of the marks secured by the students in various subjects. Let s try to understand the influence of the parents background test preparation etc on students performance. Teachers assign collect and examine student work all the time to assess student learning and to revise and improve teaching. Quick look at the dataLet s take a look at our dataAttribute Information Column Name Description gender Male Female race ethnicity Group division from A to E parental level of education Details of parental education varying from high school to master s degree lunch Type of lunch selected test preparation course Course details math score Marks secured by a student in Mathematics reading score Marks secured by a student in Reading writing score Marks secured by a student in Writing 4. 89 are females while 48. We can find that in the relationship between the percentage and the mathematics score most student have scored in the range of 50 to 80. Reading Score has the highest average. Why is it important to analyze student performance Analyzing student work is an essential part of teaching. Visualize missing values Using this matrix you can very quickly find the pattern of missingness in the dataset. We can notice that there are few who have scored exceptionally good compared to others even when they did not complete their test perparation. From the above visualization we infer The majority of students who earned an O grade were female. Nutrition plays a key role in the healthy development of the children. Majority of students received B grade followed by C. From the above visualization we can infer that Students who have completed their test preparations have definitely scored better. Quick look at the data 4 Data 5 Attribute Information 6 4. Students whose parental education level is high school and some high school have lower overall percentage. Let s create three new columns Total_Marks Percentage and grade Grading System Percentage Range Grade Qualification 95 O Outstanding 81 A Very Good 71 B Good 61 C Average 51 D Sufficient 41 E Passable 41 F Fail 6. So let s set passmark has 35 marks. We can see the relationship between reading and mathematical score and their gender distribution. The average of group E is highest among all the groups while the average of group A is lowest. It is very evident that food and nutriention play a vital role in the growth of a student both physically and academically. Almost all the scores are close to each other. Loading libraries and data 3 3. Almost similar number of both male and female got F grade. Ongoing assessment of student learning allows teachers to engage in continuous quality improvement of their courses. Nutritious foods provide the body and mind with the energy needed to grow feel well be active stay healthy and learn. Students who had the free reduced lunch have not performed so well. Students are able to learn better when they re well nourished and eating healthy meals has been linked to higher grades better memory and alertness and faster information processing. We can conclude that most students have a good reading score except a few. From the above visualisation we can observe that no peculiar pattern can be found There are no missing values in our dataset 5. Introduction 1 Why is it important to analyze student performance 2 2. Males whose parents hold a Bachelor s degree and master s degree have similar academic performance Performance of Group E is the best among all. Notice the range 75 to 100 in the above visualization. We always have few exceptions. Data Visualization Out of the total number of students 51. Females whose parents hold a Bachelor s degree followed by master s degree are more successful. While group D and C have nearly similar performance. Most students fall between the range of 40 to 85 marks in both the courses mathematics and writing. Please upvote if you liked the kernel KEEP KAGGLING initializing the passmarks Draw circle show plot Creating explode data Creating color parameters Wedge properties Creating autocpt arguments Creating plot Adding legend show plot. ", "id": "bhartiprasad17/student-academic-performance-analysis", "size": "7405", "language": "python", "html_url": "https://www.kaggle.com/code/bhartiprasad17/student-academic-performance-analysis", "git_url": "https://www.kaggle.com/code/bhartiprasad17/student-academic-performance-analysis", "script": "func missingno seaborn matplotlib.pyplot Grade pandas numpy ", "entities": "(('it', 'essential teaching'), 'be') (('KEEP', 'legend show plot'), 'upvote') (('which', 'overall percentage'), 'infer') (('Majority', 'C.'), 'receive') (('peculiar pattern', 'missing dataset'), 'observe') (('who', 'standard lunch'), 'perform') (('high high school', 'lower overall percentage'), 'be') (('More number', 'D'), 'receive') (('average score', '70'), 'be') (('Teachers', 'teaching'), 'assign') (('teachers', 'courses'), 'allow') (('1 Why it', 'student performance'), 'introduction') (('well nourished', 'better memory'), 'be') (('Quick', 'Attribute data 4 Data 5 Information'), 'look') (('average', 'group A'), 'be') (('We', 'reading score'), 'see') (('data', 'various subjects'), 'introduction') (('Also very who', 'still low percentage'), 'be') (('total marks', 'Data particular course'), 'Prep') (('performance similar academic Performance', 'Group E'), 'Males') (('who', 'O grade'), 'infer') (('you', 'dataset'), 'find') (('even when they', 'test perparation'), 'notice') (('Nutritious foods', 'feel'), 'provide') (('More female students', 'male students'), 'receive') (('parents', 'degree'), 'be') (('who', 'test preparations'), 'perform') (('Quick', 'Writing'), 'look') (('s', 'students performance'), 'let') (('group D', 'nearly similar performance'), 'have') (('most students', 'few'), 'conclude') (('Almost scores', 'other'), 'be') (('s', 'Total_Marks grade Grading Percentage Range Grade three new columns Percentage 95 O Outstanding 81 Very Good'), 'let') (('who', 'free reduced lunch'), 'perform') (('Many factors', 'parents'), 'influence') (('Most students', 'courses mathematics'), 'fall') (('parents', 'higher overall percentage'), 'be') (('Nutrition', 'children'), 'play') (('Almost similar number', 'F grade'), 'get') (('who', 'test preparations'), 'infer') (('most student', '50 to 80'), 'find') (('very food', 'student'), 'be') "}