{"name": "tensorflow 2 nuclei segmentation unet ", "full_name": " h1 Nuclie Semantic Segmentation UNet using Tensorflow 2 h1 Intro h1 Get the data h2 Visualize imported data h1 Build and train our neural network h1 Make predictions h1 Encode and submit our results ", "stargazers_count": 0, "forks_count": 0, "description": "pdf and very similar to this repo https github. com jocicmarko ultrasound nerve segmentation from the Kaggle Ultrasound Nerve Segmentation competition. png Make predictions Encode and submit our results Link https www. Get the data Downsample both the training and test images to reduce computations Retain record of the original sizes of the test images to upsample predicted masks and create correct run length encodings Visualize imported data Build and train our neural networkNext we build our U Net model loosely based on U Net Convolutional Networks for Biomedical Image Segmentation https arxiv. com rakhlin fast run length encoding python has an excellent implementation of run length encoding. Iterate over the test IDs and generate run length encodings for each seperate mask identified by skimage. 04597 which is very common for image segmentation problems such as this. Nuclie Semantic Segmentation UNet using Tensorflow 2 Intro Dataset used is from Kaggle s Data Science Bowl 2018 Nuclei Segmentation The architecture used is U Net https arxiv. com keegil keras u net starter lb 0 277 by Kjetil Åmdal Sævik. de people ronneber u net u net architecture. com rakhlin fast run length encoding python Create submission DataFrame. Create submission Set some parameters Get train and test IDs Get and resize train images and masks Read image files iteratively Append image to numpy array for train dataset Read corresponding mask files iteratively Looping through masks Read individual masks Expand individual mask dimensions Overlay individual masks to create a final mask for corresponding image Append mask to numpy array for train dataset Get and resize test images Read images iteratively Get test size Resize image to match training data Append image to numpy array for test dataset Check if training data looks all right Build U Net model Fit model Predict on train val and test Threshold predictions Create list of upsampled test masks Perform a sanity check on some random training samples Perform a sanity check on some random validation samples Run length encoding stolen from https www. This notebook is inspired from the great kernel Keras U net starter LB 0. ", "id": "advaitsave/tensorflow-2-nuclei-segmentation-unet", "size": "1418", "language": "python", "html_url": "https://www.kaggle.com/code/advaitsave/tensorflow-2-nuclei-segmentation-unet", "git_url": "https://www.kaggle.com/code/advaitsave/tensorflow-2-nuclei-segmentation-unet", "script": "prob_to_rles skimage.transform imread_collection tensorflow.keras.layers Lambda numpy tensorflow.keras.models Image MaxPooling2D Dropout rle_encoding BatchNormalization backend as K chain imread concatenate_images tqdm ImageFile tensorflow skimage.io matplotlib.pyplot tensorflow.keras.callbacks ModelCheckpoint backend PIL resize pandas EarlyStopping skimage.morphology load_model Conv2D Model Conv2DTranspose concatenate Input tensorflow.keras imshow label itertools ", "entities": "(('Nuclei 2018 architecture', 'Data Science Kaggle Bowl'), 'Segmentation') (('Threshold predictions', 'https www'), 'Set') (('de people', 'u net u net architecture'), 'ronneber') (('which', 'such this'), '04597') (('predictions', 'Link https www'), 'Make') (('we', 'Biomedical Image Segmentation https arxiv'), 'get') (('com rakhlin', 'length encoding python Create submission fast DataFrame'), 'run') (('notebook', 'great kernel'), 'inspire') (('length encoding fast python', 'length run encoding'), 'run') "}