{"name": "text2image gan ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "num_channels x 64 x 64 input is nc x 64 x 64 state size. num_channels x 64 x 64 state size. All imports are here view contents in HDF5 files 1. change this if you want to train any other gan Convert nested Python dict to object. ndf 8 x 4 x 4 self. ngf x 32 x 32 state size. pdf Git repo https github. ngf 8 x 4 x 4 based on https github. BOTTOM UP approach ahead The code in the next cell follows bottom up execution flow to understand which method is getting called when start from the last part i. Linear in_features self. Please note This kernel is for practice purposes only. ngf 4 x 8 x 8 state size. h_el One sided label smoothing Helps preventing the discriminator from overpowering the generator adding penalty when the discriminator is too confident Train the discriminator Train the generator Generator Loss function This is a customized loss function the first term is the regular cross entropy loss The second term is feature matching loss this measure the distance between the real and generated images statistics by comparing intermediate layers activations The third term is L1 distance between the generated and real images this is helpful for the conditional case because it links the embedding feature vector directly to certain pixel values. 2 inplace True based on https github. com ashual Text to Image Synthesis Datasets used in this kernel are same as the datasets used in the above git repository. ngf 2 x 16 x 16 state size. num_channels x 64 x 64 projected_embed self. Reference links Paper https arxiv. projected_embed_dim nn. see what data is stored in each category pdb. ndf x 32 x 32 state size. BatchNorm1d num_features self. com pytorch examples blob master dcgan main. ndf 4 x 8 x 8 state size. projection embed_vector. The references used are mentioned below. to know the categories in hdf5 file 2. unsqueeze 3 latent_vector torch. LeakyReLU negative_slope 0. ndf 2 x 16 x 16 state size. embed_dim out_features self. ngf 8 x 4 x 4 state size. cat projected_embed z 1 based on https github. ", "id": "msripooja/text2image-gan", "size": "525", "language": "python", "html_url": "https://www.kaggle.com/code/msripooja/text2image-gan", "git_url": "https://www.kaggle.com/code/msripooja/text2image-gan", "script": "smooth_label generator_factory DataLoader torch.autograd discriminator_factory numpy Image find_inter_embed encoder_only train validate_image nn Utils(object) sklearn.neighbors vae_encoder_generator(nn.Module) NearestNeighbors generator_only Variable Trainer(object) get_text_and_images_and_embedding save_checkpoint matplotlib.pyplot find_wrong_image timedelta cuda forward PIL Concat_embed(nn.Module) get_text datetime NearestNeighbor Text2ImageDataset(Dataset) discriminator(nn.Module) generator(nn.Module) vae_encoder(nn.Module) Struct gan_factory(object) test torch.utils.data __len__ Dataset vae_generator(nn.Module) __init__ weights_init torch get_text_and_images _train_gan __getitem__ vae_discriminator(nn.Module) ", "entities": "(('method', 'when last part'), 'follow') (('view here contents', 'HDF5'), 'be') (('data', 'category pdb'), 'see') (('it', 'pixel directly certain values'), 'sided') (('kernel', 'practice purposes'), 'note') (('Python', 'gan other Convert'), 'change') (('Synthesis Datasets', 'git above repository'), 'Text') "}