{"name": "thyroid disease detection using deep learning ", "full_name": " h2 Thyroid Disease h3 Data Set Information h4 From Garavan Institute h4 Documentation as given by Ross Quinlan h4 6 databases from the Garavan Institute in Sydney Australia h4 Approximately the following for each database h4 2 additional databases also from Ross Quinlan are also here h4 1 more database of 9172 instances that cover 20 classes and a related domain theory h4 Another thyroid database from Stefan Aeberhard h4 Dataset link ", "stargazers_count": 0, "forks_count": 0, "description": "Thyroid Disease The most common thyroid disorder is hypothyroidism. Data Set Information From Garavan Institute Documentation as given by Ross Quinlan 6 databases from the Garavan Institute in Sydney Australia Approximately the following for each database 2800 training data instances and 972 test instances Plenty of missing data 29 or so attributes either Boolean or continuously valued 2 additional databases also from Ross Quinlan are also here Hypothyroid. data and sick euthyroid. Hypo means deficient or under active so hypothyroidism is a condition in which the thyroid gland is underperforming or producing too little thyroid hormone. Recognizing the symptoms of hypothyroidism is extremely important. data Quinlan believes that these databases have been corrupted Their format is highly similar to the other databases 1 more database of 9172 instances that cover 20 classes and a related domain theory Another thyroid database from Stefan Aeberhard 3 classes 215 instances 5 attributes No missing values Dataset link Here https www. com yasserhessein thyroid disease data set summarize history for loss. ", "id": "yasserhessein/thyroid-disease-detection-using-deep-learning", "size": "1443", "language": "python", "html_url": "https://www.kaggle.com/code/yasserhessein/thyroid-disease-detection-using-deep-learning", "git_url": "https://www.kaggle.com/code/yasserhessein/thyroid-disease-detection-using-deep-learning", "script": "train_test_split IPython.display tensorflow.keras.layers plot_model SimpleImputer tensorflow.keras.models numpy Image seaborn Adam Dropout Dense ReduceLROnPlateau tensorflow.keras.utils matplotlib.pyplot tensorflow.keras.callbacks ModelCheckpoint Sequential statsmodels.api sklearn.model_selection pandas EarlyStopping load_model sklearn.impute tensorflow.keras.optimizers StandardScaler sklearn.preprocessing ", "entities": "(('29 Boolean', 'Ross also Quinlan'), 'set') (('domain related thyroid database', '3 215 instances'), 'believe') (('com yasserhessein thyroid disease data', 'loss'), 'summarize') (('thyroid gland', 'thyroid too little hormone'), 'mean') (('Recognizing', 'hypothyroidism'), 'be') "}