{"name": "tissue detect scaling bounding boxes 4xfaster ", "full_name": " h1 PANDA Tissue Detect Scaling Bounding Boxes h2 This method increased my image pre processing speed by 4 times h3 Pipeline Code Hidden Above h1 Timings Running Pipeline on Lowest Resolution h2 Findings h1 Timings Running Pipeline on Medium Resolution h2 Findings h1 New Pipeline Analysis h2 Open low resolution image h2 Detect Tissue and Find Bounding Boxes h2 Open High Resolution Image h2 Scale Smaller Bounding Boxes to High Res Image h2 Crop High Res Image with Bounding Box h2 Crop White Space From Image h2 Resize to desired injest h2 Detect Tissue and Remove Remaning White Space h2 External Contour Fix h4 Changed to h1 Revised Faster Pipeline h3 Code Hidden Below h1 Analysing New Pipeline Speed h3 More than a 4x time decrease with the new pipeline h1 Appling New Pipeline to Slide Corpus h1 Next Steps h3 If anyone has any leads on the above or other feedback recommendations please let me know ", "stargazers_count": 0, "forks_count": 0, "description": "Therefore making the ratio 1 16. All times are in milliseconds. I did this by detecting min area rect bounding boxes around tissue samples on the low resolution images and scaling that box up the larger images. This offers a good time to show the effect of contour hierarchies https docs. This flag is RETR_EXTERNAL. I also have run this script and made a new dataset with the images. com dannellyz panda tissue detection size optimization 70 walked through the steps of my process but focused only on the highest level downsampled images least resolution. More than a 4x time decrease with the new pipeline Appling New Pipeline to Slide CorpusI went ahead and added a section that can be used to run the new pipeline on the slides. As the code is getting quite bulky I am going to make a Kaggle Utility so that this code can simply be imported. I made another notebook that exported these images https www. Measuring these ratios rectangularity could lead to a more optimal base shape to cast all slides. This notebook started with running my pipeline on larger images and realizing that the time it took was unmanageable. com xhlulu panda resize and save train data. com dannellyz panda tissue detection size optimization 70 Tissue Detection Intro and First Application Base Dataset Generation https www. Open low resolution image Detect Tissue and Find Bounding Boxes Open High Resolution Image Scale Smaller Bounding Boxes to High Res Image Crop High Res Image with Bounding Box Crop White Space From Image Resize to desired injestUnlike the other pipeline I included resizes as a key feature. jpeg attachment tissue_logo. 0 d9 d8b tutorial_py_contours_hierarchy. mask_contours tier cv2. Since Tissue Detect is the majority the overall time increases proportionally New Pipeline AnalysisGiven that so much of the time it takes to process the images comes from the Tissue Detection the new pipeline seeks to handle that portion on the lowest resolution then scale up the resulting bounding boxes to the high resolution images. jpeg Tissue Detection is a key aspect to research in the domain of computer vision applied to cancer classification. Then to cut the large image down as much as possible before re runing the tissue detect on the higher resolution. This method increased my image pre processing speed by 4 times pipeline. External Contour Fix def detect_tissue. My main focus in this competition so far has been exploring previous work done in this domain and furthering its application towards this dataset. We also know that the provided images only have three layers of downsampling 1. Changed to def detect_tissue_external. com xhlulu and thier notebook PANDA Resize and Save Train Data https www. com dannellyz tissue detection bounding box metadata eda viz Exploring features from bounding boxes discovery on the slides PANDA Tissue Detect Scaling Bounding BoxesI started my research in this competition by taking academic papers and applying their technique to discover tissue within the provided Whole Slide Images. Base Notebook https www. Opening the image takes a slightly higher proportionate time. Knowing that these white spaces are very valuable to the analysis we can switch the flag on the contour processing to only include the external contours and drop those encomapssed by others. I would imagine this is due to the fact that most of the contours are more rectangular than square. This is all then followed by re sizing the image to the export shape and finally re detecting the tissue on the larger slide to remove the background. If anyone has any leads on the above or other feedback recommendations please let me know All imports For timing Convert from RGB to HSV color space Compute optimal threshold values in each channel using Otsu algorithm Make mask boolean Get intermediate slide Create mask where white is what we want black otherwise Draw filled contour in mask Extract out the object and place into output image Remove by row Remove by col For timing Open Slide Get returns from detect_tissue Get Tissue Only Slide Get minimal bounding rectangle for all tissue contours Crop with getSubImage cut empty space Get size change Set up dictionary for plotting Add Base Slide to verbose print Add Tissue Only to verbose print Add Bounding Boxes to verbose print Add Cut Slide to verbose print Set up example slide and run pipeline on low resolution Open slide on lowest resolution Detect Tissue and Copy for compare Get small level bounding boxes Open slide on lowest resolution Get center size and angle from rect Get Tissue Only Slide For timing Convert from RGB to HSV color space Compute optimal threshold values in each channel using Otsu algorithm Make mask boolean Get Tissue Only Slide For timing Open Small Slide Get returns from detect_tissue ons mall image Get minimal bounding rectangle for all tissue contours Open Big Slide Get small boudning rect and scale Scale Rectagle to larger image Crop bigger image with getSubImage Cut out white Get returns from detect_tissue on small image Get size change Set up dictionary for plotting Add Base Slide to verbose print Add Tissue Only to verbose print Add Larger Plot cut with bounding boxes Add Bounding Boxes to verbose print. The notebook I created Tissue Detection and Size Optimization 70 Shrink https www. findContours mask cv2. Below is a step through of this process. com dannellyz tissue detect scaling bounding boxes 4xfaster 4x speed increase to base notebook Tissue Dection Metadata Analysis https www. Notebooks in this collection include the following. This is compared to the old pipeline 2. Timings Running Pipeline on Lowest Resolution This is the highest indexed downsample level therefore referenced with 1. After this croping the image by the bounding box and then cutting out the empty space. Next Steps It is clear that a square final size causes serious distortions as well as adds a bit of unnecessary wasted space. Findings Tissue Detection encompasses almost 60 of the pre processing time Opening and Cutting the files are next most costly at about 12 each Timings Running Pipeline on Medium Resolution Index of 2 in the level array. Following my other notebook this also pulls from the lead of xhlulu https www. 730 seconds which is about 16x longer than the base processing time which makes since as we observed the time scaling linearlly with the size of the array. Therefore I edited the pipeline to speed up processing. jpeg attachment pipeline. This is to say that the image processed here is 4x bigger in both dimensions than the previous image. com dannellyz tissue detect td conv png 512x512 Notebook to export images to zip file Scaling Bounding Boxes Currently Here https www. jpeg Pipeline Code Hidden Above A full explaination of the pipeline is documented in the above mentioned notebook https www. Since opening and cutting the slide take the most time as of now I am also going to look into those functions for optimization. Detect Tissue and Remove Remaning White SpaceOn these high resolution images some of the white even from within the images is cut as it is seen as part of the background. Revised Faster Pipeline Code Hidden Below Analysing New Pipeline SpeedAs the timings below show the pipeline has been greatly speed up to only 633ms or roughly a 4x speed increase. For now I went ahead and put the show on show_plots verbose and onel set the images to 5 but can be uncommented to run all images. com dannellyz tissue detect png 512x512 pre process as 512x512 however after completing this I realized that the resolutions on the images were not quite up to what I wanted. com dannellyz panda tissue detection size optimization 70. Findings Tissue Detect timings increase proportionally linear with the size of the image. ", "id": "dannellyz/tissue-detect-scaling-bounding-boxes-4xfaster", "size": "6705", "language": "python", "html_url": "https://www.kaggle.com/code/dannellyz/tissue-detect-scaling-bounding-boxes-4xfaster", "git_url": "https://www.kaggle.com/code/dannellyz/tissue-detect-scaling-bounding-boxes-4xfaster", "script": "getSubImage detect_tissue numpy skimage draw_tissue_polygons comp_timings detect_tissue_external Pool tqdm tissue_cutout new_detect_and_crop matplotlib.pyplot get_disk_size make_images color_cut pandas tqdm.notebook get_timings plot_figures morphology otsu_filter multiprocessing detect_and_crop ", "entities": "(('This', 'downsample highest indexed therefore 1'), 'Pipeline') (('that', 'slides'), 'go') (('jpeg Tissue Detection', 'cancer classification'), 'be') (('code', 'Kaggle Utility'), 'go') (('com dannellyz panda detection size optimization', 'only highest level downsampled images'), 'tissue') (('increase', 'image'), 'linear') (('I', 'quite what'), 'detect') (('Therefore I', 'processing'), 'edit') (('I', 'Tissue Detection'), 'notebook') (('jpeg Pipeline full explaination', 'notebook https above mentioned www'), 'Code') (('it', 'background'), 'Tissue') (('I', 'images'), 'go') (('com dannellyz tissue', 'notebook Tissue Dection Metadata Analysis https www'), 'detect') (('below pipeline', 'greatly only 633ms'), 'below') (('that', 'larger images'), 'do') (('square final size', 'as well bit unnecessary wasted space'), 'step') (('com dannellyz tissue', 'zip file'), 'detect') (('we', 'others'), 'switch') (('it', 'larger images'), 'start') (('main focus', 'dataset'), 'explore') (('This', 'background'), 'follow') (('Findings Tissue Detection', 'level array'), 'encompass') (('metadata eda viz Exploring', 'Whole Slide provided Images'), 'detection') (('this', 'xhlulu https www'), 'pull') (('ratios rectangularity', 'slides'), 'measure') (('this', 'then empty space'), 'after') (('I', 'images'), 'run') (('most', 'contours'), 'imagine') (('Notebooks', 'following'), 'include') (('since we', 'array'), 'second') (('I', 'key feature'), 'Tissue') (('Opening', 'proportionate slightly higher time'), 'take') (('that', 'images https www'), 'make') (('This', 'hierarchies https contour docs'), 'offer') (('size change', 'Add Bounding print'), 'let') (('new pipeline', 'resolution high images'), 'be') (('method', 'times 4 pipeline'), 'increase') (('I', 'optimization'), 'go') (('also provided images', '1'), 'know') (('image', 'previous image'), 'be') "}