{"name": "train retinanet for mitotic figure detection ", "full_name": " h1 Train RetinaNet model on CCMCT data set ", "stargazers_count": 0, "forks_count": 0, "description": "Let s now unfreeze the network i. For the complete set and more information about it please see our publication in Scientific Data Bertram C. Not great but a good start. Our model was trained vor several more epochs but GPU time on kaggle is rare so we stop here with our proof of principle. Now create the network. Note that this kaggle version of the data set was converted to the DICOM format and for the sake of dataset size only the lowest i. Let s now find the optimal learning rate. 1e 4 seems to be a good value. A large scale dataset for mitotic figure assessment on whole slide images of canine cutaneous mast cell tumor. com rafaelpadilla Object Detection MetricsAdditionally some of my code https github. Note that for this step internet access is required since fast. Additionally the training provides images with a high probability of mitotic figure lookalikes see the paper. As of writing the MITOS_WSI_CCMCT data set is the only set providing mitotic figure annotations and mitotic figure look alikes for the complete microscopy slide image in total 44k mitotic figures on 32 WSI. Create anchors for object detection and show them on the image. Let s fit the frozen except the heads network for a cycle of 1 epoch 5000 randomly cropped images Let s have a quick peek at the preliminary state. highest resolution layer of data was exported. com maubreville MITOS_WSI_CCMCT https github. This is an excerpt of the data set. 1038 s41597 019 0290 4Credits to some of the library code https github. Train RetinaNet model on CCMCT data setTrain a RetinaNet model for mitotic figure detection on the MITOS_WSI_CCMCT data set. Sci Data 6 274 2019 doi 10. com ChristianMarzahl ObjectDetection https github. allow all layers to train And now let s fit the network using the cyclic learning rate scheme for 10 epochs Let s see how the network performs now. com maubreville SlideRunnerLet s have a look at the data from the data set only mitotic figure cells are selected. ai wants to download the pre trained weights for the ResNet18 stem. ", "id": "marcaubreville/train-retinanet-for-mitotic-figure-detection", "size": "2156", "language": "python", "html_url": "https://www.kaggle.com/code/marcaubreville/train-retinanet-for-mitotic-figure-detection", "git_url": "https://www.kaggle.com/code/marcaubreville/train-retinanet-for-mitotic-figure-detection", "script": "fastai.vision pathlib sliderunnerdatabase PascalVOCMetric Path create_anchors bb_pad_collate_min get_slides ObjectItemListSlide show_anchors_on_images fastai RetinaNetFocalLoss Database slide_object_result fastai.callbacks objectdetectiontools SlideObjectCategoryList RetinaNet retinanet ", "entities": "(('resolution highest layer', 'data'), 'export') (('how network', '10 epochs'), 'allow') (('more information', 'Scientific Data Bertram C.'), 'see') (('figure only mitotic cells', 'data'), 'SlideRunnerLet') (('ai', 'ResNet18 stem'), 'want') (('we', 'principle'), 'train') (('Train RetinaNet model', 'MITOS_WSI_CCMCT data set'), 'setTrain') (('kaggle version', 'only lowest i.'), 'note') (('cropped 5000 randomly s', 'preliminary state'), 'let') (('Additionally training', 'paper'), 'provide') (('internet access', 'step'), 'note') (('s', 'learning now optimal rate'), 'let') "}