{"name": "transfer learning densenet xception pneumonia ", "full_name": " h1 Pneumonia Detection Using Chest Xrays h2 CNN DenseNet201 Xception h3 xa0 xa0 xa0 xa01 Problem Statement h3 xa0 xa0 xa0 xa02 EDA and Image Augmentation h3 xa0 xa0 xa0 xa03 Model Building h3 xa0 xa0 xa0 xa04 Conclusion and Results h1 Import Libraries xa0 xa0 xa0 xa0 h1 Read the Dataset xa0 xa0 xa0 xa0 h1 Get the class labels in Train Test and Val xa0 xa0 xa0 xa0 h1 Distribution plots xa0 xa0 xa0 xa0 h1 Bluring xa0 xa0 xa0 xa0 h3 Greyscale h3 Gaussian Blur h3 Median h3 Averaging h3 X rays with Gaussian Bluring Median Bluring Average Bluring h1 Transformations xa0 xa0 xa0 xa0 h1 Simple CNN model xa0 xa0 xa0 xa0 h3 Prepare Image Data Generator h3 Add Model Layers h3 Visualize the model h3 Plot the model h3 Fit the model h3 Plot the loss curve h3 Trying more epcohs may give better results on validation set h3 Get prediction for all xrays in Val h3 Get actual classes h1 DenseNet201 xa0 xa0 xa0 xa0 h3 Add DenseNet201 layer h3 Model Building xa0 xa0 xa0 xa0 h3 Plot the loss h3 Accuracy plot h3 Quite a few fluctuation in the loss of the Test set are observed h3 Evaluate the model on test set h3 Predict on Val set h3 Evaluate the model on Val set h3 Get actual classes h4 1 XceptionNet h4 2 Separable Layers h4 3 Why is separable convolution better than normal convolution h1 Xception xa0 xa0 xa0 xa0 h3 Model Building xa0 xa0 xa0 xa0 h3 Plot the loss h3 Plot the accuracy h3 Cut off at epoch 5 post that the val accuracy decreases h3 Evaluate the model on Test set h3 Predict on Val set h3 Evaluate on Val set h3 Predict on Val set h3 Get Actual Classes ", "stargazers_count": 0, "forks_count": 0, "description": "Color MapsApplying different types of color maps. Motivation The problems arise with CNNs when they go deeper. So a total of 3x3x3x64. DenseNets simplify the connectivity pattern between layers introduced in other architectures 1. Furthermore some variations of ResNets have proven that many layers are barely contributing and can be dropped. rotate method is used to rotate a 2D array in multiples of 90 degrees. How Pneumonia is detected Chest x ray An x ray exam will allow your doctor to see your lungs heart and blood vessels to help determine if you have pneumonia. Conclusion and Results Problem Statement and Introduction to Dataset The dataset is organized into 3 folders train test val and contains subfolders for each image category Pneumonia Normal. What Does a Chest X Ray Show A chest X ray is most commonly used to detect abnormalities in the lungs but can also detect abnormalities in the heart aorta and the bones of the thoracic area. The diagnoses for the images were then graded by two expert physicians before being cleared for training the AI system. Evaluate the model on Test set Predict on Val set Evaluate on Val set Predict on Val set Get Actual Classes Conclusion and Results Using the simple version of CNN with multiple layers of Con2d with Maxpooling2d reached a accuracy of 82 on the test set. getAffineTransform will create a 2 3 matrix which is to be passed to cv2. Another problem with very deep networks was the problems to train because of the mentioned flow of information and gradients. title Loss over the Epochs plt. The difference lies in the dimensionality of the filters. This operation processes the edges while removing the noise. xl 1 ResNets DenseNets are divided into DenseBlocks where the dimensions of the feature maps remains constant within a block but the number of filters changes between them. Similarly for the Middle flow and the Exit flow this diagram clearly explains the image size the various layers the number of filters the shape of filters the type of pooling the number of repetitions and the option of adding a fully connected layer in the end. To find the transformation matrix we need three points from input image and their corresponding locations in the output image. If we make H_l to produce k feature maps every time then we can generalize for the l th layer kl k0 k l 1 This hyperparameter k is the growth rate. Without having to transform the image over and over again we can save up on computational power. We want to keep them in inference mode when we unfreeze the base model for fine tuning so we make sure that the base_model is running in inference mode here. Now we are ready to talk about the growth rate. XceptionNet Convolutional Neural Networks CNN have come a long way from the LeNet style AlexNet VGG models which used simple stacks of convolutional layers for feature extraction and max pooling layers for spatial sub sampling stacked one after the other to Inception and ResNet networks which use skip connections and multiple convolutional and max pooling blocks in each layer. Since its introduction one of the best networks in computer vision has been the Inception network. The Gaussian filter is a low pass filter that removes the high frequency components are reduced. Model Building nbsp nbsp nbsp nbsp 4. Scaling ResizingImage resizing refers to the scaling of images. Structure Traditional feed forward neural networks connect the output of the layer to the next layer after applying a composite of operations. This exam will also help determine if you have any complications related to pneumonia such as abscesses or pleural effusions fluid surrounding the lungs. This is because the path for information from the input layer until the output layer and for the gradient in the opposite direction becomes so big that they can get vanished before reaching the other side. 7 font dict color yellow size 12 arrowcolor yellow arrowsize 5 arrowwidth 0. Many times we need to resize the image i. Using the DenseNet201 reached a accuracy of 85. There are also various Separable convolutional layers. 12 filters and they just add a small set of new feature maps. The next version of notebook will deal with the pretrained models like Resnet50. Instead DenseNets layers are very narrow e. And the total number of filters we want is 64. Freeze the base_model The base model contains batchnorm layers. Regularize with dropout plt. Consequently the equation reshapes again into xl Hl x0 x1 x2. DenseNets do not sum the output feature maps of the layer with the incoming feature maps but concatenate them. It also shows the shape of the input tensor in each flow. There are also Max Pooling layers. figure figsize 16 9 plt. When interpreting the x ray the radiologist will look for white spots in the lungs called infiltrates that identify an infection. history val_accuracy label Valid Accuracy plt. history loss label Train Loss plt. And every transformation uses up 3x3x3x64 1 728 multiplications. Reference https towardsdatascience. history val_loss label Valid Loss plt. Scaling comes in handy in many image processing as well as machine learning applications. These layers between them are called Transition Layers and take care of the downsampling applying a batch normalization a 1x1 convolution and a 2x2 pooling layers. com understanding and visualizing densenets 7f688092391aDenseNet201 nbsp nbsp nbsp nbsp Add DenseNet201 layerModel Building nbsp nbsp nbsp nbsp Plot the loss Accuracy plot Quite a few fluctuation in the loss of the Test set are observed. There are also Skip connections where we use ADD to merge the two tensors. Also all Convolutional and Separable Convolutional layers are followed by batch normalization. 5 arrowhead 2 fig. EDA and Image Augmentation nbsp nbsp nbsp nbsp 3. How so We could see the feature maps as the information of the network. Traditional Convolutional layer 3x3x3x64 1 728Separable Convolutional layer 3x3x1x3 1x1x3x64 27 192 219As we see separable convolution layers are way more advantageous than traditional convolutional layers both in terms of computation cost as well as memory. Using the Xception reached a accuracy of 74. Instead in separable convolution we first use 3x3x1x3 in depthwise convolution and 1x1x3x64 in pointwise convolution. 15 line dict color yellow width 1 dash dash Evaluate the model Evaluate the model Define Training and Validation Data Generator with Augmentations Flow the data into the Data Generator Load weights pre trained on ImageNet. 15 line dict color yellow width 1 dash dash plt. The Inception model uses a stack of modules each module containing a bunch of feature extractors which allow them to learn richer representations with fewer parameters. As we see in figure above the Xception module has 3 main parts. In the separable convolution we only transform the image once in the depthwise convolution. 15 line dict color yellow width 1 dash dash Evaluate the model Evaluate the model. either shrink it or scale up to meet the size requirements. Instead of drawing representational power from extremely deep or wide architectures DenseNets exploit the potential of the network through feature reuse. Each layer is then adding a new information to this collective knowledge in concrete k feature maps of information. In fact the number of parameters of ResNets are big because every layer has its weights to learn. The main difference is that in the normal convolution we are transforming the image multiple times. The diagram also mentions in detail the number of filters the filter size kernel size and the strides. Evaluate the model on test set Predict on Val set Evaluate the model on Val set Get actual classes Xception Architechture 1. OpenCV provides us several interpolation methods for resizing an image. show summarize history for metric annotations dict showarrow True x 10 y 1. The entry flow has two blocks of convolutional layer followed by a ReLU activation. From Keras Documentation 3. It helps in reducing the number of pixels from an image and that has several advantages e. All chest X ray imaging was performed as part of patients routine clinical care. To do it they simply connect every layer directly with each other. Xception nbsp nbsp nbsp nbsp Model Building nbsp nbsp nbsp nbsp Plot the loss Plot the accuracy Cut off at epoch 5 post that the val accuracy decreases. What problem DenseNets solve Counter intuitively by connecting this way DenseNets require fewer parameters than an equivalent traditional CNN as there is no need to learn redundant feature maps. For the analysis of chest x ray images all chest radiographs were initially screened for quality control by removing all low quality or unreadable scans. 16 ax 0 ay 40 text MobileNet Model stopped Overfitting Zone xanchor center xshift 10 opacity 0. The equation for this would be xl Hl xl 1 ResNets extended this behavior including the skip connection reformulating this equation into xl Hl xl 1 xl 1 DenseNets make the first difference with ResNets right here. history accuracy label Train Accuracy plt. Separable Layers Separable convolutions consist of first performing a depthwise spatial convolution which acts on each input channel separately followed by a pointwise convolution which mixes the resulting output channels. When the strides are different than one the strides are also mentioned. Here the central element of the image is replaced by the median of all the pixels in the kernel area. In this process the central element of the image is replaced by the average of all the pixels in the kernel area. Why is separable convolution better than normal convolution If we were to use a normal convolution on the input tensor and we use a filter kernel size of 3x3x3 kernel size 3 3 and 3 feature maps. The Entry flow the Middle flow which is repeated 8 times and the Exit flow. The growth rate regulates how much information is added to the network each layer. ylabel Loss plt. Every layer has access to its preceding feature maps and therefore to the collective knowledge. Since we are concatenating feature maps this channel dimension is increasing at every layer. Pneumonia Detection Using Chest XraysCNN DenseNet201 Xception Contents nbsp nbsp nbsp nbsp 1. 15 line dict color yellow width 1 dash dash Evaluate the model Define Training and Validation Data Generator with Augmentations Flow the data into the Data Generator Rebuild top plt. For example we begin with an image size of 299x299x3 and after the entry flow we get an image size of 19x19x728. Do not include the ImageNet classifier at the top. MedianThe Median blur operation is similar to the other averaging methods. xlabel Epochs plt. DenseNets solve this issue since each layer has direct access to the gradients from the loss function and the original input image. Fractal Networks The authors solve the problem ensuring maximum information and gradient flow. Problem Statement nbsp nbsp nbsp nbsp 2. Affine TransformationIn Affine transformation all parallel lines in the original image will still be parallel in the output image. Then we take the transformed image and simply elongate it to 64 channels. Extra metallic objects such as jewelry are removed from the chest and neck areas for a chest X ray to avoid interference with X ray penetration and improve the accuracy of the interpretation. It also helps in zooming in images. It can reduce the time of training of a neural network as more is the number of pixels in an image more is the number of input nodes that in turn increases the complexity of the model. There are 5 863 X Ray images JPEG and 2 categories Pneumonia Normal. add_shape type rect x0 9. In order to account for any grading errors the evaluation set was also checked by a third expert. Model BuildingSimple CNN model nbsp nbsp nbsp nbsp Prepare Image Data Generator Add Model Layers Visualize the model Plot the model Fit the model Plot the loss curve Trying more epcohs may give better results on validation set Get prediction for all xrays in Val Get actual classes DenseNet Architechture BackgroundDensely Connected Convolutional Networks DenseNets are the next step on the way to keep increasing the depth of deep convolutional networks. ylabel Accuracy plt. X rays with Gaussian Bluring Median Bluring Average BluringTransformations nbsp nbsp nbsp nbsp 1. Chest X ray images anterior posterior were selected from retrospective cohorts of pediatric patients of one to five years old from Guangzhou Women and Children s Medical Center Guangzhou. AveragingDuring this operation the image is convolved with a box filter normalized. Preprocessing the data Look at the training testing and validation data numbers Create a 1x2 subplot create empty figure trace Get the Express fig broken down as traces and add the traces to the proper plot within in the subplot Define Training and Validation Data Generator with Augmentations Flow the data into the Data Generator Compile the model and see it s structure and parameters display using your system viewer write and show Save the model plt. Import Libraries nbsp nbsp nbsp nbsp Read the Dataset nbsp nbsp nbsp nbsp Get the class labels in Train Test and Val nbsp nbsp nbsp nbsp EDA and Image Augmentation Distribution plots nbsp nbsp nbsp nbsp Bluring nbsp nbsp nbsp nbsp Greyscale Gaussian BlurIn Gaussian Blur operation the image is convolved with a Gaussian filter instead of the box filter. We have already seen that normally this composite includes a convolution operation or pooling layers a batch normalization and an activation function. title Accuracy over the Epochs plt. ", "id": "ankitp013/transfer-learning-densenet-xception-pneumonia", "size": "19462", "language": "python", "html_url": "https://www.kaggle.com/code/ankitp013/transfer-learning-densenet-xception-pneumonia", "git_url": "https://www.kaggle.com/code/ankitp013/transfer-learning-densenet-xception-pneumonia", "script": "make_subplots colormaps keras.models subtract_gaussian_bg_image plotly.express keras rotation tensorflow.keras.layers plot_model numpy MaxPooling2D SGD Adam Dropout ResNet50 ImageDataGenerator preprocessing load_img Dense preprocess_input backend as K subtract_median_bg_image tqdm subtract_average_bg_image tensorflow.keras.layers.experimental tensorflow matplotlib.pyplot tensorflow.keras.preprocessing.image affine_tf backend plotly.graph_objs resize pandas tqdm.notebook load_model Conv2D Model plotly.subplots tensorflow.keras.preprocessing tensorflow.keras.applications.resnet50 keras.utils tensorflow.keras.optimizers Flatten image ", "entities": "(('image', 'Gaussian filter'), 'nbsp') (('we', 'filters'), 'be') (('we', 'image'), 'be') (('central element', 'kernel area'), 'replace') (('chest X ray imaging', 'clinical care'), 'perform') (('we', 'kernel 3x3x3 size'), 'be') (('we', 'pointwise convolution'), 'use') (('diagram', 'filters'), 'mention') (('which', 'Middle flow'), 'flow') (('we', 'output corresponding image'), 'need') (('which', 'output resulting channels'), 'consist') (('Using', '74'), 'reach') (('Scaling ResizingImage resizing', 'images'), 'refer') (('evaluation set', 'also third expert'), 'in') (('entry flow', 'ReLU activation'), 'have') (('Now we', 'growth rate'), 'be') (('Chest X ray images anterior posterior', 'Guangzhou one to five years old Women'), 'select') (('Exit diagram', 'end'), 'explain') (('Extra metallic objects', 'interpretation'), 'remove') (('problem', 'information'), 'be') (('model', 'actual classes'), 'evaluate') (('show', 'annotations dict metric showarrow'), 'summarize') (('next version', 'Resnet50'), 'deal') (('we', '3 main parts'), 'have') (('chest radiographs', 'low quality'), 'screen') (('operation', 'noise'), 'process') (('dash dash 1 model', 'Data Generator Rebuild top plt'), 'Evaluate') (('Convolutional Also Convolutional layers', 'batch normalization'), 'follow') (('difference', 'filters'), 'lie') (('one', 'computer vision'), 'be') (('base model', 'batchnorm layers'), 'freeze') (('that', 'advantages several e.'), 'help') (('DenseNets', 'other architectures'), 'simplify') (('already normally composite', 'pooling batch normalization'), 'see') (('1 hyperparameter k', 'l th layer'), 'make') (('layer', 'loss function'), 'solve') (('DenseNet Architechture BackgroundDensely Connected Convolutional Networks DenseNets', 'deep convolutional networks'), 'model') (('how much information', 'network'), 'regulate') (('convolution separable layers', 'computation cost'), 'layer') (('Using', '85'), 'reach') (('layers', '1x1 convolution'), 'call') (('Then we', '64 channels'), 'take') (('Fractal authors', 'maximum information'), 'Networks') (('many layers', 'ResNets'), 'prove') (('Structure Traditional', 'operations'), 'feed') (('a few fluctuation', 'Test set'), 'com') (('rotate method', '90 degrees'), 'use') (('Skip also where we', 'two tensors'), 'be') (('layer', 'therefore collective knowledge'), 'have') (('intuitively way DenseNets', 'feature redundant maps'), 'solve') (('they', 'directly other'), 'connect') (('Using', 'test set'), 'evaluate') (('we', '19x19x728'), 'begin') (('base_model', 'inference mode'), 'make') (('blood you', 'pneumonia'), 'detect') (('over we', 'computational power'), 'save') (('layer', 'weights'), 'be') (('It', 'flow'), 'show') (('Scaling', 'image many processing'), 'come') (('How so We', 'network'), 'see') (('viewer', 'model plt'), 'look') (('Overfitting Zone xanchor center', '10 opacity'), 'ax') (('history val_accuracy', 'Valid Accuracy plt'), 'label') (('transformation', '1 3x3x3x64 728 multiplications'), 'use') (('that', 'infection'), 'look') (('DenseNet201 Xception Contents', 'Pneumonia Chest'), 'detection') (('them', 'fewer parameters'), 'use') (('dataset', 'image category'), 'conclusion') (('Consequently equation', 'xl Hl x0 x1 again x2'), 'reshape') (('diagnoses', 'AI system'), 'grade') (('OpenCV', 'image'), 'provide') (('ResNet which', 'max multiple convolutional layer'), 'come') (('color 7 font dict yellow size', '12 arrowcolor yellow 5 arrowwidth'), 'arrowsize') (('Define Data Training Generator', 'ImageNet'), 'Evaluate') (('number', 'them'), 'divide') (('parallel lines', 'output still image'), 'be') (('we', 'depthwise once convolution'), 'transform') (('Chest X Ray chest X ray', 'thoracic area'), 'what') (('they', 'feature new maps'), 'add') (('val accuracy', 'that'), 'nbsp') (('strides', 'one'), 'be') (('so they', 'other side'), 'be') (('also you', 'pleural effusions lungs'), 'help') (('MedianThe blur Median operation', 'averaging other methods'), 'be') (('image', 'box filter normalized'), 'averagingduring') (('when they', 'CNNs'), 'Motivation') (('as number', 'model'), 'be') (('layer', 'information'), 'add') (('xl Hl 1 ResNets', 'ResNets'), 'be') (('DenseNets', 'feature reuse'), 'of') (('Many times we', 'image i.'), 'need') (('channel dimension', 'layer'), 'concatenate') (('which', 'cv2'), 'create') (('Here central element', 'kernel area'), 'replace') (('DenseNets', 'them'), 'sum') "}