{"name": "unet for spirochaeta bacteria detection ", "full_name": " h1 About h3 About the model s performance h1 Snippets to read and slice images into batches of 256x256x3 RGB images h1 Define loss functions h1 Define Unet Model h1 Calculate classes percentage for balancing h1 Split into training and testing set h1 One hot encoding the labels h1 Start training the model h1 Conclusion h2 Optimization options ", "stargazers_count": 0, "forks_count": 0, "description": "The data was collected processed and annotated by myself with help of my Professor Dr. com longmakesstuff UnetPlusPlus About the model s performanceTraining on kaggle is quite constrainted since I only have about 16GB RAM so this script only demonstrates a prototype of what UNet and UNetPlusPlus can be used for. One hot encoding the labelsFor training Start training the modelSince the instance only has 13GB I will not apply any augmentation and train the model only on 300 data points at once ConclusionThe model learns. With a proper computer and much optimization the final model can be used to analyze live video of bacteria. The implementation can also be found at https github. nguyen2306 at protonmail. We need some balancing for the model to learn properly. We also use only 2000 samples. AboutThis is a code demonstration for reproducibility purpose of my Bachelor thesis. com watch v 9 J3L1Fvv60Also we do not do any further statistical analysis of model s performance in this notebook. Define Unet ModelThe implementation can also be found at https github. Images are normalized into interval 0. If you have any question don t hesitate to contact me at long. Use the whole dataset Require a computer with about 64GB RAM or an implementation with Python generator Image too small Width small Height small Reading raw images Sanity check Slicing images into 256 x 256 Check output Some hyper parameters I have to use only 2000 images because the kaggle s cloud instance does not have enough RAM. Split into training and testing setNo validation set for this setting. com longmakesstuff UnetPlusPlus Calculate classes percentage for balancingSince background s absolute frequency is very dominant. The output are the two variables images and masks. Snippets to read and slice images into batches of 256x256x3 RGB imagesYou can use following cell if you want to obtain the data in optimal form. Define loss functionsWe make use of sum of three major loss functions for segmentation crossentropy intersection over union and F1. The video can be found at the following link https www. Optimization options Augmentation that a lots. ", "id": "longnguyen2306/unet-for-spirochaeta-bacteria-detection", "size": "2033", "language": "python", "html_url": "https://www.kaggle.com/code/longnguyen2306/unet-for-spirochaeta-bacteria-detection", "git_url": "https://www.kaggle.com/code/longnguyen2306/unet-for-spirochaeta-bacteria-detection", "script": "UNetPP log_iou tensorflow.keras.layers iou numpy SlidingWindow MaxPooling2D Adam Dropout weighted_loss BatchNormalization LeakyReLU dice tqdm do tensorflow conv2d tensorflow.keras.backend loss Conv2D conv2dtranspose Conv2DTranspose concatenate Input fit loss_function log_dice compile __init__ tensorflow.keras.optimizers ", "entities": "(('com UnetPlusPlus Calculate classes percentage', 'balancingSince absolute frequency'), 'longmakesstuff') (('cloud instance', 'enough RAM'), 'use') (('don t', 'me'), 'have') (('you', 'optimal form'), 'use') (('data', 'Professor'), 'collect') (('UNet', 'what'), 'longmakesstuff') (('ConclusionThe once model', 'learns'), 'encode') (('some', 'model'), 'need') (('implementation', 'https also github'), 'find') (('we', 'notebook'), 'do') (('video', 'link https following www'), 'find') (('much final model', 'bacteria'), 'use') (('Define Unet ModelThe implementation', 'https also github'), 'find') (('AboutThis', 'Bachelor thesis'), 'be') "}