{"name": "up and running set up eda and images explained ", "full_name": " h1 Table of Contents h2 Introduction h3 Project Overview h3 Goals h2 h2 Set up h3 Install Dependencies h3 Examine Files h2 00322d4d 1c29 4943 afc9 b6754be640eb 0 8 10 10 50 50 0 75 100 100 5 5 h2 h2 Data Exploration and Visualization h2 First of all a giant shout out to thomasjpfan s kernel for a lot of these visualizations We ve adapted some and used others as is and explained the code behind them for this tutorial h2 We use Python s multiprocessing package to accelerate the speed of these tasks h3 Classes h2 How many of the patients have pneumonia compared to those that don t h2 How many bounding boxes designating a pneumonia opacity are present in each image h2 What is the age distribution by gender and target h3 Pneumonia Locations h2 How is the pixel spacing distributed h2 How are the bounding box areas distributed by the number of boxes h2 What is the distribution of black pixels saturation in the images How many have more than 10 of images comprised of black pixels h2 What do the images with mostly black pixels look like h2 Can traditional image processing find a bounding box in the cropped images here h2 Can the bounding boxes be resized when cropping and resizing the cropped images h2 How are the bounding box aspect ratios distributed h2 What does the images with a high aspect ratio look like h2 h2 Conclusion h3 Other Kernels h3 References h2 ", "stargazers_count": 0, "forks_count": 0, "description": "Other Kernels CNN with segmentation https www. 200208 876OC return to Table of Contents combine into one as near identical values. org 3 library multiprocessing. org 3 library warnings. What is the distribution of black pixels saturation in the images How many have more than 10 of images comprised of black pixels What do the images with mostly black pixels look like While we re at it what do the images with mostly white pixels look like These ones are generally full frame. html allows estimation of the parameters of a Gaussian mixture distribution here scikit image morphology feature measure util transform https scikit image. Let s first look at the csv files in order. return to Table of Contents Data Exploration and Visualization First of all a giant shout out to thomasjpfan s kernel https www. The first column is the patientId and the second is the class. One thing we notice about those is that the have a large quantity of black pixels resulting from the cropping. io en latest library for image augmentation in machine learning experiments here tqdm https pypi. Target is 0 for no boxes and 1 when a box is present. This is possible because females generally have lung volumes that are 10 12 less than that of males https www. We ll use pydicom to read the images. com hjhuney yolo object detection walkthrough for the rsna pneumonia detection challenge 123ec9a9adf2 by Jake Huneycutt a walk through to get a YOLOv3 model working locally Kaggle RSNA Pneumonia Detection Challenge Explained https medium. com t7jackso 26951f901707 by Robert Jackson An overview of the competition challenge with discussion on pneumonia neural networks and more References https www. Scoring in the competition will be by finding the mean average precision of the predicted boxes at different intersection over union thresholds. org stable modules generated sklearn. How many of those patient IDs are unique Some patients are represented multiple times in the patientId column. org doc numpy reference Python package for scientific computations including linear algebra here multiprocessing https docs. Classes How many of the patients have pneumonia compared to those that don t How many bounding boxes designating a pneumonia opacity are present in each image What is the age distribution by gender and target What are the areas of the bounding boxes by gender Here we see that females have smaller sized pneumonia bounding boxes. It would be helpful to recalculate the centroid in relation to each lung after segmentation. Got it So 3062 patients are represented twice 105 thrice and 11 four times. com thomasjpfan q a with only pictures for a lot of these visualizations. html Python data analysis and processing library used for reading csv files here seaborn https seaborn. Many control images with no pneumonia opacity or with other lung conditions are also present with which to train. com c rsna pneumonia detection challenge evaluation. Some contain pneumonia opacities and others contain other conditions. We also know from the competition evaluation page https www. And again some patients are represented multiple times. This will be done by training machine learning models on a set of images that have been labeled by experts to show a box drawn around the presumed pneumonia lung opacity or opacities when present. read_csv https pandas. Data Exploration and Visualization Classes Pneumonia Locations4. Set up Install Dependencies Examine Files3. We ve loaded the data explored the files included examined images to help us understand our goals and to brainstorm approaches and run the provided model on the data to create our first submission file. com ashishpatel26 chexnet radiologist level pneumonia detection NASNet https www. com pydicom pydicom inspect and modify DICOM https www. html graphical plotting output library here pydicom https github. pyplot https matplotlib. return to Table of Contents Set up Install Dependencies We need to import the libraries and packages we ll be using. This tells us we do NOT want to include the row index counters on our submission. We will need to differentiate between pneumonia opacities and other lung conditions that can create signals such as fluid overload bleeding volume loss lung cancer post radiation or surgical changes and fluid in the pleural space. Let s break that down. Can traditional image processing find a bounding box in the cropped images here Can the bounding boxes be resized when cropping and resizing the cropped images How are the bounding box aspect ratios distributed What does the images with a high aspect ratio look like Is there a relationship between the bounding box s aspect ratio and area return to Table of Contents Conclusion So there you have it. A more detailed explanation can be found on the challenge s evaluation page https www. com jonnedtc cnn segmentation connected components CheXNet https www. We use Python s multiprocessing package to accelerate the speed of these tasks. If you have any questions comments or especially criticisms please let us know in the comments so we can address them Have a nice day everyone Table of Contents 1. org data here numpy https docs. org a collection of algorithms for image processing here Click on here to the right of the library to find the code block where it is first used. These are os https docs. Next we will define functions that parse the DICOM metadata for the attributes we are interested in. org wiki DICOM images. com c rsna pneumonia detection challenge. Let s look into that. Where do we go next Well there are several other models that have been shared in the kernels. html provides options for warning control here matplotlib. com ashishpatel26 beginner tutorial nasnet pneumonia detection You can also check out these excellent Medium articles by NoMonia team members YOLO Object Detection Walkthrough for the RSNA Pneumonia Detection Challenge https medium. Spoiler that is because some patients have multiple bounding boxes labeled Let s now look at the metadata available with each image. Pneumonia Locations Where is the centroid of the bounding boxes of pneumonia located Without overlaying this over the mean lung outline it is difficult to make any strong conclusions from this as the lungs may not be centered on all images. A successful algorithm will be able to take unlabeled images and label them accurately by drawing a box around pneumonia lung opacities. Dear Kagglers This kernel is intended to help beginners who are overwhelmed by this project get up and running. The information we are most interested in at this point are the patient s sex and age the view position of the image PA for posterior anterior or AP for anterior posterior the image pixel spacing and of course the image itself which is contained in the Pixel Data array. Goals To classify pneumonia in medical images we will build an algorithm that detects lung opacities. The Radiological Society of North America RSNA http www. html supports spawning processes here warnings https docs. Each row consists of the patientId as well as either NaN not a number if there are no pneumonia bounding boxes indicated or values representing the x and y coordinates of the upper left corner of the bounding box followed by the width and height of the bounding box. Lastly we will point you to models to explore including our own version of YOLO. com c rsna pneumonia detection challenge evaluation that if a patient has multiple predicted bounding boxes that the submission should include them all by listing them one after another in the prediction column like this 00322d4d 1c29 4943 afc9 b6754be640eb 0. html Python module for operating system functionality here pandas https pandas. com sebastiannorena c140b19bf903 by Sebastian Norena ideas for improving upon the competition provided starter kernel No more moaning ia A Journey in Medical Imaging https medium. Patch 2D shapes with a face color and an edge color here imgaug https imgaug. Examine Files We will start by listing the files included in the project. html to read the data and then look at a few examples. 75 100 100 5 5 Next up we have the training labels file. We hope to provide a basic understanding of the data and how to work with it to make predictions that can be submitted to the competition. This line below counts up each patientId s number of occurrences and then counts up how many have each number of occurrences. org Python visualization library here matplotlib. First we will briefly discuss the challenge. A more detailed definition of the of the competition is provided on the Kaggle RSNA Pneumonia Detection Challenge website https www. There are 28 989 rows with two columns. We see that it has two columns titled patientId and PredictionString and 1000 rows. org has sponsored this competition on Kaggle to incentivize the creation of new algorithms that can detect pneumonia in radiographic images. What do the outliers look like Aha As feared there are images that are cropped and off center. Next we will manipulate the images to maximize their usefulness for model training. Conclusion Other Helpful Kernels References Introduction This kernel will provide a simplified approach to loading and examining data for the RSNA Pneumonia Detection Challenge. org project tqdm fast extensible progress meter here scikit learn GaussianMixture http scikit learn. How is the pixel spacing distributed How are the bounding box areas distributed by the number of boxes Where are the outliers Again this is difficult to interpret without normalizing the location of the lungs in each image. org api _as_gen matplotlib. Introduction Project Overview Goals2. We get the age gender view position patient ID pixel spacing and a metric to determine the number of black pixels in each image we ll see why later. We ve adapted some and used others as is and explained the code behind them for this tutorial. org users pyplot_tutorial. Then we will look at the csv files and examine the DICOM https en. patches https matplotlib. org pandas docs stable generated pandas. The sample submission file will show us the format that we should be using for our competition submission after we have created our predictions. Project Overview Numerous advances in medicine have been accomplished through the use of machine learning on medical imagery. ", "id": "dreamsofbunnies/up-and-running-set-up-eda-and-images-explained", "size": "12626", "language": "python", "html_url": "https://www.kaggle.com/code/dreamsofbunnies/up-and-running-set-up-eda-and-images-explained", "git_url": "https://www.kaggle.com/code/dreamsofbunnies/up-and-running-set-up-eda-and-images-explained", "script": "os get_image sklearn.mixture skimage GaussianMixture augmenters draw_bbs convert_bbs order_coordinates imgaug tqdm feature matplotlib.patches util transform _convert_bb pandas morphology augmenters as iaa get_info measure draw_image ", "entities": "(('First we', 'briefly challenge'), 'discuss') (('Next we', 'model training'), 'manipulate') (('So 3062 patients', 'twice 105 thrice'), 'got') (('it', 'two columns'), 'see') (('Conclusion Helpful Kernels References Other kernel', 'RSNA Pneumonia Detection Challenge'), 'introduction') (('females', 'boxes'), 'class') (('patients', 'multiple times patientId column'), 'be') (('lung other that', 'surgical pleural space'), 'need') (('Then we', 'DICOM https'), 'look') (('Examine We', 'project'), 'file') (('we', 'attributes'), 'define') (('We', 'tasks'), 'use') (('more detailed explanation', 'evaluation page https www'), 'find') (('html', 'here matplotlib'), 'provide') (('ones', 'mostly white pixels'), 'be') (('876OC 200208 return', 'identical values'), 'combine') (('when box', 'boxes'), 'be') (('where it', 'code block'), 'org') (('control Many images', 'also which'), 'be') (('com sebastiannorena c140b19bf903', 'Medical Imaging https more moaning ia medium'), 'provide') (('We', 'competition evaluation page https also www'), 'know') (('advances', 'medical imagery'), 'accomplish') (('It', 'segmentation'), 'be') (('next several other that', 'kernels'), 'go') (('hjhuney yolo', 'Kaggle locally RSNA'), 'com') (('Lastly we', 'YOLO'), 'point') (('that', 'competition'), 'hope') (('s', 'order'), 'let') (('that', 'pneumonia lung presumed opacity'), 'do') (('lungs', 'images'), 'Locations') (('Radiological Society', 'www'), 'http') (('successful algorithm', 'pneumonia lung opacities'), 'be') (('s', 'available image'), 'spoiler') (('we', 'libraries'), 'return') (('Scoring', 'union thresholds'), 'be') (('com ashishpatel26 beginner tutorial nasnet pneumonia You', 'RSNA Pneumonia Detection Challenge https medium'), 'detection') (('which', 'Pixel Data array'), 'be') (('us', 'submission first file'), 'load') (('that', 'males https www'), 'be') (('bounding boxes', 'bounding box'), 'consist') (('we', 'predictions'), 'show') (('that', 'lung opacities'), 'goal') (('estimation', 'transform https scikit image'), 'allow') (('html', 'warnings https here docs'), 'support') (('Again this', 'image'), 'distribute') (('return', 'kernel https www'), 'shout') (('that', 'radiographic images'), 'sponsor') (('So there you', 'it'), 'find') (('we', 'submission'), 'tell') (('Patch 2D', 'face color'), 'shape') (('we', 'image'), 'get') (('who', 'project'), 'Kagglers') (('the', 'cropping'), 'be') (('we', 'everyone Contents'), 'let') (('pneumonia opacities', 'other conditions'), 'contain') (('100 100 5 Next up we', 'training labels file'), '75') (('more detailed definition', 'Kaggle RSNA Pneumonia Detection Challenge website https www'), 'provide') (('that', 'center'), 'look') (('We', 'tutorial'), 'adapt') (('submission', '00322d4d 1c29 4943 afc9'), 'evaluation') (('then how many', 'occurrences'), 'count') "}