{"name": "very contradictory eda ", "full_name": " h2 con tra dic tion ˌkɒntrəˈdɪkʃən h1 Welcome h1 Random exploration h1 Annotation Artifacts Yes sir h1 The defeat of Napoleon h1 About the author h1 Resources ", "stargazers_count": 0, "forks_count": 0, "description": "You can find them by Joining my Telegram channel https t. Case 2 entailed Premise I will take care of that right away Sir. Bauerstein and give a positive answer. The battle of Waterloo It depends on our personal judgement on some historic event. The great example of this paradox is The Battle of Borodino which has very diverse set of opinions expressed by different historians Some claim it is a victory for the French Others say it is a victory for the Russians The third group exists saying it was a Pyrrhic victory as it ultimately cost Napoleon his armySo the other important question arises How could one define the crossing line between natual language understanding and having a certain probably biased opinion on some facts One would also note the sentences in these strange samples are of a very different length. We should account for no prior knowledge of Agatha Cristie and in this case Bauersten is just a random surname so the pair is neutral. How people reproached me for it And yet could you stuff my pipe No it s just a representation is it not So if I had written on my picture This is a pipe I d have been lying René Magritte WelcomeWelcome to a Very Contradictory EDA This notebook is inspired by a quote by Kaggle Grandmaster Agnis Liukis https www. The defeat of NapoleonLet s continue by filtering out samples with premises consisting of just one word The following pairs are great examples of what could go wrong with the model training for Natural Language Inference some of these sentences require very specific domain knowledge Dr Bauerstein and Alfred Inglethorp are fictional characters in Agatha Christie s detective novel The Mysterious Affair at Styles. Thus Waterloo might be a battle but primarily it is a geographic name thus the pair is neutral. One might argue the last statement as sometimes a person has two names. Sentences of the same length are more likely to be neutral2. Longer sentence naturally conveys more information than a shorter one 1. Clearly we have found some pattern samples with short premises are most contradictory to look at. lv kaggle Regiment Charles Ewart. Waterloo is a municipality in Belgium from which the famous Waterloo battle took its name. So the purpose of this EDA is to find something interesting and not so straightforward about this dataset. I spend a few hours every day to write a single post about a single concept. It helps your body know when it s time to sleep and wake up. This leads to a conclusion that humans judge on the meaning of the sentence pairs given prior knowledge and context. png The one about proximity to Jerusalem is of particular interest Let s check out all the samples with the same premise Recalling the labels 0 entailment 1 neutral 2 contradictionIsn t three miles away from Jerusalem still being close to it I would rather label this pair as entailement however training set says it is neutral. Is Waterloo is the defeat of Napoleon It depends on how one understands the word Waterloo. Given this sentence pair without prior knowledge which is a premise and hypothesis Would you choose premise and hypothesis the same way as in the dataset Would you label these pairs differently depending on that assignment Case 1 neutral Premise Yes sir. com alijs1 To stand out and get some real advantage it is necessary to do something different find something that others didn t notice. In case hypothesis is shorter than a premise it has lower entropy and have more chances to be a summary either neutral or entailement word overlap is measured by the percentage of tokens from the question that appear in the evidence. Saint Paul de Vence is a commune in the Alpes Maritimes department in the Provence Alpes Côte d Azur region of Southeastern France. Given the knowledge that there are thousands of people with the very same name Agatha Christie the pair might be neutral. Let s check this idea by introducing additional feature word count ratio Now let s check the samples with hypothesis being at least twice as long as the premise https storage. Given the knowledge that Mary Westmacott is Agatha Cristie s pseudonym we should say it is an entailement. Thank you Resources1. png con tra dic tion ˌkɒntrəˈdɪkʃən the fact of something being the complete opposite of something else or very different from something else so that one of them must be wrong Cambrigde dictionary a difference between two statements beliefs or ideas about something that means they cannot both be true Longman dictionary The famous pipe. In this case those are just random surnames which are different and are thus contradictionary. With that we will formulate our own set of hypotheseses based on word count in respective sentences 1. Sentences of the different length are more likely to either contradict or entail3. In case longer sentence is a hypothesis as in Case 1 we could assume the pair is more likely to be contradictory or at least neutral because longer sentence have more chances to contain information that contradicts a premise. Hypothesis Yes sir. We will check that assumption on a training set by introducing anothe feature word count ratio Let s check what part of a training has hypotheses longer than premises Now let s check how this correlates to the label our assumption is that contradiction will prevail About the authorThis notebook is published under the Data Science DJ initiative with the goal of giving you distilled pieces of valuable information short and concise easy to comprehend. lv kaggle napoleon_vs_agatha_cristie. com feed hashtag keywords datasciencedj If this work gives you joy or maybe even inspiration please consider contributing to my Patreon account https www. Is Bauerstein a doctor Given you have just read Agatha Cristie s novel The Mysterious Affair at Styles you may recall Dr. Instead of the common approach taking head of the dataset we will take random samples This gives us a chance to find some non topmost samples in training and test set that might be interesting to investigate deeper Let s inspect one of the sentence pairs consisting of Yes sir and I will take care of that right away Sir. Are Alfred Inglethorp and Bauerstein the same person Obviously they are not given you are familiar with Agatha Cristie s The Mysterious Affair at Styles. In case longer sentence is a premise as in Case 2 the pair is more likely to be entailed just because shorter hypothesis has fewer chances to be contradictory. 02324 Draw the density plot Plot formatting. Should our model be aware of the Agatha Cristie and Napoleon https storage. Melatonin is a hormone made by the pineal gland. On the other hand the pair is not Agatha Cristie s Bauerstein vs Agatha Cristie s Alfred Inglethorp so we should treat those names without any connection to the original novel. For example how would you label the pair Agatha Cristie and Mary Westmacott the latter is one of her pseudonyms Following the logic of Alfred Inglethorp vs Bauerstein as the names are different we should say it is contradictionary. Hypothesis I will take care of that right away Sir. Despite being commonly referred as Waterloo battle direct meaning of this word is the municipality not the famous Napoleon s combat. Would The defeat of Napoleon be an entailement if the premise would explicitly say about Waterloo being referred as a battle e. In case hypothesis is longer than a premise it has higher entropy containing more information which in turns increases chances of a contradiction4. Annotation Artifacts Yes sir Despite having very similar meaning the resulting label is different depending on sentence order Why is this happening Word count. D Day is the name of the Normandy landings operation during World War II on June 6 1944. me datasciencedj Following my LinkedIn tag https www. Let s go Random explorationLet s start by looking at the raw data. png Let s recall the sample about Waterloo again. In certain cases one could interprete the very same pairs of sentences differently given different knowledge and context. ", "id": "dmitryyemelyanov/very-contradictory-eda", "size": "8688", "language": "python", "html_url": "https://www.kaggle.com/code/dmitryyemelyanov/very-contradictory-eda", "git_url": "https://www.kaggle.com/code/dmitryyemelyanov/very-contradictory-eda", "script": "seaborn scipy get_word_count_ratio matplotlib.pyplot get_word_count dist_plot pandas stats numpy ", "entities": "(('Sentences', 'more contradict'), 'be') (('Obviously they', 'Styles'), 'be') (('So purpose', 'interesting so dataset'), 'be') (('it', 'Bauerstein'), 'label') (('Alfred so we', 'original novel'), 'be') (('Saint Paul de Vence', 'Southeastern France'), 'be') (('notebook', 'Kaggle Grandmaster Agnis Liukis https www'), 'reproach') (('hypothesis', 'premise https at least twice as long storage'), 'let') (('I', 'single concept'), 'spend') (('Dr Bauerstein', 'Mysterious Styles'), 'continue') (('that', 'evidence'), 'be') (('Why this', 'Word count'), 'Artifacts') (('D Day', 'June'), 'be') (('s', 'raw data'), 'let') (('it', 'knowledge'), 'say') (('I', 'right away Sir'), 'take') (('just random which', 'case'), 'be') (('that', 'premise'), 'assume') (('model', 'Napoleon https Agatha Cristie storage'), 'be') (('explicitly Waterloo', 'battle e.'), 'be') (('others', 'that'), 'com') (('municipality', 'word'), 'be') (('you', 'assignment differently Case'), 'choose') (('s', 'Waterloo'), 'let') (('I', 'right away Sir'), 'entail') (('we', 'respective sentences'), 'formulate') (('maybe even inspiration', 'Patreon account https www'), 'datasciencedj') (('how one', 'word'), 'be') (('more just shorter hypothesis', 'fewer chances'), 'be') (('You', 'Telegram channel https t.'), 'find') (('which', 'contradiction4'), 'be') (('you', 'Styles'), 'be') (('Melatonin', 'pineal gland'), 'be') (('Agatha pair', 'very same name'), 'be') (('One', 'very different length'), 'be') (('pattern samples', 'short premises'), 'find') (('humans', 'prior knowledge'), 'lead') (('it', 'rather pair'), 'png') (('It', 'historic event'), 'battle') (('one', 'differently different knowledge'), 'interprete') (('sometimes person', 'two names'), 'argue') (('just random pair', 'case'), 'account') (('contradiction', 'valuable information'), 'check') (('Longer sentence', 'shorter one 1'), 'convey') (('Sentences', 'same length'), 'be') (('Hypothesis I', 'right away Sir'), 'take') (('they', 'something'), 'ˌkɒntrəˈdɪkʃən') (('Waterloo famous battle', 'name'), 'be') (('Plot', 'density plot'), 'draw') "}