{"name": "visual eda hpa single cell classification ", "full_name": " h1 Human Protein Atlas Single Cell Classification h2 Exploratory Data Analysis EDA h1 TABLE OF CONTENTS h3 0 xa0 xa0 xa0 xa0IMPORTS h3 1 xa0 xa0 xa0 xa0BACKGROUND INFORMATION h3 2 xa0 xa0 xa0 xa0SETUP h3 3 xa0 xa0 xa0 xa0HELPER FUNCTIONS h3 4 xa0 xa0 xa0 xa0LABEL EXPLORATION h3 5 xa0 xa0 xa0 xa0IMAGE EXPLORATION h3 6 xa0 xa0 xa0 xa0SEGMENTATION EXPLORATION h3 7 xa0 xa0 xa0 xa0SINGLE WEAK LABEL INDIVIDUAL CELL EXPLPORATION h1 0 xa0 xa0IMPORTS h1 1 xa0 xa0BACKGROUND INFORMATION h3 1 1 THE DATA h3 1 2 THE GOAL h3 1 3 ADDITIONAL INFORMATION ON CELL MORPHOLOGY h1 2 xa0 xa0NOTEBOOK SETUP h1 3 xa0 xa0HELPER FUNCTIONS h1 4 xa0 xa0LABEL EXPLORATION h3 4 1 INVESTIGATE TRAIN CSV BASICS h3 4 2 WHICH PROTEINS OCCUR MOST OFTEN h3 4 3 Distribution of Multiple Labels Per Image in the Training Data h3 4 4 DISTRIBUTION OF SINGLE LABEL IMAGES VS MULTI LABEL IMAGES WITHIN THE TRAINING DATA h3 4 5 IDENTIFY CORRELATION IN IMAGES WITH MULTIPLE LABELS h1 5 xa0 xa0IMAGE EXPLORATION h3 5 1 VISUALIZE EACH LABEL USING IMAGES WHERE THAT IS THE ONLY LABEL PRESENT h3 5 2 IDENTIFY DUPLICATES WITHIN THE TRAINING DATA h1 6 xa0 xa0SEGMENTATION EXPLORATION h3 6 0 Segmentation Utility Functions h3 6 1 Explore the CellSegmentator Tool h3 6 2 Create Cell Classification Dataset h1 7 xa0 xa0SINGLE WEAK LABEL INDIVIDUAL CELL EXPLORATION ", "stargazers_count": 0, "forks_count": 0, "description": "1 INVESTIGATE TRAIN CSV BASICS Let s investigate the train. This might also give insight into how to detect leakage between the train and test datasets. csv a sample submission file in the correct format1. Vesicles 17 A vesicle is a structure within or outside a cell consisting of liquid or cytoplasm enclosed by a lipid bilayer. The major structural elements of the spindle are microtubule polymers whose intrinsic polarity and dynamic properties are critical for bipolar spindle organization and function. com its7171 created a dataset using this tool. 1 Explore the CellSegmentator Tool Let s use an example image to show how we will be using the CellSegmentator tool and how we will be post processing the generated segmentation maps6. com c human protein atlas image classification is that we are being asked to classify the label s of each cell in every image with only weak image level training data compared to the classification of image level labels as done in the previous competition. Both Mitochondria and Nuclear Speckles are much more commonly found as individual image labels when compared to the gross distribution across all images. progress_apply lambda x get_phash x def tf_load_image path img_size 256 256 return decode_img tf. 4 v4 beta or v4 official if the length of the contours tuple is 3 then we are using either OpenCV v3 v4 pre or v4 alpha otherwise OpenCV has changed their cv2. Most train images only have 1 or 2 labels. We can see below that just because a cell exists in a single label image there is no guarantee that it presents the required green staining to indicate that the protein is localized in the indicated organelle Cell Segmentator Tool Machine Learning and Data Science Imports Built In Imports Visualization Imports Submission Imports PRESETS Stop Tensorflow From Eating All The Memory Currently memory growth needs to be the same across GPUs Memory growth must be set before GPUs have been initialized Define the root data directory Define segmentation mask directory Define the paths to the training tiles for the cell wise classification dataset Define the paths to the training and testing tfrecord and image folders respectively Capture all the relevant full image paths Capture all the relevant full tfrec paths Define paths to the relevant csv files Create the relevant dataframe objects if the length the contours tuple returned by cv2. 6 nbsp nbsp SEGMENTATION EXPLORATIONWe will use the CellSegmentator tool. that are consistently found in cells presenting with the protein of interest Use this to show that many cells in the images may be Negative even though the image level class label is something else. 3 ADDITIONAL INFORMATION ON CELL MORPHOLOGYMost Of The Content For This Markdown Cell Comes From This Notebook Written By The Talented User Saurabh Shahane Nucleoplasm 0 The fluid inside the nucleus surrounded by nuclear membrane is called nucleoplasm It controls the cell s growth and reproduction because it contains cell s hereditary information Protein is localized to the NucleoplasmNuclear Membrane 1 A nuclear membrane is a double membrane that encloses the cell nucleus It serves to separate the chromosomes from the rest of the cell The nuclear membrane includes an array of small holes or pores that permit the passage of certain materials such as nucleic acids and proteins between the nucleus and cytoplasmNucleoli 2 Nucleoli are small basophilic spherical bodies located in the nucleus Usually they can be found in the central nuclear region but may also be close to the nuclear membrane. They are distinguished from thin filaments by their size 8 10 nm and the fact that thin filaments are obviously motile. In contrast small or thin components like the mitotic spindle microtubles and vesicles are very seldom in our train data. 0 Segmentation Utility Functions 6. The cytosol of any cell is a complex solution whose properties allow the functions of life to take place. The Golgi apparatus is comprised of a series of flattened sacs that extend from the endoplasmic reticulum. The most common organelle Nucleoplasm is also the one most commonly used to individually identify an image. Border cells are included when there is enough information to decide on the labels. 2 nbsp nbsp NOTEBOOK SETUP3 nbsp nbsp HELPER FUNCTIONS4 nbsp nbsp LABEL EXPLORATIONThis section will explore the distribution and occurences of the 19 different labels that exist in this dataset4. The organelle also modifies products of the endoplasmic reticulum to their final form. The images in this dataset are confocal microscopy images containinng 4 channels R G B Y. More information about why this task is important can be found here https www. Plasma Membrane 13 The plasma membrane also called the cell membrane is the membrane found in all cells that separates the interior of the cell from the outside environment. Human Protein Atlas Single Cell ClassificationExploratory Data Analysis EDA CREATED BY DARIEN SCHETTLERTABLE OF CONTENTS 0 nbsp nbsp nbsp nbsp IMPORTS 1 nbsp nbsp nbsp nbsp BACKGROUND INFORMATION 2 nbsp nbsp nbsp nbsp SETUP 3 nbsp nbsp nbsp nbsp HELPER FUNCTIONS 4 nbsp nbsp nbsp nbsp LABEL EXPLORATION 5 nbsp nbsp nbsp nbsp IMAGE EXPLORATION 6 nbsp nbsp nbsp nbsp SEGMENTATION EXPLORATION 7 nbsp nbsp nbsp nbsp SINGLE WEAK LABEL INDIVIDUAL CELL EXPLPORATION 0 nbsp nbsp IMPORTS1 nbsp nbsp BACKGROUND INFORMATION1. The steps are as follows Find IDs with only one image level class label Leverage my previously created 256x256 single channel datasets and pull all the cell wise images for all of those single image level class label images. png The dataset is comprised of 21 806 training images and 559 testing images for a total of 22 365 images. 2 WHICH PROTEINS OCCUR MOST OFTEN We Deduce From The Graph Output Below. They may stabilize organelles like the nucleus or they may be involved in specialized junctions. Identify patterns color histograms shapes etc. This is the tool that the competition host team used in annotating the ground truth dataset. This will contribute to a better understanding of functional differences between otherwise seemingly identical cells. Cytosol 16 Cytosol is the liquid found inside of cells. map lambda x tf_load_image x train_ds train_ds. 2 THE GOAL In this competition we will utilize the weakly labelled dataset to create a model that can segment and conduct multi label classification on all individual cells located within a microscopy image. In bacterial and plant cells a cell wall is attached to the plasma membrane on its outside surface. Let s see an example of each label and see what we can find out. nbsp nbsp Red Microtubules nbsp nbsp Green Protein of interest nbsp nbsp Blue Nucleus nbsp nbsp Yellow Endoplasmic reticulum The images are a mix of resolutions 1728x1728 2048x2048 and 3072x3072. Microtubules 10 Microtubules are microscopic hollow tubes made of the proteins alpha and beta tubulin that are part of a cell s cytoskeleton a network of protein filaments that extends throughout the cell gives the cell shape and keeps its organelles in place. For these classes the prediction will be very difficult as we have only a few examples that may not cover all variation normally present within these biological structures will be captured. The organelle is also called the Golgi complex or Golgi body. A give cell can have multiple labels and the segmentation maps and ground truth individual cell annotations are not provided. In addition rare organelles like Aggresome s and No Label Negative also have very little representation in the dataset. Nucleoli Fibrillar Center 3 The Nucleolus Fibrillar Center FC is a sub compartment of most metazoan nucleoli. Nuclear Speckles 4 The nuclear speckles are small subnuclear membrane less organelles or structures also called the splicing factor SF compartments that correspond to nuclear domains located in interchromatin regions of the nucleoplasmNuclear Bodies 5 Nuclear bodies are membraneless structures found in the cell nuclei of eukaryotic cells Nuclear bodies include Cajal bodies the nucleolus and promyelocytic leukemia protein nuclear bodiesEndoplasmic Reticulum 6 Endoplasmic reticulum ER is a continuous membrane system that forms a series of flattened sacs within the cytoplasm of eukaryotic cells. We Deduce From The Output Below. You are predicting protein organelle localization labels for each cell in the image. We will identify differences in the distributions of labels so we can see which organelles are more commonly found alone vs. from_tensor_slices os. 3 Distribution of Multiple Labels Per Image in the Training Data This will help us identify the trivial case one label present as well as the more difficult cases. There are in total 19 different labels present in the dataset 18 labels for specific locations and label 18 for negative and unspecific signal. 5 IDENTIFY CORRELATION IN IMAGES WITH MULTIPLE LABELS Identifying correlations between organelles found in multi label objects may help us deduce which organelles often pair together. with other organelles as labels. 85117 eNqLiYrLN7DNCjDMMIj0N Iz9DcwBEIDfyN QyA2AAsBRfxMPcKTA1MMADVADIo The binary segmentation masks are run length encoded RLE zlib compressed and base64 encoded to be used in text format as EncodedMask. com c hpa single cell image classification overview Author s Take nbsp nbsp nbsp nbsp 1. Centrosomes are made of from arrangement of two barrel shaped clusters of microtubules called centrioles and a complex of proteins that help additional microtubules to form. join kaggle input shopee product matching train_images f_name for f_name in train_gf. The images are available in both. They are primarily composed of polymers of actin but are modified by and interact with numerous other proteins in the cell. ImageBID ImageBWidth ImageBHeight LabelB1 ConfidenceB1 EncodedMaskB1 LabelB2 ConfidenceB2 EncodedMaskB2 Note that a mask MAY have more than one class. Aggresome 15 An aggresome refers to an aggregation of misfolded proteins in the cell formed when the protein degradation system of the cell is overwhelmed. The multi label case is where the weak supervised training becomes more difficult. Instance Segmentation for All Cells Containing the Protein of Interest nbsp nbsp nbsp nbsp 2. The labels are represented as integers that map to the following 0 Nucleoplasm 1 Nuclear membrane 2 Nucleoli 3 Nucleoli fibrillar center 4 Nuclear speckles 5 Nuclear bodies 6 Endoplasmic reticulum 7 Golgi apparatus 8 Intermediate filaments 9 Actin filaments 10 Microtubules 11 Mitotic spindle 12 Centrosome 13 Plasma membrane 14 Mitochondria 15 Aggresome 16 Cytosol 17 Vesicles and punctate cytosolic patterns 18 Negative DATA FILES train. A sample with real values would be pythonImageID ImageWidth ImageHeight PredictionString721568e01a744247 1118 1600 0 0. We Deduce From The Graph Output Below. If that is the case predict separate detections for each class using the same mask. csv file at a high level first. Intermediate Filaments 8 Intermediate filaments are important components of the cell s cytoskeletal system. This will be incredibly useful as it will allow us to identify classify Nucleoplasm s with a high degree of confidence in images containing Nucleoplasm s and other types of organelles. csv the training data information where respective IDs are mapped to labels sample_submission. findContours is 2 then we are using either OpenCV v2. Multi Label Classification of Each Segmented Cell The main difference between this and the previous HPA competition https www. Mitochondria 14 Mitochondria are membrane bound cell organelles mitochondrion singular that generate most of the chemical energy needed to power the cell s biochemical reactions. The main function of the Golgi apparatus is the ability to deliver vesicles or packets of various cell products to different locations throughout the cell. fromarray convert_rgby_to_rgb load_image _id TRAIN_IMG_DIR tqdm. Specifically we use the Coco masks RLE encoding decoding see the encode method of COCO s mask API the zlib compression decompression RFC1950 and vanilla base64 encoding. com rai555 hpa duplicate images in train I wanted to highlight similar images that can be found within the training dataset. His dataset completes the CellSegmentator portion of the above process for us. However the dataset comprises 17 different cell types of highly different morphology which affect the protein patterns of the different organelles. pythonImageID ImageWidth ImageHeight PredictionStringImageAID ImageAWidth ImageAHeight LabelA1 ConfidenceA1 EncodedMaskA1 LabelA2 ConfidenceA2 EncodedMaskA1. Therefore we will iterate over his dataset and we will use it to create the square subset dataset7 nbsp nbsp SINGLE WEAK LABEL INDIVIDUAL CELL EXPLORATIONIn this section we will explore what the different classes look like at a cell level. Centrosome 12 Centrosomes are organelles which serve as the main microtubule organizing centers for animal cells. Actin Filaments 9 Actin Filaments also called Microfilaments are protein filaments in the cytoplasm of eukaryotic cells that form part of the cytoskeleton. to_array train_ds train_ds. Solving the single cell image classification challenge will help us determine precise locations for all human proteins in each individual cell in our large collection of open access images. One slight exception might be the co occurence of microtubles and mitotic spindles within an image 20 Another slight exception is nucleoplasm negatively correlation 30 to 10 with the following in descending order of intensity nbsp nbsp nuclear speckles nbsp nbsp cytoplasm nbsp nbsp plasma membrane nbsp nbsp endoplasmic reticulum 5 nbsp nbsp IMAGE EXPLORATIONThis section will explore the images themselves and show examples of each class as well as certain common combinations. It is the water based solution in which organelles proteins and other cell structures float. Chemical energy powerhouse of the cell produced by the mitochondria is stored in a small molecule called adenosine triphosphate ATP. 4 DISTRIBUTION OF SINGLE LABEL IMAGES VS. MULTI LABEL IMAGES WITHIN THE TRAINING DATA The single label case is the trivial case and will allow us to deduce cell level classification for classes with sufficient data. Images containing 3 or more labels are uncommon Images containing 5 labels only occur 3 times4. read_file path img_size n_channels 3 def decode_img img img_size 256 256 n_channels 3 TBD img tf. We can see that most common protein structures belong to coarse grained cellular components like the plasma membrane the cytosol and the nucleus Nucleoplasm. co s1Lp04V Screen Shot 2021 01 27 at 5 14 45 PM. Vesicles form naturally during the processes of secretion exocytosis uptake endocytosis and transport of materials within the plasma membrane. findContours return signature yet again and I have no idea WTH is going on return the actual contours array Define the paths to the training files for the tile dataset as a map from class index to list of paths Update training dataframe Split The Dataframe Into the Single Label and Multi Label Portions SETUP FOR FUTURE AND SORT def get_phash _id return str imagehash. For each image in the test set you must predict a list of instance segmentation masks and their associated detection score confidence pythonImageID ImageWidth ImageHeight PredictionStringImageAID ImageAWidth ImageAHeight LabelA1 ConfidenceA1 EncodedMaskA1 LabelA2 ConfidenceA2 EncodedMaskA2. The dataset is acquired in a highly standardized way using one imaging modality confocal microscopy. Mitotic Spindle 11 The mitotic spindle is the macromolecular machine that segregates chromosomes to two daughter cells during mitosis. uint8 BATCH_SIZE 64 train_ds tf. Almost all of the organelles only exhibit a slight correlation to other organelles. In these instances we know that every cell can be labelled accurately based on the image level label. pandas train_df rgb_phash train_df. ER serves multiple functions being important particularly in the synthesis folding modification and transport of proteins. Golgi Apparatus 7 The Golgi apparatus is an organelle in eukaryotic organisms that moves molecules from the endoplasmic reticulum to their destination. decode_png img channels n_channels return tf. We wish to classify subcellular protein localization patterns of single cells in microscope images. resize img img_size tf. 2 IDENTIFY DUPLICATES WITHIN THE TRAINING DATA Inspired by this notebook https www. Aggresome formation is a highly regulated process that possibly serves to organize misfolded proteins into a single location. 2 Create Cell Classification Dataset The brilliant Kaggle user tito https www. There are 2 columns nbsp nbsp ID nbsp nbsp nbsp nbsp nbsp nbsp Unique Identifier Which Identifies Which Respective Image Is Being Referenced nbsp nbsp Label A delimited list of labels that exist within a given image The Label column has only 432 unique values The maximum number of unique labels in an image is 5 The minimum number of unique labels in an image is 1 NOTE We will also add a column titled string_label which will be the Label column with the full names of the classes labels replacing the integer representations. This will help us with visualizations and plotting later. AUTOTUNE train_ds check input mask convert input mask to expected COCO API input RLE encode mask compress and base64 encoding Get batch of images Do segmentation post processing pad height pad width. From this we can expect that we will struggle and will be forced to make less accurate predictions on the minor classes. DATASET INFORMATION 4 Channels of Example Image https i. NOTE We already know that the maximum number of present labels for one image is 5. 1 VISUALIZE EACH LABEL USING IMAGES WHERE THAT IS THE ONLY LABEL PRESENT The trivial class of images are those where only one label is present. The Golgi also has important functions in tagging vesicles with proteins and sugar molecules which serve as identifiers for the vesicles so they can be delivered to the proper target. 1 THE DATA BACKGROUND INFORMATIONIn this competition we are predicting protein organelle localization labels for each cell in the image. 637833 eNqLi8xJM7BOTjS08DT2NfI38DfyM Q3NMAJgJJ RkBs7JecF5tnAADw Q9I7b018c5e3a20daba 1600 1066 16 0. ", "id": "dschettler8845/visual-eda-hpa-single-cell-classification", "size": "27874", "language": "python", "html_url": "https://www.kaggle.com/code/dschettler8845/visual-eda-hpa-single-cell-classification", "git_url": "https://www.kaggle.com/code/dschettler8845/visual-eda-hpa-single-cell-classification", "script": "create_input_list Counter plotly.graph_objects plotly.express seg_demo_plot filter_by_class encode_binary_mask label_cell numpy Image multihot_melt seaborn cut_out_cells ListedColormap rle_encoding decode_img get_img_list tif_gzip_to_png glob _mask create_segmentation_maps get_contour_bbox plot_rgb tqdm get_color_path_map convert_rgby_to_rgb matplotlib.patches tensorflow grab_contours _mask as coco_mask hpacellseg.cellsegmentator matplotlib.pyplot typing plot_ex PIL matplotlib.colors download_and_convert_tifgzip_to_png pandas get_phash datetime tqdm.notebook get_new_data tf_load_image hpacellseg.utils pycocotools subprocess_rle_encode load_from_tile_paths rle_to_mask collections flatten_list_of_lists pad_to_square load_image generate_rle_lists ", "entities": "(('you', 'instance segmentation masks'), 'predict') (('17 vesicle', 'lipid bilayer'), 'Vesicles') (('Cytosol 16 Cytosol', 'inside cells'), 'be') (('Nucleoli Fibrillar Nucleolus Fibrillar Center 3 FC', 'sub most metazoan nucleoli'), 'Center') (('we', 'previous competition'), 'be') (('Border cells', 'when enough labels'), 'include') (('segmentation ground cell individual annotations', 'multiple labels'), 'have') (('png dataset', '22 365 images'), 'comprise') (('image level class even label', 'images'), 'find') (('images', 'confocal microscopy containinng 4 channels'), 'be') (('we', 'minor classes'), 'expect') (('multiple functions', 'proteins'), 'serve') (('DATASET', 'Image https i.'), 'information') (('dataset', 'one imaging modality'), 'acquire') (('where respective IDs', 'sample_submission'), 'csv') (('how we', 'segmentation generated maps6'), 'explore') (('different classes', 'cell level'), 'iterate') (('You', 'image'), 'predict') (('functions', 'place'), 'be') (('that', 'cytoskeleton'), 'call') (('macromolecular that', 'mitosis'), 'Spindle') (('us', 'trivial case'), 'distribution') (('trivial us', 'sufficient data'), 'images') (('where only one label', 'images'), 'use') (('us', 'other organelles'), 'be') (('Update training dataframe', 'SORT get_phash return str i imagehash'), 'signature') (('EXPLORATIONThis nbsp endoplasmic 5 nbsp nbsp section', 'class'), 'be') (('COCO API input RLE encode mask compress', 'segmentation post processing pad height pad width'), 'train_ds') (('sample', 'real values'), 'be') (('us', 'access open images'), 'help') (('nbsp SEGMENTATION 6 nbsp EXPLORATIONWe', 'CellSegmentator tool'), 'use') (('s', 'train'), 'let') (('we', 'what'), 'let') (('encode method', 'compression zlib RFC1950'), 'use') (('We', 'Graph Output Below'), 'protein') (('continuous membrane that', 'eukaryotic cells'), 'Speckles') (('that', 'normally biological structures'), 'be') (('dataset', 'us'), 'complete') (('ImageBWidth EncodedMaskB2 mask MAY', 'more than one class'), 'ImageBID') (('already maximum number', 'one image'), 'NOTE') (('that', 'endoplasmic reticulum'), 'comprise') (('they', 'proper target'), 'have') (('main function', 'cell'), 'be') (('Vesicles', 'plasma membrane'), 'form') (('protein degradation when system', 'cell'), 'Aggresome') (('This', 'train datasets'), 'give') (('They', 'cell'), 'compose') (('that', 'microscopy image'), '2') (('that', 'outside environment'), 'Membrane') (('This', 'visualizations'), 'help') (('organelles', 'which'), 'CORRELATION') (('com cell image classification hpa single Author', 'nbsp'), 'overview') (('that', 'dataset4'), 'SETUP3') (('Label Negative', 'dataset'), 'have') (('additional microtubules', 'proteins'), 'make') (('train Most images', 'only 1 labels'), 'have') (('cell wall', 'outside surface'), 'attach') (('titled which', 'classes integer representations'), 'be') (('then we', 'OpenCV v2'), 'use') (('that', 'training dataset'), 'com') (('base64', 'EncodedMask'), 'eNqLiYrLN7DNCjDMMIj0N') (('8 10 nm thin filaments', 'size'), 'distinguish') (('which', 'different organelles'), 'comprise') (('organelle most common Nucleoplasm', 'also most commonly individually image'), 'be') (('v4 otherwise OpenCV', 'cv2'), 'beta') (('Yellow Endoplasmic nbsp images', 'resolutions'), 'Microtubules') (('protein most common structures', 'plasma membrane'), 'see') (('organelles proteins', 'water based which'), 'be') (('This', 'otherwise seemingly identical cells'), 'contribute') (('Chemical energy powerhouse', 'small molecule'), 'store') (('competition host team', 'ground truth dataset'), 'be') (('they', 'specialized junctions'), 'stabilize') (('organelle', 'final form'), 'modify') (('that', 'destination'), 'Apparatus') (('that', 'place'), 'be') (('Almost all', 'other organelles'), 'exhibit') (('Intermediate Filaments 8 Intermediate filaments', 'cytoskeletal important system'), 'be') (('small components', 'train very seldom data'), 'be') (('Mitochondria', 'images'), 'find') (('LABEL INDIVIDUAL 7 nbsp nbsp nbsp WEAK CELL', 'nbsp HELPER 3 nbsp 4 nbsp LABEL 5 nbsp'), 'EDA') (('cell organelles membrane bound singular that', 'biochemical reactions'), 'be') (('steps', 'image level class label single images'), 'be') (('com its7171', 'tool'), 'create') (('microtubule intrinsic polarity', 'dynamic bipolar spindle organization'), 'be') (('We', 'microscope images'), 'wish') (('highly regulated that', 'single location'), 'be') (('DATA BACKGROUND competition we', 'image'), 'INFORMATIONIn') (('organelles', 'labels'), 'identify') (('Images', 'only 3 times4'), 'occur') (('case', 'same mask'), 'predict') (('tuple', 'cv2'), 'see') (('14 Mitochondria 15 Aggresome 16 Cytosol 17 Vesicles', 'Plasma 12 Centrosome 13 membrane'), 'represent') (('which', 'animal cells'), 'be') (('cell', 'image level accurately label'), 'know') (('Usually they', 'also nuclear membrane'), 'come') "}