{"name": "what do kagglers say about data science ", "full_name": " h1 Kaggle Survey Data Analysis Report h1 Table of contents h2 About the survey h2 1 Tell me about yourself h3 Gender age and country h3 Formal education and Major h3 How did you start learning Data Science h3 Employment status h3 Would you like to work in Data Science h2 2 Python Vs R Let the battle begin h3 R and Python across the world h3 ML methods algorithms and skills for R and Python h3 Industry and Job title h3 Main function and percentage of time for specific tasks h3 Experience as code writers h3 What language would you recommend for DS beginners h2 US working Kagglers Annual income analysis h3 American Kagglers annual income h3 Salary VS Gender h3 Salary VS Formal Education h3 Salary VS Job Title h3 Dimensionality reduction and 2D plotting h3 Income Prediction Classification ML problem h2 4 Welcome to Data Science h3 Demographic properties h3 Platforms used for learning h3 Method and Tool to learn next year h3 Time invested on DS training h3 Skills and proofs of knowledge for landing a DS job h3 Learners job hunt h2 Conclusion h3 As for the key takeaways of this Kernel h2 Please upvote if you liked the kernel that would be very encouraging ", "stargazers_count": 0, "forks_count": 0, "description": "5 of started more than 5 years ago This shows the effect of the hype around Data Science over the last few years and also its exponential growth. For me this means that using R or Python is more about a preference than an obligation towards some specific usage. This is sort of expected because those are the two most active communities around the world in Data Science thanks to Kaggle and Analytics Vidhya. Users who use both R and Python equally and at least often will be categorized as Both. Let s recall that logistic regression outputs probabilities. Gender Age and Country general 1. Each of the eigenvalues of this matrix has an inertia similar to expressed variance for PCA and the process to obtain the 2D visualization is the same. In the following not only will you get the answer to nearly any question related to Data Science you ll also be able to predict your salary as a data scientist given some very basic properties see section 3. com Whats ROC curve which basically helps to observe the trade off between precision and recall when reducing increasing the threshold so here we go The AUC score isn t very high that suggest that modifying the threshold wouldn t bring a big improvement to the model. We ll only look at working people coding workers who are defined as such Respondents who indicated that they were Employed full time or Employed part time AND that they write code to analyze data in their current job. Python and use that method This means that people who master both languages have the best of both worlds and use all available methods. 71 is too low there s 5 times as many male respondents as female respondents. Clearly Data Science is THE hype the real deal. Let s check what kind of problem we re having here with respect to the proportion of each class 32 of the US respondents have an income higher than 130k so the dataset is a little imbalanced but nothing too worrying. 2 of learners aren t actually looking for a job. According to Glassdoor the average annual salary for a data scientist is 128k so it s coherent with what we ve just got here. Users who use Python Most of the time often and don t use R just as much will be considered Python Users. American Kagglers annual incomeWell it would be cool to know how much data scientists are getting paid actually Unfortunately even if 73 of the respondents are employed see part1 only 26. Learners job hunting job_hunt Conclusion conclusion About the survey There were 16 716 Kaggle respondents to this survey. Use across the world interactive Tableau visualization countryuse 2. EDIT After doing some research I came across the method that economists and policy makers use to make comparisons across countries involving salaries and economic weel being. Let s see which online platform is the most popular amongst data science learners. Use at the workplace Algorithms methods type of data. Salary VS GenderIt seems that the salary gap between the two genders isn t too big but is still in favour of men. What comes next focuses on how learners perceive the professional aspect of Data Science starting with ranking skills according to necessity and ranking proofs of DS knowledge. In fact I was expecting those results because anytime I ask someone Please where can I learn X efficiently where X is related to Machine Learning I end up with a MOOC recommendation. One should be aware of the job s title when looking for work because the salaries seem to be really different even if many resepondents identify as data scientists Dimensionality reduction and 2D plottingThe most known used dimensionality reduction technique has to be PCA. That being said my goal here is to show you guys how to conduct such a test during your future analysis so we ll let that go no offense to our beloved rigourous statisticians So now the chi 2 test The p value that the chi2 test returns is a positive number. Those are probably students enrolled in data science program or learners fully dedicated to DS learning which is not the case for workers looking for a career switch who naturally have less time at their disposal to invest in DS learning. A logistic regression can take you a long way if you use it carefully. R fares as good as better than Python in the following industries Government Insurance Non profit Pharmaceutical Retail and Marketing. com crawford analyzing the analyzers. Let s check the frequency of use for younger learners younger than 23 Hum there s some progress 5th instead of 7th but nothing flagrant. Industry and Job title As I said earlier there are some cases where both plots proportion and raw number of coders can give valuable informations this is one of those case and I kept both of them here on purpose here s what we notice The plot on the left shows that even if there are more Python users than R users in this survey as we saw earliers we notice on this plot that there are industries where R is still dominant or as competitive as Python. Five files come with this survey multipleChoiceResponses. com krishnakummar donut chart with python matplotlib d411033c960b Employment statusThe overwhelming majority of all participants are employed and as you can notice most of them are employed full time. Gender age and countryOuch The gender gap is huge Unfortunately this is common in the tech industry. We don t always need very sophisticated models to get good enough results in Machine Learning instead we need to carefully choose the features we re going to use the parameters for the models etc. Let s apply it here first comes the contingency table To be entirely accurate and honest we shouldn t be applying the chi 2 test here because one of the hypothesis is that all values should be higher than 5. Python outdoes R by a large margin in the tech industry which is also the industry with the most respondents in this survey which makes sense since Data Scientist is a tech job. This means that R users tend to work in companies that mostly use relational datasets only while Python users are more versatile Again this tells the same story as the algorithms plot did and there s a link between them if you re going to work with text image data you better use neural networks and we saw that only few R users do so hence the correlation Our takeaway from the 4 previous plots is The proportion of R coders using algorithms methods datasets related to deep learning computer vision NLP. Experience as code writers Here s what we observe 1. Let s see what we ve got EDIT Credits to Chris Crawford who inspired me with his very nice goose shaped WordCloud that you can check here http www. We re not going to build a sophisticated model but rather a simple logistic regression easily understandable and as we ll see the results won t be bad at all. csv Participants answers to multiple choice questions. As for the key takeaways of this Kernel On the analysis side The gender gap in Kaggle users is huge unfortunately at least for the moment Most of Kagglers are either master s or bachelor s graduates who had CS as a major and are now employed full time. But for R users it seems like they all work in areas where only some specific algorithms methods are being used and that s what we ll kind of confirm thanks to the next visualizations. RespondentTypeREADME. hobby and fun were also frequently used it suggests that some people practice data science and participate in competitions as a hobby to have fun not because they want to work in that field. Nearly all of them have been writing code to analyze data Tenure for 2 years at most. If we combine Always and Most of the time we find that 35. The truth is as Mr gmobaz wisely pointed out in the comment section there s no fight and no clear winner. But when it comes to new emerging fields like reinforcement learning NLP and computer vision Python is miles ahead. Since some responses were available for both questions like Bayesian Techniques for example the answer to those two questions overlap hence the utility of displaying one next to the other. aspx Tutorial AP for people who never heard about this test it s a really simple explanation followed by an example of its use. Without surprise most of working kagglers who aren t yet working as data scientists would love to switch careers That being said some of them don t which raises the question of the motive of using Kaggle for people who wouldn t want to work in Data Science. Further we re going to use a much higher C to build the final classifier. Annual income for US citizens us_salary 3. That s why we plot the ROC curve http www. To learn more about precision recall and why those two measures are more accurate than accuracy see what I did there check the following link http tryolabs. Personally I started learning data science both at university and with online courses at the same time. BUT R users are a lot more enclined to recommend Python than Python users are to recommend R Indeed only 2. txt is necessary when you want to understand the behaviour of a specific community of kagglers and schema. 1 of learners started their DS training at most 2 years ago when only 3. When dealing with categorical variables the two most used techniques are Label encoding That means replacing by numbers for example Bachelor s degree would become 1 Master s degree 2. schema. General job boards LinkedIn Now to the time spent looking for a job. The average for male kagglers is a bit higher than the average for female kagglers. png That s not so bad actually. stats has all statistic tests you could need. This makes sense that part of the plot must contain kagglers who have just started their careers between 18 and 25 years old and seem to work full time as business data analysts. First thing I noticed is that for a given method algorithm except Neural Networks GANs CNN RNN the of respondents who code with both languages and use that method is higher than the of respondents who code only with R resp. o who either hold senior positions in their workplace or work as private consulting data scientists that have been writing code since forever. com en Multiple_correspondence_analysis to get more technical you can check the references in the links. Platforms used for learning Interesting Kaggle and Online courses seem to be the favorite platforms for data science learners. 34 of respondents hold at least a bachelor degree. Tell me about yourself We ll start with a general overview of the demographic properties. draw a circle at the center of pie to make it look like a donut Set aspect ratio to be equal so that pie is drawn as a circle. The best way I found to do so was to use Tableau and have an interactive plot with pie charts of Python of R of both for every country that s present in the survey and that has more than 50 respondents else it s included in Other. First encounter with Data Science firsttime 1. Seems like most Kagglers are either Americans or Indians. So far we ve seen how much time learn spent on perfecting their Data Science skills we ve seen the factors that they consider to be important for landing a job in DS and we ve seen what s the most important way to prove ML DS knowledge. Some are still students others are looking for a career switch but they all have something in common they re learners So what are platforms are using for this purpose What do they want to learn most What job are they looking for Well let s see if we can answer those questions According to the respondent type README file learners can be Students People formally or informally learning data science skills Professionals looking for a career switch Unemployed but looking for work peopleWe first extract a dataframe containing instances having at least one of these characteristics. 30 of R coders are Statisticians Data Analysts or Business Analysts while only 11 of Python coders have one these 3 job titles. Would you like to work in Data Science An interesting question was asked to kagglers in this survey Are you actively looking to switch careers to data science. R users and compare between the percentages for both communities. For now these results here tell us that if you re a Python user your use of algorithms methods may differ according to where you work what you do. So what s the volume of work for each task gathering data visualizing it. Experience as code writers tenure 2. Let s see how all of the words are linked Curiosity and interest and interesting were frequently used it suggests that some answers were Interest towards machine learning for example. The distribution shows that most salaries lie between 50k and 140k USD. The same thing happens with algorithms where a really small proportion of R users work with CNNs RNNs type of Neural Networks and Python users seem to use a bit of every algorithm out there. Anyway we ll only check the salary for US citizens as it s the most represented country in this survey so it would yield the most significant results. 63 of Python users 30. com en Correspondence_analysis and here https www. Possible answers were frequencies so I tried to check the of each frequency for Python resp. In the following we re going to see which words were the most often used by non switchers who answered this question. Main function and percentage of time devoted to specific tasks tasks 2. Demographic properties of learners community demographic 4. Taking only never the gap is bigger 6. 4 of them hold a doctoral degree others attended college without earning a degree. What about ways you can prove your knowledge of ML DS Learners were asked What s the most important way you can prove your knowledge of ML DS. Two different questions very related to each other were asked to the workers community to see what kind of algorithms and methods they use at work. Personnaly I m a Python user but when I first discovered MCA I found more performing libraries on R than on Python and that often happens for statistic tools and that s what s beautiful about R and Python knowing how to use both of them really makes one able to use some techniques a lot more efficiently. e choices were not given. ML methods algorithms and skills for R and Python EDIT Credits and thanks to Mateus for pointing that since Python users outnumber R users using countplot may not always be the right choice for meaningful visualizations and we should use of R Python users instead like what proportion of Python users verifies X property. DS learners are constantly striving for development The most important factor during their job hunt by far is whether the job would hand them opportunities of professional development. That shows that data scientist aren t really open to work with whatever technology the company is using they have strong preferences that are crucial for chosing one job over another. Most learners hold a bachelor degree earlier for all respondents the most frequent education was Master level. Let s recall what we found earliers More than 70 of R coders use data visualization ML Methods and more than 20 of them are either business analysts or data analysts Role. Welcome to Data Science This Kaggle Survey participants weren t all experienced data scientists far from that Many of them me included are still aspiring to become data scientists and have a long way to go. A great proportion of R coders are skilled in unsupervised learning outlier detection time series analysis and supervised learning. This question was included in the survey and it s one of the very few questions that only came as a free form question i. Since we re dealing with a sparse matrix I think it s better to use l1 penalty that shrinks coefficients to 0 to keep the most important features colorscale 0 rgb 5 10 172 10 rgb 40 60 190 20 rgb 70 100 245 30 rgb 90 120 245 40 rgb 200 200 200 4500 rgb 220 220 220. The problem with PCA is that it works best for numerical continuous variables which is not the case here. e when there s a natural order between the possible values of a variable for Formal Education for example. Instances with 0 5 100 years old don t make much sens. My guess is that the other respondents are either already working as data scientists in which case Yes No would have no sens or are still students. Personnaly I m not a big fan of converting every salary to USD and then treat all the respondents the same to calculate values such as median of salary of all data scientists because being paid 100k in the US is absolutely not comparable to being paid that same amount in India or Portugal for example. In fact if you recall in the methods plot for example we said that Both users were having the best of both worlds. csv Currency conversion rates to USD. The bottom part of the plot contains excusively people whose income is above 130k. What next ML Method Tool platforms 4. 63 of Python users recommended R while 23. For example running this by clicking run or pressing Shift Enter will list the files in the input directory Any results you write to the current directory are saved as output. com kaggle docker python For example here s several helpful packages to load in linear algebra data processing CSV file I O e. In the US more and more universities MIT Columbia Stanford. PS Credits to Andreas Mueller creator of wordcloud for the following code of the class GroupedColorFunc. That being said there s no woman with an income of 400k or higher while there are some outliers in the men part. S We saw on the first part of this EDA several countries don t have many participants on this survey. challenge project and competition were popular too and yeah kaggle is a pretty great platform for fierce competitors looking for challenging subjects Okay so we ve pretty much covered all the demographic features of the dataset except the income but an extended analysis is dedicated to that below we can move on to the second part which tries to answer the following question How do Python and R fare in Data Science 2. 5 by default is used to binarize the output i. It may be students looking for internships or employed people checking from time to time if an exciting opportunity is out there somewhere. Most used platforms for learning Data Science and their usefulness platforms 4. We notice that most of R coders and Python coders are data scientists well the opposite would have been very surprising A great proportion of Python coders a cumulative 25 are either Software Engineers or Machine Learning Engineers while only 5 of R coders occupy those two roles Seems that really few R practitioners are considered ML masters. As the dataset is imbalanced maybe reducing the threshold can yield better result because it s less probable to have a very high income. Keep in mind that the following plot is entirely interactive if you find that the pie charts are small there were too many on Europe I reduced the size so that the pie charts don t overlap you can zoom on your country of interest and do many other things I let you discover all of that Such visualizations can be obtained using Tableau Public which is completely free to use. Building the predictive model L1 penalty achieves high sparsity percentage of zero coefficients of solutions. Dig as deep as I can in this survey s results to expose interesting insights that could give anyone a better understanding about the Data Science world as it is in 2017 be it from a worker point of view or a learner s one. Indeed the most used platforms are the most useful according to the last 2 plots. So I perfectly identify with the results to this question To plot basic donut pies such as the one above here s a nice and brief tutorial http medium. Let s now see what platforms are these learners using in their quest to becoming data scientists. You can read more about it here https www. Without suprise the chosen key words in green are among the most used in the answers that were given. So yes this supports what we saw above R coders seem to diminish the importance of putting work to production. A large proportion of Python coders use basic classic stuff such as logistic regression but a non negligible proportion focuses on deep learning as opposed to R users. Then couple of months later I discovered Kaggle and its kernels quickly became my favourite learning tool. Speaking about that let s see where R and Python coders work and what tasks do they perform at work. The age median is about 30 years old and most participants are between 25 and 37 years old. I remember the first time I asked my manager during my internship why do we use Python rather than R and he simply replied We always want to put our models into production and doing that using R can really be a pain in the ass. The most important file is multipleChoiceResponses. Which language would you recommend for beginners learnfirst 3. com blog 2013 03 25 why accuracy alone bad measure classification tasks and what we can do about it. Here s the code to obtain the excel file I used for my Tableau plot. html sphx glr auto examples colored by group py Get text data from the freeform words below will be colored with a green single color function Words that are not in any of the color_to_words values will be colored with grey Create a color function with multiple tones Apply our color function Plot modify to unique values Convert all salaries to floats Remove Outliers I have uploaded an image instead. 83 of them gave a proper answer to the income so we can t beextremely precise here. Formal education and Major education 1. I also expected Physics to be higher than Electrical Engineering but I was proved wrong on this one too by a quite far margin. Here we notice for example that we have 0 computer scientist that had Psychology as a Major. We notice that the most important feature is the answer to the question Have you been coding for more than 10 years Comes after that the answer to Are you between 18 and 25 years old That s really good scores considering that Logistic regression is the easiest and most simple classifier to build and understand We only selected 18 demographic features and one hot encoded them So with just basic preprocessing and a basic model we get 68 precision and 60 recall Accuracy correct outputs total outputs is not so bad too but that s expected since the dataset is a bit imbalanced. The third one is the programming languages and frameworks they d be working with. EDIT Credits to sowhit for pointing out that the barplots could have better readability when the bars are ordered. The top part of the plot contains excusively people whose income is below 130k. Python Vs R Let the battle begin What do you use for data science stuff R or Python must be the question we all got more than once as aspiring data scientists. Seaborn s distplot fits a univariate distribution using kernel density estimation KDE http en. Kaggle They can t wait to learn more about Neural Networks and Tensorflow they firmly believe that the future of deep learning is bright and they re probably right. We notice with the bins that most kagglers have an income between 70k and 130k and that the fitted distribution is skewed right which means there s much more outliers towards the right unusually high incomes than towards the left. That being said nearly 1000 learners from a total of 5494 spend more than 11 hours a week. in a DS job Both type of coders spend most of their time gathering data 38 for Python users 40 for R and building models 19 for Python 18 for R. This must have something to do with Andrew NG s famous course who helped introducing Machine Learning to a huge amount of people. csv This file includes all the questions that have been asked explains each one of them and precise to whom they ve been asked learners coders. A statistic that would be more meaningful is the of learners amongst kaggle respondents of each country. For narrative reasons my second section was named Python Vs R Let the battle begin and I painted that as an epic confrontation. Thus it makes sense to see here that most of R users role at work is to analyze data for business purpose. EDIT I adopt here a classification approach and restrict it to US Kagglers. This plot gives a great insight about the use of either language according to the data we have to handle. PCA has a less known version of itself very well suited to dealing with categorical variables it can produce really beautiful plots. That s it for the ML model part I hope this can help beginners in DS to gain more experience and informations and I would encourage you to copy the same preprocessing and use more sophisticated models like SVM or Tree based models Random Forest Gradient boosting. I expected that a lot more people would have Mathematics as their Major but I was wrong. In my very long and entertaining thankfully quest to becoming a data scientist I ve been asked some straightforward and basic questions and still I found it hard to give a proper answer. 130k is an arbitrary treshold I just tried to separate between the richer kagglers in the US and the others let s see what we ve got. Most learners think that a degree is more a nice asset to have than a necessary one but I m not so sure about that. Users who use R Most of the time often and don t use Python just as much will be considered R users. io word_cloud auto_examples colored_by_group. Simply put It s a technique that use chi 2 independence tests to create a distance between row points that will be further contained in a matrix. Except for the Data Scientist role and Student Researcher it seems that the roles where we have the highest of R coders are the roles where the of Python coders is the lowest and vice versa Ouf This confrontation between R and Python is really intense let s take a quick break from it to get our break back by asking ourselves the following question How dependant is the job titile of the major of a worker Up until now we ve been analyzing the dataset through visualizations and significant plots. Well if you see again the methods algorithms plot per language programming you ll notice that logistic regression is always the most used technique Accuracy can be misleading in classification problems especially when dealing with imbalanced datasets don t forget about precision and recall Well it seems like everything that needs to be said has been said I really hope that anyone that comes across this kernel ends up learning something new either on the analysis part the technical one or even both of them I m open to any suggestions and would love to get some feedback so don t hesitate to contact me or put something on the comment section. Industry and Job title Correlation to Major industry 2. That being said nearly all countries use Python more than R. Conversely smaller values of C constrain the model more. Kaggle s learners community learners 4. A similar technique Multi Correspondence Analysis MCA is used to achieve dimensionality reduction for categorical data. The median for people who attended college but hold no degree is higher than the median for Bachelors and Masters holders BUT the first quartile Q1 of first community is way smaller than the first quartile of the other two communities. The brown box contains men only. We notice that some of the highest proportions of learners are found in Nigeria Egypt Kenia and Indonesia. org wiki Kernel_density_estimation. All of them have been writing code to analyze data for more than 10 years That part of the seems to contain male kagglers older than 45 y. We drew a pink box to investigate further in what way the instances within that box look alike we ll see that below. Removing those instances here we ll keep them later on as the age doesn t affect the other properties would yield more significant results. 43 of R users almost always push their models to production. Thank you for your time Please upvote if you liked the kernel that would be very encouraging. Career plan and Motivation for using Kaggle switchers 2. The second most important factor is the office environment they would be working in. The pink box contains 6 men and 4 women all of them hold either a Bachelor s or a Master s degree. txt This is to understand how instances are being defined by Kaggle who are the learners who are the workers who are the the coding workers. In our 2D plot we observed the same thing the first box contained no data scientists only analysts while the second one contained mainly data scientitst. 71 of coding workers in India are still frequently using R and 45. Actually as we ve seen before Part 2 only 20 of data scientists time is devoted to Machine Learning and model building Well we re going to respect those proportions and actually include a simple model that predicts whether the income of an american kaggler is higher than 130k or not a classic classification problem The 2D plot we ve got above makes us optimistic because as we ve seen there s an overlap zone but the two populations seems to be clearly separated to some extent so hopefully our Machine Learning will learn this distinction as well. Expose various data analysis visualization tools for data science beginners who read this notebook such as plotly library seaborn matplotlib Tableau and MCA technique for dimensionality reduction when dealing with categorical variables providing references and link to tutorials when possible. We drew a brown box to investigate further in what way the instances within that box look alike we ll see that below. com what is one hot encoding why and when do you have to use it e3c6186d008f for more explanation. I ve personnaly never used R production wise so I can t relate but I guess that these statistics support my manager s words EDIT I actually recalled that there was a specific question in the survey for workers which was At work how often do the models you build get put into production and decided to delve deeper into this aspect. What I found more surprising was the proportion of learners in China 47. We shall now begin the analysis first comes the demographic overview. It s more about understanding the synergy between both languages how the complement each other and where each one seems to perform best. So looking at the turquoise blue box and comparing it with the light pink and mustard yellow boxes we notice that the majority of people with a professional degree are between Q1 and the median while the majority of Bachelors and Masters holders are between the median and Q3. If we combine Never and Rarely we find that 22. We notice that there s a little progress compared to the general proportions 16. We can also notice that people who use Python just as much as R are also recommending Python more than they are recommending R. com chi square test independence. Kaggle Survey Data Analysis Report Mhamed Jabri 11 15 2017 So what s Data Science anyway What languages do you guys use most What s the most valuable technical skills for a Data Scientist and maybe the hardest one What does a Data Scientist specifically do at work. Let s now see what the learners are looking forward to learn next year Method and Tool to learn next yearAt first I drew the two plots separately but when I saw the results I was like no way I m going to put one next to the other. Let s check young kagglers leaving in the US Aha College University becomes the second most used platform and it isn t anymore outnumbered by Kaggle. csv helps understanding the questions. In fact if you want to see problem that could arise when combining all countries check what heppened in this great kernel http www. Prior work experience in ML comes in first position and I have agree with that. I would like to introduce to beginners how we evaluate dependacy between two categorical variables in statistics. 05 is a pretty small value for logistic regression and we see that we achieve a sparsity of 91. Ont Hot encoding That means binarizing the category see here http hackernoon. Let s now see how useful are these same platforms for learners. Computer Science majoring instances are twice as many as the Mathematics ones. A little more than 10 are actively working for a job spending at least 6 hours per week job hunting. Interesting India has more data science learners than the U. The plot on the right shows that when it comes to industries it s R who seems to be more versatile When we see the proportions we notice that it s way more balanced for R than it is for Python. We ll use the demographic properties and some of related to work answers like language preference to visualize the respondents. For Python coders the second most voted duration is 1 2 years while for R coders the second most voted duration is actually More than 10 years We conclude that R coders tend to be more experienced as they ve been writing code for a longer period of time whil Python started to be more widely used during the 5 last years What language would you recommend for DS beginners As expected the majority of each community recommended the language it uses that s fair. This means that a part of the R community is now convinced that Python may be the real deal for Machine Learning. The data that we ve been given will help us understand what platforms people use to learn data science what s the most valuable skill in data science what data scientists are looking for when they re job hunting what programming language is most frequently used and a lot more. Statistics show that women hold only 25 of computing jobs which is already low but what we re having here is worse. According to Glassdoor Data Scientist is the best job in America for the second year in a row while a new study by CareerCast. Employment status prolife 1. 27 of R users almost never push their models to production. Time invested on DS training Most learners spend between 2 and 10 hours a week learning data science which is kind of the amount you would spend if your learning consists of one Online Course at a time. 5 spend an hour or two a week looking for a job which means that there s no urge to look for a job. Formal education and MajorNearly half of the kagglers who took this survey are Master s graduates impressive. At first I was a bit surprised when I saw that College University comes as the 7th most used platform but then I remembered that learners include professionals who are looking to career switch learners median age is 26. Most of them are between 18 and 25 years old and work either as Data Analysts or Business Analysts. Generally both type of coders seem to invest the same time for nearly all tasks. That s the best solution when the variable is ordinal i. Let s now analyze the learners community of Kaggle 4. So when a learner is finally ready to start his DS career what resources does he use to find a DS job how much time does he spent looking for a job and what are the characteristics of his dream job Let s answer that Learners job hunt So the top 3 resources according to learners are 1. 6 for the machine learning stuff Let s now embark on a journey of Data Science discovery. com definition relational database while only 56 of Python users deal with that kind of data. Let s see for how many years kagglers have been learning data science. 45 of coding workers in Australia is using R That s more than python coders in Australia. conversionRates. We ve seen that Kaggle and Coursera were the most used platforms for DS learning. Here we got p 0 so basically our features are as dependent as mathematically possible Okay the break is over take your sit back and enjoy the rest of the battle Main function and percentage of time for specific tasks It seems that most R users tend to perform tasks related to business data analytics part. Most important skills for landing a job in Data Science skills_job 4. So it seems that Python coding workers who use exclusively Python are nearly twice as many as those who use exclusively R. The median follows a reasonable trend the higher the education the higher the median annual income except for doctoral education that is shadowed by professional degrees. There was a question about frequency use of Python and R frequencies ranging from Rare to Most of the time. Indeed 28 of Python programmers consider themselves to be skilled in Computer Vision when only 7 of R programmers do For NLP the difference is not as big but still 33 VS 19. 46 for Python users and 11. Demographic analysis demographics 1. R and Python across the world I was really curious to know how those two languages fare across the world by comparing the proportions of users in each country. Dimensionality reduction and 2D plotting MCA mca 3. com mhajabri salary and purchasing power parity. The following words data science mining big bigdata machine learning are deliberately plotted in shades of green. More precisely All in all 41. That being said I wouldn t agree with the fact than MOOCs are more important that a Master s degree and I don t think that companies value Online Courses certificates more than a Master in Mathematics Computer science or any related field. Those are countries where data science is at its very start and it finding as much learners as practitioners make sens. US working Kagglers Annual income analysis For this part of the analysis we ll select 20 features mostly demographic that can greatly impact the income of a person and that will be further used for dimensionality reduction. On the Methods part Data visualization and Logistic Regression seem to be fundamental assets for R users since 70 of them use those two methods. Kaggle has a very small proportion but that s natural people usually come to kaggle to complete their learning once they ve got the basics. Tableau is sometimes a great tool to create interactive plots so maybe keep that in mind To create a map filled with pie charts as below here s a very concise and step by step tutorial http onlinehelp. Income by gender gender_salary 3. X_train and X_test are obviously very sparse a lot of 0s on each row so we ll keep that in mind when building the model. Tech Specific job boards Stack Overflow recruitment platform for example 3. In this plot the factors are ordered according to the criteria Most Important. For python users scipy. We notice with this plot that they re also the platforms that are considered to be the most useful amongst learners and they re far ahead of the third most useful platform Projects. 29 of the total instances are either from the US or India. Okay I got to admit this took me by surprise. com christinampoid what affects your compensation Salary vs Major the very accurate point made by DrGuillermo in the comments. Enjoy the ride Table of contents About the survey introduction 1. This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python docker image https github. Often programs are either focused on mathematics or on computer science so a student must complete his training alone. Demographic properties First thing first let s see which countries has the most learners check their age and the gender distribution amongst them. When we were looking at salaries for all the job titles we found that business analysts data analysts tend to be paid less than data scientists. This Kaggle survey aims to dig deeper and understand how data science is perceived through expert data scientists and aspiring data scientists using this wonderful platform. Hands on experience is always valuable for recruiters especially when it comes to coding stuff. EDIT I did some research and found that actually that often the entire program s name is Electrigal Engineering and Computer Science so that explains the resulsts here. Each column contains the answers of one respondent to a specific question. That s expected actually because salary is continuous and if we take for example one person with an annual income of 120k and another one with 135k they probably have similar properties even if with our treshold they belong to two different classes. csv which contain most of the informations that will be needed. That being said the PhD box contain outliers its whiskers are more extended than those of the Professional degree box so all in all doctors are the best paid kagglers. 8 of the 9 instances are older than 45 years old and work as independent Data Scientists or pure Scientists. Source link https amueller. 27 of Python users deal with Image datasets and nearly 60 of them deal with text datasets. Learners favourite platform for learning is. He made the code fully public for people who want to use specific color for specific words and made an example. Income Prediction Classification ML problem Up until now we ve been analyzing and visualizing the data we ve got from Kaggle. Couple of months ago polls suggested that Python has definitely overtaken R and became the leader language for Data Science. com mhajabri salary and purchasing power parity up. 07 of Python users 23. com current pro desktop en us maps_howto_filledpiechart. That being said there are some cases where both plots yield interesting informations and I ll show that below. Also time series mastery seems to be more important for R users than for Python users. R language 2. On the other hand Python users are doing a bit of everything and we find pretty high percentages for three tasks Business analytisc building ML prototypes and build ML services that improve the product. If you prefer a general income prediction predict the exact value of the income for all countries check this http www. And when we review the tools well the results are quite the same since people want to master TensorFlow which is the most used tool for deep learning Let s now see how much time kagglers learners spend on DS learning on those platforms and for how many years have they been learning DS ML. That being said the biggest difference observed comes for putting work into production 12 for Python users 7 for R. csv Each time a respondent selected Other and filled the Please specify part his answer was added in the freeform. I d rather convert all the salaries amounts to dollars but treat each country separatly I think this makes a lot more sensethan checking the median for everything. The most voted duration of coding for both R and Python coders is 3 5 years. read_csv Input data files are available in the. The thing is in several countries universities didn t have and still don t have specific data science training. The deep learning hype is real Methods Kagglers want to learn most are Deep Learning I consider Neural nets to be included in Deep Learning by a really big margin. Only 3012 respondents answered this question. Yet it remains somewhat hard to set boundaries and axioms for Data Science indeed while we can say something like Being good at probabilities and stochastic processes guarantees success as a QR sorry fellow financial engineers there s no equivalent for Data Science at least in my opinion. Large values of C give more freedom to the model. For better readability and since the subject and content are both different it was better to devote a different kernel to the global analysis you can find it here http www. Okay so up until now we ve done a demographic overview of the respondents we ve analyzed the coding workers community and their use of programming languages and we conducted a study on the annual income for the workers community while also adding a little funny classification machine learning problem. Salary VS Formal EducationLet s recall what the boxes mean in seaborn s boxplot the documentation says The box shows the quartiles of the dataset while the whiskers extend to show the rest of the distribution except for points that are determined to be outliers. They devote around 8 10 hours a week to their Data science training and when looking for work the most important criteria for them is how much they can improve professionaly. Let s move on to the brown box. offer specific data science masters or at least machine learning courses for students who are interested. We only do so to shrink coefficients to 0 a keep only what the models considers to be the most important features. Let s see what s the formal education of our learners. Salary VS Job TitlePeople labeled as Machine Learning Engineers or Data Scientst have an annual average income higher than Data Analysts Business Analysts Statisticians or Programmers. The questions covered a broad spectrum starting with general demographic questions before moving on to specific DS ML questions for both the working community and the learning one. Preprocessing and feature engineering Our dataset only contains categorical variables even the age was binned at some point. In the other hand only 26 of american kagglers are still in the learning phase. When you conduct a study about income make sure not to merge all countries together as that could lead to biased and generally false results. Let s do some Machine Learning Income Prediction prediction 4. Companies job listing pages 2. This survey will allow us to dig deeper and understand We shall now begin First we must identify R and Python users amongst the instances. On the other hand even if Neural Networks and Nature Language Processing aren t the most used techniques amongst Python users they re the techniques where the difference between R and Python users is the biggest 48 vs 25 for the first and 32 vs 19 for the second. Still I thought I would find more freelancers independent workers given the fact that several companies hire private data scientits consultants and the fact that some data scientists dedicate a lot of their time to Kaggle competitions. The salary comes fourth and is close to other factors so it doesn t seem to be too problematic for aspiring data scientists maybe that s because they re already quite assured that the salary would be great Conclusion Unfortunately every story eventually comes to an end and looks like we re at the end of this one too Through this EDA kernel I did my best to achieve three things 1. is very small and all R coders seem to follow the same path clear focus on some specific areas. Let us load those files. On the image part let s recall that in ML skills we found really few R users that are skilled at Computer Vision On the other hand 78 of R users deal with Relational data http searchsqlserver. Income by job titles jobtitle_salary 3. The lower the p value the more correlated are our 2 categorical features. freeformResponses. Income by Academic degrees education_salary 3. This is why generally in most countries students feel like they learn about data science a lot more outside their college. Time spent during Data Science learning time_learning 4. We also notice that the relative usefulness of a platform is strongly related to the number of learners using that same platform. US working Kagglers Annual income analysis salary 3. On the other hand only 7 of R users deal with image datasets and 47 with text data set. Skills and proofs of knowledge for landing a DS job For Data Science learners there s no doubt mastering Python is the most important skill for a job in Data Science we could add that in our Python VS R duel. Master s degree and PhD aren t well ranked that s expected since most learners consider a that a degree is not necessary to land a job in DS. 5 predict positive class else predict negative class. Coursera has a clear edge over Udacity edX and DataCamp. Let us now compare between the use of those two languages at the workplace. On the technical side When you want to measure correlation between two categorical variables chi2 test is a good start. I would have guessed that the proportion of learners in China is similar to the one of the US but that s not true at all according to the survey responses. 12 of R users recommended Python. Here s a more sophisticated plot for the distribution of the annual income. I wasn t aware of that as in France the two programs are always separated How did you start learning Data Science The most popular way to start learning Data Science Machine Learning is Online Courses. Create a basic classification problem from the dataset and solve it with the most simple machine learning model logistic regression then show the usual metrics we use in those problems accuracy precision recall and auc roc score. We re going to perform one hot encoding for all the categorical variables and build a training and a test set. html to followSome countries are still heavily relying on R. That s primarly because amongst learners we find students who are yet to finish their studies. Let s not forget that some are still enrolled in College University and others workers who answered yes for career switch may be looking to switch position within the company they work for. com revealed data scientist jobs have the best growth potential over the next seven year. Ladies and gentlemen let me introduce to you the one and only chi2 test of independence I d recommend reading this this http stattrek. We ll try to see if it s possible to construct clusters by salaries. This means that there are more and more women involved and interested in learning Data Science that s good news. There s an area where both poupulations overlap and we can t really separate between two instances having incomes 130k or not. ", "id": "mhajabri/what-do-kagglers-say-about-data-science", "size": "51375", "language": "python", "html_url": "https://www.kaggle.com/code/mhajabri/what-do-kagglers-say-about-data-science", "git_url": "https://www.kaggle.com/code/mhajabri/what-do-kagglers-say-about-data-science", "script": "chi2_contingency (WordCloud __call__ accuracy_score numpy seaborn recall_score subprocess get_single_color_func) f1_score get_color_func sklearn.linear_model auc plotly.tools matplotlib.pyplot precision_score plotly.offline plotly.graph_objs pandas roc_curve LogisticRegression GroupedColorFunc(object) scipy.stats __init__ check_output sklearn.metrics wordcloud ", "entities": "(('users', 'worlds'), 'say') (('that', 'answers'), 'be') (('Instances', 'much sens'), 'make') (('it', 'salaries'), 'try') (('most important you', 'ML DS'), 'ask') (('Salary VS Job TitlePeople', 'Data Analysts Business Analysts higher Statisticians'), 'label') (('how many years they', 'DS ML'), 'be') (('nearly 60', 'text datasets'), 'deal') (('biggest difference', '7 R.'), 'say') (('task', 'it'), 's') (('Annual income', 'US citizens'), '3') (('more you', 'links'), 'com') (('second one', 'data mainly scientitst'), 'observe') (('that', 'further matrix'), 'put') (('s', '5th instead 7th'), 'let') (('most salaries', '50k'), 'show') (('using', 'really ass'), 'remember') (('who', 'example'), 'make') (('Python', 'leader Data Science'), 'suggest') (('time series Also mastery', 'Python users'), 'seem') (('they', 'deep learning'), 'wait') (('income', '130k'), 'contain') (('78', 'Relational data http'), 'let') (('chi2 test p returns', 'now chi 2 test'), 'say') (('Building', 'solutions'), 'achieve') (('student', 'training'), 'be') (('they', 'two different classes'), 'expect') (('factors', 'criteria'), 'order') (('little nothing', 'higher 130k'), 'let') (('I', 'too quite far margin'), 'expect') (('EDIT I', 'US Kagglers'), 'adopt') (('how we', 'statistics'), 'like') (('Random Forest Gradient', 'SVM based models'), 's') (('programming language', 'job what'), 'help') (('models', 'only what'), 'do') (('Machine hopefully Learning', 'distinction'), 'devoted') (('who', 'DS learning'), 'be') (('they', 'basics'), 'have') (('modifying', 'model'), 'com') (('answers', 'example'), 'let') (('part', 'male kagglers'), 'write') (('I', 'that'), 'say') (('we', '91'), 'be') (('Further we', 'final classifier'), 'go') (('who', 'tutorials'), 'expose') (('you', 'section'), 'get') (('now First we', 'instances'), 'allow') (('having', 'already what'), 'show') (('s', 'Machine Learning Income Prediction prediction'), 'let') (('so all', 'doctors'), 'say') (('this', 'surprise'), 'get') (('they', 'work'), 'ask') (('most frequent education', 'earlier respondents'), 'be') (('nearly 1000 learners', 'more than 11 hours'), 'say') (('that', 'professional degrees'), 'follow') (('that', 'points'), 'recall') (('We', 'demographic properties'), 'tell') (('s', 'Kaggle'), 'let') (('Mr gmobaz', 'comment wisely section'), 'be') (('this', 'everything'), 'convert') (('where difference', 'second'), 're') (('words data science bigdata machine following mining big learning', 'green'), 'plot') (('us', 'workplace'), 'let') (('we', '35'), 'find') (('that', 'language'), 'be') (('we', 'problems accuracy precision recall'), 'create') (('really one', 'techniques'), 'Personnaly') (('most', 'them'), 'chart') (('5', 'output i.'), 'use') (('exciting opportunity', 'time'), 'be') (('we', 'data'), 'give') (('4 all', 'Bachelor'), 'contain') (('Interesting India', 'U.'), 'have') (('I', 'that'), 'come') (('Electrigal Computer that', 'resulsts'), 'EDIT') (('who', 'exclusively R.'), 'seem') (('Generally type', 'nearly all tasks'), 'seem') (('it', 'proper answer'), 'quest') (('why we', 'www'), 's') (('We', 'training'), 'go') (('next how learners', 'DS ranking knowledge'), 'focus') (('I', 'MOOC recommendation'), 'expect') (('Neural nets', 'really big margin'), 'be') (('using', 'specific usage'), 'mean') (('R most users', 'business data analytics part'), 'get') (('1', 'DS training'), 'start') (('values', '5'), 'come') (('they', 'learners coders'), 'csv') (('found', 'China'), 'be') (('just as much', 'don often Python'), 'use') (('where one', 'how other'), 's') (('That', 'category'), 'see') (('job', 'professional development'), 'strive') (('questions', 'working community'), 'cover') (('you', 'what'), 'tell') (('also relative usefulness', 'same platform'), 'notice') (('Here more sophisticated plot', 'annual income'), 's') (('that', 'Data more Science'), 'mean') (('salary gap', 'men'), 'seem') (('else it', 'Other'), 'be') (('Learners job So top 3 resources', 'learners'), 'use') (('difference', 'NLP'), 'consider') (('who', 'machine learning at least students'), 'offer') (('29', 'US'), 'be') (('most popular way', 'Data Science Machine Learning'), 'wasn') (('I', 'next other'), 'let') (('read_csv Input data files', 'the'), 'be') (('Set aspect pie', 'circle'), 'draw') (('Conversely smaller values', 'model'), 'constrain') (('business analysts data analysts', 'data scientists'), 'look') (('who', 'people'), 'have') (('they', 'company'), 'let') (('you', 'here www'), 'for') (('practitioners', 'sens'), 'be') (('that', 'survey at all responses'), 'guess') (('csv Participants', 'choice multiple questions'), 'answer') (('34', 'bachelor at least degree'), 'hold') (('You', 'it'), 'read') (('KDE', 'kernel density estimation'), 'fit') (('I', 'Major'), 'expect') (('who', 'Kaggle'), 'txt') (('together that', 'biased generally results'), 'make') (('who', 'yet studies'), 's') (('you', 'deeper aspect'), 've') (('R coders', 'production'), 'support') (('we', 'beextremely precise'), 'give') (('users', 'data'), 'database') (('more than 5 years ago This', 'last few years'), 'start') (('R users', 'production'), 'push') (('who', 'resp'), 'be') (('which', 'job'), 'spend') (('that', 'i.'), 'include') (('even age', 'point'), 'preprocessing') (('actually Unfortunately even 73', 'part1'), 'be') (('71', 'still frequently R'), 'use') (('first demographic overview', 'now analysis'), 'come') (('we', 'when model'), 'be') (('they', 'field'), 'use') (('How Python', 'Data Science'), 'be') (('only 26', 'learning still phase'), 'be') (('we', 'models'), 'don') (('which', 'Tableau Public'), 'be') (('2', 'aren actually job'), 'look') (('online platform', 'data science most learners'), 'let') (('Computer Science', 'Mathematics twice as ones'), 'be') (('learning', 'time'), 'spend') (('really how two languages', 'country'), 'r') (('70', 'two methods'), 'seem') (('how much they', 'professionaly'), 'devote') (('data scientist jobs', 'next seven year'), 'reveal') (('type', '18 R.'), 'in') (('it', 'really beautiful plots'), 'have') (('we', 'incomes 130k'), 's') (('which', 'left'), 'notice') (('computer Python', 'NLP'), 'but') (('others', 'degree'), 'attend') (('it', 'view'), 'be') (('here most', 'business purpose'), 'make') (('I', 'three things'), 'come') (('little more than 10', 'at least 6 hours week'), 'work') (('economic weel', 'salaries'), 'EDIT') (('s', 'isn second most used anymore Kaggle'), 'let') (('8', 'Data than 45 years independent Scientists'), 'be') (('that', 'product'), 'do') (('where really small proportion', 'algorithm'), 'happen') (('that', 'country'), 'be') (('don so t', 'comment section'), 'notice') (('more they', 'R.'), 'notice') (('that', 'informations'), 'csv') (('Multi Correspondence Analysis MCA', 'categorical data'), 'use') (('So I', 'such one'), 'identify') (('who', 'don t often R'), 'consider') (('who', 'survey'), 'be') (('data deeper how science', 'wonderful platform'), 'aim') (('answer', 'freeform'), 'add') (('shrinks', 'colorscale'), 'deal') (('I', 'Python'), 'be') (('didn t', 'don data science still specific training'), 'be') (('Data Scientist', 'specifically work'), 'Jabri') (('when bars', 'better readability'), 'credit') (('Tech job Specific boards', 'Stack Overflow recruitment example'), 'platform') (('Students data science formally informally Professionals', 'characteristics'), 'be') (('I', 'http stattrek'), 'let') (('Python users', 'R'), 'be') (('we', 'Python VS R duel'), 'skill') (('who', 'career switch learners median age'), 'be') (('who', 'question'), 'go') (('only 7', 'text data set'), 'deal') (('how many years kagglers', 'data science'), 'let') (('71', 'too 5 times as many male female respondents'), 'be') (('degree', 'DS'), 'rank') (('we', 'what'), 'experience') (('Coursera', 'Udacity edX'), 'have') (('Kaggle', 'DS most used learning'), 'see') (('especially when it', 'coding stuff'), 'be') (('great proportion', 'detection time series outlier analysis'), 'be') (('part full time time they', 'current job'), 'look') (('one hot why you', 'e3c6186d008f more explanation'), 'com') (('63', '23'), 'recommend') (('It', 'python docker image https kaggle github'), 'come') (('you', 'output'), 'list') (('Indeed most used platforms', 'most last 2 plots'), 'be') (('nearly all countries', 'more R.'), 'say') (('S We', 'survey'), 'see') (('Most', 'Data 18 years Analysts'), 'be') (('learners', 'data scientists'), 'let') (('I', 'image'), 'example') (('We', 'little general proportions'), 'notice') (('that', 'code'), 'o') (('we', 'that'), 'draw') (('you', 'statistic tests'), 'have') (('Kaggle', 'Then couple months'), 'discover') (('we', 'data scientists'), 'let') (('No', 'sens'), 'be') (('Nearly all', '2 years'), 'write') (('ve what', 'ML DS most important knowledge'), 'see') (('answer', 'next other'), 'overlap') (('it', 'less very high income'), 'yield') (('sort of those', 'thanks Kaggle Vidhya'), 'be') (('exact value', 'http www'), 'predict') (('you', '3'), 'recommend') (('what', 'formal learners'), 'let') (('data scientists', 'Kaggle competitions'), 'think') (('R really few practitioners', 'two roles'), 'notice') (('we', 'it'), 'blog') (('That', 'men part'), 'say') (('where R', 'still as Python'), 'be') (('majority', 'Masters median'), 'look') (('now how same platforms', 'learners'), 'let') (('That', 'Australia'), 'use') (('Statisticians Data Business only 11', 'job one 3 titles'), 'be') (('it', 'use'), 'AP') (('which', 'best numerical continuous variables'), 'be') (('there following link', 'tryolabs'), 'learn') (('we', 'what'), 'be') (('now Python', 'Machine real Learning'), 'mean') (('who', 'major'), 'as') (('you', 'data science'), 'like') (('earliers', 'more than them'), 'let') (('it', 'Python'), 'show') (('data scientists Dimensionality reduction', '2D dimensionality reduction most known technique'), 'be') (('I', 'example'), 'Personnaly') (('Large values', 'model'), 'give') (('Personally I', 'same time'), 'start') (('they', 'platform far ahead third most useful Projects'), 'notice') (('long way you', 'it'), 'take') (('they', 'work'), 'let') (('I', 'so that'), 'think') (('some', 'Nigeria Egypt Kenia'), 'notice') (('When you', 'two categorical variables'), 'be') (('they', 'lot more college'), 'be') (('process', '2D visualization'), 'have') (('s', 'Data Science discovery'), '6') (('something', 'at least opinion'), 'remain') (('R very coders', 'specific areas'), 'be') (('who', 'available methods'), 'Python') (('degree', 'example'), 'be') (('age later on doesn', 'more significant results'), 'keep') (('com what', 'comments'), 'christinampoid') (('most voted duration', 'R coders'), 'be') (('large proportion', 'R as users'), 'use') (('Unfortunately this', 'tech industry'), 'age') (('we', 'kind of thanks next visualizations'), 'seem') (('we', 'visualizations'), 'seem') (('that', 'dimensionality further reduction'), 'analysis') (('that', 'kernel'), 'thank') (('We', 'respondents'), 'use') (('WordCloud you', 'here www'), 'let') (('results', 't'), 'go') (('that', 'another'), 'show') (('takeaway', 'computer vision deep learning NLP'), 'mean') (('I', 'Tableau plot'), 's') (('I', 'epic confrontation'), 'name') (('Only 3012 respondents', 'question'), 'answer') (('Online Courses', 'Mathematics Computer science'), 'say') (('that', 'Major'), 'notice') (('we', 'classification machine learning also little funny problem'), 'do') (('average', 'female kagglers'), 'be') (('43', 'production'), 'push') (('column', 'specific question'), 'contain') (('heppened', 'www'), 'in') (('Five files', 'survey'), 'come') (('dataset', 'total outputs'), 'notice') (('Data Scientist', 'sense'), 'outdo') (('logistic regression', 'probabilities'), 'let') (('who', 'Data Science'), 'without') (('who', 'equally at least often Both'), 'categorize') (('Rarely we', '22'), 'combine') (('positive class', 'else negative class'), 'predict') (('html', 'still heavily R.'), 'be') (('who', 'business data full time analysts'), 'make') (('we', 'Kaggle'), 'problem') (('Masters first quartile Q1', 'other two communities'), 'median') (('it', 'most significant results'), 'check') (('Interesting Kaggle courses', 'data science favorite learners'), 'use') (('instead proportion', 'X property'), 'algorithm') (('most learners', 'gender them'), 'property') (('Tableau', 'step tutorial very http'), 'be') (('when you', 'kagglers'), 'be') (('me', 'data still long way'), 'welcome') "}