{"name": "wsi extract patches pytorch ", "full_name": " h1 Pre Processing and Analysis h3 Steps to create sliding window images slices with Pytorch h2 Get the percentage Distribution from Masks and cross check with Gleason Score ", "stargazers_count": 0, "forks_count": 0, "description": "We are considering the markings made under radboud category as its straight forward to derive the Gleason score based on the markings which range from 0 to 5. There is are no markings of cancerous epithelium Gleason 3 but score is given as 3 3 in first case. png Get the percentage Distribution from Masks and cross check with Gleason ScoreThe value 0 in the mask corresponds to background and unknown areas let us avoid those and check the percentage distribution of other labels and see if it matches with the Gleason Score. Pre Processing and Analysis Version 1 Create Patches from Images Version 2 Create Patches from Masks Version 3 Check if the marking distribution aligns with the Gleason Score given Steps to create sliding window images slices with PytorchSliding window is the standard approach used to process WSI so that the input files can be accomodated in the GPU. png attachment image. Based on the label distribution in the masks it appears files 004dd32d9cd167d9cc31c13b704498af and 0068d4c7529e34fd4c9da863ce01a161 are incorrectly labelled. The whole image is broken into tiles of regular size and then fed into classification or segmentation algorithms image. Usual Imports Check input file Load input file and check dimensions Display the file Convert to torch and CHW format Create patches of size 512x512 Load mask file Only the third channel has the markings Convert to torch and CHW format Show a Random Patch. In the second cancerous epithelium Gleason 3 is only 0. 005 and no marking for cancerous epithelium Gleason 4 More checking might be needed to evaluate all the 5160 files marked in radboud. ", "id": "imrandude/wsi-extract-patches-pytorch", "size": "1418", "language": "python", "html_url": "https://www.kaggle.com/code/imrandude/wsi-extract-patches-pytorch", "git_url": "https://www.kaggle.com/code/imrandude/wsi-extract-patches-pytorch", "script": "Path pathlib matplotlib.pyplot plot_image pandas showTensor tqdm numpy ", "entities": "(('which', '5'), 'consider') (('markings', '3 first case'), 'be') (('it', 'Gleason Score'), 'get') (('Gleason', 'radboud'), 'mark') (('whole image', 'then classification'), 'break') (('Gleason', 'second cancerous epithelium'), 'be') (('input files', 'GPU'), 'be') (('0068d4c7529e34fd4c9da863ce01a161', 'files'), 'appear') (('format', 'Random Patch'), 'display') "}