{"url": "https://academicpositions.com/ad/university-of-luxembourg/2021/research-and-development-specialist-in-ethics-and-digitization/164743", "title": "Research and development specialist in Ethics and Digitization", "publish_date": "2021-11-16", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": {"@type": "PostalAddress", "streetAddress": "6, rue Richard Coudenhove-Kalergi", "postalCode": "L-1359", "addressCountry": "Luxembourg"}, "country": "Luxembourg", "position": "Research Assistant", "field": "Computational Linguistics, Epistemology, Ethics, Linguistics, Metaphysics, and 1 morePhilosophy", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "University of Luxembourg&nbsp;is an&nbsp;international research&nbsp;university with a distinctly&nbsp;multilingual&nbsp;and&nbsp;interdisciplinary&nbsp;character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.&nbsp;The&nbsp;Faculty of Humanities, Education and Social Sciences&nbsp;(FHSE)&nbsp;brings together expertise from the humanities, linguistics, cognitive sciences, social and educational sciences. People from across 20 disciplines are working within the Faculty. Along with the&nbsp;disciplinary&nbsp;approach a very ambitious interdisciplinary research culture has been developed.The facultyâ\u0080\u0099s research and teaching focuses on&nbsp;social, economic, political&nbsp;and&nbsp;educational&nbsp;issues with the common goal of contributing to an inclusive, open and&nbsp;resourceful society. The&nbsp;FHSE offers four Bachelor and 15 Master degrees and a doctoral school providing students with the necessary knowledge and high-qualified skills to succeed in their future career.Your Role..The University of Luxembourg is seeking a Research &amp; Development Specialist to work at the intersection of computational linguistics/computer science and theoretical philosophy/ethics at the newly established Centre of Ethics and Digitization.The successful candidate will be expected to contribute conceptually to the development of the new Centre, with particular emphasis on collaboration between colleagues from the Department of Computer Sciences and the Department of Humanities.The advertised position starts as a temporary position for two years and can subsequently be made permanent.Activities Supporting research projects and the development of research projects on various levels; Administer communication with people and institutions; Write and finalize project reports. What we expect from youâ\u0080¦ Master Diploma (M.A.) in a discipline of Humanities or Computer Science or another relevant discipline; A very good command of English, French and/or German. Luxembourgish is considered an asset; Ability to work autonomously; Willingness to engage in teamwork in research group. In Short.. Contract Type: Fixed Term Contract 24 Month Work Hours: Full Time 40.0 Hours per Week Location:&nbsp;Belval Internal Title:&nbsp;Research and development specialist Job Reference:&nbsp;UOL04455 We offer.. Personal workspace at the University; Opportunities to expand your skills and knowledge in a dynamic research team; Stimulating work environment. How to apply..Applications should be submitted online and include: Curriculum Vitae Letter of Motivation Copies of Diploma Early application is highly encouraged, as the applications will be processed upon reception.&nbsp;To ensure full consideration,&nbsp;candidates should apply by October, 10th, 2021.Please apply formally through the HR system. Applications by email will not be considered.The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.Hereâ\u0080\u0099s what awaits you at the University Multilingual and international character.&nbsp;Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d&nbsp;(UniGR).&nbsp; A modern and dynamic university.&nbsp;High-quality equipment.&nbsp;Close ties to the business world and to the Luxembourg labour market.&nbsp;A unique urban site with excellent infrastructure. A partner for society and industry.&nbsp;Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic&nbsp;partners such as ministries, local governments, associations, NGOs â\u0080¦Find out more about the University Addresses, maps &amp; routes to the various sites of the University ", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Luxembourg aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international, multilingual and interdisciplinary character.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}