{"url": "https://academicpositions.com/ad/robert-bosch-gmbh/2022/phd-thesis-5g-6g-radio-localisation-for-automated-driving/173828", "title": "PhD Thesis â\u0080\u0093 5G/6G Radio Localisation for Automated Driving", "publish_date": "2022-01-11", "deadline": "2022-04-11", "location": "Robert-Bosch-StraÃ\u009fe 200 Hildesheim, Germany", "city": "N/A", "country": "Germany", "position": "PhD", "field": "Communication Engineering, Electrical Engineering, Engineering Physics, Signal Processing, Systems Engineering, and 1 moreTelecommunications Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "Robert Bosch GmbH", "job_description": "Robert-Bosch-StraÃ\u009fe 200, 31139 Hildesheim, GermanyFull-timeLegal Entity: Robert Bosch GmbHCompany DescriptionAt Bosch, we shape the future by inventing high-quality technologies and services that spark enthusiasm and enrich peopleâ\u0080\u0099s lives. Our promise to our associates is rock-solid: we grow together, we enjoy our work, and we inspire each other. Join in and feel the difference.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The Robert Bosch GmbH is looking forward to your application!Job DescriptionVehicle-to-vehicle communication as well as communication with road infrastructure components is an important technology for automated driving. While the communication mechanisms have already been standardized with C-V2X in 3GPP, positioning methods based on this are an interesting research topic.In this PhD thesis you are researching on new concepts for vehicle positioning based on 5G and 6G sidelink communicationYou realize algorithms for positioning, for example based on channel state informationYou develop appropriate simulations and/or prototype implementations to investigate the feasibility of your ideasYou coordinate your results with colleagues and contribute them to the standardization processFurthermore, you cooperate with your supervising professor, publish scientific articles, attend scientific conferences, and prepare a doctoral thesisQualificationsEducation: excellent Master degree in electrical engineering, computer science, physics or mathematicsQualification: strong background in communication systems including waveforms, channel estimation and synchronisation as well as radio based localization and signal processingExperience and Knowledge: practical skills in simulation, structured software development and preferably Software-Defined Radio implementationsPersonality: self-motivated and enjoyment of working in a team, high level of commitment and initiative as well as a competent and obliging appearanceLanguages: fluent in English and knowledge of German is a plusAdditional InformationThe final PhD topic is subject to your university. Duration: 3 yearsPlease submit all relevant documents (incl. curriculum vitae and certificates).Need support during your application?Kevin Heiner (Personalabteilung)+49 (711) 811 12223&nbsp;&nbsp;Need further information about the job?Frank Hofmann (Fachabteilung)+49 (5121) 49 5392&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Our products and services are designed to spark enthusiasm, improve quality of life, and help conserve natural resources. We want to deliver top quality and reliability. In short: we want to create technology that is â\u0080\u009cInvented for life.â\u0080\u009d", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC92NjVIeTQ4b0pjTjRHY3R3bTV3cjluQXR0dnB0MEFQVHVzbWIzZnpHLnBuZyIsImVkaXRzIjpbXX0="}