{"url": "https://academicpositions.com/ad/ku-leuven/2022/phd-on-particle-stabilized-pickering-emulsions-in-droplet-based-microfluidic-environments-to-mimic-biomimetic-erythrocyte-red-blood-cell-membranes/175064", "title": "PhD on Particle-stabilized Pickering Emulsions in Droplet-based Microfluidic Environments to Mimic Biomimetic Erythrocyte (Red Blood Cell) Membranes", "publish_date": "2022-02-09", "deadline": "2022-03-15", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Analytical Chemistry, Bioengineering, Chemical Engineering, Inorganic Chemistry, Materials Chemistry, and 4 moreMaterials Engineering,Nanochemistry,Nanotechnology,Particle Physics", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-92)This PhD position is with Prof. Erin Koos (Soft Matter, Rheology and Technology section of the Department of Chemical Engineering, https://cit.kuleuven.be/smart/) and Xevi Casadevall i Solvas (Mechatronics, Biostatistics and Sensors section of the Department of Biosystems, https://www.biw.kuleuven.be/biosyst/mebios). The PhD research will be conducted in the framework of the EIC Pathfinder program SynEry.Website unitProjectBlood is a precious and vital resource for many clinical interventions. Erythrocytes (red blood cells), one of its key components, are used to save thousands of lives every day worldwide. Yet, in low- and middle-income countries, insufficient blood donations and their unsafe control are endemic burdens that cost lives. Despite several decades of attempts a safe and universal blood substitute has yet to be developed. The ambitious goal of the SynEry project (funded via an EICPathfinder Open framework of Horizon Europe) is to reproduce key features of erythrocytes in an advanced lipid vesicle or synthetic erythrocyte. Specifically, this position aims to develop particle-stabilized Pickering emulsions in droplet-based microfluidic environments in order to assist the reconstruction of biomimetic erythrocyte membranes. The knowledge gained by producing such a synthetic erythrocyte, is envisioned to enable the production of artificial cells with in-vivo applicability and it will pave the way towards the future development of an effective blood substitute that can remedy pervasive global blood availability and safety issues.Key tasks:Synthesizing and characterizing inorganic nanoparticles for production of Pickering emulsions with different functional groups.Characterization of the nanoparticles self-assembly processes and their spatial distribution at the interface of water-in-oil microdroplets.Characterize the mechanical properties of the Pickering emulsions using a combination of imaging techniques (e.g. confocal microscopy and SEM) and rheology with a focus on the resistance of the droplet breakup and coalescence in flow.Developing strategies to tune the physical properties of Pickering emulsions leading to either increased or decreased stability of the particle-stabilized interface.ProfileAre you an energetic person, able to both think critically and creatively in scientific terms while also being effective at resolving technical challenges? Are you keen on working at the crossroads of several disciplines (from chemical engineering to biomedicine)? Then you may be the perfect scientist to join our team.The ideal candidate will possess the following skill set:Candidates should have a strong experimental and theoretical background in colloids and rheology with knowledge of nanoparticle synthesis and functionalization.On-hands experience in using Pickering emulsions for stabilization of microdroplets in microfluidic environments.Familiarity with analytical techniques for experimental characterization of nanoparticles and/or nanostructure assemblies.Candidates should have recently obtained a Masterâ\u0080\u0099s degree in Chemical Engineering, Bio-Engineering, Materials Science or Materials Engineering with outstanding grades.Language skills: ENGLISH: Excellent; DUTCH: of advantage for the interaction within the University, however not required.Candidates have to be hard working, enthusiastic and intelligent with a strong interest in understanding the fundamentals of materials behavior, as well as its implications for engineering applications.You have a talent for conceiving advanced experimental set-ups and can realize them in a target-oriented manner.You must have less than 4 years of research experience, i.e., you should be an early-stage researcher.&nbsp;Important: although priority will be given to PhD candidates, postdoctoral candidates with a strong fit for the position who have not be enengaged in a principal activity (work, studies, etc.) in Belgium for more than24 months in the last 3 years are also strongly encouraged to apply.OfferWe offer a full-time PhD or Postdoctoral position for 1 year. After a positive evaluation, the contract can be extended to 3 additional years (4 years in total).Excellent guidance by our young, dynamic and multidisciplinary team.State of the art research infrastructure.A challenging job in a young, dynamic environmentHigh level scientific training at a top-ranked universityBeing part of world-class research groups working on a high visibility European Project.Remuneration according to the KU Leuven salary scales: https://www.kuleuven.be/english/research/associatienet/phdIdeal start time is April 1st, but earlier and later starting dates can be negotiated.Interested?For more information please contact Prof. dr. Erin Koos, tel.: +32 16 37 63 47, mail: erin.koos@kuleuven.be or Prof. dr. Xevi Casadevall i Solvas, tel.: +32 16 37 71 03, mail: xevi.casadevall@kuleuven.be.Applications must contain:Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; An up-to-date CV, detailing work experience and research and academic achievementsÂ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A cover letter exposing the candidate motivation for the fellowshipÂ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; At least two reference letters from a (former)supervisor, professor or a manager with contact information.Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Scanned copy of the degree (usually the masterâ\u0080\u0099s degree) which would formally entitle the candidate to embark on a doctorate. If the degree has not been obtained yet, the applicant will have to ensure that the date of graduation will be earlier than the start date of the contract.Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Transcript of records (applicantâ\u0080\u0099s ranking landmarks) for both Bachelor degree and Master degree. In case the applicant has not obtained their Master degree yet, a copy of the most up-to-date Mastergrades should be providedÂ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A copy of an identity document.You can apply for this job no later than March 15, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}