{"url": "https://academicpositions.com/ad/wenzhou-kean-university/2022/tenure-track-assistant-associate-professor-in-english-school-of-english-studies/173669", "title": "Tenure Track Assistant/Associate Professor in English, School of English Studies", "publish_date": "2022-01-05", "deadline": "N/A", "location": "88 Daxue Rd, Ouhai, Zhejiang Province Wenzhou, China", "city": "N/A", "country": "China", "position": "Associate Professor", "field": "Applied Linguistics, Germanic languages, West Germanic languages,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Wenzhou-Kean University", "job_description": "About Wenzhou-Kean UniversityWenzhou-Kean University (WKU), located in Wenzhou, China, one of three Sino-American universities along with NYU Shanghai and Duke Kunshan University, is approved by the Ministry of Education of China. Launched in 2012, WKU offers a unique model of higher education in partnership with Kean University, a comprehensive, public university in the state of New Jersey that is accredited by the Middle States Commission on Higher Education. WKU sits on approximately 500 beautiful acres and currently enrolls about 3,500 undergraduate students, and it is now in the midst of a rapid growth that will bring enrollment to 7,000 students within the next five years. All instruction is in English and all curriculum is provided by Kean University. In addition to its current 18 undergraduate programs, WKU has been approved by the Ministry of Education for offering 8 Masterâ\u0080\u0099s and 3 doctorate programs. Wenzhou is one of the most vibrant and economically advanced developed cities on Chinaâ\u0080\u0099s East Coast, located one hour by plane and just over three hours by high-speed train from Shanghai.Wenzhou-Kean University currently offers the following degree programs: Doctor of Educational Leadership (Ed.D.), Biotechnology Science (M.S.), Computer Information Systems (M.S.), Instruction and Curriculum (M.A.), Global Management (M.B.A.), and Architecture (M.Arch.); Finance (B.S.), Accounting (with emphasis on international standards and practices) (B.S.), Global Business (B.S.), Marketing (B.S.), Management (Business Analytics option/ Supply Chain &amp; Information Management option) (B.S.), Economics (B.S.), Graphic Design (B.F.A.), Interior Design (B.F.A), Industrial Design (B.I.D.), Architectural Studies (B.A.), Computer Science (B.S.), Mathematical Sciences (Data Analytics Option) (B.A.), Biology (Cell and Molecular option) (B.S.), Chemistry (B.S.); Earth Science (Environmental Science option) (B.S.); English (English in Global Settings option) (B.A.); Psychology (General option/ Forensic Psychology option)(B.A.); and Communication (Public Relations option) (B.A.). In addition, WKU has a substantial commitment to the teaching of ESL/EFL.&nbsp;About the Job:The School of English Studies seeks to fill three tenure-track positions starting on site for Fall 2022: one in literature (specialist in digital humanities or global literature preferred but all areas of literature will be considered), one in rhetoric and composition and/or technical and professional writing, and one in applied linguistics with a special emphasis on translation and TESL. A tenure-track Assistant/Associate Professor is a full time, 10-month employee who teaches 24 credits per academic year (course release is available for grant proposal development and other substantial research initiatives). Tenure track faculty develop and teach courses related to their academic specialty and research interests, in addition to General Education courses as needed. Candidates will be expected to participate in the full range of faculty responsibilities, including high quality teaching, research, advising, student learning support, curriculum development, program assessment, student recruitment and retention, office hours, senior project supervision, internship opportunities, research experience for undergraduates, and service to the university and/or professional community. Tenure-track appointment requires publications in internationally recognized and vigorously peer-reviewed journals on English, Rhetoric and Composition, Linguistics, or other closely related subjects.&nbsp;&nbsp;Teaching experience with non-native speakers in a foreign country is highly desirable. Teaching assignments and related responsibilities may include day, evening, weekend and online courses. Interest or experience in using advanced instructional technologies to improve the teaching/learning process is highly desirable. Candidates with an interest in teaching across disciplines are encouraged to apply.&nbsp;Qualifications:A Ph.D. in English, Rhetoric and Composition, or Linguistics is required; ABD can be considered with completion prior to the effective date of employment. A minimum of two years of teaching experience in a college or university setting is preferred. Native English speakers or equivalent English proficiency is required.Application Information:&nbsp;Review of applications will begin immediately and continue until positions are filled. Candidates should send cover letter, CV, statement of teaching philosophy, a research statement describing research interests, past accomplishments in research, and future research plans, unofficial transcripts, and the email contact information of three professional references. Please send all materials to Search Committee Chairperson at wkuenglish@wku.edu.cn. Three current letters of recommendation are required before advancement. Official transcripts for all degrees are required before appointment.&nbsp;Faculty positions at WKU offer:Salary is $67,000 to $75,000 for Assistant Professors and $73,000 to $83,00 for Associate Professors depending on qualifications and experience.A well-rounded healthcare coverage, academic travel up to $2,000, housing options and subsidy up to $3,000, home traveling up to $6,000 (2 international round-trip airfares), a reimbursement to cover relocation expenses up to $1,000, shuttle bus to campus for work, and up to 8% front-load retirement benefits within accordance with completion of years of service with the University.WKU tuition waiver up to 80% for spouse/dependent children of faculty for undergraduate programs, and tuition discount of private/international kindergarten, elementary, middle and high schools for children of faculty.A collegial environment.&nbsp;The opportunity to teach high quality students with more than a third of WKU graduates being admitted to the graduate schools at the Worldâ\u0080\u0099s Top 50 Universities, and about 60% of its graduates at the Worldâ\u0080\u0099s Top 100 Universities.&nbsp;Background Screening:Wenzhou-Kean University conducts background screenings on all job candidates upon acceptance of a contingent offer and may use a third-party administrator to conduct background screenings.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Wenzhou-Kean University is a Chinese-American jointly established higher education institution with Independent legal person status and limited liabilities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyODNcLzY0NFwvMjgzNjQ0MTViNjFlMWM1NTViMTU2ZjljNjM5MjZmMTYucG5nIiwiZWRpdHMiOltdfQ=="}