{"url": "https://academicpositions.com/ad/ku-leuven/2022/phd-scholarship-in-operations-research/175063", "title": "PhD Scholarship in Operations Research", "publish_date": "2022-02-09", "deadline": "2022-04-04", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Algorithms, Applied Mathematics, Business Administration, Business Economics, Computational Mathematics, and 5 moreIndustrial Economics,Industrial Engineering,Programming Languages,Project Management,Stochastics", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-82)The research group ORSTAT of KU Leuven (Belgium) works in the areas of Operations Research (OR) and Statistics. The ongoing research projects cover a wide range of challenging subjects in these two fields.Website unitProjectORSTAT has a vacancy for one full-time PhD scholarship starting in September 2022, for a period of four years.The researcher to be hired will work in the field of OR under the supervision of Prof. Roel Leus; this work should lead to a PhD degree.&nbsp; Some keywords of our research area are: combinatorial optimization, integer (linear) programming, stochastic and robust optimization, algorithm design, â\u0080¦&nbsp; The candidate will work on the development of models and algorithms at the interface of discrete optimization, scheduling, project management, and innovation.&nbsp; He/she will find a dynamic and pleasant working environment, in a group that is actively involved in scientific research at the highest international level.Candidates will be expected to participate in seminars and conferences, be internationally mobile, and to enroll in our PhD program.&nbsp; The candidate can be asked to give guidance to Bachelor and Master students, to be involved in teaching activities, and to supervise exams.ProfileCandidates should have a strong interest in OR and preferably hold a Masterâ\u0080\u0099s degree in Business Engineering (Handelsingenieur), Mathematics, Computer Science, Industrial Engineering, Operations Research, or equivalent.&nbsp; Graduation with honors in preliminary studies is a requirement, as well as an appropriate command of written and spoken English.&nbsp; Experience with at least one programming language is an asset.&nbsp; Students that are currently in the final year of their Masters are especially encouraged to apply.OfferWe offer an employment as full-time doctoral scholar for 1 year, renewable up until max. 4 years after positive evaluation.&nbsp; The tentative starting date is September 19, 2022, depending on the availability of the candidate.Interested?For more information please contact Prof. dr. Roel Leus, tel.: +32 16 32 69 67, mail: roel.leus@kuleuven.be or Dr. Ben Hermans, tel.: +32 16 37 40 74, mail: ben.hermans@kuleuven.be.You can apply for this job no later than April 04, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}