{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/doctoral-researcher-phd-student-in-luxembourgish-literature/175130", "title": "Doctoral researcher (PhD student) in Luxembourgish Literature", "publish_date": "2022-02-10", "deadline": "2022-05-10", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "PhD", "field": "Germanic languages, Literary Theory, Romance languages, West Germanic languages, World Literatures,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "The University of Luxembourg is an&nbsp;international research university with a distinctly multilingual and interdisciplinary character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.&nbsp;The Faculty of Humanities, Education and Social Sciences (FHSE)&nbsp;brings together expertise from the humanities, linguistics, cognitive sciences, social and educational sciences. People from across 20 disciplines are working within the Faculty. Along with the disciplinary approach a very ambitious interdisciplinary research culture has been developed.The facultyâ\u0080\u0099s research and teaching focuses on social, economic, political&nbsp;and educational issues with the common goal of contributing to an inclusive, open and&nbsp;resourceful society. The&nbsp;FHSE offers four Bachelor and 15 Master degrees and a doctoral school providing students with the necessary knowledge and high-qualified skills to succeed in their future career.Your Role..&nbsp;The doctoral candidate will be a member of the Department of Humanities at the Faculty of Humanities, Education and Social Sciences. S/he will work under the supervision of Prof Dr Jeanne E. Glesener and assist the professor in research and teaching.Your TasksPrepare a doctoral thesis in Luxembourgish Literature on one of the following topics:19th century Luxembourgish literature in Luxembourgish, German and FrenchThe novel in Luxembourgish, German and French, 1980 - 2000Translingual Luxembourgish LiteratureMandatory enrolment in the Doctoral School in Humanities and Social Sciences.Assist the professor in her administrative and teaching activities (3 hours per week).Actively participate in the organization of scientific conferences, research activities in the Department of Humanities and in study program organization.What we expect from youâ\u0080¦&nbsp;Excellent Masterâ\u0080\u0099s Degree in Comparative Literature or in French, German or English LiteratureResearch focus on comparative approaches, genre theory and multi/translingualismLanguage skills: Luxembourgish (reading competence at least), French, German, EnglishIn Short..&nbsp;Contract Type: Fixed Term Contract 36 Month - extendable up to 48 months if requiredWork Hours: Full Time 40.0 Hours per WeekIdeal starting date: May 2022Location:&nbsp;BelvalEmployee and student statusJob Reference:&nbsp;UOL04742The yearly gross salary for every PhD at the UL is EUR 37.101,36 (full time)How to apply..&nbsp;Applications should be submitted online and include:CvMotivation letterShort abstract of PhD-project (1 000 words)Copies of diplomasReferencesWe ensure consideration until 1st of April 2022 then the posting will remain until until filled.Please apply formally through the HR system. Applications by email will not be considered.The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.Hereâ\u0080\u0099s what awaits you at the University&nbsp;Multilingual and international character.&nbsp;Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d&nbsp;(UniGR).&nbsp;A modern and dynamic university.&nbsp;High-quality equipment.&nbsp;Close ties to the business world and to the Luxembourg labour market.&nbsp;A unique urban site with excellent infrastructure.A partner for society and industry.&nbsp;Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic&nbsp;partners such as ministries, local governments, associations, NGOs â\u0080¦Find out more about the UniversityAddresses, maps &amp; routes to the various sites of the University", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Luxembourg aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international, multilingual and interdisciplinary character.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}