{"url": "https://academicpositions.com/ad/wenzhou-kean-university/2022/assistant-professor-in-global-business/173676", "title": "Assistant Professor in Global Business", "publish_date": "2022-01-05", "deadline": "N/A", "location": "88 Daxue Rd, Ouhai, Zhejiang Province Wenzhou, China", "city": "N/A", "country": "China", "position": "Assistant Professor", "field": "Behavioural Economics, Business Administration, International Economics, Management, Strategic Management,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Wenzhou-Kean University", "job_description": "Along with NYU Shanghai and Duke University Kunshan, Wenzhou-Kean University (WKU) is one of only three full legal-person Sino-American universities with all English instruction approved by the Ministry of Education in China. We invite applications for full-time positions at the rank of Assistant Professor (tenure track) in Global Business to begin in Spring or Fall 2022. The successful candidate will be able to teach IB and strategy related courses, as well as participate in the full range of faculty responsibilities, including scholarly research and service to the University. Applicants should possess an earned doctorate in field relevant to International Business - such as management, finance, business strategy - from an AACSB accredited program, or anticipate completion by July 2022. Applicants with terminal related Social Science degrees from Ivy League or better schools are also strongly encouraged to apply. To receive full consideration by the search committee, candidates need to submit a cover letter, CV, research statement, unofficial transcripts and contact information for three references by email to: Search Committee Chairperson at wkucbpm@wku.edu.cn . Official transcripts for terminal degrees and three current letters of recommendation are required before appointment. &nbsp;&nbsp;WKU sits on over 500 beautiful acres with new state-of-the-art facility (http://www.wku.edu.cn/en/cbpm/). A city of 9 million people, Wenzhou is only one hour by plane and just over three hours by high-speed train from Shanghai and Hong Kong.Business faculty positions at WKU offer:Extremely competitive salaries that are multi-year Tax-Free for citizens of countries such as U.S.A.Generous home leave, housing, schooling, and relocation allowances, as well as 8% front-load retirement benefits with immediate vesting.Research fundingA collegial environmentThe opportunity to teach high quality students with half of them go to the graduate schools at Top 50 Universities in the world.&nbsp;Wenzhou-Kean University is an Equal Opportunity Employer", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Wenzhou-Kean University is a Chinese-American jointly established higher education institution with Independent legal person status and limited liabilities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyODNcLzY0NFwvMjgzNjQ0MTViNjFlMWM1NTViMTU2ZjljNjM5MjZmMTYucG5nIiwiZWRpdHMiOltdfQ=="}