{"url": "https://academicpositions.com/ad/imec/2021/c-software-engineer/164297", "title": "C++ Software Engineer", "publish_date": "2021-10-06", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Computer Science, Electronics, Engineering, Image Processing, Programming Languages, and 1 moreSoftware Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "For hyperspectral imaging systemsWhat you will doIntroduction &amp; contextWithin imecâ\u0080\u0099s Systems &amp; Solutions, LifeSciences and Sense &amp; Actuate departments, we focus on the development of novel technologies for industrial and medical systems, built on top of imec technology differentiators. Current projects vary from lens free holographic imaging, hyperspectral imaging and other computational imaging systems that are tuned to specific customer requirements. Such technologies require a multidisciplinary approach within a team that has expertise in software, electronics, optics, and a drive to get things done. The hyperspectral imaging team is developing novel technology that drastically miniaturizes spectral imaging cameras. This opens a whole new range of applications that were previously assumed unachievable. To support the growth of the activities, imec is opening a position of C++ Software Engineer for the hyperspectral imaging systems within our Integrated Imaging group.The teamâ\u0080\u0099s mission is to further mature and integrate this core technology and enable our customers to develop new applications on top, in fields ranging from medical to agriculture and space. This has already brought non-invasive methods for Alzheimerâ\u0080\u0099s disease screening, in-field detection of crop diseases, multi-spectral satellite imaging from CubeSats and more.Software plays a crucial role in the success of our team as it is instrumental in enabling our customers to apply our technology successfully and reliably. For this, our software landscape is very heterogenous, ranging from hardware interfaces to evaluation software, demonstrators, and APIs. As a software engineer in our team, you will significantly contribute to developing and shaping this landscape, driving our roadmap further with a positive impact on the world around us.Your main responsibilities Contribute to the design and implementation of new features in our software Be hands-on with our hyperspectral camera systems to gain insights and feeling of the software quality and performance Collaborate with the support team by providing documentation of new features and help in 2nd line support Provide training to the team and customers and collect feedback on software and systems Participate in building demos and make demo software to showcase our technology on worldwide tradeshows Collaborate with your colleagues to define solutions and the plan of attack to everyday problems More informationâ\u0080\u0099s on http://www.imechyperspectral.com&nbsp;&nbsp;What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will determine the society of tomorrow.We are committed to being an inclusive employer (http://www.imec-int.com/en/careers#diversity) and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a competitive salary with many fringe benefits.Who you areYour profile 5+ years of software engineering experience Strong background in C++ for application and API development on Windows Experience with Qt, boost, Visual Studio, multi-threading Knowledge of Python, Git, CMake, Linux Making software to do useful things with hardware is an important driver for you&nbsp; Strong interest in the broader scope of your work, a generalist mindset Team player and eager to collaborate openly with colleagues Work methodologically: first think, then do Nice to have Experience in a scrum / agile environment Knowledge of CI/CD infrastructure Strong interest in and affinity with imaging Experience with software for vision systems ", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}