{"url": "https://academicpositions.com/ad/university-of-nottingham-ningbo-china-unnc/2021/professor-of-creative-industries-digital-media/161174", "title": "Professor of Creative Industries & Digital Media", "publish_date": "2021-07-06", "deadline": "2025-07-03", "location": "199 Taikang East Road Ningbo, China", "city": "N/A", "country": "China", "position": "Assistant Professor", "field": "Communication Design, Cultural Studies, Film Studies, Game Design, Journalism, and 1 moreMedia and Communication Studies", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham Ningbo China (UNNC)", "job_description": "Reference 181807Closing Date Thursday, 3rd July 2025Department Opportunities at the University of Nottingham in Ningbo ChinaSalary 731,551 RMB to 930,737 RMB Competitive SalaryJoin a unique British University in China.&nbsp; The University of Nottingham Ningbo China (UNNC) was the first Sino-foreign university to open its doors in China. This award winning campus offering a UK style education has grown to establish a student body of over 8,000 in just 16 years.A pioneer in Sino-foreign tertiary education, UNNC is rapidly expanding&nbsp;as part of the University of Nottinghamâ\u0080\u0099s Global University. The institution seeks ambitious, talented academics with a flair for research and a passion for teaching to join its team of experts, offering unique teaching and research opportunities in a highly dynamic economy.The School of International Communications is the largest school in the Faculty of Humanities and Social Sciences, and is affiliated to the Department of Culture, Media and Visual Studies at the Nottingham UK campus. Our BA (Hons) in International Communications is a provincial level accredited degree which includes a dedicated programme of study for a European or East Asian language. Its sister programme, BA (Hons) in International Communications with Chinese, has proved successful in attracting high quality international students to the school. We currently run an MA programme in International Communications and also have one of the most successful PhD programmes in the university.The post-holder will be expected to teach across the full range of our programmes, undertake supervision of BA and MA dissertation students and PGR students, and conduct research and external engagement in the schoolâ\u0080\u0099s main research areas. More details of the school and its teaching and research activities can be found here:https://www.nottingham.edu.cn/en/humanities-and-social-sciences/international-communications/home.aspxCandidates must have a PhD degree&nbsp;supported by extensive and high level research and teaching experience in communications studies that connects to the Creative Industries and Digital Media, which could include: Media technologies Film studies Digital heritage Digital Humanities Media convergence News media and journalism studies Cultural studies Games studies Celebrity Studies Candidates will need to have in depth knowledge of creative and cultural industries to enable the development of new knowledge, innovation and understanding in the relevant field. In addition, candidates will be required to have extensive experience in leading the design of research techniques and methods and capability to act as a role model in the areas of research and teaching.Minimum salary will be RMB731,551 per annum and negotiable based on background and experience.&nbsp;In addition, an attractive package including employment support allowance, international private medical insurance, and schooling support will be provided for international appointments.The post will initially be offered on a fixed term contract with the University of Nottingham Ningbo China for a period of 5 years starting Autumn 2021/as soon as possible. This contract may be extended on an indefinite basis by mutual agreement.All applicants are required to formally apply online via online system at:&nbsp;https://hrms.nottingham.edu.cn/psc/PRDHCM/EMPLOYEE/HRMS/c/HRS_HRAM.HRS_APP_SCHJOB.GBL?Page=HRS_APP_JBPST&amp;Action=U&amp;FOCUS=Applicant&amp;SiteId=1&amp;JobOpeningId=181807&amp;PostingSeq=1Informal enquires may be addressed to Dr Filippo Gilardi, Head of School of International Communications, email:&nbsp;filippo.gilardi@nottingham.edu.cn.&nbsp;Please note that applications sent directly to this address will not be accepted.Interview will be arranged in Ningbo or on Teams for oversea candidates.For more details and/or to apply online please access:&nbsp;https://hrms.nottingham.edu.cn/psc/PRDHCM/EMPLOYEE/HRMS/c/HRS_HRAM.HRS_APP_SCHJOB.GBL?Page=HRS_APP_JBPST&amp;Action=U&amp;FOCUS=Applicant&amp;SiteId=1&amp;JobOpeningId=181807&amp;PostingSeq=1If you are unable to apply online please contact Recruitment Team, Email: Job@nottingham.edu.cn&nbsp;Please quote ref.181807.&nbsp;Closing date: Open till filledFor other vacancies and more about working at the University of Nottingham Ningbo, China please see:&nbsp;http://www.universityjobsinchina.com/", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "We are run by The University of Nottingham with co-operation from Zhejiang Wanli Education Group, a key player in the education sector in China.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pZGlFblhTMmRhR3JraXlUOFVSNHZ5cEN0TjlQMXlCRFZCS2dTejNmLmpwZyIsImVkaXRzIjpbXX0="}