{"url": "https://academicpositions.com/ad/imec/2021/r-d-manager-imager-design/164109", "title": "R&D Manager Imager Design", "publish_date": "2021-10-01", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Electronics, Engineering, Engineering Physics, Image Processing,", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Lead a design team for development of application-driven solutions for novel imager sensors.What you will doWithin the imagers area, we focus on the development of application-driven solutions for novel imager sensors. Our ambition is to seek unique application solutions that leverage our expertise in both design and process technology.&nbsp;In this job, you will be the technical leader for imecâ\u0080\u0099s imager design team. You will oversee a design team for imagers, including analog and digital designers and test engineers. You and your team will work closely with pixel development and process integration teams.&nbsp;&nbsp;As R&amp;D Manager Imager Design you will: Manage and provide technical leadership to the imager design (including analog and digital designers), imager measurement and characterization team.&nbsp; Manage resource allocation of team members across multiple design projects. Follow up technical progress and ensure that key deliverables are met.â\u0080¯â\u0080¯&nbsp; Work closely with other technical leaders including key people in pixel development and process integration to review new project proposals. This includes evaluation of technical solutions, risks, and resource requirements.&nbsp; Interface with key customers when needed and work closely with imec technical and business teams to ensure that customer requirements are being addressed.â\u0080¯&nbsp; Report to management on overall status of running activities and provide action plans to address issues or to respond to changes in strategy.&nbsp; Provide mentorship to technical team and promote development of technical and non-technical skills.&nbsp; Quickly adapt to new business requirements and/or opportunities.&nbsp; What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible.â\u0080¯Together, we shape the technology that will determine the society of tomorrow.â\u0080¯&nbsp; We are proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;&nbsp; We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a competitive salary with many fringe benefits.&nbsp;&nbsp;Who you areYou have an MSc or PhD degree in engineering, physics, or other relevant discipline with at least 10 years of experience in imager design and development. Industry experience, including product development experience, is a plus. Your proven track record in defining, planning, and executing complex imager projects involving multi-disciplinary teams and aggressive milestones is key. As is your experience in leading technical teams and in managing people towards successful project execution and career growth. Your strong analytical skills help you to evaluate technical risks and drive decision-making. You have managed budgets and resources according to project needs. You have excellent communication skills for reporting externally towards customers and internally towards management. You are a team player with a personal drive to motivate teams towards technical and business objectives. Given the international character of imec, a fluent knowledge of English is necessary.â\u0080¯&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}