{"url": "https://academicpositions.com/ad/paul-scherrer-institute/2022/laser-scientist-tenure-track/173653", "title": "Laser Scientist (Tenure Track)", "publish_date": "2022-01-05", "deadline": "2022-02-28", "location": "Forschungsstrasse 111 Villigen, Switzerland", "city": "N/A", "country": "Switzerland", "position": "Assistant Professor", "field": "Applied Physics, Atomic, Molecular and Optical Physics, Optics, Spectroscopy,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Paul Scherrer Institute (PSI)", "job_description": "The Paul Scherrer Institute PSI is the largest research institute for natural and engineering sciences within Switzerland. We perform cutting-edge research in the fields of matter and materials, energy and environment and human health. By performing fundamental and applied research, we work on sustainable solutions for major challenges facing society, science and economy. PSI is committed to the training of future generations. Therefore, about one quarter of our staff are post-docs, post-graduates or apprentices. Altogether, PSI employs 2100 people.&nbsp;The Laboratory for Non-linear Optics LNO provides experimental capabilities in ultrafast laser physics at the Swiss Hard X-ray Free Electron Laser SwissFEL. The scientific publications can be found here. Inside this unit, the Gun Laser Group is internationally recognized for its competences in state-of-the-art laser technology applied to high-brightness electron accelerators, SASE and seeded Free Electron Lasers. For this group, we are looking for aLaser Scientist (Tenure Track)Your tasksEstablish future time-resolved laser spectroscopy facility and high-field mid-IR and THz sourceMaintain CPA lasers, expand experimental capabilities, and support R&amp;D activities at SwissFELEstablish an independent research program in new laser technologies and secondary sources based on OPCPA drive laserCoordinate laboratory activities in multi-disciplinary teams and projectsYour profilePhD degree in experimental physics / engineeringProven track record in R&amp;D of high-energy, high-power CPA/OPCPA laser systems and applications in nonlinear opticsExperience in numerical simulations and high-level programing languagesExcellent organizational and communication skills in EnglishWe offerOur institution is based on an interdisciplinary, innovative and dynamic collaboration. You will profit from a systematic training on the job, in addition to personal development possibilities and our pronounced vocational training culture. If you wish to optimally combine work and family life or other personal interests, we are able to support you with our modern employment conditions and the on-site infrastructure.This is a Tenure Track position. The employment contract will initially be limited to 3 years.For further information, please contact Dr Alexandre Trisorio, phone +41 56 310 53 02.Please submit your application online by 28 February 2022 (including CV, list of publications and addresses of referees) for the position as a Laser Scientist (Tenure Track) (index no. 6611-00).Paul Scherrer Institut, Human Resources Management, Elke Baumann, 5232 Villigen PSI, Switzerland&nbsp;Apply online now", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "PSI is the largest research centre for natural and engineering sciences within Switzerland, with its research activities concentrated on three main areas: Matter and Material, Energy and the Environment, and Health.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8wOVwvUFNJLUxvZ28tc2VwLmpwZyIsImVkaXRzIjpbXX0="}