{"url": "https://academicpositions.com/ad/silicon-austria-labs-sal/2021/master-thesis-aeroacoustic-characterization-of-piezoelectric-mems-microphones-f-m-d/173099", "title": "Master Thesis - Aeroacoustic Characterization of Piezoelectric MEMS Microphones (f/m/d)", "publish_date": "2021-12-17", "deadline": "N/A", "location": "Inffeldgasse 33 Graz, Austria", "city": "N/A", "country": "Austria", "position": "Master", "field": "Acoustics, Electrical Engineering, Engineering Physics, Mechanical Engineering, Signal Processing,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Silicon Austria Labs (SAL)", "job_description": "YOUR FUTURE RESPONSIBILITIESAs a part of the EU-funded AEROMIC project [1], this thesis aims to characterize the piezoelectric MEMS microphones for aeroacoustic measurements developed at SAL.The main tasks include:Packaging of piezoelectric MEMS microphonesElectrical and mechanical characterizationsAcoustic characterizations (e.g., sensitivity, bandwidth, and dynamic range)&nbsp;[1] This project has received funding from the Clean Sky 2 Joint Undertaking (JU) under grant agreement No 101007958. The JU receives support from the European Unionâ\u0080\u0099s Horizon 2020 research and innovation programme and the Clean Sky 2 JU members other than the Union. (https://aeromic-cleansky.eu/,&nbsp;https://cordis.europa.eu/project/id/101007958).YOUR PROFILETop master student with study or research background in aeroacoustics, MEMS, or other related fields.Interested in the acoustic characterization and microsystem or MEMS technologies.Experience with the characterization of acoustic sensors such as MEMS microphones and micro speakers.Knowledge of audio signal processing would be preferred.Good oral and written English skills.IMPORTANT FACTS ABOUT SALStart of Employment: Immediately.Limited position: Duration 6 months.This position is endowed with a gross annual salary of&nbsp;â\u0082¬ 1.545.- / month, based on the collective agreement for research (â\u0080\u009eForschungs-Kollektivvertragâ\u0080\u009c).Home Office possible.â\u0082¬ 4.- /day food allowance in restaurants / â\u0082¬ 2.- /day in supermarkets.Free Coffee/Milk/Tea.&nbsp;&nbsp;&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "In the network of science and industry, we carry out reÂ­search at the highest global reÂ­search level.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI3YjZcLzM0NlwvN2I2MzQ2ODRlNjQ2YThlYmM4ODM3ZmI2NDQ4OGM1NTcuc3ZnIiwiZWRpdHMiOltdfQ=="}