{"url": "https://academicpositions.com/ad/imec/2022/postdoc-hardware-spike-detection-and-data-compression-for-next-generation-cmos-neural-probes/175164", "title": "Postdoc: Hardware spike detection and data compression for next generation CMOS neural probes", "publish_date": "2022-02-11", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Algorithms, Artificial Neural Network, Computer Architecture, Data Structures, Electrical Engineering, and 3 moreElectronics,Programming Languages,Signal Processing", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Integrate massive multi-channel feature extraction algorithms on chip that enable clinical translation of next-generation neural probesWhat you will doTopic description: The brain is the most complex organ in the human body, containing billions of neurons. To understand the concepts by which the brain operates, large-scale in-vivo sensing of neuron populations has emerged as a key research technique. Microfabricated silicon neural probes have been established as the dominant technology in this field and have reached ever increasing densities and numbers of simultaneous recording electrodes. Thanks to the rapid development of CMOS technology, imec has recently demonstrated a state-of-the-art active microelectrode array with up to 1000 channels, which enables neurologists and researchers to monitor the brainâ\u0080\u0099s electrical activity in great detail.Despite this great progress in neuroscience tools, major bottlenecks to further increase the channel density in CMOS neural probes are the data-transmission bandwidth and the power consumption required to transmit the large amount of raw data. While for some applications access to raw data is an important requirement, brain-computer-interfaces (BCIs) and other clinical applications only require specific information about spike events and their features. By taking advantage of this characteristic, it is possible to think of a new generation of neural probes that are able to record from 1 million neurons at once and only send out the relevant information by exploiting online hardware spike detection and/or data compression.In this project, several online spike-detection and data-compression techniques will be explored in order to implement the most hardware-efficient integrated circuit for the detection and feature extraction of overlapping spikes in real time and with low latency. The circuits and algorithms must be area and power efficient to be implemented on chip and must achieve a considerable reduction of the data rates while maintaining the signal fidelity. The main goal is then to integrate massive multi-channel feature extraction algorithms on chip that enable clinical translation of next-generation neural probes.This is a multi-disciplinary project that requires interest and expertise in several domains:Digital and analog/mixed-signal IC designUnderstanding of BCI theoryNeural signal processing and spike sorting algorithmsData compression algorithmsArtificial neural networksType of work: Signal processing and analysis, IC prototype design and simulation, system integration and evaluation.What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will define the society of tomorrow.&nbsp;We are proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of an excellent 2-year scholarship.Who you areYou have (or will obtain in the near future) a PhD degree in Electrical Engineering or Computer ScienceYou have published in high-ranking conference and/or journals in the fieldYou have knowledge of analog/mixed-signal and digital IC design and verification flows and tools:&nbsp; Cadence Virtuoso including ADE (G)XL, layout and design verification (DRC, LVS, ERC)You have proven experience in data compression or spike sorting algorithmsYou have good programming skillsYou have excellent analytical skillsYou speak and write English fluentlyYou have good communication skillsThis postdoctoral position is funded by imec through KU Leuven. Because of the specific financing statute which targets international mobility for postdocs, only candidates who did not stay or work/study in Belgium for more than 24 months in the past 3 years can be considered for the position (short stays such as holiday, participation in conferences, etc. are not taken into account).", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}