{"url": "https://academicpositions.com/ad/leiden-university/2022/full-professor-of-modern-contemporary-european-literature-and-culture/174228", "title": "Full Professor of Modern/Contemporary European Literature and Culture", "publish_date": "2022-01-19", "deadline": "2022-02-28", "location": "Rapenburg 70 Leiden, Netherlands", "city": "N/A", "country": "Netherlands", "position": "Full Professor", "field": "Applied Linguistics, Cultural Studies, Germanic languages, Literary Theory, Romance languages, and 2 moreWest Germanic languages,World Literatures", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "Vacancy number 22-035 10582Function type Academic staffHours (in fte) 1External/ internal ExternalLocation LeidenPlaced on 18 January 2022Closing date 28 February 2022 40 more days to applyThe Leiden University Centre for the Arts in Society (LUCAS) is looking for aFull Professor of Modern/Contemporary European&nbsp;Literature and Culture, 1,0 fte (38 hours per week)Leiden University for the Arts in Society (LUCAS) seeks applicants for the position of Full Professor Contemporary European&nbsp;Literature and Culture.&nbsp;We are looking for a candidate who will play a pivotal role within LUCAS, both in terms of content, organization and academic leadership. We are in particular interested in candidates who count French or German literature as part of their primary expertise. The new chair will be a leading and recognised expert in the relevant research field and is internationally recognized as such, in both research and education. The candidate will strengthen LUCASâ\u0080\u0099 research profile and will help developing our Institute and its collaborations further, both nationally and internationally. We are searching for a candidate who feels at home and has proficiency in literary studies in its widest sense, including critical theory, cultural analysis and comparative approaches, also in relation to future challenges in society. The candidate will have experience in working in a versatile and multidisciplinary research community such as LUCAS and will possess the capacity to fruitfully connect disciplines and fields, as well as people, within the Institute, the Faculty and beyond.Key responsibilities:actively participating in the academic community of the Institute and showing leadership in connecting scholars and stimulating research, particularly between scholars in literary studies and modern European literatures and cultures;conducting high-quality, innovative academic research, presenting its results at conferences, in top-ranking peer-reviewed journals and with leading academic publishers, and translate these results to a wider audience;developing a sustainable research programme and research agenda that fits within LUCASâ\u0080\u0099 research profile;acquiring project funding at national, European and international level (NWO, ERC, Horizon Europe etc.);attracting and supervising PhD candidates and junior researchers;managing and supervising academics in different stages of their academic career, stimulating their research, teaching and professional development;preparing and teaching courses on a BA and (Research) MA level in their field, with a strong emphasis on programme innovation;engaging in all usual forms of instruction in these programmes, including supervising internships and excursions, supervising BA and (Research) MA theses;performing administrative and management tasks within LUCAS, the Faculty of Humanities and Leiden University.Requirements:The successful candidate:Will hold a PhD in the field of literary studies or modern European literature, with a multidisciplinary approach to research;will show the ability to bridge differences and seek connections between scholars and create synergies between programmes taught in LUCAS (such as film, French and German or other literatures taught)will show a keen interest in current academic debates and state-of-the-art concepts pertaining to the field, such as the position of literature in a broader socio-, political, cultural context, theoretical concepts, and the use of traditional and innovative methodologies;will be an internationally recognised expert in their field, with evidence of active, visible and ongoing collaborations with a national and international network of scholars, and visibility and recognition appropriate to the senior level of this position;will have an excellent track record of undertaking high-quality, original research that is evident from high-profile publications with well-established and world-leading international academic publishers;will have a successful track record in attracting both external funding and PhD candidates and junior researchers;will have the ability to connect their research to concerns in and beyond academia and a proven record of public engagement and impact;will demonstrate both academic leadership and a broad vision on and competence in research and education;will have a strong record of providing quality teaching and mentoring on BA, MA, Research MA, and PhD levels (as demonstrated by a University Teaching Qualification certificate and/or excellent teaching evaluations), and experience of curriculum development in the field of comparative literary and/or cultural studies;will have experience with management and leadership functions and a proven ability to inspire and unite in their leadership;will be flexible and a team worker, as well as a proactive leader with excellent communication skills and the ability to unite, initiate and build communities;will play an active role in the innovation of several teaching programmes in LUCAS and the Faculty of Humanities;will have a vision on the challenges facing academia, and in particular the Humanities, and clear ideas for its implementation;will not only be fluent in at least one language as specified above of the literatures/cultures of their research, but also in English on a (near) native level (spoken and written). If the successful applicant is not Dutch-speaking, they are expected to acquire a good command of Dutch within two years from taking up duty, for teaching, administrative and social purposes; the University will fund their Dutch training at the Universityâ\u0080\u0099s Academic Language Center.Faculty of HumanitiesA&nbsp;wealth of expertise in the fields of philosophy, (art) history, the arts, literature, film and cultural sciences, religious studies, linguistics and multidisciplinary area studies results in a unique Faculty of Humanities. Our global expertise, international focus and synergy of scientific approaches form windows to the world, opening up the many perspectives of a globalising world. In a century of large-scale levels of migration, intense and ever faster communication, cultural transformations and the politicising of culture and the rise of new (super) powers, the work and knowledge of the facultyâ\u0080\u0099s staff is of vital importance to our society, both inside and outside of the Netherlands.The Faculty of Humanities offers an inspiring and international work environment with room for diversity and growth for employees and students from the Netherlands and abroad.&nbsp;Our faculty is home to more than 8,000 students and 800 staff members.&nbsp;It offers a wide range of education, with students being able to choose from no less than&nbsp;26 Bachelorâ\u0080\u0099s and 27 Masterâ\u0080\u0099s degree programmes. The Facultyâ\u0080\u0099s&nbsp;research&nbsp;is organised within seven institutes and contributes to six research dossiers for research at Leiden University.&nbsp;For more information&nbsp;see:&nbsp;https://www.universiteitleiden.nl/en/humanities.LUCASThe Leiden University Centre for the Arts in Society (LUCAS) is one of the&nbsp;seven research institutes of the Faculty of Humanities. It aims to be a prominent player in the research field of the arts (literature, art, architecture, media and design).&nbsp;LUCAS is dedicated to ground-breaking research that explores the multifaceted relationships between the arts and society. It hosts a range of academic disciplines and is a hub for interdisciplinary collaborations regarding the relationships between the arts and society from multi- and interdisciplinary perspectives. Our members study cultural production over the course of two millennia, from classical antiquity to our contemporary world.&nbsp;The successful candidate will be one of the seven full professors within the&nbsp;research cluster&nbsp;Modern and Contemporary Studies. This cluster is home to over 100 senior staff members and PhD candidates in a wide range of fields organised into six research themes.Terms and conditions&nbsp;We offer a full-time temporary appointment for initially a period of 18 months, convertible into a permanent position in case of satisfactory performance. If the successful candidate has already held a full professorship or if they have successfully completed a tenure track, they may be eligible for a permanent appointment. &nbsp;The gross monthly salary will be between â\u0082¬ 5.843,- and â\u0082¬ 8.508,- commensurate with qualifications and experience. These amounts are based on a fulltime appointment and are in conformity with current salary scales (HL-2) under the collective employment agreement (CAO) for Dutch Universities.An appointment at Leiden University includes pension build-up and other benefits, including an annual holiday premium of 8% and an end-of-year premium of 8.3%. Candidates from outside the Netherlands may be eligible for a substantial tax break.&nbsp;For international spouses we have set up a dual career programme.&nbsp;For more information, see&nbsp;https://workingat.leiden.edu/&nbsp;More information about the terms of employment can be found at:&nbsp;https://staff.leiden.edu.After appointment, depending on experience and formal qualifications to date, the successful applicant will be required to enter a nationally standardized tertiary teaching skills certification trajectory (BKO or&nbsp;Basis Kwalificatie Onderwijs), successful completion of which is a condition for favorable assessment in work reviews.DiversityLeiden&nbsp;University&nbsp;is strongly committed to diversity within its community and especially welcomes applications from members of underrepresented groups.InformationEnquiries about the Chair can be made to Prof Dr Sybille Lammes, Academic Director of LUCAS, e-mail:&nbsp;s.lammes@hum.leidenuniv.nl. Enquiries about the procedure and conditions can be made to&nbsp;im-lucas@hum.leidenuniv.nl.ApplicationsPlease submit your application no later than 1 March 2022 via our e-recruitment portal in the form of a single PDF file that contains the following items in the following order:Curriculum Vitae including a list of publications and research projects;a cover letter stating your motivation (max. 1 A4);an outline of your research plans for the coming 5 years and their fit within the LUCAS research agenda (max. 2 A4);an outline of your teaching vision and plans for the coming 18 months (max. 2 A4);an outline of your vision on academic leadership and your role within the academic community (max. 1 A4);names of three references (please list these in your CV rather than entering them into the system).The selection procedure may include a trial lecture and an assessment. Interviews with shortlisted candidates are expected to take place in March and April 2022.Acquisition following this advertisement is not appreciated.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Leiden University was founded in 1575 and is one of Europeâ\u0080\u0099s leading international research universities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5NWZcLzc3Y1wvOTVmNzdjYjE3YjNmODExNDlkZmNlYmIyYWRmYzc1MWQucG5nIiwiZWRpdHMiOltdfQ=="}