{"url": "https://academicpositions.com/ad/imec/2022/postdoctoral-researcher-biofet-device-modeling-engineer/174887", "title": "Postdoctoral Researcher biofet device modeling engineer", "publish_date": "2022-02-04", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Applied Physics, Bioengineering, Electrical Engineering, Electronics, Engineering Physics, and 1 moreInstrumentation Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Creating SPICE-level compact models for nanopore field effect transistors (NPFETs) and gate-exposed FinFETs (BIOFETs)What you will doThe progress in CMOS process technology enabled to manufacture nano-scale Field-Effect Transistors (FETs). This has opened doors not just for better computing but also for bio-sensing area, such as proteins and DNA sensors. Massive parallelization, enabled by large-scale integration, can be used for analysing biological systems, resulting in more complete view of a biological system at a reasonable cost. The design of such large sensors arrays takes advantage of the IC design flow and SPICE-level model must be developed for bio-sensors as well.&nbsp;In this postdoc position, you will create SPICE-level compact model for nanopore field effect transistors (NPFETs) and gate-exposed FinFETs (BIOFETs). The compact model will be based on TCAD models and measurements of existing devices. The model will be used to simulate and optimize the signal and noise response of complete large-scale sensor systems. This model will also form the basis of the theoretical exploration of different measurement strategies.&nbsp;&nbsp;This topic requires understanding of semiconductor physics, experimental biosensor device, and basics of circuit design. You will therefore interact closely with device and integration experts, TCAD modelling experts, and circuit specialists.&nbsp;&nbsp;What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible.â\u0080¯Together, we shape the technology that will determine the society of tomorrow.â\u0080¯&nbsp;We are proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a competitive scholarship.&nbsp;Who you areYou have obtained a PhD in science or electrical engineering.You have knowledge of device physics and bio-sensor engineering.We value your experience in electrical, compact device modelling, noise analysis and TCAD.You are a communicative team player, but you can work independently.You are creative and like taking initiative; you are persuasive and assertive, while keeping a constructive attitude.Given the international character of imec, a fluent knowledge of English is necessary.This postdoctoral position is funded by imec through KU Leuven. Because of the specific financing statute which targets international mobility for postdocs, only candidates who did not stay or work/study in Belgium for more than 24 months in the past 3 years can be considered for the position (short stays such as holiday, participation in conferences, etc. are not taken into account).&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}