{"url": "https://academicpositions.com/ad/imec/2021/postdoctoral-researcher-pathfinding-for-2d-materials-based-experimental-nanosheet-devices/164520", "title": "Postdoctoral Researcher Pathfinding for 2D-materials based experimental nanosheet devices", "publish_date": "2021-10-11", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Applied Physics, Chemistry, Electronics, Engineering, Experimental Physics, and 5 moreMaterials Chemistry,Materials Engineering,Materials Physics,Nanotechnology,Physics", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Building most advanced transistorsWhat you will doWhile fundamental research keeps providing new device insights and understanding in material processing, the potential application space for 2D-materials is still expanding [D. Akinwande et al., Nature573,507â\u0080\u0093518 (2019)]. Ab-initio modelling predicts semi-conducting transitionmetal dichalocogenides (TMD) being interesting candidate materials for transistors with ultimate gate length scaling [A. Afzalian et al, SISPAD (2019)]. Additionally, insight studies are pointing in the direction of nanosheet device architectures [Ahmed et al, IEDM 2020]. The goal of this project is to verify experimentally the potential of such a device and identify key parameters determining the overall performance.&nbsp;&nbsp;This work requires a double approach. The experimental workflow contains the fabrication of the nanosheet stacks and the development of specific process steps. The final device will be fabricated in a lab-2-fab approach, keeping CMOS compatibility central. Also, detailed electrical device characterization is required. Correlation of these finding with other inspection techniques contributes to the overall understanding of device operation. This performance assessment will help the modelling team to further elaborate on the models.&nbsp;&nbsp;&nbsp;&nbsp;At imec, we have a large expert team with various backgrounds in materials and process development, 300 mm and lab integration, device learning and modelling. You will be part of the device team with a strong contribution in integration. 80% of the work will be experimental work, 20% literature and modeling.What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will determine the society of tomorrow.We are proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a competitive scholarship.Who you are You have a PhD in a related topic (nanosheet, 2D devices, graphene, ..) You have a background in material physics, electron device physics Hands-on experience in lab-processing is a plus. You are a communicative team player, but still you are able to work independently. You like taking initiative; you are persuasive and assertive, while keeping a constructive attitude. You show the flexibility to change between different projects according to changing priorities. Given the international character of imec, a fluent knowledge of English is necessary. This postdoctoral position is funded by imec through KU Leuven. Because of the specific financing statute which targets international mobility for postdocs, only candidates who did not stay or work/study in Belgium for more than 24 months in the past 3 years can be considered for the position (short stays such as holiday, participation in conferences, etc. are not taken into account).Apply online at www.imec.be/jobs.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}