{"url": "https://academicpositions.com/ad/silicon-austria-labs-sal/2022/scientist-power-electronics-f-m-d/174944", "title": "Scientist - Power Electronics (f/m/d)", "publish_date": "2022-02-07", "deadline": "2022-05-07", "location": "Inffeldgasse 33 Graz, Austria", "city": "N/A", "country": "Austria", "position": "Researcher", "field": "Applied Physics, Electrical Engineering, Electronics, Engineering Physics, Systems Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Silicon Austria Labs (SAL)", "job_description": "YOUR FUTURE RESPONSIBILITIESDesign and characterization of innovative power electronic modules and systems for future power electronics applications.Use and manage state-of-the-art laboratory equipment for power semiconductor devices &nbsp;and modules characterization, with the aim to setup and validate simulation models.Exploit the benefits of newest semiconductors and packaging technologies in emerging applications such as e.g., providing novel solutions to the e-mobility market.Work with an interdisciplinary and multicultural team of experts, including international and national academic and industrial partners, within the scope of research projects in the field of power electronic systems and technologies.Scientific dissemination of your research results in international conferences and journals.Write and contribute to funding proposals and project acquisition, also in collaboration with industrial partners.Seek for new research opportunities and proactively contribute to project results.YOUR PROFILEBackground (master degree with relevant work experience or completed PhD) in electronics or electrical engineering, technical physics or similar. Focus on power electronics is preferred.Proven ability of working independently with laboratory equipment.Practical experience with designing, simulating, prototyping and start-up power electronic systems and implementation of innovative control algorithms.Familiar with most common electric circuit simulation tools (Plecs, LTSpice, GeckoCircuits, ..).Knowledge of Electronic design tools (Altium Designer, Fusion360â\u0080¦).Basic programming (C, C++, Java, or other object-oriented programming language) and script based programming skills (e.g. Python, Matlabâ\u0080¦).Knowledge of power electronic topologies and architectures, their control, simulation and experimental is a plus.Experience with FPGA/SoCs and/or microcontroller platforms, and rapid control prototyping systems in combination with power electronics control implementation is a plus.Knowledge in multi-physics simulations is a plus.IMPORTANT FACTS ABOUT SALStart of your employment: as soon as possible.Home Office possible.â\u0082¬ 4.- /day food allowance in restaurants / â\u0082¬ 2.- /day in supermarkets.Family- &amp; Kids friendly.Free Coffee/Milk/Tee and fresh fruits.â\u0080\u008bThis position is subject to the Collective Agreement for employees in non-university research (Research CA) starting in occupational group E (E1 salary = EUR 3.274, paid 14 times a year - based on 38,5 hours per week). For this position we offer competitive salaries and additional benefits based on your experience and qualifications, starting with a minimum salary of EUR 56.000 (annual, based on an All-in contract and bonus).ABOUT USSilicon Austria Labs (SAL) is a top research center for Electronic Based Systems (EBS). At three locations (Graz, Villach, Linz), SAL is conducting research along the entire EBS value chain in the areas of sensor systems, power electronics, RF (radiofrequency) systems, system integration and embedded systems to develop future-oriented solutions for industrial production, health, energy, mobility, safety and more. SAL brings together key players from industry, science and research and thus valuable expertise and know-how and conducts cooperative, application-oriented research along the value chain. Cooperative projects are co-financed by SAL and enable a fast and unbureaucratic project start. SAL is thus shaping the high-tech location Austria and Europe and developing the future&nbsp;Innovation is our top priority and so are our employees. We are a family-friendly company and support the compatibility of work and family as much as possible. That is why we have been awarded the Work and Family Certificate until 2023. But we are constantly working on new measures to offer our employees an environment where they feel good, healthy and motivated.Innovation is our top priority and so are our employees. We are a family-friendly company and support the compatibility of work and family as much as possible. That is why we have been awarded the Work and Family Certificate until 2023. But we are constantly working on new measures to offer our employees an environment where they feel good, healthy and motivated.You want to get more SAL insights?", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "In the network of science and industry, we carry out reÂ­search at the highest global reÂ­search level.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI3YjZcLzM0NlwvN2I2MzQ2ODRlNjQ2YThlYmM4ODM3ZmI2NDQ4OGM1NTcuc3ZnIiwiZWRpdHMiOltdfQ=="}