{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/research-associate-fellow-surface-chemical-analysis-fixed-term/175206", "title": "Research Associate/Fellow: Surface Chemical Analysis (Fixed term)", "publish_date": "2022-02-11", "deadline": "2022-03-03", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Research Assistant", "field": "Analytical Chemistry, Medicinal Chemistry, Pharmacy & Pharmacology, Surface Chemistry,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference SCI055822Closing Date Thursday, 3rd March 2022Job Type ResearchDepartment PharmacySalary Â£27924 to Â£35326 per annum (pro rata if applicable) depending on skills and experience (minimum Â£31406 with relevant PhD).We are seeking a Research Associate/Fellow to support surface chemical analysis research within the School of Pharmacy as well as from other departments at the University of Nottingham. The role will primarily involve the operation of a time-of-flight secondary ion mass spectrometer (ToF-SIMS) and 3D OrbiSIMS instrument [Passarelli et al. Nature Methods 2017]. Working closely with Dr. David Scurr and Prof. Morgan Alexander, the role is an opportunity to undertake research employing state-of-the-art secondary ion mass spectrometry (SIMS) instrumentation and data analytics. The University of Nottingham is the first of only two academic institutions worldwide to possess a 3D OrbiSIMS instrument.&nbsp;The aim of the post is to facilitate SIMS instrument access, operations and training for users (typically PhD students and post-doctoral researchers), consulting on aspects covering experimental design, data acquisition / analysis and reporting. These interactions generate multidisciplinary collaborative high impact research opportunities within the School of Pharmacy as well as within other schools including Physics, Life Sciences, Medicine and Chemistry. As well as supporting research at the University of Nottingham, the role holder will have the opportunity to develop their own areas of independent research and build national and international collaborative research projects and networks. &nbsp;Candidates should have, or be close to completion of, a PhD in a discipline relevant to mass spectrometry. Experience of mass spectrometry and associated data analysis is essential. Experience of ToF-SIMS, 3D OrbiSIMS, or Orbital trapping mass spectrometry would be beneficial. The candidate will be required to support research activities through the day-to-day management of the Nottingham SIMS Facility. Candidates must have excellent communication skills, an aptitude for critical thinking and a flexible approach to collaborative research.This full-time post (36.25 hours per week) will be offered on a fixed-term contract for 36 months. Job share arrangements may be considered.Informal enquiries can be addressed to Dr. David Scurr (david.scurr@nottingham.ac.uk) and / or Prof. Morgan Alexander (morgan.alexander@nottingham.ac.uk). Please note that applications sent directly to these email addresses will not be accepted.Our University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileAdditional InformationApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}