{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/research-development-specialist-in-fast-prototyping-and-network-engineer/174951", "title": "Research & Development Specialist in Fast prototyping and network engineer", "publish_date": "2022-02-07", "deadline": "2022-03-15", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Engineer/Technician", "field": "Algorithms, Applied Mathematics, Computational Engineering, Computational Mathematics, Computer Communications (Networks), and 5 moreElectrical Engineering,Electronics,Operating Systems,Programming Languages,Software Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "The University of Luxembourg seeks to hire a technician at its Interdisciplinary Centre for Security, Reliability and Trust (SnT) for the Space research activities. SnT is a recently formed centre carrying out interdisciplinary research in secure, reliable and trustworthy ICT (Information and Communication Technologies) systems and services, often in collaboration with industrial, governmental or international partners. SnT is active in several international research projects funded by the EU H2020 programme, the European Space Agency and the spaceresources.lu initiative from the Ministry of Economy. The Centre is currently expanding its research activities in relation to the Space research and is seeking highly motivated technician who wish to support research and Laboratories in close cooperation with our Research teams and the partners related to Space and the Interdisciplinary Space Master. For further information, you may check: www.securityandtrust.luWeâ\u0080\u0099re looking for people driven by excellence, excited about innovation, and looking to make a difference. If this sounds like you, youâ\u0080\u0099ve come to the right place!Your Role..The successful candidate will support all the laboratories of universityâ\u0080\u0099s Interdisciplinary Space Master and the research activities related to LunaLab, Zero-G Lab, CubeSat Lab, Concurrent Design Facility and 5G-SatCom Lab.The position holder will be required to perform the following tasks:Help on the setup and maintenance of the LabsInstallation and configuration of computers and networksUse and maintenance of the 3D printerPurchase of equipment and material for the LabsSetup and maintenance of new equipment (e.g. robots, Software-defined radios, etc)Implement basic programs and algorithmsSupport code developmentOrganize the video recordings of lecturesParticipating in project deliverablesEnsure scientific quality managementContribute to scientific publicationsResearch existing technologies and contribute to technology, benchmarks, selection and methodologies to apply to new and ongoing research projectsConceptually design IT solutions within research projects (e.g. develop/code programs and/or systems, create new methods, etc.) mainly focused in network architecture and fast prototypingYour Profile..Qualification: The candidate should possess a Master degree or equivalent in Electronic Engineering, Computer Science or Applied Mathematics.Experience: The ideal candidate should have some knowledge and experience in the following topics:Linux and Windows administration user levelCAD design, for 3D printingIT networks setup and management (e.g. Cisco, Mikrotik)The following topics will be considered as an assetPlan, produce, and assemble new or changed mechanical parts for productsDevise, fabricate, and assemble new or modified mechanical components for productsProgramming experience (e.g., C, C++, python programming and debugging. Familiarity with ROS, LabView0Language Skills: Fluentwritten and verbal communication skills in English are required.Hereâ\u0080\u0099s what awaits you at SnT..Exciting infrastructures and unique labs. At SnTâ\u0080\u0099s two campuses, our researchers can take&nbsp;a walk on the moon at the LunaLab, build a nanosatellite, or help make autonomous vehicles even betterThe right place for IMPACT.&nbsp;SnT researchers engage in demand-driven projects. Through our&nbsp;Partnership Programme, we work on projects with more than 45 industry partnersBe part of a multicultural family. At SnT we have more than 60 nationalities. Throughout the year, we organise team-building events, networking activities and moreFind out more about us!In Short..Contract Type: Fixed Term Contract 24 Month (extendable to 5 years)Work Hours: Full Time 40.0 Hours per WeekStarting date: as soon as possible (upon agreement)Location:&nbsp;KirchbergJob Reference:&nbsp;UOL04762How to apply..Applications should include:Curriculum Vitae (including your email address, work experience, publications)Cover letter indicating relevant experience and your motivationContact information for 2 referees&nbsp;All qualified individuals are encouraged to apply.We ensure a full consideration for applications received by 15/03/2022 - then the posting will remain online until filled.Please apply ONLINE formally through the HR system. Applications by Email will not be considered.The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.About the University of Luxembourg..University of Luxembourg is an&nbsp;international research university with a distinctly multilingual and interdisciplinary character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.Further informationFor further information, please contact us at Miguel.olivaresmendez@uni.lu", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Luxembourg aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international, multilingual and interdisciplinary character.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}