{"url": "https://academicpositions.com/ad/graduate-school-quantitative-biosciences-munich-qbm/2021/upcoming-phd-positions-at-the-graduate-school-of-quantitative-biosciences-munich-qbm/164775", "title": "Upcoming PhD positions at The Graduate School of Quantitative Biosciences Munich (QBM)", "publish_date": "2021-10-15", "deadline": "N/A", "location": "ButenandtstraÃ\u009fe 1 Munich, Germany", "city": "N/A", "country": "Germany", "position": "PhD", "field": "Biochemistry, Bioinformatics, Biology, Biomedicine, Biophysics, and 6 moreBiostatistics,Chemistry,Computational Biology,Medicine,Molecular Biology,Physics", "salary": "N/A", "max_working_hours": "N/A", "employer": "Graduate School of Quantitative Biosciences Munich (QBM)", "job_description": "Thanks to all the academics who submitted their applicationThe application deadline has passed and the selection process started. More information for the new call-out will come up in early 2022. Stay tuned!Our Graduate School invites excellent students from all over the world and different primary disciplines that range from Medical Science, Biology, Biochemistry, Engineering, Bioinformatics, Physics to Applied Math, to work on an&nbsp;interdisciplinary PhD project in life science. Become a part of our unique research network comprising Ludwig-Maximilianâ\u0080\u0099s-University Munich (LMU), Technical University Munich (TUM), Max-Planck Institutes (MPI) and the Helmholtz Center Munich at one of Europeâ\u0080\u0099s highest-ranked universities.Benefit from the inspiring spirit in our school and our&nbsp;individualized courses&nbsp;like programming and data analysis with R, Python and MatLab, statistics, bioinformatics, biophysics and life science in&nbsp;small classes, tailored to your PhD project. Acquire in-demand and more specialized skills in our bonus lectures and transferable skills courses that will boost your PhD project!&nbsp;Read more about our doctoral program here:&nbsp;https://qbm.genzentrum.lmu.de/phd-program", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "QBM is designed to prepare young life scientists for the emerging era of quantitative, systems-oriented bioscience.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5ZmFcL2UzMVwvOWZhZTMxNDU4NmQ2MzcwZTIwNTdhZDI5YTJjYzEyZGIucG5nIiwiZWRpdHMiOltdfQ=="}