{"url": "https://academicpositions.com/ad/leiden-university/2022/senior-research-analyst/175144", "title": "Senior research analyst", "publish_date": "2022-02-10", "deadline": "2022-03-15", "location": "Rapenburg 70 Leiden, Netherlands", "city": "N/A", "country": "Netherlands", "position": "Researcher", "field": "Biophysics, Cell Biology, Mathematical Physics, Molecular Biology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "Vacancy number 22-073Function type Academic staffHours (in fte) 0.8External/ internal ExternalLocation LeidenPlaced on 8 February 2022Closing date 15 March 2022 33 more days to applyThe Faculty of Science and the Leiden Institute of Physics invite applications forSenior research analyst (0.8 fte)Vacancy number 22-073As a senior research analyst your primary task is to support biophysics research, in particular in the work in the group of prof. John van Noort. The main focus in the group is the organization of DNA in eukaryotes and the development of single-molecule techniques to study this. In addition, as part of a small group of research technicians, up to 25% of your time will be spend on supporting related work of other groups in and outside LION.&nbsp;Key responsibilitiesThe successful candidate will be expected to:Design new DNA substrates with various sequences and chemical modifications;Functionalize proteins and microfluidic devices to include specific interactions and fluorophores;Produce designed DNA substrates in high quality for reconstitution of chromatin;Help graduate and undergraduate students with various backgrounds (physics/biology/chemistry) to handle these materials and successfully perform experiments with them;Keep up to date with technical advances in the field of molecular biology and introduce them to the group;Manage the safety and inventory of a small molecular biology laboratory;Actively participate in sharing knowledge with a team of research technicians.Selection criteriaThe successful candidate should:Have relevant working experience, preferably as a graduate student in the field of molecular biology and/or (bio)physicsHave a practical â\u0080\u0098can-doâ\u0080\u0099 attitude and experience in the DNA manipulation, analysis and purification (techniques such as: PCR, digestion, cloning, plasmid harvesting, capillary electrophoresis, Nanopore sequencing)Be a flexible, enthusiastic and independent co-worker that exercises a high quality standard while taking initiative to improve methods and practices in the lab.Be able to communicate with colleagues on scientific topics in fluent English (oral/written).Research at our faculty and instituteThe Leiden Institute of Physics (LION) is one of the oldest physics institute in the Netherlands. LION is part of the Faculty of Sciences at Leiden University and covers a broad spectrum of physics research and education. Ranging from cosmology to the mechanics of DNA, from the physics of jamming in granular materials to quantum nano-science, from protein folding to super lubricity. All topics are covered by joined efforts in theory and experiment. One of LIONâ\u0080\u0099s core research efforts is Biophysics.Within LION van Noortâ\u0080\u0099s biophysics group is working on DNA organization. The research is an interdisciplinary mixture of physics, chemistry and (molecular) biology and focuses on:1. Resolving the structure of DNA organization in eukaryotes2. Studying the relation between DNA organization and transcription regulation3. Development of instrumentation and statistical physics models to advance single-molecule studiesTerms and conditionsSalary range from â\u0082¬ 2.846, to â\u0082¬ 4.490 gross per month on a 1,0 fte base (pay scale 10), depending on education and experience level of the candidate. The contract will be for a one year, with a possible extension to a permanent position, based on performance.Leiden University offers an attractive benefits package with additional holiday (8%) and end-of-year bonuses (8.3%), training and career development and sabbatical leave. Our individual choices model gives you some freedom to assemble your own set of terms and conditions. Candidates from outside the Netherlands may be eligible for a substantial tax break.DiversityLeiden University is strongly committed to diversity within its community and especially welcomes applications from members of underrepresented groups.InformationEnquiries can be made to Prof.dr.ir. John van Noort, noort@physics.leidenuniv.nl, tel. 071 527 5890 or you can visit https://physics.leidenuniv.nl/vannoort&nbsp;ApplicationsPlease send an email to Yvonne Kerkhof (kerkhof@physics.leidenuniv.nl). Please ensure that your applications includes a cover letter that quotes the vacancy number and a Curriculum vitae. Only applications before March 15, 2022 can be considered.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Leiden University was founded in 1575 and is one of Europeâ\u0080\u0099s leading international research universities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5NWZcLzc3Y1wvOTVmNzdjYjE3YjNmODExNDlkZmNlYmIyYWRmYzc1MWQucG5nIiwiZWRpdHMiOltdfQ=="}