{"url": "https://academicpositions.com/ad/ku-leuven/2022/post-doctoral-researcher-in-autonomous-inland-shipping/175097", "title": "Post-doctoral Researcher in Autonomous Inland Shipping", "publish_date": "2022-02-09", "deadline": "2022-05-30", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Control Systems Engineering, Electrical Engineering, Electronics, Materials Engineering, Mechanical Engineering, and 3 moreMechatronics,Robotics,Systems Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-90)The Robotics research at KU Leuven Department of Mechanical Engineering has pioneered robotics research in Europe since the mid-1970s. It has covered virtually all aspects of sensor-based robotics, from the high-level task specification down to low-level sensor-based control, and applied the research results in a variety of industrial applications. In the last decade the group shifted its attention towards system medical and logistic applications . The Intelligent Mobile Platform (IMP) group is a multi-disciplinary and multi-campus research group originating from the robotics research with a focus on the intelligent design and control of the mobile platforms of the future with a special focus on waterway transport applications. The industrial relevance of the department's research activities is witnessed by its many spin-off companies and its tradition of close industry collaboration in numerous European, national, and bilateral projects. Campus Group T is an internationally oriented campus of KU Leuven undertaking education, research, and services in the fields of engineering, enterprising, and educating. Campus Group T aims to create an environment in which students and professors alike can develop themselves by experiencing these core activities, both locally and internationally.Website unitResponsibilitiesYou will assist in the coordination of various research projects at the Intelligent Mobile Platform (IMP) research group at&nbsp; KU Leuven within the domain of autonomous inland shipping. This dynamic and young research group is expending rapidly within an emerging new domain with tremendous challenges at various levels (ship design, drive train, control, communication, ..). Expertise in the domain of marine engineering/design is a big asset but not essential. Profound knowledge of software design in C/C++ or Python is however essential.&nbsp;The chosen candidate will need to take the lead in:The development of an open source software platform (including KAFKA) for the control of autonomous inland vessel (in collaboration with the other researchers).The development and maintenance of a state-of-the-art autonomous scale model vessel to perform experimental validations.You will take new initiates and write new research proposals within the field and follow up and extend the current relations with academic and industrial partners. This includes the organization of research event and a yearly international conference.You will guide various PhD researchers/job students and master's students and you are responsible for the maintenance and coordination of our research facilities.Currently the IMP group has multiple running project in the domain of autonomous inland shipping where you will be involved:Localization of inland vessel based on sensor fusion (H2020-IWNET project);Demonstrate autonomous inland shipping in a city context (INTERREG-AVATAR project);Shared situational awareness (VLAIO-SSAVE);Point cloud data processing (VLAIO-CUMULUS);You will be encouraged to extend the scope of our research group towards other relevant inland waterway transport technologies (drive train, remote control, ship design, ..) depending on your interests and ambitions.ProfileYou are the holder of a doctoral degree in Engineering Technology, Engineering Science, Computer Science or equivalent.You have the ambitions and competences to coordinate research projects.You have the ambitions and competences to specify and write new research proposals.You are able to take the lead in a young and dynamic research group.You have expertise in real-time software development for mechatronic systems (Python, C++,C).You can work independently and pro-actively, you have a sense of order and you are accurate and stress resistant.You are analytical, results-oriented and student centered.You have excellent communication skills (written and spoken) in English. This means an IELTS of at least band 7 (reading, writing and speaking) or equivalent. Knowledge of Dutch is an asset.You have a ICC certificate or are willing to obtain it.OfferWe offer a post-doctoral position in a stimulating and multi-disciplinary environment and with a strong industrial network. You will&nbsp; be encouraged to strengthen your academic profile in order to apply for upcoming permanent academic vacancies within KU Leuven.&nbsp; Your job location will be in Leuven.Interested?For more information please contact Prof. dr. ir. Peter Slaets, tel.: +32 16 32 27 73, mail: peter.slaets@kuleuven.be.You can apply for this job no later than May 30, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}