{"url": "https://academicpositions.com/ad/emlyon-business-school-campus-france/2021/full-time-faculty-positions-at-emlyon-business-school-france/173414", "title": "Full-time Faculty Positions at emlyon business school - FRANCE", "publish_date": "2021-12-21", "deadline": "2022-03-22", "location": "23, avenue Guy de Collongue Ã\u0089cully, France", "city": "N/A", "country": "France", "position": "Other Category", "field": "Business Administration, Business Economics, Entrepreneurship, Management, Marketing,", "salary": "N/A", "max_working_hours": "N/A", "employer": "emlyon business school Campus France", "job_description": "THE POSITIONSemlyon business school invites applications for following full-time Faculty positions:&nbsp;A full-time position in Entrepreneurship at Full professor levelA full-time position in Corporate Entrepreneurship / Innovation Management at Associate or Full professor levelA full-time position in Sport Marketing at Associate or Full professor level&nbsp;Appointments are made at full Professor, Associate Assistant, depending on research, teaching record and business experience.All these positions are based in France (Lyon - St Etienne â\u0080\u0093 Paris)Rank of appointment and salary will be commensurate with qualifications and experience. Salary and conditions will be competitive with leading European Business SchoolsSuccessful candidates are expected to start by September 2022.&nbsp;We strongly encourage people of all backgrounds (gender, ethnic background, nationality) to apply.Fluency in English is required. Speaking French is not a requirement but holding French basic notions will be an asset. For non-French professors basic language support is offered at emlyon.The selected candidate is expected to be based in Lyon or nearby area. Emlyon has set-up a relocation policy to support the moving process.&nbsp;THE SCHOOLemlyon&nbsp;business school, one of the leading French Grandes coles in Management, has consistently been ranked among the top European Business Schools. It holds a triple accreditation (AACSB, EQUIS, and AMBA) and offers a wide range of programs including a BBA, MSc in Management, Specialized Master's degrees, MBA, DBA, PhD, as well as open and tailor-made executive programs.emlyon business school is ranked among the top 100 best universities and business schools of the world, in the latest Shanghai ranking. In the Management category, the school reaches the top 3 of best French business schools.&nbsp;World-class institution, emlyon welcomes in its Faculty 170 highly qualified professors whose research inform the scientific conversation as well as the economic and social debates. These professors share and diffuse their knowledge and expertise with all our participants via innovative pedagogical designs.&nbsp;The school counts seven campuses around the world: Lyon, Saint-Ã\u0089tienne, Paris, Casablanca, Shanghai, Bhubaneswar and Mumbai.&nbsp;&nbsp;&nbsp;THE ENVIRONMENTemlyon&nbsp;business school&nbsp;is at the center of a vibrant ecosystem of large universities with excellent research teams in engineering, computer science, natural sciences, social sciences, and the humanities (see:&nbsp;https://www.onlylyon.com/en)Lyon is the second largest city in France, with a long tradition in entrepreneurship and with a strong digital industry.&nbsp;Further informationAbout emlyon&nbsp;business school&nbsp;:&nbsp;http://www.em-lyon.com/en/&nbsp;THE APPLICATION SHOULD CONSIST OF&nbsp;A cover letter including motivation to join&nbsp;emlyon business schoolA teaching statement (with teaching evaluation)Research samplesAn up-to-date curriculum vitaeReference letters from two referees&nbsp;All application materials should be submitted in English. The application materials will not be returned.&nbsp;Candidates are strongly encouraged to apply as soon as possible as review of applications will begin immediately.Interested candidates should apply electronically through emlyon business school recruitment webpage:HERE", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "emlyon business school, one of the leading French Grandes Ecoles in Management, has consistently been ranked among the top European Business Schools.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI0ZmVcL2Q0YVwvNGZlZDRhOTBkZTQ2YmJlNDhhYjdkOTMwYmM0YTQ0OTgucG5nIiwiZWRpdHMiOltdfQ=="}