{"url": "https://academicpositions.com/ad/leiden-university/2022/phd-position-1-utrecht-university-avoiding-tipping-of-savanna-ecosystems-1-0-fte-phd-position-2-leiden-university-spatial-patterns-and-multi-stability-1-0-fte/175044", "title": "PhD position 1 (Utrecht University) â\u0080\u0093 Avoiding tipping of savanna ecosystems (1.0 FTE) & PhD position 2 (Leiden University) â\u0080\u0093 Spatial patterns and multi-stability (1.0 FTE)", "publish_date": "2022-02-08", "deadline": "2022-03-02", "location": "Rapenburg 70 Leiden, Netherlands", "city": "N/A", "country": "Netherlands", "position": "PhD", "field": "Applied Mathematics, Ecology, Environmental Science, Geophysics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "Vacancy number 22-064Function type PhD positionsExternal/ internal Internal, ExternalPlaced on 1 February 2022Closing date 2 March 2022 22 more days to applyOpmerkingen This is a combined vacancy from Leiden University and Utrecht UniversityKey responsibilitiesThe PhD projects are part of the research project Resilience in complex systems through adaptive spatial pattern formation financed by the Dutch Research Council NWO. It is a collaboration between Utrecht University and Leiden University. There will be two PhD projects, one at Utrecht University and one at Leiden University. The PhD projects are strongly intertwined and the Utrecht and Leiden groups will be interacting intensely. The overall objective is to investigate and validate conditions for which tipping points will be circumvented through spatial pattern formation in ecosystems classically viewed as prone to critical transitions. A project description is available. The central research questions are:&nbsp;When does the classical non-spatial framework of tipping points breaks down and needs to be supplemented by the theory of spatial pattern formation?&nbsp;&nbsp;For which ecosystems and earth systems is this valid, including the planet as a whole?&nbsp;&nbsp;Under which conditions and for which spatial scales is this the case?&nbsp;&nbsp;PhD position 1 (Utrecht University) â\u0080\u0093 Avoiding tipping of savanna ecosystems (1.0 FTE)We are looking for a self-motivated PhD candidate interested in ecology, environmental sciences, mathematics and geospatial data. It will be your role:&nbsp;&nbsp;to develop and analyze universal spatial savanna ecosystem models;&nbsp;&nbsp;to analyze observation of spatial patterns in savanna ecosystems related to circumvention of tipping points.&nbsp;PhD position 2 (Leiden University) â\u0080\u0093 Spatial patterns and multi-stability (1.0 FTE)We are looking for a self-motivated PhD candidate interested in mathematics, physics, ecology and environmental sciences. It will be your role:to investigate mechanism by which tipping may be evaded in ecosystem models;&nbsp;to study the impact of (human induced) heterogeneities on these mechanisms.QualificationsYou have a MSc degree in Environmental Science, Ecology, Earth Sciences, Mathematics, Physics or a closely related field. You have an interest in ecology as well as reaction-diffusion systems. You are communicative, able to work in a multi-disciplinary team of scientists and able to demonstrate English language proficiency.&nbsp;Terms and conditionsYou will be offered a temporary position (1.0 fte), initially for one year with an extension to a total of four years upon a successful assessment in the first year, and with the specific intent that it results in a doctorate within this period. The gross salary ranges between â\u0082¬2,434 in the first year and â\u0082¬3,111 in the fourth year of employment (scale P according to the Collective Labour Agreement Dutch Universities) per month for a full-time employment. Salaries are supplemented with a holiday bonus of 8% and a year-end bonus of 8.3% per year. Both universities offer excellent secondary conditions, for Utrecht see https://www.uu.nl/en/organisation/working-at-utrecht-university/terms-of-employment &nbsp;and for Leiden see https://www.universiteitleiden.nl/en/working-at/job-application-procedure-and-employment-conditions&nbsp;&nbsp;About Utrecht UniversityA better future for everyone. This ambition motivates our scientists in executing their leading research and inspiring teaching. At Utrecht University, the various disciplines collaborate intensively towards major societal themes. Our focus is on Life Sciences and Sustainability, Dynamics of Youth, and Institutions for Open Societies.The Faculty of Geosciences offers education and research concerning the geosphere, biosphere, atmosphere and anthroposphere. With 3,400 students (BSc and MSc) and 720 staff, the faculty is a strong and challenging organisation. The Faculty of Geosciences is organised in four departments: Earth Sciences, Human Geography &amp; Spatial Planning, Physical Geography, and the Copernicus Institute of Sustainable Development. The PhD project will be performed at the Copernicus Institute.The Copernicus Institute investigates processes and opportunities for innovative change towards sustainability. This transformation is a multidisciplinary process requiring a variety of disciplines. The Copernicus Institute offers a unique multidisciplinary&nbsp; environment in this&nbsp; complex field. The Copernicus Institute of Sustainable Development&nbsp; is embedded in the Faculty of Geosciences at Utrecht University and consists of five research groups (sections): Innovation Studies, Environmental Governance, Environmental Sciences, Energy and Resources, and the Utrecht Futures Studio. These groups function as primary organizational units for education and research.The mission of the Environmental Science group is to understand the interactions between terrestrial ecosystems and global environmental changes. Our research broadly covers the following themes: Biogeochemical cycles, Interactions and feedbacks over time and space, and Integrated assessment. The PhD will be embedded in the Environmental Sciences group.About Leiden UniversityThe Faculty of Science is a world-class faculty, where staff and students work together in a dynamic international environment. It is a faculty where personal and academic development are top priorities. Our people are committed by curiosity to expand fundamental knowledge and to look beyond the borders of their own scientific discipline. Their aim is to benefit science and to make a contribution to addressing the major societal challenges of the future.&nbsp;The research carried out at the Faculty of Science ranges from mathematics, computer science, astronomy, physics, chemistry and bio-pharmaceutical sciences to biology and environmental sciences. The research activities are organized in eight institutes. These institutes offer eight bachelorâ\u0080\u0099s and twelve masterâ\u0080\u0099s programs. The faculty has grown strongly in recent years and now has more than 2,300 staff and almost 5,000 students. We are located in Leidenâ\u0080\u0099s Bio Science Park, one of Europeâ\u0080\u0099s biggest science parks, where university and business life come together.&nbsp;For more information, seeâ\u0080¯https://workingat.leiden.edu/â\u0080¯andâ\u0080¯https://www.science.leidenuniv.nlâ\u0080¯&nbsp; andâ\u0080¯https://www.universiteitleiden.nl/en/science/about-faculty-of-science/diversity&nbsp;The Mathematical Institute (MI) is one of the eight institutes within the Faculty of Science and it has a strong international orientation. Its mission is to perform high quality research at the frontiers of mathematical knowledge, and to educate future generations of mathematicians and statisticians in a friendly but challenging environment. MI students have named MI Top Teaching Institute for the fifth year in a row.&nbsp;InformationMore information about PhD position 1 (Utrecht University) can be obtained from&nbsp;Prof. Max Rietkerk (m.g.rietkerk@uu.nl)Dr. Mariska te Beest (m.tebeest@uu.nl)&nbsp;Dr. Arie Staal (a.staal@uu.nl).&nbsp;More information about PhD position 2 (Leiden University) can be obtained fromProf. Arjen Doelman (doelman@math.leidenuniv.nl)&nbsp;&nbsp;ApplicationEveryone deserves to feel at home at our universities. We welcome employees with a wide variety of backgrounds and perspectives. To apply, please send your curriculum vitae, including a letter of motivation via the links below. Applications should include the names of at least two references (with e-mail addresses and phone numbers).Apply at LeidenApply at UtrechtThe application deadline is:02/03/2022", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Leiden University was founded in 1575 and is one of Europeâ\u0080\u0099s leading international research universities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5NWZcLzc3Y1wvOTVmNzdjYjE3YjNmODExNDlkZmNlYmIyYWRmYzc1MWQucG5nIiwiZWRpdHMiOltdfQ=="}