{"url": "https://academicpositions.com/ad/hector-fellow-academy/2022/carry-out-your-own-phd-project-in-deformation-fracture-processes-tribology-interface-in-metals-ceramics-supervised-by-prof-peter-gumbsch-karlsruhe-institute-of-technology/173760", "title": "Carry out your own PhD project! in Deformation & Fracture Processes / Tribology / Interface in Metals & Ceramicssupervised byProf. Peter Gumbsch (Karlsruhe Institute of Technology)", "publish_date": "2022-01-07", "deadline": "2022-03-31", "location": "Schlossplatz 19 Karlsruhe, Germany", "city": "N/A", "country": "Germany", "position": "PhD", "field": "Materials Chemistry, Materials Engineering, Physical Chemistry, Surface Chemistry,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Hector Fellow Academy", "job_description": "The Hector Fellow Academy offers you the opportunity to realize a self-developed research project under supervision Prof. Peter Gumbsch. He is one of the Hector Fellows, a community of outstanding professors from different research institutions across Germany working in STEM-subjects, medicine, and psychology.His research activities focus on modeling and simulation of materials, in particular multiscale modelling approaches. His activities cover atomistic simulation, mesoscopic modeling as well as macroscopic materials descriptions. Central research topics are deformation and fracture processes as well as interface properties in metals and ceramics. He has recently started new activities in the area of tribology.Your profileYou are enthusiastic about developing and investigating an innovative research idea within the discipline of Prof. Gumbsch.You have a masterâ\u0080\u0099s degree in a scientific or engineering subject with excellent grades.&nbsp;Our offerOpportunity to realize a self-developed research ideaMentored by an internationally renowned, top-level scientistFunded position (according to TV-L 13, up to 100%, based on the funding rates of the DFG for PhD students)Extensive research fundingMembership in an excellent research networkAdditional management courses, trainings &amp; networking eventsYour applicationApply until March 31st, 2022&nbsp; via our Application Portal.Further information: www.hector-fellow-academy.de", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Hector Fellow Academy (HFA) is a young science academy offering a platform for interdisciplinary exchange to outstanding researchers.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI1ZmFcL2I0YVwvNWZhYjRhMTZkNmI2MTBkZGQxMTNlZjdhODEyYWMxNTYucG5nIiwiZWRpdHMiOltdfQ=="}