{"url": "https://academicpositions.com/ad/ku-leuven/2022/tenure-track-position-sociology-of-diversity/175176", "title": "Tenure Track Position: Sociology of Diversity", "publish_date": "2022-02-11", "deadline": "2022-04-04", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Assistant Professor", "field": "Gender Studies, Social Research, Social Stratification, Social Theory, Social Work, and 1 moreSociology", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. ZAP-2021-131)The Centre for Sociological Research (CeSO), part of the Faculty of Social Sciences, has a full-time position as tenure track professor (lecturer) vacant, with thematic focus on diversity. The selected candidate will be part of the Centre for Sociological Research (CeSO). KU Leuven is one of the leading academic institutions in Europe and its mission is to achieve excellence in academic teaching, research and service. KU Leuven is a member of the League of European Research Universities (LERU) and is consistently ranked within the top 10 universities in Europe. CeSO is a network of researchers who study social change from a sociological perspective. CeSO researchers are active in a variety of sub-disciplines, such as social policy and social work, labour and organisation, culture and religion, demography and family sociology, social innovation, political sociology, science and technology studies, theoretical sociology and research methodology. Through its research, CeSO provides insights that are crucial to understanding the challenges faced contemporary society.Website unitDutiesResearchThe candidate conducts research, teaches and provides service in the field of sociology, with diversity as the thematic focus. The concept of diversity is broadly conceived here, and can be understood in terms of, for example (but not limited to) intersections between gender, ethnic origin, cultural background, social class, age or sexual preference. Familiarity with core concepts from the literature on diversity (such as inclusion/exclusion, intersectionality, social divisions and polarisation, vulnerability and privilege) is of great importance. The candidate conducts empirical research that finds connection with sociological sub-disciplines and research lines present within CeSO.&nbsp;The candidate develops her/his own research programme and strives for complementarity and cooperation with ongoing research at CeSO. She/he actively raises funds for own and collaborative research, embedded in international research networks and initiatives, interuniversity collaborations, etc. Based on his/her own research, the candidate will actively coach research staff and PhD students, with a view to obtaining a PhD.EducationThe teaching duties of the selected candidate will mainly consist of developing and teaching courses in the programmes organized by CeSO. The candidate is willing and able to give introductory courses in sociology, as well as a course in theoretical sociology. She/he is also actively committed to the quality of the sociology program as a whole. The candidate independently supervises master's theses. KU Leuven expects non-Dutch-speaking candidates to have a sufficient command of Dutch within three years of their appointment.&nbsp;ServiceThe candidate helps to disseminate the research being conducted at CeSO through public science communication and societal service. She/he is also prepared to gradually take on administrative roles within the the research unit, the sociology programme, the faculty and the university.&nbsp;ProfileThe candidate holds a PhD in social sciences, preferably (but not limited to) in sociology. The candidate performs high quality scientific research in the field of diversity (substantiated by recent publications in journals and books) and is active in international networks. Successful acquisitoin of research funding is an advantage. The candidate possesses the necessary didactic skills to provide excellent education. The candidate has the necessary communication and organisational skills and can work in a team.OfferWe offer full-time employment in an intellectually challenging and international environment. You will work in Leuven, a historic yet dynamic and vibrant city in the centre of Belgium, twenty minutes from Brussels and less than two hours from Paris, London and Amsterdam.You will be appointed as a tenure track professor (lecturer) for a period of 5 years, after which, in case of a positive evaluation, you will receive tenure as an associate professor. From the start, you can develop a line of research independently, act as supervisor of dissertations and acquire your own research funds.To facilitate scientific integration and research in the first phase, start-up funding of EUR 100,000 is offered to new professors who do not have substantial other funding (e.g. ERC).KU Leuven is well equipped to welcome foreign professors and their families and offers practical support in the areas of immigration and administration, housing, childcare, learning Dutch, partner career coaching, etc.Interested?For more information please contact Prof. dr. Giselinde Kuipers, tel.: +32 16 37 62 78, mail: giselinde.kuipers@kuleuven.be or Prof. dr. Steven Eggermont, tel.: +32 16 32 32 38, mail: steven.eggermont@kuleuven.be. For problems with online applying, please contact solliciteren@kuleuven.be.You can apply for this job no later than April 04, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}