{"url": "https://academicpositions.com/ad/potsdam-institute-for-climate-impact-research-pik/2022/postdoctoral-position-on-causal-policy-analysis-m-f-d/175135", "title": "Postdoctoral position on â\u0080\u009cCausal Policy Analysisâ\u0080\u009d (m/f/d)", "publish_date": "2022-02-10", "deadline": "2022-03-15", "location": "Telegraphenberg A 31 Potsdam, Germany", "city": "N/A", "country": "Germany", "position": "Postdoc", "field": "Business Economics, Climatology, Econometrics, Environmental Economics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Potsdam Institute for Climate Impact Research (PIK)", "job_description": "The climate needs bright minds. The Potsdam Institute for Climate Impact Research (PIK) addresses crucial scientific questions in the fields of global change, climate impacts and sustainable development. It is one of the world's leading research institutions in its field and offers natural and social scientists from around the world an inspiring environment for excellent interdisciplinary research.To strengthen its research capacity in causal climate policy evaluation in the newly established FutureLab â\u0080\u009cCERES: Political Economy for Inclusive Wealth Governance and Sustainabilityâ\u0080\u009d, PIK is offering a&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Postdoctoral position on â\u0080\u009cCausal Policy Analysisâ\u0080\u009d (m/f/d)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(Position number:&nbsp;04-2022-Postdoc-CERES)in the field of environmental economics and applied econometrics, with a starting date as soon as possible.The position is funded for 4 years. Remuneration is in accordance with the&nbsp;German public tariff scheme (TV-L Brandenburg), salary group E 13. This is a full-time position with a weekly working time of&nbsp;40 hours.&nbsp;&nbsp;Key responsibilities:&nbsp;The successful candidate will be involved in a joint research project with&nbsp;Nicolas Koch (MCC and IZA) and&nbsp;Felix Pretis (University of Victoria and University of Oxford) that seeks to provide a global and cross-sectoral causal evaluation of effective climate policies. We expect the candidate to co-lead policy-oriented and data-intensive econometric research that builds on and further develops our prior work. The goal is to pair machine learning with program evaluation tools to estimate causal treatment effects in settings in which standard methods are limited. It is the candidateâ\u0080\u0099s responsibility to implement a research program that applies these novel methods in different contexts and to coordinate the research team that includes a significant number of student research assistants. It is the candidateâ\u0080\u0099s objective to contribute to our excellence in research. First, by conducting and publishing high-level articles in international peer-reviewed journals, and, second, by engaging in an international network for causal climate policy evaluation. The knowledge generated by the FutureLabâ\u0080\u0099s interdisciplinary team of economists, political scientists, and experts in statistics and machine learning shall not only drive research, but also set new standards for evidence-based climate policy advice at the national and the global level.&nbsp; &nbsp;Requirements:&nbsp;PhD (or be close to finishing their PhD) in economics or a related field,strong skills in econometric methods as well as expertise and research interest in environmental and climate change economics,strong coding skills are a prerequisite, especially in R,boundless enthusiasm about applying quasi-experimental program evaluation techniques to evaluate climate policies,creativity and openness to new&nbsp;methodological approaches,ability to solve challenging problems independently and diligently,capacity for teamwork and organizational talent to supervise a significant number of student research assistants,experience with machine learning is beneficial,existing knowledge of climate policy instruments (such as carbon pricing) and their real-world implementation is extremely helpful but not strictly required,your previous research should demonstrate the publication potential in leading scientific journals.an inspiring, international and interdisciplinary work environment in a world leading research institute on&nbsp;Potsdam's beautiful, historic Telegrafenberg campus, a short commuting distance from Berlin,We offer:working in a dedicated and motivated team with very supportive colleagues and a well-established international research network,meaningful involvement in a research project of immediate policy relevance,access to high-performance cluster computers,flexi-time and mobile working (up to 40% of your hours),a collective pay scheme and associated benefits as well as a subsidized travel card.PIK seeks to increase the share of women in scientific positions and therefore explicitly encourages women to apply. In cases of equal qualification and within the given legal scope, women will be given preference. Applications by persons with a migration background are expressly encouraged. Applications of disabled persons with equal qualifications will be regarded favourably. PIK also encourages applications by parents returning from parental leave.Please apply by&nbsp;15.03.2022, using our&nbsp;Application form.&nbsp;The application process remains open until the position has been filled successfully.If you hold an international higher education qualification, please also submit the Statement of Comparability from the Central Office for Foreign Education (ZAB) with your application. In the case that you do not yet have a ZAB Statement of Comparability for your qualification, please be aware that you will need to request this if your application is successful. You can find further information on this website:&nbsp;https://www.kmk.org/zab/central-office-for-foreign-education.htmlFor further information or to discuss the position please contact&nbsp; Dr.&nbsp;Janin Schaffer", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Potsdam Institute for Climate Impact Research (PIK) was founded in 1992 and currently has a staff of about 300 people.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEzXC8wM1wvUElLTG9nby5wbmciLCJlZGl0cyI6W119"}