{"url": "https://academicpositions.com/ad/leibniz-institute-age-research-fritz-lipmann-institute-fli/2022/postdoc-m-f-d/173996", "title": "Postdoc (m/f/d)", "publish_date": "2022-01-14", "deadline": "2022-03-13", "location": "BeutenbergstraÃ\u009fe 11 Jena, Germany", "city": "N/A", "country": "Germany", "position": "Postdoc", "field": "Biomedicine, Cell Biology, Genetics, Immunology, Microbiology, and 1 moreMolecular Biology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leibniz Institute on Aging â\u0080\u0093 Fritz Lipmann Institute e. V. (FLI)", "job_description": "The Leibniz Institute on Aging - Fritz Lipmann Institute (FLI) in Jena is a federal and state government-funded research institute and member of the Leibniz Association (Wissenschaftsgemeinschaft Gottfried Wilhelm Leibniz e.V.). FLIâ\u0080\u0099 s internationally visible and highly competitive research is focused on understanding the mechanisms of aging and associated age-related diseases. Scientists from over 40 countries are currently investigating the molecular mechanisms of aging and the occurrence of age-related diseases. Our aim is to create the basis for new approaches in medicine as a way to improve the health of the elderly (www.leibniz-fli.de).The research group of Prof. Dr. Dario Riccardo Valenzano is looking for a Postdoc (m/f/d) who will work within the SFB project (collaborative research center, CRC, funded by the DFG for the next 4 years): \"Co-evolution of gut microbiota and immune cells during ageing in killifish\"&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Postdoc (m/f/d)Research focus of the Lab: The Valenzano Lab investigates the genetic and ecological factors involved in vertebrate survival and ageing. We study the cross-talk between immune system and the microbiome during organismal aging. Our experimental and analytical approaches include genetic mapping, comparative genomics, population genetics, cell culture, transgenesis and numerical simulations.Tasks and Challenges:This project will focus on the characterization of immune phenotypic changes occurring during aging in naturally short-lived killifish. This project will involve planning and executing experiments aimed at analyzing b cell and t cell receptor repertoires in longitudinal cohorts of short-lived killifish. B cell and T cell receptor repertoire analysis will be combined with microbiome sequencing and with the analysis of antibody-epitope specificity, through large scale phage display experiments. This work will be conducted at the FLI in Jena in collaboration with animal care takers, technicians and state-of-the-art facilities to raise fish cohorts, genome/transcriptome sequencing, analysis of immune-cell phenotypes and culturing of the microbiome. The computational/ analytical part will be done in collaboration with bioinformaticians in the group and with collaborators within the collaborative research center CRC.&nbsp;Requirements:PhD in Biology, Life Science, Biomedicine, or equivalent&nbsp;Genuine interest in pursuing independent academic career&nbsp;Experience in immunology, molecular biology of aging, high-throughput genome sequencing, genomics and/or microbiome research&nbsp;Excellent spoken and written English&nbsp;FELASA-equivalente certification and experience in animal experiment planning is a plus, but not a prerequisiteWe offer:A competitive postdoc position in a world-leading research group investigating biology of aging within the Leibniz Institute on Aging (Fritz Lipmann Institute, FLI). Our institute is embedded within the multidisciplinary Jena Beutenberg Campus, an interdisciplinary base for innovative research.A position integrated in the FLI PostDoc Network. The Network promotes interdisciplinary collaborations involving clinician scientists, basic scientists and bioinformaticians and supports career development and postdoctoral training courses.The contract conditions and the salary will be according to the collective labour agreement for public service employees of the federal states of Germany (TV-L E13) for 2 years initially.Flexible working time, a family friendly working environment including support for child care solutions and dual career.Application:Please apply online through the FLI application portal by 13.03.2022 and provide a cover letter, your CV, your degrees and the names and contacts of 4 referees.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Our mission is to understand the molecular mechanisms that underlie the ageing process and that lead to age-related diseases.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE0XC8wN1wvZmxpLWVuLmpwZyIsImVkaXRzIjpbXX0="}