{"url": "https://academicpositions.com/ad/university-of-bern/2021/3-phd-positions-in-machine-learning-and-computer-vision/164390", "title": "3 PhD Positions in Machine Learning and Computer Vision", "publish_date": "2021-10-07", "deadline": "N/A", "location": "Hochschulstrasse 4 Bern, Switzerland", "city": "N/A", "country": "Switzerland", "position": "PhD", "field": "Applied Mathematics, Computational Mathematics, Computer Communications (Networks), Computer Science, Computer Vision, and 10 moreData Structures,Databases,Engineering,Image Processing,Machine Learning,Machine Vision,Mathematics,Operating Systems,Probability Theory,Programming Languages", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Bern", "job_description": "Positions: We have openings for 3 PhD positions in the areas of machine learning and computer vision. One position is on motion estimation tasks (such as optical flow and structure from motion) via deep learning. The other two positions are on unsupervised learning methods for image processing also based on deep learning. Research objectives include the development and analysis of generative models for images and videos, and the development of novel machine learning methods. Research will be performed in the Computer Vision Group at the University of Bern. All 3 positions are immediately available and will be filled as soon as a suitable candidate is found.Your profile: We are looking for a highly motivated candidate, who is eager to get involved in cutting edge, creative research. You hold a Master of Science in Computer Science, Mathematics or Engineering, with a solid background in machine learning and computer vision. You have excellent skills in applied mathematics, in probability theory, and a programming language (e.g., Python, C/C++). You have a solid background in Deep Learning and you are already a proficient programmer in one of the main Deep Learning libraries (e.g., TensorFlow, PyTorch). We expect fluent communication skills in English.What we offer: You will be part of a team of academic researchers working on state-of-the-art technologies for machine learning and computer vision. You will have the chance to contribute to and participate in the international research community. We are located in Bern in the core of Switzerland, one of the cities with the highest quality of life worldwide. You will receive a very competitive salary (a base salary of 55,000 CHF per year + a teaching assistance salary) and be given financial support to attend training courses and international conferences.Application and further information:Applications must be submitted to Prof Paolo Favaro, through the submission website link http://cvg.unibe.ch/vacancies/Applications submitted directly via email will not be considered.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Bern offers top quality across the board: it enjoys special recognition in leading-edge disciplines, is reputed for the excellent quality of its teaching and offers a delightful setting.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEyXC8wN1wvQmVybkxvZ28yLnBuZyIsImVkaXRzIjpbXX0="}