{"url": "https://academicpositions.com/ad/ghent-university/2022/postdoctoral-researcher-22546-pharmaceutics/175173", "title": "Postdoctoral researcher (22546) - Pharmaceutics", "publish_date": "2022-02-11", "deadline": "2022-05-11", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Biochemistry, Biomedical Engineering, Biomedicine, Biotechnology, Cell Biology, and 4 moreChemical Biology,Molecular Biology,Pathology,Pharmacy & Pharmacology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Apply before 09/02/2022&nbsp;(DD/MM/YYYY) 23:59 (Brussels Time)&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Department:&nbsp;FW01 - Geneesmiddelenleer&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Occupancy rate: 100%&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Number of positions: 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Type of employment:&nbsp;Contract of unlimited duration with clause&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Term of&nbsp;assignment:&nbsp;min. 1 year - max. 6 years&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Wage scale:&nbsp;&nbsp;PD1 to PD4 (doctoral degree)&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Required diploma:&nbsp;PhD&nbsp;&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University is a world of its own. Employing more than 8,000 people, it is actively involved in education and research, management and administration, as well as technical and social service provision on a daily basis. It is one of the largest, most exciting employers in the area and offers great career opportunities. With its 11 faculties and more than 80 departments offering state-of-the-art study programs grounded in research in a wide range of academic fields, Ghent University is a logical choice for its staff and students.&nbsp;Moreover, the highly attractive city of Ghent is located at the heart of Europe and unfolds as a cultural and historical hub with a vibrant student lifestyle.&nbsp;The research team of Prof. Koen Raemdonck (Full Professor) is embedded in the Ghent Research Group on Nanomedicines at the laboratory for General Biochemistry and Physical Pharmacy, Faculty of Pharmaceutical Sciences of Ghent University. The group is a world-leading research lab on macromolecular drug delivery by nanomedicines. The lab hosts 5 professors and their multidisciplinary research teams, with on average 40 researchers with diverging scientific background, who collaborate closely on a daily basis.&nbsp;YOUR TASKS&nbsp;Currently, the exceptional therapeutic potential of RNA is not yet available for treatment of (chronic) respiratory pathologies due to a lack of enabling technologies. The team of Prof. Raemdonck is seeking a highly motivated and skillful postdoctoral researcher to work on ground-breaking RNA delivery technologies for inhalation therapy and beyond.The postdoc will assist in the development, optimization and (in vitro/in vivo) application of bio-inspired nanocarriers for RNA therapeutics. The project is of translational nature, aiming to merge fundamental insights with rational formulation design, and is expected to lead to high impact publications.The candidate shall also be committed to contribute to the supervision of (PhD) students, academic (grant) writing and support of general (scientific) lab activities.At least 70% of the assignment will be spent on academic research.&nbsp;WHAT WE ARE LOOKING FOR&nbsp;The position is open to motivated candidates with a strong background in nucleic acid therapeutics, biomaterials/nanomedicines and/or inhalation therapy and with a keen interest in both cell/chemical/molecular biology and biomedical applications.Eligible candidates must hold a thesis-based doctorate in Pharmaceutical Sciences, Biomedical Sciences, Biomedical Engineering, Biochemistry/Biotechnology or equivalent (obtained max. 6 years ago; this term of 6 years is determined by the date written on the above-mentioned required diploma).Candidates are recommended to have a strong publication record and proven record in team work and/or (international) collaboration.Experience with animal models of (lung) pathologies is an asset.The applicant must be able to communicate fluently in English and demonstrate excellent academic writing and presentation skills.&nbsp;WHAT WE CAN OFFER YOU&nbsp;This postdoctoral research project is fully funded by a European Union H2020 ERC Consolidator Grant (RESPIRNA), awarded to Prof. Raemdonck. We offer you a postdoctoral staff member contract of indefinite duration, with a minimum term of 1 year and a maximum term of 6 years. In case of a positive evaluation 1 year after the start, the contract can be extended.In case your application meets the hereto required conditions, it may be considered to recruit via a postdoctoral scholarship instead, with a maximum term of 3 years.Your contract will start in April 2022 or as soon as possible afterwards.You will be part of a dynamic, pluralistic and multidisciplinary team that is highly motivated to perform high-level research on drug delivery. The credo of Ghent University is â\u0080\u0098Dare To Thinkâ\u0080\u0099, a philosophy that is infiltrated into its daily activities of science and education and which we adopt in our own lab vision statement as well.You will be able to advance your academic career in various ways (e.g. development of research skills, academic writing skills, managerial skills, or contribute to scientific and societal valorization of research,â\u0080¦).Your remuneration will be determined by salary scale PD1-PD4. Click here for more information about our salary scales.All Ghent University staff members enjoy a number of benefits, such as a wide range of training and education opportunities, 36 days of holiday leave (on an annual basis for a full-time job) supplemented by annual fixed bridge days, bicycle allowance and eco vouchers. Click here for a complete overview of all the staff benefits (in Dutch).&nbsp;INTERESTED?&nbsp;Apply online through the e-recruitment system before the application deadline. We do not accept late applications or applications that are not submitted through the online system.&nbsp;Your application must include the following documents:&nbsp;In the field â\u0080\u0098CVâ\u0080\u0099: your updated CV (pdf format)In the field â\u0080\u0098Cover letterâ\u0080\u0099: your application letter in pdf formatIn the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of the required degree and grades (if already in your possession). If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field â\u0080\u009cother documentsâ\u0080\u009d: a reference letter (optional)&nbsp;Note that the maximum file size for each field is 10 MB.&nbsp;As Ghent University maintains an equal opportunities and diversity policy, everyone is encouraged to apply for this position.MORE INFORMATION&nbsp;For more information about this vacancy, please contact Prof. Koen Raemdonck (koen.raemdonck@UGent.be). Important: do NOT send your application by email, but apply online. Selected candidates will be invited for an interview and further discussion. For more information about the lab, please check our website: https://www.biofys.ugent.be.Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}