{"url": "https://academicpositions.com/ad/flanders-make/2021/senior-powertrain-engineer-for-e-vehicle-research-lommel-or-leuven/163887", "title": "Senior Powertrain Engineer for E-vehicle research (Lommel or Leuven)", "publish_date": "2021-09-28", "deadline": "N/A", "location": "Gaston Geenslaan 8, 3001 Leuven Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Control Systems Engineering, Electrical Engineering, Electronics, Engineering, Mechanical Engineering, and 2 moreMechatronics,Systems Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "Flanders Make", "job_description": "Shape the electric vehicle of the future with advanced powertrain conceptsFlanders Make is the strategic research centre for the manufacturing industry. From our sites all over Flanders, we stimulate open innovation towards high-performant, energy efficient, flexible and autonomous vehicles, eg. by rethinking the electric and autonomous prototype vehicles. Our demonstration and validation infrastructure includes testing facilities for efficient drives,&nbsp; and a top-notch Hardware-In-the-Loop platform for hybrid vehicle applications. Rethink the concept of electric powertrainsAs an expert in electric drivetrains and mechatronic systems, you : Rethink performance and energy efficiency. Can creative actuation concepts, energy storage designs or advanced control systems contribute to better performing systems?; Generate new research ideas inspired by new concepts for the electric vehicle of the future (eg. a hybrid truck, an electric forklift, â\u0080¦) &amp; for high tech industrial variants (eg. mobile robot ) and respond to innovation needs of manufacturing companies;&nbsp; Can you think of an alternative energy system replacing the central e-motor? ; Translate your innovative ideas into project proposals; Take the technical lead of a research team combining expertise in model based mechatronic system engineering, vehicle dynamics,&nbsp; energy management, battery systems, control, and testing and validation. Examples of Flanders Make projects:This movie shows how Flanders Make helped a company converting their trucks into electric Trucks. https://www.youtube.com/watch?v=ncG9KK0fM88 Creative industrial innovator with a conceptual mindYou have : Master's degree or PhD in Engineering (Power electronics, Electrical, Mechatronics); Proven experience and expertise in electric powertrains and mechatronic systems; Broad knowledge of machine and/or vehicle dynamics and motion control, modelling, control algorithms, system simulation, sensors and actuators, â\u0080¦; Experience in an automotive context is a plus. You are : A conceptual thinker inspired by research problems and technological innovation; Interested in automotive as well as machine applications; Enthusiastic about developing new project ideas; Pro-active and taking initiative; Open minded and a team player. Make a difference in automotive and powertrain technologyFlanders Make gives you the opportunity to develop pre-competitive research within the next-generation vehicle and technologies, together with Flemish and European companies, universities and research institutes; An open minded and flexible working environment; An attractive salary with additional extralegal advantages. Flanders Make is the strategic research centre for the manufacturing industry. From our sites in Lommel, Leuven and Kortrijk we stimulate open innovation through excellent research.Our purpose: realising a top-level research network in Flanders that delivers full support to the innovation projects of manufacturing companies. This way, we want to contribute to new products and production processes that help to realise the vehicles, machines and factories of the future.Because of our unique position between industry and research, our teams combine application and system proficiency with technological and scientific knowledge.We focus on 4 key competences, all based on modelling and virtualisation: Decision &amp; Control Design and optimisation Motion product specification, architecture, and validation Flexible assembly specification, architecture, and validation Convinced? Send your motivation letter and cvDo you feel you can contribute to our research with your expertise? Do you share our values and our mission? We are looking forward to reading about your story, your interest for Flanders Make and for this job in particular.&nbsp;To apply, go to http://jobs.flandersmake.be.Please fill in the online application form and upload a motivation letter and cv.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Flanders Make is the strategic research centre for the manufacturing industry.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI1MjZcLzM4ZVwvNTI2MzhlNmI0ZDUwNTBlYWY5NzVlYjkxM2JkMzhiODcuanBlZyIsImVkaXRzIjpbXX0="}