{"url": "https://academicpositions.com/ad/ghent-university/2022/predoctoraal-researcher-phd-circular-transition-of-offshore-wind-mills-materials-22232-green-chemistry-and-technology/174144", "title": "Predoctoraal researcher: PhD Circular Transition of Offshore Wind Mills Materials (22232) - Green Chemistry and Technology", "publish_date": "2022-01-18", "deadline": "2022-02-14", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Bioengineering, Chemical Engineering, Energy Technology, Environmental Chemistry, Environmental Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Apply before 14/02/2022&nbsp;(DD/MM/YYYY) 23:59 (Brussels Time)&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Faculty of Bioscience Engineering&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Department:&nbsp;BW24 - Groene Chemie en Technologie&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Occupancy rate: 100%&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Number of positions: 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Type of employment:&nbsp;Contract of unlimited duration with a 4 year clause&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Term of&nbsp;assignment:&nbsp;01/03/2022 until 28/02/2026&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Wage scale:&nbsp;&nbsp;WM1 to WM4 (master degree)&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Required diploma:&nbsp;Master&nbsp;&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University is a world of its own. Employing more than 8,000 people, it is actively involved in education and research, management and administration, as well as technical and social service provision on a daily basis. It is one of the largest, most exciting employers in the area and offers great career opportunities. With 11 faculties and more than 80 departments offering state-of-the-art study programmes grounded in research in a wide range of academic fields, Ghent University is a logical choice for its staff and students.&nbsp;&nbsp;YOUR TASKS&nbsp;We welcome applications for a full-time PhD position within the Research Group Sustainable Systems Engineering (STEN) of the Department of Green Chemistry and Technology, Faculty of Bioscience Engineering, UGent. The PhD student will be appointed in a fellowship position on the project \"Circular Transition of Offshore Wind Mills Materials or CTOâ\u0080\u009d.&nbsp;A short summary of the CTO project:CTO is a Flemish ICON project, coordinated by Parkwind, and the aim is mainly to prepare the industry for the upcoming End of life (EoL) phase of offshore wind farms. This will be done by assessing the impact over its full lifecycle based upon all three sustainability pillars (economic, environmental and social) and elucidating technical and societal challenges and technology gaps in this EoL phase. The impact assessment framework will cover both existing offshore wind technologies (ex-posteriori analysis) as well as future offshore wind energy technologies (ex-ante analysis). The CTO project aims to address both the EoL challenge as improving the sustainability throughout the lifecycle.&nbsp;The project consists of five work packages: 1) Identification of potential offshore wind energy value chain scenarios and selection of three scenario sets, 2) Assessment of the various offshore operations (installation, O&amp;M and decommissioning) and prioritizing one or two scenarios with alternative offshore operations, 3) Assessment of the material composition and onshore operations (material extraction, manufacturing and EoL) and prioritizing one or two scenarios with alternative material compositions, 4) Prospective sustainability assessment of the selected scenarios, combining material flow analysis (MFA) with a Life Cycle Sustainability Analysis (LCSA) approach, suitable for both existing as well as future offshore wind technologies, 5) Conclusions and recommendations that may enable implementing a life cycle and sustainability mindset in the development of future windfarms.&nbsp;As the research group STEN is involved in all WPs as described above, your PhD will be built upon these tasks within the CTO project.&nbsp;At least 90% of your assignment will be spent on academic research in preparation of a doctoral dissertation&nbsp;&nbsp;&nbsp;WHAT WE ARE LOOKING FOR&nbsp;Candidates are expected to have an engineering background and/or affinity with sustainability analysis methods such as life cycle assessment. For this project we are looking for someone who is critical, analytical and has a sense of initiative. Affinity with plastic food packaging is a plus.&nbsp;Other profile requirements:- You hold a master's degree in environmental engineering, bioscience engineering, or equivalent.- You are interested in scientific research in order to obtain a doctoral degree.- You have good writing and presentation skills.- You have a very good oral and written knowledge of academic English (speaking Dutch is a plus as the CTO project contains of a Flemish consortium).- Additional plus points: 1) You have experience in carrying out quantitative and/or qualitative research and in collecting data independently and 2) You have experience with LCA software such as openLCA, Gabi, SimaPro, etc. and LCA databases (e.g. ecoinvent).&nbsp;Students graduating in January/February or June 2022 are also welcome to apply.&nbsp;&nbsp;WHAT WE CAN OFFER YOU&nbsp;We offer you a contract of indefinite duration with a maximum term of 4 years.Your contract will start on 15/02/2022 at the earliest.Your remuneration will be determined by salary scale WM1. Click here for more information about our salary scales.All Ghent University staff members enjoy a number of benefits, such as a wide range of training and education opportunities, 36 days of holiday leave (on an annual basis for a full-time job) supplemented by annual fixed bridge days, a bicycle allowance and eco vouchers. Click here for a complete overview of all the staff benefits (in Dutch).&nbsp;&nbsp;INTERESTED?&nbsp;Apply online through the e-recruitment system before the application deadline (see above). We do not accept late applications or applications that are not submitted through the online system.&nbsp;Your application must include the following documents:&nbsp;In the field â\u0080\u0098CVâ\u0080\u0099: your CV and an overview of your study results (merged into one pdf file)In the field â\u0080\u0098Cover letterâ\u0080\u0099: your application letter in pdf formatIn the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of the required degree (if already in your possession). If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field â\u0080\u009cother documentsâ\u0080\u009d: not applicable.&nbsp;Note that the maximum file size for each field is 10 MB.&nbsp;Selection procedure:- Preselection based on the provided documents- Selection based on interviews&nbsp;As Ghent University maintains an equal opportunities and diversity policy, everyone is encouraged to apply for this position.&nbsp;MORE INFORMATION&nbsp;For more information about this vacancy, please contact Prof. dr. ir. Jo Dewulf (jo.dewulf@ugent.be). &nbsp;Important: do NOT send your application by email, but apply online.&nbsp;&nbsp;&nbsp;&nbsp;Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}