{"url": "https://academicpositions.com/ad/leiden-university/2022/fixed-term-2-years-postdoctoral-researcher-in-ancient-near-eastern-studies/174792", "title": "Fixed-Term (2 years) Postdoctoral Researcher in Ancient Near Eastern Studies", "publish_date": "2022-02-02", "deadline": "2022-03-31", "location": "Rapenburg 70 Leiden, Netherlands", "city": "N/A", "country": "Netherlands", "position": "Postdoc", "field": "Archaeology, Cultural Anthropology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "The&nbsp;Faculty of Humanities, Leiden Institute for Area Studies (LIAS),&nbsp;The Netherlands Institute for the Near East (NINO)&nbsp;is looking for a:Fixed-Term (2 years) Postdoctoral Researcher in Ancient Near Eastern StudiesThe Netherlands Institute for the Near East (NINO) is pleased to offer a two-year postdoctoral fellowship hosted at Leiden University. This initiative is designed to foster early-career researchers specializing in the study of&nbsp;the ancient Near East. The fellowship comes with full-time employment&nbsp;at the Faculty of Humanities at Leiden University and with access to facilities&nbsp;at NINO (office space, computer, libraries and collections). The fellow is expected to reside in or near Leiden during the time of appointment and to participate in the intellectual life of the Institute (in as far as the COVID-19 situation so permits). All applicants, but especially those with interdisciplinary research profiles beyond the Humanities, are encouraged to seek additional affiliation to relevant researchers or research groups in the Netherlands (Leiden or elsewhere).The fellowship is aimed at candidates of any nationality who completed their doctorate (PhD) within the last four years and who have proven their&nbsp;potential to conduct and publish research at an international level.&nbsp;This year, we invite applications of researchers who work in the field of ancient Near Eastern archaeology.During the fellowship, the successful candidate will work on their own research. They will design and teach a graduate course on â\u0080\u009cMethods and Concepts in ancient Near Eastern Studiesâ\u0080\u009d, which is offered at a national level to advanced students from a wide range of disciplinary backgrounds, including ancient Near Eastern Archaeology and History, Assyriology, Classics, Egyptology, Hittitology and Coptic Studies. In their second year, the fellow will convene an international academic conference on a topic relevant to their own research,&nbsp;taking into consideration the research interests represented at the NINO and/or other institutes and universities in The Netherlands.&nbsp;The proceedings of this conference will be published after peer-review in one of NINOâ\u0080\u0099s book series.Key responsibilitiesConduct original research on a topic relating to ancient Near Eastern archaeology;Teach a graduate seminar on methods and concepts in ancient Near Eastern Studies;Organize an international conference on a topic relevant to their own research;Disseminate the results of their research to (non-)academic parties through appropriate channelsRequirementsA PhD degree in a relevant field of study, completed between January 2018 and February 2022;A research and publication record that is commensurate with career stage;Commitment to high-quality research, publication, and dissemination;Excellent communication and organization skills;Ability to work independently as well as part of a team.Our organisationThe Faculty of Humanities is rich in expertise in fields such as philosophy, religious studies, history, art history, literature, linguistics and area studies covering nearly every region of the world. With its staff of 995, the faculty provides 27 masterâ\u0080\u0099s and 25 bachelorâ\u0080\u0099s programmes for over 7,000 students based at locations in Leiden and in&nbsp;The Hague. For more information:&nbsp;https://www.universiteitleiden.nl/en/humanities.The Netherlands Institute for the Near East is a research centre located at the Faculty of Humanities. NINO aims to advance knowledge of the history of the ancient Near East (incl. Egypt), its archaeological remains and its cultural heritage. Its research community consists of researchers based in Leiden as well as in other Dutch universities. The successful candidate will have the opportunity to engage with this community while in residence. The fellowship grants privileged access to NINOâ\u0080\u0099s specialist library and its various collections.&nbsp;For more information:&nbsp;https://www.nino-leiden.nl.The postdoctoral researcher will hold a position in the Leiden Institute for Area Studies (https://www.hum.leiden.edu/lias/ ). LIAS &nbsp;is comprised of a School of Asian Studies, &nbsp;a School of Middle-Eastern Studies and the Centre for&nbsp;the Study of Religion,&nbsp;with international staff and student populations. The institute is committed to a present-day vision of area studies, integrating disciplinary and regional-historical perspectives on a solid foundation of excellent language skills. Current staff &nbsp;in LIAS has expertise in the fields of Anthropology, Archaeology, Art Studies, Buddhist Studies, Film Studies, History, International Relations, Language Pedagogy, Law, Linguistics, Literary Studies, Material Culture Studies, Performance Studies, Philology, Philosophy, Political Economy, Religious Studies, Sociology, and Visual Culture Studies.Terms and conditionsWe offer a fixed-term position from September 2022 through August 2024.The salary range&nbsp;for a postdoctoral researcher is from â\u0082¬&nbsp;3,821&nbsp;to â\u0082¬ 5,230&nbsp;gross per month (pay-scale 11) based on fulltime employment, commensurate with qualifications. Depending on qualifications, the researcher may start at the appropriate step in scale 10 until s/he fully meets the requirements for scale 11 as specified by the Faculty of Humanities, particularly with regard to the number of years of relevant work experience.Leiden University offers an attractive benefits package with additional holiday (8%) and end-of-year bonuses(8.3 %), training and career development and sabbatical leave. Our individual choices model gives you some freedom to assemble your own set of terms and conditions.&nbsp;For international spouses we have set up a dual career programme.&nbsp;Candidates from outside the Netherlands may be eligible for a substantial tax break.&nbsp;More at&nbsp;https://www.universiteitleiden.nl/en/working-at/job-application-procedure-and-employment-conditions.Diversity and inclusionFostering an inclusive community is a central element of the values and vision of Leiden University. Leiden University is committed to becoming an inclusive community which enables all students and staff to feel valued and respected and to develop their full potential. Diversity in experiences and perspectives enriches our teaching and strengthens our research. High quality teaching and research is inclusive.InformationEnquiries can be made to the chair of the search committee, dr. Willemijn Waal (w.waal@hum.leidenuniv.nl).ApplicationsPlease submit online your application&nbsp;no later than&nbsp;03/31/2022&nbsp;via the blue button in&nbsp;our application system&nbsp;with the items listed below included in this order in a single PDF document named â\u0080\u0098FAMILY NAME â\u0080\u0093 Given name â\u0080\u0093 vacancy numberâ\u0080\u0099:A CV including education, employment history and publications;A letter of motivation;A research proposal (c. 1,000 words)A conference proposal including an abstract, a list of envisaged speakers, and a budget table explaining the expenditure of max.&nbsp;â\u0082¬&nbsp;10,000 (c. 750 words).One sample publication or other piece of written work;Names, positions and email addresses of two referees (no reference letters).Interviews will be held in April or early May.Enquiries from agencies are not appreciatedApply now", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Leiden University was founded in 1575 and is one of Europeâ\u0080\u0099s leading international research universities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5NWZcLzc3Y1wvOTVmNzdjYjE3YjNmODExNDlkZmNlYmIyYWRmYzc1MWQucG5nIiwiZWRpdHMiOltdfQ=="}