{"url": "https://academicpositions.com/ad/university-of-strasbourg/2022/imcbio-phd-program-14-phd-positions-starting-october-2022-at-the-university-of-strasbourg/174690", "title": "IMCBio PhD program â\u0080\u0093 20 PhD positions starting October 2022 at the University of Strasbourg", "publish_date": "2022-02-01", "deadline": "2022-03-17", "location": "4 rue Blaise Pascal CS 90032 Strasbourg, France", "city": "N/A", "country": "France", "position": "PhD", "field": "Botany and plant science, Cancer Research, Cell Biology, Developmental Biology, Genetics, and 6 moreHepatology,Immunology,Molecular Biology,Neuroscience,Structural Biology,Virology", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Strasbourg", "job_description": "The IMCBio graduate school from the University of Strasbourg is recruiting 20 PhD students in 2022 through its international PhD program.This interdisciplinary program, funded by the French National Research Agency (ANR), provides PhD students with a 3-year doctoral contract, mobility support, high-level training sessions and&nbsp;access to state-of-the-art research platforms, as well as possibilities to travel abroad to learn new techniques.PhD research projects in life sciences cover the IMCBio graduates schoolâ\u0080\u0099s main research domains:-&nbsp;Development and stem cells-&nbsp;Functional genomics and cancer-&nbsp;Integrated structural biology-&nbsp;Translational medicine and neurogenetics-&nbsp;Architecture and reactivity of RNA-&nbsp;Insect models of innate immunity-&nbsp;Plant Biology-&nbsp;Genomes expression and cross-talk in mitochondrial function and dysfunction&nbsp;-&nbsp;Viral hepatitis and liver diseases&nbsp;The IMCBio graduate school from the University of Strasbourg builds on the strong research developed in&nbsp;four Laboratories of Excellence&nbsp;(LabEx) INRT (Integrative biology: Nuclear dynamics, Regenerative and Translational medicine), MitoCross (Mitochondria-nucleus Cross-talk), NetRNA (Networks of regulatory RNAs) and HepSYS (Functional genomics of viral hepatitis and liver disease), which cover all areas of molecular and cellular biology at the levels of molecular factors, genes, cells and organisms from model systems to diseases. The complementarities and synergies between the LabEx researchers constitute an attractive training community for the future IMCBio PhD students. Trainees also benefit from outstanding technology infrastructures and platforms to develop high-level research projects in a stimulating and interdisciplinary environment.Covid-19 notice:&nbsp;Please note that the recruitment process might be done online and all necessary precautions will be taken on arrival according to the sanitary situation in October 2022.If you are a highly motivated candidate of academic excellence and if you want to start an innovative research project in 2022, then click below to have a look at the projects advertised and apply to join the IMCBio graduate school!&nbsp;The first PhD Call in 2022:Application deadline:&nbsp; March 21st 2022&nbsp;(noon time Paris).&nbsp;Online registration deadline: March 17, 2022&nbsp;(noon time Paris).&nbsp;Candidates have to complete an online form in English via a web-based application&nbsp;portal.&nbsp;Applications will be evaluated through a three-step process:1st&nbsp;round selection:&nbsp;evaluation &amp; ranking of applications by the IMCBio PhD committee in March â\u0080\u0093 April 20222nd&nbsp;round selection: shortlisted candidates are invited for an&nbsp;online interview session&nbsp;by members of the PhD committee on April 25- May 5, 2022.3rd&nbsp;round selection: shortlisted candidates are invited for an interview session by the whole PhD committee and interviews with their possible future PhD supervisor in May 23 - 27, 2022.Final results will be given in Early June 2022. Start of PhD on October 1st 2022.Additional comments:The IMCBio PhD Program is in English. International students willing to apply for the IMCBio PhD Program should inquire about the visa procedure regarding their country.Web site for application:&nbsp;http://imcbio-phdprogram.unistra.frâ\u0080\u008bPlease indicate that you saw this advert on&nbsp;Academic Positions&nbsp;when applying.And for more information about the IMCBio graduate school:&nbsp;https://imcbio.unistra.fr/About the employerThe&nbsp;University of Strasbourg was founded in the 16th century with the mandate of disseminating knowledge, one of the core values of Humanism. Today, the University of Strasbourg hosts 3 Nobel Prize winners, 42 000 students, offers initial and further education in a wide range of academic fields and is an international player in scientific research. It creates the synergies and fertile ground for a new generation of researchers who will meet the challenges and emerging needs of our society. Strasbourg is the second most international university city in France (after Paris)", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The origins of the University of Strasbourg date back to the early 16th century when Jean Sturm created an institution where one could study theology, philosophy, medicine and law.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJmMDdcLzNlMlwvZjA3M2UyMWViMTMyNDBlY2M0NjI4YjVlNGEwZWI0YjEucG5nIiwiZWRpdHMiOltdfQ=="}