{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/assistant-professor-in-product-design-manufacture-part-time/175191", "title": "Assistant Professor in Product Design & Manufacture (Part time)", "publish_date": "2022-02-11", "deadline": "2022-03-14", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Assistant Professor", "field": "Manufacturing Engineering, Materials Engineering, Product Design,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference ENG026322Closing Date Monday, 14th March 2022Job Type TeachingDepartment Mechanical Materials &amp; Manuf EngSalary Â£40927 to Â£50296 per annum pro-rata depending on skills and experience. Salary progression beyond this scale is subject to performance.The University of Nottingham seeks applications for a part-time Assistant Professor in Product Design and Manufacture to contribute to teaching on our growing undergraduate taught programs in this area. This role is offered as teaching and learning only. It is anticipated that this might also appeal to someone moving into academia from industry as well as existing academics with a T&amp;L focus.&nbsp;It is expected that the ideal candidate will have expertise in the area of product design and manufacture, with knowledge of engineering design methods (including familiarity of CAD and visualisation software) and digital manufacturing. Applications are particularly welcome from individuals with teaching or industrial experience within this field. &nbsp;&nbsp;We particularly welcome applications from staff with protected characteristics, such as BAME, disabled and LGBT+ communities. We also encourage staff who are under-represented in their professional field e.g. for reasons such as gender, to apply.The role holder will contribute to the planning, design, development and delivery of materials for programmes in the Department of Mechanical, Materials and Manufacturing Engineering. &nbsp;The role will include the development of course curricula and teaching materials as required.This post is offered on a permanent basis. We are offering this part-time position between 0.1 and 0.24FTE (Maximum 8.75 hours).Please direct informal enquiries to Simon Harrison (Programme Director for Product Design and Manufacture) (Simon.Harrison@nottingham.ac.uk). Please note that applications sent directly to this email address will not be accepted.Our University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileAdditional InformationApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}