{"url": "http://www.academictransfer.com/en/309155/phd-student-on-magnetic-resonance-imaging-mri-in-interstitial-lung-disease-the-m-ild-study/apply/", "title": "PhD student on: \"Magnetic Resonance Imaging (MRI) in Interstitial Lung Disease: the M-ILD study\"", "publish_date": "2022-02-07", "deadline": "2022-02-20", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "PhD", "field": "Health", "salary": "â\u0082¬2495â\u0080\u0094â\u0082¬3196 per month", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "Interstitial Lung Disease (ILD) prevalence is high and progressively increasing. Every year 500 new ILD-patients are diagnosed at Erasmus MC. Overall median ILD survival is poor ranging from 5 to 14 years. A recent landmark study demonstrated a reduction in ILD disease progression using costly anti-fibrotic drugs. However, half ILD-patients do not benefit from these expensive anti-fibrotic drugs, but could be better treated with anti-inflammatory or combined treatment. Hence, there is an unmet need for a monitoring tool to phenotype ILD-patients by assessing the amount of pulmonary fibrosis and inflammation to guide treatment choices and monitor response.<br><br>Current monitoring, namely computed tomography and lung function tests cannot differentiate between fibrotic lung disease and active inflammation. Chest Magnetic Resonance Imaging (MRI) can offer a one-stop-shop solution for ILD providing structural and functional information in a single examination, such as ventilation inflammation perfusion and structure (VIPS-MRI).<br><br>The aim of this clinical project is to develop an innovative MRI technology for effective phenotyping, patient-tailored treatment guiding and monitoring of therapy response in ILD-patients through the quantification of both fibrosis and inflammation. A novel imaging chest-MRI protocol will be developed and compared to positron emission tomography MRI (PET-MRI) to quantify inflammation and fibrosis. Dedicated post-processing tools for advanced imaging analysis of chest-MRI will be developed. The PhD student will design the new MRI protocol and execute studies on patients with ILD. The PhD will also develop the needed advanced post-processing tools to quantify fibrosis and inflammation on MR images.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You are a highly motivated candidate with a university MSc degree in Physics, Engineering or Computer Science.</li>\n<li>You have outstanding theoretical and experimental research skills, are well organized and result-driven with a strong team spirit.</li>\n<li>You have strong written and oral English skills (EUR requirements minimum IELTS overall score of 7.0, [comparable to TOEFL PBT: 600; TOEFL CBT: 250; TOEFL IBT: 95]).</li>\n<li>You have received excellent scientific training in the field of physics, computer science (Python, Tensorflow, Pytorch), electric engineering or a related field.</li>\n<li>As you will have patient contact knowledge of basic Dutch is a prerequisite. Or you are willing to learn basic Dutch.</li>\n<li>Experience with imaging studies, especially MR and PET imaging will be considered an advantage.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You will receive a temporary position for 4 years.</li>\n<li>The gross monthly salary is â\u0082¬ 2.570,- in the 1st year and increases to â\u0082¬ 3.271- in the 4th year (scale OIO). The terms of employment are according to the Collective Bargaining Agreement for Dutch University Medical Centers (CAO UMC).<br/>Study options, such as participation in courses offered by the Netherlands Institute for Health Sciences (NIHES) or Molecular Medicine (MolMed).</li>\n<li>Excellent fringe benefits, such as a 13th month that is already paid out in November and a personal travel budget.</li>\n<li>Pension insurance with ABP. The employer covers approximately 2/3 of the monthly contribution. â\u0080¢</li>\n<li>Special benefits, such as a physiotherapist and a company bicycle repairer. And there is also a sports club where you can work on your fitness after work.</li>\n<li>Upon commencement of employment, we require a certificate of conduct (Verklaring Omtrent het Gedrag, VOG) and there will be, depending on the type of job, a screening based on the provided CV. Erasmus University Medical Center's HR Department will apply for this certificate on your behalf.</li>\n</ul>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus MC</h4>\n              \n              The Department of Radiology &amp; Nuclear Medicine of the Erasmus MC is the largest department of Radiology in the Netherlands and one of the largest in Europe. Our department is dedicated to high quality patient care, education, and research. Concerning research, the department is known for its forefront research and its state-of-the-art facilities. Moreover, the Radiology department has an MRI physics group with expertise in sequence development, quantitative MRI biomarkers and clinical MRI protocols optimization. The Radiology department has also one of the largest group of imaging analysis in the Netherlands.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about this position, please contact Prof. Dr. Juan Hernandez-Tamames (project leader), via: <a>+31(0) 10 703 0279</a> / j.hernandeztamames@erasmusmc.nl or Dr. Pierluigi Ciet (project leader), via <a>+ 31 (0)10 703 0947</a> / p.ciet@erasmusmc.nl.<br/><br/>For queries regarding your application, please contact Jerry Chandansingh, Recruiter, by phone number: <a href=\"0031650031006\">+31 (0)6 500 310 06</a>. If you are excited by the thought of this position and would like to apply, please do so by using the application form on our website. Your application must include the following documents:<ul>\n<li>Cover letter explaining your motivation and suitability for the position.</li>\n<li>CV/resume including your final marks, research projects and other relevant experience.</li>\n<li>Contact information of 2 senior scientists or principle investigators as references, willing to provide recommendation letters or enquiry.</li>\n</ul>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}