{"url": "https://academicpositions.com/ad/king-abdullah-university-science-technology-kaust/2022/phd-positions-in-structural-biology-at-kaust/174670", "title": "PhD positions in structural biology at KAUST", "publish_date": "2022-01-31", "deadline": "2022-05-01", "location": "King Abdullah University of Science and Technology Thuwal, Saudi Arabia", "city": "N/A", "country": "Saudi Arabia", "position": "PhD", "field": "Biochemistry, Bioinformatics, Biophysics, Computational Biology, Structural Biology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "King Abdullah University of Science and Technology (KAUST)", "job_description": "About the roleHighly motivated candidates are invited to apply for a fully-funded PhD studentship in the laboratory of Dr. Alfredo De Biasio in the Biological and Environmental Sciences and Engineering (BESE) Division at the King Abdullah University of Science and Technology (KAUST) (https://www.kaust.edu.sa/en/study/faculty/alfredo-de-biasio). The project investigates the structure and function of key protein complexes operating in human DNA replication using cryo-Electron Microscopy (cryo-EM). For examples of our recent work see: Lancey et al., Nature Commun., 12(1):6095 (2021); Lancey et al., Nature Commun., 11(1):1109 (2020). The successful candidate will join a vibrant community of structural biologists, biochemists and biophysicists.The BESE Division at KAUST offers a unique combination of an intellectually stimulating environment and access to world-class laboratories, instrumentation, and generous funding schemes. KAUST provides outstanding structural biology research facilities, including a Titan KRIOS G4 [with cold FEG illumination, Ceta D camera, Selectris X and Falcon 4 and phase plate and access to powerful GPU computer clusters], Titan KRIOS G1 [with phase plates, Quantum GIF Gatan filter (model 968), K2 Summit direct detector and access to powerful GPU computer clusters], NMR spectrometers (600, 700, 800 and 950 MHz) and an in-house X-ray source. KAUST facilities also include state-of-the-art core laboratories in Genomics, Proteomics, Imaging &amp; Characterization, Extreme Computing and Informatics.About youThe graduate student should have a bachelor or master degree in Biochemistry, Biophysics, Bioinformatics or related discipline.This Fellowship Opportunity Includes:Stipend for living expensesFree tuitionFree student housingRelocation support&nbsp;Medical/Dental coverageAdditional informationKAUST is an international, graduate research university dedicated to advancing science and technology through interdisciplinary research, education, and innovation. KAUST attracts top international faculty, scientists, engineers and students to conduct curiosity-driven and goal-oriented research to address the worldâ\u0080\u0099s most pressing scientific and technological challenges. Located in Saudi Arabia, on the eastern shores of the Red Sea, KAUST provides an award-winning campus to live, work, study and play, and offers superb research facilities, with guaranteed baseline research funding, infrastructure support, entrepreneurship opportunities and internationally competitive salaries. For more information about KAUST, please visit&nbsp;http://www.kaust.edu.sa. More information about the BESE Division and the Bioscience Program is available at&nbsp;http://bese.kaust.edu.sa.&nbsp;Informal enquiries are welcomed and should be made to Dr. Alfredo De Biasio on +966 012 8084646 or alfredo.debiasio@kaust.edu.sa&nbsp;How to ApplySTEP 1&nbsp;- Apply and provide required documentation for Graduate Studies through the&nbsp;Admissions Website.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Please ensure you have Transcripts, CV, and contact information for three recommendation providers. A Statement of Purpose explaining your interest in topic of research is also required.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Established in 2009, King Abdullah University of Science and Technology (KAUST) is a graduate research university devoted to finding solutions for some of the worldâ\u0080\u0099s most pressing scientific and technological challenges in the areas of food, water, energy and the environment.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEzXC8xMFwva2F1c3QucG5nIiwiZWRpdHMiOltdfQ=="}