{"url": "https://academicpositions.com/ad/ku-leuven/2022/postdoc-position-on-the-development-of-novel-protein-degraders-involved-in-diseases/175065", "title": "Postdoc Position on the Development of Novel Protein Degraders Involved in Diseases", "publish_date": "2022-02-09", "deadline": "2022-02-24", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Biochemistry, Cell Biology, Medicinal Chemistry, Molecular Biology, Pharmacy & Pharmacology, and 2 moreSolid-state Chemistry,Structural Biology", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-81)We are looking for a motivated and dedicated postdoc to join our research teams at KU Leuven. You will take part in interdisciplinary research involving a collaboration between the research teams of Prof. Peter Dedecker, Prof. Shehab Ismail, and the Center for Drug Design and Discovery (CD3) at KU Leuven. Our investigation aims to deliver a novel generation of PROTAC-like drugs based by combining our expertises in biochemistry, structural biology, drug design, and live-cell assays, based on a highly innovative framework. The research will be performed within the facilities available to the groups of Prof. Ismail and Prof. Dedecker. The Laboratory for Mechanistic Molecular Biology, headed by Prof. Shehab Ismail, recently relocated to KU Leuven, the Chemistry Department, from Cancer Research UK-Beatson, Scotland. The group is focused on studying and investigating the molecular mechanisms of the small G-proteins functions, with focus on the Arf-like proteins and Ras proteins, and their involvement in diseases. The group uses structural biology, biochemistry and cell biology approaches to unravel these mechanisms and employ this knowledge to eventually design therapeutics that can control cell signaling. The Lab for Nanobiology, headed by Prof. Peter Dedecker, is a relatively young group with a research focus on advanced imaging in complex biological systems, including the development of molecular probes and sensors that allow the determination of biological activities within live biological samples. We offer an interdisciplinary environment including expertise in (bio-) chemistry, biology, and engineering. Located at the Department of Chemistry at the KU Leuven, the lab possesses and has access to extensive imaging and spectroscopic instruments, probe development facilities, and cell culturing facilities. The Centre for Drug Design and Discovery is an investment fund and drug discovery center focusing on the discovery of new drugs based on innovative science from our partners. We bridge the gap between innovative biomedical research emerging from academic institutes or biotechs and the pharmaceutical industry, and create value for all stakeholders.Website unitResponsibilitiesYou will form a key part of this investigative team. In addition to your contributions to the overall vision, you will particularly focus on the biochemical and structural characterization of the designed molecules. In particular, you willProduce the proteins of interest in ample and pure form (from prokaryotic expression system, eukaryotic/insect cells is a plus)Determine the structures of protein complexes and protein-molecules complexes using crystallographyDetermination of Protein-Protein and Protein-Ligand interactions using fluorescence-based assaysPerform enzymology studiesEngage in intensive discussion, knowledge exchange, and experiments with the other investigators involved in this project.ProfileYou are a highly motivated and driven researcher with PhD degree in biochemistry, molecular biology, pharmacology, or a related field. You have expertise in protein purification, protein-protein interactions studies, enzymology and crystallography. Expressing proteins from insect cells or mammalian cells is a plus. You can function well as part of a dynamic interdisciplinary team and are eager to develop innovative research.OfferWe offer full-time employment as a postdoctoral fellow.Interested?For more information please contact Prof. dr. Shehab Ismail, shehab.ismail.mohamed@kuleuven.be or Prof. dr. Peter Dedecker, peter.dedecker@kuleuven.be.You can apply for this job no later than February 24, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}