{"url": "http://www.academictransfer.com/en/309277/phd-position-10-fte-historical-tensions-between-international-business-and-national-taxation-a-challenge-for-europe-today/", "title": "PhD Position (1.0 FTE) Historical Tensions between International Business and National Taxation: A Challenge for Europe Today", "publish_date": "2022-02-09", "deadline": "2022-03-02", "location": "Burgemeester Oudlaan 50, 3062PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "PhD", "field": "Behaviour and society; Economics", "salary": "max. â\u0082¬2443 per month", "max_working_hours": "40", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "<p>The Erasmus University PhD project comprises a case study of the Anglo-Dutch Unilever since the merger in 1930. Against a background of major international ruptures (1930s Great Depression, Second World War, De-colonisation, the coming of the Iron Curtain and fall of the Berlin Wall) this project will focus on Unilever&rsquo;s connections to other multinational companies in the UK and the Netherlands and particularly its relations with the Dutch and British governments.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>We expect candidates to have:</p>\n<ul>\n<li>a completed Master’s degree or equivalent with a relevant specialization within the social sciences or humanities, e.g. economic/business history, international relations, international business law, international business (IB).</li>\n<li>familiarity with and keen interest in qualitative and quantitative research methods;</li>\n<li>independent thinking and critical analytical skills;</li>\n<li>good collaboration skills and an ability to join interdisciplinary and intercultural academic communities;</li>\n<li>excellent oral and written communication skills in English (CEFR C1);</li>\n<li>command of the Dutch language is a precondition to work in the corporate and national archives (CEFR C1);</li>\n<li>motivation to carry out high level research and (a demonstrated ability to) publish in top peer reviewed international journals.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Employment starts by <strong>May 1st 2020</strong>. We offer an appointment as PhD student for a period of 1.5 year, which will be extended with a second term of 2.5 years if the candidate performs well.</p>\n<p>Remuneration will be in accordance with the PhD scale set by the Collective Labor Agreement for Dutch Universities (CAO NU). Fulltime work will pay € 2.443.- gross in the first year, going up to € 3.122.- in the fourth year.</p>\n<p>EUR offers a holiday bonus of 8% and a year-end allowance of 8.3% per year and there are generous opportunities for additional education.</p>\n<p>Erasmus University Rotterdam offers a Dual Career Programme (DCP) to assist the life partners of new academic staff (on payroll) in finding employment in The Netherlands. The programme is offered in close cooperation with the nearby universities of Delft and Leiden.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus University Rotterdam</h4>\n<p>Erasmus University Rotterdam (EUR) is an internationally oriented university with a strong social orientation in its education and research, as expressed in our mission ‘Creating positive societal impact’. EUR is home to 3.700 academics and professionals and almost 33.000 students from more than 140 countries. Everything we do, we do under the credo The Erasmian Way – Making Minds Matter. We’re global citizens, connecting, entrepreneurial, open-minded, and socially involved. These Erasmian Values function as our internal compass and create EUR’s distinctive and recognizable profile. From these values, with a broad perspective and with an eye for diversity, different backgrounds and opinions, our employees work closely together to solve societal challenges from the dynamic and cosmopolitan city of Rotterdam. Thanks to the high quality and positive societal impact of our research and education, EUR can compete with the top European universities. <a href=\"http://www.eur.nl\">www.eur.nl</a>.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p> Enquiries relating to the project material can be made to Prof.dr. Ben Wubs <a href=\"mailto:wubs@eshcc.eur.nl\">wubs@eshcc.eur.nl</a> </p>\n<p>Each applicant needs to provide in their application:</p>\n<ul>\n<li>CV (with a list of education, positions, teaching experience, administrative experience and other qualifying activities, including a complete list of publications);</li>\n<li>Names and contact details of two potential references (no letters of recommendation are required at this stage).</li>\n<li>A motivation letter, including an outline of a proposed scheme of work for the project (1.5 A4 pages maximum)</li>\n<li>A transcript of your BA and MA/MSc courses and grades.</li>\n<li>A digital copy of your MA/MSc thesis.</li>\n</ul>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}