{"url": "https://academicpositions.com/ad/imec/2022/senior-researcher-acoustofluidics/174093", "title": "Senior Researcher Acoustofluidics", "publish_date": "2022-01-17", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Researcher", "field": "Acoustics, Electrical Engineering, Electronics, Engineering Physics, Mechanical Engineering, and 2 moreMechanics,Systems Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><i>Design novel MEMS system coupling ultrasound and micro-fluidics </i></p><p><i><strong>What you will do</strong></i></p><p>Within imecâ\u0080\u0099s Sensor and Actuator Technology department, our teamâ\u0080\u0099s activities focus on the development of novel applications using transducers, sensors and actuators using MEMS technology. The team is working on the design and characterization of the devices itself as well as the full system analysis until the creation of demos. In this job you will work on these novel technologies and systems. You will collaborate closely with the biomedical, process technology, and ASIC teams. This interaction will enable the natural evolution of the currently developed MEMS technologies and devices towards their application. Materials selection, technology parameter definition, modeling of novel physical phenomena as well as technological variability will be key for this successful transition.</p><p>In this role, your main responsibilities will be:</p><ul><li>You will design novel MEMS system coupling ultrasound and micro-fluidics using existing technologies and technologies under development. More specifically, you will work on the design of ultrasound transducers to generate force on biological medium in order to control droplets, to move fluid in a channel or to control cell for sorting. </li><li>You will participate to the characterization of the designed devices in order to update your models.</li><li>You will build acousto-fluidic set-up in collaboration of the life science department to demonstrate the application. </li><li>You will maintain a high standard of literature knowledge to support the design activities.</li><li>You will collaborate with specialists from our cross-disciplinary design and technology teams.</li><li>You will follow up on customer projects</li><li>You will be involved in the definition of industrial as well as public funded projects.</li><li>You will contribute to the creation of a long-term vision and strategy for the group. You will generate patents and publish in international journals.</li><li>You will mentor Master internship students and PhD students to leverage the work</li></ul><p><i><strong>What we do for you</strong></i></p><p>We offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will define the society of tomorrow.</p><p>We are <a href=\"http://www.imec-int.com/en/careers#diversity\" target=\"_blank\">committed to being an inclusive employer</a> (<a href=\"http://www.imec-int.com/en/careers#diversity\" target=\"_blank\">http://www.imec-int.com/en/careers#diversity</a>) and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth. </p><p>We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a market appropriate salary with many fringe benefits. </p><p><i><strong>Who you are</strong></i></p><p>You are a self-motivated researcher, who seizes opportunities. You benchmark your results with state of the art and explore new methodologies that go beyond todayâ\u0080\u0099s solutions.</p><ul><li>You have a PhD degree in Physics, Mechanics or Electrical Engineering with several years of relevant experience in ultrasound system analysis of MEMS. </li><li>You have proven experience:<ul><li>in acousto-fluidic modelling using software such as ANSYS and comsol</li><li>in building set-ups for ultrasound and micro-fluidic</li><li>in project managing</li></ul></li><li>You are organized and you can structure a complex project. Having experience in project writing is a plus.</li><li>You have excellent communication skills, that you will use to interface with internal and external customers </li><li>You can work according to agreed customer timelines and manage time efficiently according to strict project schedules</li><li>You take initiative and can work on your own, while being part of a team.</li><li>You are result-driven and flexible to meet deadlines with quality output</li></ul><ol><li>The imec environment requires a good team player with customer-oriented communication and reporting skills. </li><li>Given the international character of imec, a good knowledge of English is mandatory.</li></ol><p>Apply online a t<a href=\"http://www.imec-int.com/careers\" target=\"_blank\">www.imec-int.com/careers</a></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}