{"url": "http://www.academictransfer.com/en/309321/phd-student-on-genetic-factors-for-obesity/apply/", "title": "PhD student on genetic factors for obesity", "publish_date": "2022-02-10", "deadline": "2022-02-27", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "PhD", "field": "Health", "salary": "â\u0082¬2570â\u0080\u0094â\u0082¬3271 per month", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "Obesity is a global health care problem and forms a major risk factor for metabolic comorbidities such as diabetes, cardiovascular disease, and cancer. While the obesogenic environment has contributed to increased obesity rates, genetic factors modulate the susceptibility for obesity. Our research within the Obesity Center CGG (Centrum Gezond Gewicht) shows that obese patients frequently harbor genetic mutations or variants as an underlying cause of their obesity. Studies show that common polymorphisms in genes implicated in severe obesity modulate body mass index (BMI) and the risk for obesity in the general population.<br><br>In this project we aim to analyze the association of variants of genes involved in the leptin-melanocortin system and novel identified obesity-related pathways with BMI and obesity-related health issues (such as type 2 diabetes, cardiovascular disease) using population-based cohorts and translate results to our clinical obesity cohort.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For this position we are seeking a highly motivated candidate with an MSc in Biology, Biomedical Sciences or a related discipline with an interest in Endocrinology and Obesity. You must have experience with human genetics, genetic epidemiology, and biostatistics. Other requirements/preferences include:<ul>\n<li>Experience with population genetic and association analyses of human complex traits.</li>\n<li>Experience in managing and analyzing genome-wide genotype data.</li>\n<li>Basic understanding of the biology of obesity and metabolic disorders.</li>\n<li>Experience in the programming languages R and/or python.</li>\n<li>Experience of multi-trait genetic association analysis, polygenic risk scores, and/or Mendelian randomization is an advantage.</li>\n<li>Excellent communication and writing skills in Dutch and/or (academic) English.</li>\n<li>bility to interact effectively and work productively in a team. Emphasis will be placed on personal suitability.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You will receive a temporary position for 4 years.</li>\n<li>The gross monthly salary is â\u0082¬ 2.570 ,- in the 1st year and increases to â\u0082¬ 3.271,- in the 4th year (scale OIO).</li>\n<li>Excellent fringe benefits, such as a 13th month that is already paid out in November and a individual travel expense package.</li>\n<li>Pension insurance with ABP. We take care of approximately 2/3 of the monthly contribution.</li>\n<li>Special benefits, such as a incompany physiotherapist and bicycle repairer. And there is also a gym where you can work on your fitness after work.</li>\n</ul> The terms of employment are in accordance with the Collective Bargaining Agreement for University Medical Centers (CAO UMC).\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus MC</h4>\n              \n              The Department of Internal Medicine is a large department with nine research laboratories. Our main mission is to pioneer innovation in research, education and care by bringing science to the patient. To achieve this objective, we aim to continually develop new technologies and innovations within the department in research, education and care.<br/><br/>Within the section Endocrinology, the research group \"Metabolism and Reproduction\" focuses on aspects of sex differences in metabolism in health and disease. We approach our research questions using genetic, physiological and cellular techniques, both in animal models and in humans. An important principle that guides our efforts is the possibility to apply our findings to the clinic and, vice versa, paying attention to questions that arise in the clinic when treating patients. You will be working in a multi-disciplinary dynamic environment. For this project, you will collaborate closely with researchers of the team of Prof. J. van Meurs.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about this position, please contact Dr. ir. Jenny Visser, Associate Professor, Head Lab Metabolism and Reproduction, phone number: <a href=\"tel:00107030533\">+31 010 703 05 33</a>. For queries regarding your application, please contact Jeanette dos Santos Gomes, Recruiter, by phone number: +31 (0)6 500 310 07.<br/><br/>If you are excited by the thought of this position and would like to apply, please do so by using the application form on our website. Please send your Curriculum Vitae, motivation letter and contact information of at least two references.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}