{"url": "https://academicpositions.com/ad/technion-israel-institute-technology/2021/open-phd-position-project-duration-is-3-5-years-42-months/173335", "title": "Open PhD position: project duration is 3.5 years (42 months)", "publish_date": "2021-12-21", "deadline": "2022-03-21", "location": "Mauerberger Building, 2nd floor Technion City Haifa, Israel", "city": "N/A", "country": "Israel", "position": "PhD", "field": "Aeronautical Engineering, Energy Technology, Fluid Dynamics, Fluid Mechanics, Thermodynamics, and 1 moreTransportation Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "Technion - Israel Institute of Technology", "job_description": "Thermo-Fluids and Interfaces LaboratoryFaculty of Aerospace EngineeringOur research is multidisciplinary and spans a wide breadth of activities in the areas of thermo-fluids and interfacial transport phenomena. The focus is on understanding the related physics across scales and leveraging this knowledge to the development of advanced energy technologies and green aviation. Specific examples include ultra-efficient propulsion systems and thermal management, alternative water resources, and the exploitation of the physical regimes at small scales to obtain new functionalities.Terzis Research Lab invites applications for highly-motivated students to carry out research in the broad field of flow and transport processes in porous media. The projects include experimental, numerical and theoretical investigation of multi-phase and reactive transport in deformable and multi-porosity media.For more information: https://aterzis.com/Apply now: apply@int.technion.ac.il", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Technionâ\u0080\u0093Israel Institute of Technology is a public research university in Haifa, Israel. Founded in 1912, Technion is the countryâ\u0080\u0099s oldest university.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9sMzBzNlkyZTlKUVZ0WTNNZlVPbDdkTUhsMXJ5RFpLM3R4M2lFeVdJLnBuZyIsImVkaXRzIjpbXX0="}