{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/dean-of-the-college-of-international-studies/174544", "title": "Dean of the College of international studies", "publish_date": "2022-01-27", "deadline": "N/A", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Management", "field": "Business Administration, Conflict Processes, Educational Leadership, Educational Management, International Relations, and 7 moreInternational Security and Arms Control,Management,Political Economy,Politics,Public Administration,Public Policy,Strategic Management", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>This position will report directly to the <strong>Associate Vice President for Academic Affairs.</strong> </p><p><strong>JOB DESCRIPTION:</strong></p><p>The Dean will serve as the chief academic and administrative officer for the College of Global Affairs &amp; Public Policy and, is responsible for developing and implementing academic and financial strategies, recruiting faculty, students, and administrative staff, and maintaining the organizational structure that will serve and promote research, clinical and educational programs of the highest caliber.</p><p><strong>This position will be responsible for:</strong></p><ul><li>Serves as chief executive and academic administrative officer of the College of Global Affairs &amp; Public Policy by creating a vision and advancing the mission of the College, with responsibility for academic and development functions, personnel, general administration and management, and budget.</li><li>Plans for the fiscal and material resources needed to offer the educational, research, and service programs of the College.</li><li>Administers the College's educational, research, and public service programs.</li><li>Consults and collaborates with faculty and administrators on decisions related to the academic affairs of the College.</li><li>Recommends to the Vice President of Academic Affairs the appointments, promotions, and tenure of College of Global Affairs &amp; Public Policy faculty members.</li><li>Serves as the College's representative on various University policy and decision bodies and is the official representative of the College to external constituencies.</li><li>Collaborates with individuals, groups, Colleges, programs, alumni, and organizations within the University, and the public at large to promote the goals of the College.</li><li>Leads the College's development activities to promote the College's goals and vision.</li><li>Assures compliance with the general policies and practices of AUIB.</li><li>Responsible for the strategic planning and policy development activities of the College.</li></ul><p><strong>Qualifications:</strong></p><ul><li>Must have PhD degree in a discipline in the College from an accredited institution, primarily in international law, conflict resolution, political economy, security studies and public policy majors.</li><li>At an Associate Dean or Dean experience at least 3 â\u0080\u0093 5 years.</li><li>Must be native English speaker and possess excellent communications skills.</li><li>A reputation for creative scholarship and a demonstrable record of fostering excellence in research, teaching, and service.</li><li>Ability to think strategically and build effective institutional partnerships.</li><li>Demonstrated administrative experience, a high standard of professional integrity, and strong team building skills.</li><li>Ability to effectively articulate the College's vision and mission to the students, faculty, alumni, practitioners, external funding agencies, and other decision-making bodies.</li></ul><p><strong>Application Procedure:</strong></p><p>Applications should include:</p><ul><li><strong>Cover Letter</strong></li><li><strong>Curriculum Vitae</strong></li><li><strong>Passport First Data Page</strong></li><li><strong>Contact Information For Three (3) Professional References</strong></li><li><strong>Copies Of Degrees Or Certification</strong></li></ul><p>Applications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately.</p><p>Please apply through AUIB website OR send your application and supporting documents to the following email address:</p><p><a href=\"mailto:jobs@auib.edu.iq\">jobs@auib.edu.iq</a> with <a href=\"mailto:Karin.Jesuis@auib.edu.iq\">Karin.Jesuis@auib.edu.iq</a> in copy.</p><p><strong>A declaration of a relation at AUIB is obligatory</strong></p><p><strong>We will contact you if you are selected for interview.</strong></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}