{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/research-associate-postdoc-in-computer-vision-for-robotics/174831", "title": "Research Associate (Postdoc) in Computer Vision for Robotics", "publish_date": "2022-02-03", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Research Assistant", "field": "Applied Mathematics, Artificial Intelligence, Computer Vision, Image Processing, Machine Learning, and 2 moreProgramming Languages,Robotics", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>SnT</strong> is a leading <strong>international research and innovation centre</strong> in secure, reliable and trustworthy ICT systems and services. We play an instrumental role in Luxembourg by fueling innovation through research partnerships with industry, boosting R&amp;D investments leading to economic growth, and attracting highly qualified talent.</p><p>The Centre is currently expanding its research activities and is seeking highly motivated research associates who wish to pursue research in close cooperation with our partners. For further information you may check: <a href=\"http://www.securityandtrust.lu/\" target=\"_blank\">www.securityandtrust.lu</a>, <a href=\"http://wwwen.uni.lu/snt/research/spacer\" target=\"_blank\">http://wwwen.uni.lu/snt/research/spacer</a></p><p>Weâ\u0080\u0099re looking for people driven by excellence, excited about innovation, and looking to make a difference. If this sounds like you, youâ\u0080\u0099ve come to the right place!</p><p><strong>Your Role...</strong></p><p>The successful candidate will join the young, strong and motivated SpaceR research group focused on increasing the autonomy of aerial, planetary and orbital robotics for on-earth applications, space exploration, on-orbit servicing and manufacturing, and space resource utilization. This innovative research group is led by Prof. Miguel Olivares-Mendez.</p><p>We offer two different career paths for scientific staff, depending on their focus on an academic or industry career. In our academic track, candidates focus on publications, research grants, teaching experience, and community engagement, while maintaining a positive relationship to industry to get access to first-hand research data. In our industry track, candidates will prepare themselves for a career in industry or in a start-up while utilitzing their previous theoretical knowledge. They will build relationships with our industry partners while having freedom to pursue their own ideas in an innovative and dynamic environment.</p><p>Successful candidates will perform the following tasks (weighting according to chosen track):</p><ul><li>Carrying out research in the predefined areas</li><li>Disseminating results through scientific publications</li><li>Providing guidance to PhD and master students</li><li>Communicating and working with companies in the robotics sector and stakeholders in government</li><li>Preparing research proposals to attract industry partnerships as well as national and European grant projects</li><li>Managing research projects and preparing project deliverables</li><li>Cooperate within other projects and with colleagues at SpaceR to extend the used of the developed approaches to planetary and orbital robotics</li><li>Participating in research proposal drafting and project deliverables</li><li>Assisting in the organization of relevant workshops and demos</li></ul><p><strong>Your Profile...</strong></p><p>Qualifications: The candidate should possess a Ph.D. degree in Engineering, Computer Science, Applied Mathematics or affine.</p><p>What we are looking for:</p><ul><li>A collaborative player with a desire to make a personal impact within our interdisciplinary research group</li><li>The commitment to participate in theâ\u0080¯design and implementationâ\u0080¯of high-quality solutions that solve significant problemsâ\u0080¯</li><li>Self-initiative, creativity,â\u0080¯curiosity,â\u0080¯flexibilityâ\u0080¯and enthusiasm to workâ\u0080¯</li><li>Prior experience inâ\u0080¯publishingâ\u0080¯high-qualityâ\u0080¯and high-impact research (including publications in top-tier journals and conference proceedings)</li></ul><p>Knowledge and Experience:</p><p>The candidate should haveâ\u0080¯strong knowledge and/or experienceâ\u0080¯in:</p><ul><li>Traditional computer vision and Machine Learning based image processing for object detection and tracking</li><li>Robotics with strong development skills in C++, python and ROS</li></ul><p>The candidate should haveâ\u0080¯basic knowledge and/or experience in at least two of the following areas:</p><ul><li>Management of research projects</li><li>Vision-based pose estimation</li><li>Sensor fusion</li><li>Simultaneous Localization and Mapping (SLAM)</li><li>Vision Inertial Odometry</li><li>Point Cloud analysis</li><li>LIDAR-based localization and mapping</li><li>Hands-on aerial robot setup and maintenance</li></ul><p>Language Skills: Fluent written and verbal communication skills in English are required.</p><p><strong>Hereâ\u0080\u0099s what awaits you at SnT...</strong></p><ul><li><strong>Exciting infrastructures and unique labs.</strong> At SnTâ\u0080\u0099s two campuses, our researchers can take a walk on the moon at the LunaLab, build a nanosatellite, or help make autonomous vehicles even better</li><li><strong>The right place for IMPACT. </strong>SnT researchers engage in demand-driven projects. Through our Partnership Programme, we work on projects with more than 45 industry partners</li><li><strong>Be part of a multicultural family</strong>. At SnT we have more than 60 nationalities. Throughout the year, we organise team-building events, networking activities and more</li></ul><p><a href=\"https://wwwfr.uni.lu/snt/about_us\" target=\"_blank\">Find out more about us!</a></p><p><strong>In Short...</strong></p><ul><li>Contract Type: Fixed Term Contract 24 Month (extension possible)</li><li>Work Hours: Full Time 40.0 Hours per Week</li><li>Ideal starting date: April / May 2022</li><li>Location: Kirchberg</li><li>Job Reference: UOL04751 / 5G-Sky budget</li></ul><p>The yearly gross salary for every Postdoctoral Researcher at the UL is EUR 75.285 (full time)</p><p><strong>How to apply...</strong></p><p>Applications in English should include:</p><ul><li>A cover letter including:<ul><li>A research statement and a list of topics of particular interest to the candidate (250 words)</li><li>A statement on the candidate's personal motivation for applying (250 words)</li><li>A strategy for the acquisition of research grants and industry partnerships (250 words)</li></ul></li><li>Full CV, including the contact address, work experience and a list of publications</li><li>Transcript of all modules and results from university-level courses</li><li>Reference letters by prior employers</li><li>3 publications in full-text, co-authored by the candidate</li></ul><p>All qualified individuals are encouraged to apply.</p><p>Early application is highly encouraged, as the applications will be processed upon reception. Please apply ONLINE formally through the HR system. Applications by Email will not be considered.</p><p>The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.</p><p><strong>About the University of Luxembourg...</strong></p><p><strong>University of Luxembourg</strong> is an <strong>international research</strong> university with a distinctly <strong>multilingual</strong> and <strong>interdisciplinary</strong> character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.</p><p><strong>Further information</strong></p><p>For further information, please contact at <a href=\"mailto:miguel.olivaresmendez@uni.lu\">miguel.olivaresmendez@uni.lu</a></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}