{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/associate-professor-tenure-track-assistant-professor-in-computational-soil-mechanics-and-foundation-engineering/175103", "title": "Associate Professor / Tenure-track Assistant Professor in Computational Soil Mechanics and Foundation Engineering", "publish_date": "2022-02-10", "deadline": "2022-05-01", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Assistant Professor", "field": "Civil Engineering, Computational Engineering, Computational Physics, Environmental Engineering, Geotechnical Engineering, and 1 moreMechanics", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "The Department of Engineering of the Faculty of Science, Technology and Medicine is seeking to hire an outstanding candidate in the area of Computational Soil Mechanics and Foundation Engineering. We seek candidates who are eager to engage as educators among a diverse student community.Your role..&nbsp;To diversify the existing skills and expertise of the department of engineering in civil and environmental engineering, the&nbsp;candidate is expected to:Perform high-level research in computational soil mechanics and foundation engineeringContribute to teaching in the bachelor and master programs in engineeringApply for third-party fundingSetup and manage a research group in foundation engineering, including supervision of PhD candidatesEstablish collaborations with national and international partners in industry and academiaCandidates who can demonstrate innovative engineering approaches to address sustainability challenges associated with the built environment will stand out. Potential focus areas include â\u0080\u0093 but are not limited to â\u0080\u0093 the reduction of carbon emissions and resource consumption; recycling, reuse and revitalisation in foundation engineering; as well as models and methods for the characterisation of porous media and advanced geotechnical situations, for instance in relation to carbon capture.Your profile..&nbsp;The ideal candidate is an emerging, high-potential researcher with proven track record in research in the area of foundation engineering and/or soil mechanics as well as applied research activities in the broader domain of civil engineering.The successful candidates should have:A PhD degree in civil engineering or related areaRecognised and original contributions to research in foundation engineering and computational soil mechanicsExperience in teaching at the undergraduate and graduate levelsGood presentation, communication, organisational and management skillsInterest in interdisciplinary collaborationsWorking knowledge of English and either French or GermanWe offer..&nbsp;An exceptional research environment and skilled support staffExtensive laboratories for material and structural testingHighly competitive salary and benefits packagesVery significant package for research funding and very good opportunities for external fundingIn short..&nbsp;Contract Type: 5 years (tenure track), with perspective of a permanent position and promotion to Associate Professor upon a positive evaluation. In case of an excellent more senior candidate, a direct appointment at the level of Associate Professor would then be on a permanent positionWorking hours: Full time 40 hours per weekLocation: Campus Kirchberg and/or Campus Esch BelvalStarting date: September 2022 or laterJob reference:&nbsp;UOL04164How to apply..&nbsp;Applications, in English, should contain a motivation letter, a research statement, a teaching statement highlighting areas of interest in education and willingness to contribute to departmental operations, a detailed curriculum vitae, a full list of publications and the names of at least four experts who can, upon request from the Faculty, provide reference letters.We encourage early application. To ensure full consideration, candidates should apply by&nbsp;May 1st, 2022. All applications should be sent to the Dean of the Faculty, Prof. Dr. Jean-Marc Schlenker, using the email address:&nbsp;FSTM.recruitment-DOE@uni.luThe University of Luxembourg is an equal opportunity employer and strives to increase the share of female professors. We explicitly encourage women to apply.The University..&nbsp;Multilingual and international character.&nbsp;Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d&nbsp;(UniGR).&nbsp;A modern and dynamic university.&nbsp;High-quality equipment. Close ties to the business world and to the Luxembourg labour market.&nbsp;A unique urban site with excellent infrastructure.A partner for societyand industry.&nbsp;Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic&nbsp;partners such as ministries, local governments, associations, NGOs â\u0080¦Find out more about the UniversityAddresses, maps &amp; routes to the various sites of the UniversityThe University of Luxembourg is a highly international, young and dynamic university, for instance currently ranked 20th in the Times Higher Education ranking of the best universities under 50 years old.The University of Luxembourg is set in a multilingual context. The person hired on this position must be proficient in English and either French or German. The University encourages its staff to learn the other language and provides access to language courses to this end.Living and working in Luxembourg..&nbsp;Luxembourg has an extensive welfare system. It comprises a social security, health, and pension funds. Among those benefits, there are various types of financial aids directly linked to the schooling and education of children: family allowance, birth allowance &amp; children's future allowance. According to a recent UNESCO report, Luxembourg rank highest on childcare provisions among 41 OECD and EU countries. Further information:&nbsp;t.ly/aH3PThe country counts with an extensive public education system that comprises as well International and European Schools. Further information:&nbsp;t.ly/1RyJFor more general information about living and working in Luxembourg including tips for accommodation, entry conditions/visas you can also view the Euraxess Researcher Guide:&nbsp;t.ly/IgJDFor further questions, please contact the dean of the Faculty under&nbsp;jean-marc.schlenker@uni.lu", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Luxembourg aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international, multilingual and interdisciplinary character.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}