{"url": "https://academicpositions.com/ad/wenzhou-kean-university/2022/assistant-associate-full-professor-in-finance/173675", "title": "Assistant/Associate/Full Professor in Finance", "publish_date": "2022-01-05", "deadline": "N/A", "location": "88 Daxue Rd, Ouhai, Zhejiang Province Wenzhou, China", "city": "N/A", "country": "China", "position": "Full Professor", "field": "Business Economics, Corporate Finance, Finance, Financial Economics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Wenzhou-Kean University", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>Along with NYU Shanghai and Duke University Kunshan, Wenzhou-Kean University (WKU) is one of only three full legal-person Sino-American universities with all English instruction approved by the Ministry of Education in China. We invite research-oriented applicants for full-time tenure track positions at the rank of Assistant or Associate Professor in Finance to begin in <strong>Spring or Fall 2022</strong>. High research candidates with UTD (<a href=\"https://jindal.utdallas.edu/the-utd-top-100-business-school-research-rankings/list-of-journals\" target=\"_blank\">https://jindal.utdallas.edu/the-utd-top-100-business-school-research-rankings/list-of-journals</a>) publication record may be considered for a special research track with 1-1 or 2-0 load, generous research funding, up to RMB 1.2 million (about USD $180K) in 10-month tax-FREE salary (pending nationality), and additional allowance besides standard benefit package, e.g. extra RMB one million in housing subsidy. </p><p><br/>The successful candidate will be able to teach a field in investment, international finance, or financial statement analysis, as well as participate in the full range of faculty responsibilities, including scholarly research and service to the University. Applicants should possess an earned doctorate in Finance from an AACSB accredited program, or anticipate completion by July 2022. Applicants with terminal economics degree from top universities and proven research records in Finance are also strongly encouraged to apply. To receive full consideration by the search committee, candidates need to submit a cover letter, CV, research statement, unofficial transcripts and contact information for three references by email to: Search Committee Chairperson at <a href=\"mailto:wkucbpm@wku.edu.cn\">wkucbpm@wku.edu.cn</a> . Official transcripts for terminal degrees and three current letters of recommendation are required before appointment. </p><p>WKU sits on over 500 beautiful acres with new state-of-the-art facility (<a href=\"http://www.wku.edu.cn/en/cbpm/\" target=\"_blank\">http://www.wku.edu.cn/en/cbpm/</a>). A city of 9 million people, Wenzhou is only one hour by plane and just over three hours by high-speed train from Shanghai and Hong Kong. </p><p>Business faculty positions at WKU offer: </p><ul><li>Competitive salaries that are multi-year Tax-Free for citizens of countries such as U.S.A.</li><li>Generous home leave, housing, schooling, and relocation allowances, as well as 8% front-load retirement benefits with immediate vesting.</li><li>Research funding</li><li>A collegial environment</li><li>The opportunity to teach high quality students with more than half of them go to the graduate schools at Top 50 Universities in the world.</li></ul><p>Wenzhou-Kean University is an Equal Opportunity Employer</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyODNcLzY0NFwvMjgzNjQ0MTViNjFlMWM1NTViMTU2ZjljNjM5MjZmMTYucG5nIiwiZWRpdHMiOltdfQ=="}