{"url": "http://www.academictransfer.com/en/309217/phd-candidate-in-quantitative-social-science-with-a-focus-on-civil-registration/apply/", "title": "PhD Candidate in Quantitative Social Science with a Focus on Civil Registration", "publish_date": "2022-02-08", "deadline": "2022-03-15", "location": "Nieuwe Achtergracht 166, 1018 WV, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "PhD", "field": "Behaviour and society", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "38", "employer": "University of Amsterdam (UvA)", "job_description": "<p>The Department of Political Science at the University of Amsterdam (UvA) is looking for a PhD candidate to conduct research in the project &#39;CitizenGap - Legal Identity for All&#39;. The project is funded by the European Research Council (ERC) and led by Dr. Imke Harbers. The PhD candidate will be embedded in the Amsterdam Institute for Social Science Research (AISSR) at the Faculty of Social and Behavioural Sciences.</p><p>Citizenship grants access to the rights enjoyed by all members of the political community of a given state. Although we often think of undocumented persons as migrants or non-citizens, globally one in seven people have not had their birth registered, and thus do not possess official documents to prove their legal identity. The share of people who hold identity documents, but whose documents are deemed insufficient or inconclusive to prove citizenship, is even higher.</p><p>For millions of people, the threat to their fundamental rights derives not from their legal status, but from their inability to prove this status. What accounts for this gap between citizenship as a legal status and the ability of citizens to document their claim to citizenship? If civil registration is not universal, who is left out? Why is access to civil registration uneven across societal groups?</p><p>To answer these questions, the project conceptualizes civil registration as a tool used by political elites to include or exclude societal groups. The project uses a multi-method approach, combining quantitative demographic and spatial (GIS) datasets with fieldwork, archival sources, interviews and focus groups.</p><p>The PhD candidate selected for this position will conduct quantitative, cross-national research on access to civil registration based on demographic data. Further information about the project may be found&nbsp;<a href=\"https://www.dropbox.com/s/pjn4i3edm3fv8q2/ERC%20B1%20Summary_updated%202022.pdf?dl=0\">here</a>.</p><p><strong>What are you going to do</strong></p><p>You will:</p><ul> <li>conduct PhD research on civil registration, legal identity and citizenship based primarily on census data, surveys, and vital statistics;</li> <li>be affiliated with the AISSR and participate in its organized PhD training.</li> <li>complete academic work resulting in a doctoral dissertation that will be defended at the Faculty of Social and Behavioural Sciences at the University of Amsterdam with the goal of obtaining a PhD degree;</li> <li>take active part in the research environment at the AISSR, including project group meetings and research seminars;</li> <li>teach Bachelor level courses, depending upon availability and as is suitable for the PhD schedule;</li> <li>assist with administrative responsibilities related to the project (ca. 10% of the time), such as project management, the organization of workshops, or other project events;</li> <li>make Amsterdam (or a location within commuting distance) your primary residence for the duration of the PhD project. The AISSR will assist with finding adequate housing and with applying for visa and residence permits.</li> </ul>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>What do we require</strong></p>\n<ul>\n<li>Essential:\n\t<ul>\n<li>a Master, Research Master or equivalent degree in the social sciences, global health, or a closely related discipline. The degree must have been obtained by the start of your employment;</li>\n<li>excellent oral and written communication skills in English;</li>\n<li>excellent command of quantitative research methods, including familiarity with R;</li>\n<li>experience working with demographic and/or survey data;</li>\n<li>a commitment to academic integrity and transparency;</li>\n<li>independent thinking and critical analytical skills;</li>\n<li>the ability to work independently;</li>\n<li>the ability to collaborate in an interdisciplinary team.<br/>\n\t\t </li>\n</ul>\n</li>\n<li>Desirable:\n\t<ul>\n<li>experience with research on civil registration;</li>\n<li>experience with qualitative research methods or conducting fieldwork;</li>\n<li>experience as research assistant or enumerator in the field;</li>\n<li>oral and written communication skills in another language.</li>\n</ul>\n</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Our offer</strong></p>\n<p>The position concerns a temporary appointment of 38 hours per week for a maximum term of four years. The initial appointment is for one year, starting no later than 1 September 2022. Following a positive assessment after 12 months and barring other unforeseen circumstances, your appointment will be extended by a maximum of 36 months, at the end of which a doctorate should be conferred. You will follow a curriculum with other AISSR PhD candidates. You will also have the opportunity to attend additional training courses, summer schools and both national and international conferences.</p>\n<p>Your salary will be €2,443 gross per month in the first year and will increase to €3,122 in the final year, based on full-time employment and in keeping with the <a href=\"https://www.universiteitenvannederland.nl/en_GB/cao-universiteiten.html\">Collective Labour Agreement for Dutch Universities</a>. We additionally offer an extensive package of secondary benefits, including 8% holiday allowance and a year-end bonus of 8.3%.</p>\n<p>The UvA offers excellent possibilities for further professional development and education. A stimulating work environment with a variety of duties and ample scope for individual initiative and development within an inspiring organisation. The social and behavioural sciences play a leading role in addressing the major societal challenges faced by the world, the Netherlands and Amsterdam, now and in the future.</p>\n<p>To work at the University of Amsterdam is to work in a discerning, independent, creative, innovative and international climate characterised by an open atmosphere and a genuine engagement with the city of Amsterdam and society.</p>\n<p>The University of Amsterdam (UvA) is a university with an internationally acclaimed profile, located at the heart of the Dutch capital. The UvA is a member of the League of European Research Universities.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>University of Amsterdam</h4>\n<p>The University of Amsterdam is the largest university in the Netherlands, with the broadest spectrum of degree programmes. It is an intellectual hub with 39,000 students, 6,000 employees and 3,000 doctoral students who are all committed to a culture of inquiring minds.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Do you have any questions or do you require additional information? Please contact:</p>\n<ul>\n<li><a href=\"mailto:i.harbers@uva.nl\">Dr. Imke Harbers</a></li>\n</ul>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uva.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uva-en-wide/22e1319f66e44f07d56047b996668aa9.png"}