{"url": "https://www.academictransfer.com/en/309365/phd-position-at-the-amsterdam-school-for-heritage-memory-and-material-culture/apply/", "title": "PhD Position at the Amsterdam School for Heritage, Memory and Material Culture", "publish_date": "2022-02-11", "deadline": "2022-03-31", "location": "Kloveniersburgwal 48, 1012 CX, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "PhD", "field": "Language and culture", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "38", "employer": "University of Amsterdam (UvA)", "job_description": "<p>The Amsterdam School for Heritage, Memory and Material Culture (AHM) invites applications for a PhD position at the Faculty of Humanities. The Amsterdam School for Heritage, Memory and Material Culture is one of the six Research Schools within the <a href=\"https://aihr.uva.nl/research/research-schools.html\">Amsterdam Institute for Humanities Research</a>. Each research school covers an important research area within the faculty and has its own research program. AHM is also the home base for PhD candidates, who interact with each other and with senior members in the research groups.</p><p><a href=\"https://ahm.uva.nl/\">AHM</a>, as a thematic research school, fosters a dynamic, interdisciplinary and transnational approach across various disciplines. AHM&rsquo;s mission and profile integrate all branches of research that focus on the material and intangible remains of the past, the reciprocal relations between objects, meanings and representations, and the dynamics of memory.</p><p>AHM&rsquo;s research is carried out from diverse theoretical and methodological perspectives: in concept-oriented, object-oriented and user-oriented approaches. AHM&rsquo;s research agenda is streamed into five Research Themes that cross and connect the fields of heritage, memory studies and material culture.: <em>Museums &amp; Memorials</em>, <em>Heritage &amp; Conflict</em>, <em>Transnational Memory Narrative</em>s, <em>Digitality &amp; E-Memories, Materiality &amp; Material Culture</em>. Each of these themes relates to several working research groups in the school, but has in principle a rather open character, and closely collaborates with the other research themes and research groups.</p><p><strong>What are you going to do</strong></p><p>You will conduct research on your PhD project in a dynamic and interdisciplinary context with ample opportunities for development and innovation. AHM is the research base for a broad spread of disciplines from Heritage and Memory Studies, Media Studies, Museum Studies, Archaeology and Material Culture, and Conservation and Restoration, and Art History. Besides conducting research on their own topic, PhD candidates are expected to actively participate and contribute to AHM&rsquo;s events and activities.</p><p><strong>Tasks and responsibilities: </strong></p><ul> <li>submission of a PhD dissertation within the period of appointment;</li> <li>presenting intermediate research results at workshops and conferences;</li> <li>participation in the Research School and Faculty of Humanities PhD training programmes;</li> <li>teaching courses at BA-level in the 2nd or 3rd year of the appointment (0,2 FTE per year).</li> </ul>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>What do you have to offer</strong></p>\n<p>We are seeking an enthusiastic PhD candidate in the research areas of AHM.<strong> </strong></p>\n<p><strong>Requirements: </strong></p>\n<ul>\n<li>a completed Master's degree in in a field relevant to the proposed PhD project and the research areas of AHM. You may apply if you have not yet completed your Master's degree only if you provide a signed letter from your thesis supervisor stating that you will graduate before 1 September 2022;</li>\n</ul>\n<ul>\n<li>excellent research skills demonstrated by an outstanding Master's thesis and/or a track record of academic publications;</li>\n<li>excellent command of English.</li>\n</ul>\n<p>Please note that if you already hold a doctorate/PhD or are working towards obtaining a similar degree elsewhere, you will not be admitted to a doctoral program at the UvA.</p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>We offer a temporary employment contract for the period of 48 months. The first contract will be for 16 months, with an extension for the following 32 months, contingent on a positive performance evaluation within the first 12 months. The employment contract is for 38 hours a week. The preferred starting date is 1 September 2022.</p>\n<p>The gross monthly salary, based on 38 hours per week and relevant experience, ranges from €2,443 up to a maximum of €3,122. This sum does not include the 8% holiday allowance and the 8,3% year-end allowance. A favourable tax agreement, the ‘30% ruling’, may apply to non-Dutch applicants. The <a href=\"https://www.vsnu.nl/en_GB/cao-universiteiten.html\">Collective Labour Agreement of Dutch Universities</a> is applicable.</p>\n<p><strong>What else do we offer</strong></p>\n<ul>\n<li>PhD candidates receive a tuition fee waiver.</li>\n<li>PhD candidates have free access to courses offered by the <a href=\"https://gsh.uva.nl/\">Graduate School of Humanities</a> and the Dutch <a href=\"https://aihr.uva.nl/national-research-schools/research-schools.html\">National Research Schools</a>.</li>\n<li>An inspiring and professional academic team in the centre of Amsterdam.</li>\n<li>An active PhD community at the research school and the Faculty.</li>\n</ul>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>University of Amsterdam</h4>\n<p>The <a href=\"https://www.uva.nl/en/about-the-uva/about-the-university/about-the-university.html\">University of Amsterdam</a> is the Netherlands' largest university, offering the widest range of academic programmes. At the UvA, 30,000 students, 6,000 staff members and 3,000 PhD candidates study and work in a diverse range of fields, connected by a culture of curiosity.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Questions</strong></p>\n<p>Do you have any questions or do you require additional information? Please contact:</p>\n<ul>\n<li><a href=\"mailto:ahm-fgw@uva.nl\">Mr. René Does</a>, AHM coordinator.</li>\n</ul>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uva.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uva-en-wide/22e1319f66e44f07d56047b996668aa9.png"}