{"url": "https://academicpositions.com/ad/ca-foscari-university/2022/assistant-professor-in-the-area-of-economics/174120", "title": "Assistant professor in the area of Economics", "publish_date": "2022-01-18", "deadline": "2022-02-17", "location": "Dorsoduro 3246 Venice, Italy", "city": "N/A", "country": "Italy", "position": "Assistant Professor", "field": "Behavioural Economics, Business Economics, Labour Economics, Organizational Economics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Caâ\u0080\u0099 Foscari University of Venice", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><span style=\"color:#222222;\"><strong>Caâ\u0080\u0099 Foscari invites applications for a non - tenured position of Assistant professor in the area of Economics.</strong></span></p><p><span style=\"color:#222222;\">Caâ\u0080\u0099 Foscari is a research intensive institution committed to competing for international scientific excellence through the recruitment of the best academic talents worldwide. Talented young researchers and experienced senior professors make Caâ\u0080\u0099 Foscari a stimulating environment for career development and research freedom. Our university is committed to research excellence, funding promising researchers and developing international partnerships. As a leading research university, Caâ\u0080\u0099 Foscari explores cutting-edge research directions across disciplinary boundaries, setting a new agenda designed around six global challenges.</span></p><p><span style=\"color:#222222;\">Caâ\u0080\u0099 Foscari is looking for a researcher in the area of Economics, capable of inspiring students to become game-changers in their own fields and to make a genuine difference in the world.</span></p><p>Research: effects of the Pandemic on labour markets based on the coding of occupations. The aim of the project is to analyse the labor market behaviour of workers aged 50 on the basis of occupational coding based on ISCO-08. The project requires both a theoretical economic research on the economics of ageing and knowledge of occupational coding to map occupational characteristics in the European context.</p><p>Teaching: courses of Economics, both in Italian and English.</p><p><span style=\"color:#222222;\">The position will be in the </span><a href=\"https://www.unive.it/pag/27720/\" target=\"_blank\"><span style=\"color:#1155CC;\">Department of Economics</span></a><span style=\"color:#222222;\">, a center that carries out innovative research in fields such as economics, finance, statistics and mathematics, covering all the legal, social, international, and environmental aspects of these disciplines.</span></p><p><span style=\"color:#222222;\">The Department has recently received a â\u0080\u009cDepartment of Excellenceâ\u0080\u009d Award by the Italian Ministry of Education, Universities and Research. The Excellence Award has allowed the department to receive additional state funding to develop innovative projects on Economic and Risk Analytics for public policies.</span></p><p><span style=\"color:#222222;\">The QS World University Ranking by subject has placed Caâ\u0080\u0099 Foscari of Venice among the top 250 universities in the world for Economics &amp; Econometrics and Accounting &amp; Finance.</span></p><p><span style=\"color:#222222;\">The Department offers Bachelor, Master and PhD programmes taught entirely in English. Numerous internships opportunities abroad, more than 40 Erasmus+ destinations, prestigious partnerships, Double and Joint degree programmes with some of the most important universities worldwide all contribute to the international dimension that has always characterized Ca' Foscari.</span></p><p><span style=\"color:#222222;\">The Institution</span></p><p><span style=\"color:#222222;\">Since its foundation in 1868, Caâ\u0080\u0099 Foscari University of Venice has been a leader in Economics and Foreign Languages and Cultures. Today, Caâ\u0080\u0099 Foscari is exploring new frontiers in research, focusing on Climate Change, Digital Humanities, Digital and Social Innovation, and Nanosciences. An intellectual powerhouse of international repute in the heart of the city of Venice, Caâ\u0080\u0099 Foscari provides a one-of-a-kind blend of scientific research, cultural heritage and history, offering a life-changing experience to its students and researchers, with a transformative impact on the local community.</span></p><p><span style=\"color:#222222;\">Caâ\u0080\u0099 Foscari University of Venice has also obtained the full Human Resources Strategy for Researchers certificate, a set of initiatives to improve work conditions for researchers and to attract talents worldwide. Caâ\u0080\u0099 Foscari provides applicants with exclusive services and onboarding initiatives. Our </span><a href=\"https://www.unive.it/pag/19768/\" target=\"_blank\"><span style=\"color:#1155CC;\">Housing office</span></a><span style=\"color:#222222;\"> will help you search for a suitable and convenient accommodation, matching your needs and preferences with the available options.</span></p><p><span style=\"color:#222222;\">If you are a non-Italian applicant or if you have resided outside of Italy for more than 3 years, you will benefit from a favorable tax treatment for the first 4 years of the contract.</span></p><p><span style=\"color:#222222;\">Read here: </span><a href=\"https://www.unive.it/data/38002/?id=2022-UNVE000-0001815\" target=\"_blank\">https://www.unive.it/data/38002/?id=2022-UNVE000-0001815</a></p><p>Application deadline: 17th February at 1pm. </p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI2ZDhcL2NkMVwvNmQ4Y2QxNjU1NDIxOTEwNGU0ZTFjYzc2NDIyZTE4MjYucG5nIiwiZWRpdHMiOltdfQ=="}