{"url": "https://academicpositions.com/ad/university-of-luxembourg/2021/experienced-python-developer/164020", "title": "Experienced Python Developer", "publish_date": "2021-09-30", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Engineer/Technician", "field": "Architecture and Design, Computer Science, Computing in Social science, Arts and Humanities, Programming Languages, Software Design, and 1 moreSoftware Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "The&nbsp;Luxembourg Centre for Contemporary and Digital History (C2DH)&nbsp;is a&nbsp;research&nbsp;centre&nbsp;for the study, analysis and public dissemination of contemporary history of Luxembourg and Europe with a particular focus on digital methods and tools for doing innovative historical research. It serves as a catalyst for&nbsp;innovative&nbsp;and&nbsp;creative&nbsp;scholarship and new forms of public dissemination and societal engagement with history.Your Role..The CÂ²DH (https://www.c2dh.uni.lu/) is looking to hire an&nbsp;experienced python developer&nbsp;as part of a research project supported by the Luxembourg National Research Fund (FNR). You will join a growing team of researchers and technicians to develop Kiara (https://github.com/DHARPA-Project/kiara), our new free and open-source data orchestration engine for humanities research. Working in Python and Typescript, you will build out Kiaraâ\u0080\u0099s feature set and work closely with researchers on real-world applications of the software.&nbsp;For further information, please contact&nbsp;sean.takats@uni.luWhat we expect from youâ\u0080¦The ideal candidate would have experience and an interest in data orchestration and data science. We seek a highly motivated developer with the following profile: Bachelorâ\u0080\u0099s or Masterâ\u0080\u0099s degree in user interface design, computer science or related disciplines; At least five years of experience developing applications; Required experience includes:Python for software development Jupyter notebooks / JupyterLab Experience that would be great â\u0080\u0094 or an interest in learning! â\u0080\u0094 includes:JS for software development (ideally including React) Containerization (Docker, DockerHub) Virtual environments (ideally including BinderHub) and data storage Passionate about open-source software development; Willingness to cooperate actively in a larger team of mixed experience; An interest in digital humanities, digital archives, and preservation will be a plus; Ability to meet deadlines and demonstrate methodological, organised, pragmatic and effective approaches to the work; Good command of English. We offer.. Employee status on a 24-month fixed term contract; Full-time position (40h/week) ; Earliest starting date 01 October 2021 (position will be advertised until filled); Competitive remuneration; contract subject to public national security system benefits; A dynamic, exciting and equal opportunity international research environment. In Short.. Contract Type: Fixed Term Contract 24 Month Work Hours: Full Time 40.0 Hours per Week Location:&nbsp;Belval Starting date: As soon as possible Job Reference:&nbsp;UOL04228 How to apply..Applications should be submitted online and include: a full curriculum vitae a cover letter indicating your motivation for this project, relevant experience and future interests a portfolio of prior work with descriptions of your contributions contact information for 1-3 professional references Early application is highly encouraged, as the applications will be processed upon reception. Please apply formally through the HR system. Applications by email will not be considered.The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.In return you will getâ\u0080¦ Multilingual and international character.&nbsp;Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d&nbsp;(UniGR).&nbsp; A modern and dynamic university.&nbsp;High-quality equipment.&nbsp;Close ties to the business world and to the Luxembourg labour market.&nbsp;A unique urban site with excellent infrastructure. A partner for society and industry.&nbsp;Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic&nbsp;partners such as ministries, local governments, associations, NGOs â\u0080¦Find out more about the University Addresses, maps &amp; routes to the various sites of the University Further information..The&nbsp;University of Luxembourg&nbsp;aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international and&nbsp;interdisciplinary character. It fosters the cross-fertilisation of&nbsp;research&nbsp;and&nbsp;teaching, is relevant to its country, is known worldwide for its research and teaching in targeted areas, and is establishing itself as an innovative model for contemporary European Higher Education.&nbsp;The University`s core asset is its well-connected world-class academic staff which will attract the most motivated, talented and creative students and young researchers who will learn to enjoy taking up challenges and develop into visionary thinkers able to shape society.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Luxembourg aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international, multilingual and interdisciplinary character.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}