{"url": "https://academicpositions.com/ad/university-of-antwerp/2021/public-funding-grants-expert/165078", "title": "Public Funding & Grants Expert", "publish_date": "2021-10-26", "deadline": "N/A", "location": "Prinsstraat 13 Antwerp, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Artificial Intelligence, Business Administration, Business and Economics, Computer Communications (Networks), Computer Science, and 2 moreFinance,Project Management", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Antwerp", "job_description": "IMECimec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique. By leveraging our world-class infrastructure and local and global ecosystem of partners across a multitude of industries, we create groundbreaking innovation in application domains such as healthcare, smart cities and mobility, logistics and manufacturing, and energy. &nbsp;As a trusted partner for companies, start-ups and universities we bring together close to 3,500 brilliant minds from over 70 nationalities. Imec is headquartered in Leuven, Belgium and also has distributed R&amp;D groups at a number of Flemish universities, in the Netherlands, Taiwan, USA, China, and offices in India and Japan. All of these particular traits make imec to be a top-class employer.&nbsp;&nbsp;University of Antwerp â\u0080\u0093 imec IDLab Research groupThe Internet &amp; Data Lab (IDLab) is an imec research group at the University of Antwerp and Ghent University. IDLab&nbsp;focuses its research on&nbsp;internet technologies&nbsp;and&nbsp;data science. IDLab is a joint research initiative between Ghent University and the University of Antwerp. Bringing together 300 internet experts, we develop technologies outperforming current solutions for communication subsystems, high speed and low power networking, distributed computing and multimedia processing, machine learning, artificial intelligence and web semantics. Within Antwerp, the overall IDLab&nbsp;research areas&nbsp;are machine learning and wireless networking. &nbsp;IDLab has a unique&nbsp;research infrastructure&nbsp;used in numerous national and international collaborations.&nbsp; &nbsp;IDLab collaborates with many universities and research centres worldwide and jointly develops&nbsp;advanced technologies with industry&nbsp;(R&amp;D centers from international companies, Flandersâ\u0080\u0099 top innovating large companies and SMEâ\u0080\u0099s, as well as numerous ambitious startups).&nbsp;For further&nbsp;strategic business development of IDLab, we are looking for a&nbsp;public funding &amp; grants expert. &nbsp;The jobYou will strengthen our business development team for artificial intelligence and wireless communication&nbsp;as a&nbsp;public funded projects expert: You will interface with researchers to identify their needs, the project proposal scope and the appropriate funding channels. You will interface with funding agencies and attend their events to identify new and updated calls for proposals. You will assist in writing project proposals, for regional and European subsidies. You will be responsible for following up on project progress. You will assist in the operational pipeline and connect the right stakeholders within the organization. You will support the implementation of the IDLab research valorization strategy. You will support the research valorization directors in their activities. Job requirementsMinimum qualifications: You have a Master or PhD degree, preferably in Engineering, Business, or equivalent.&nbsp; You have strong social/communication skills.&nbsp; You have proven experience in writing national and/or international project proposals and/or supporting researchers to acquire funding. You have a strong affinity with research and innovation.&nbsp; You are able to match&nbsp;research with the appropriate funding channels. You take ownership of your work.&nbsp; You are a pro-active problem solver and team player but are able to work independently when required.&nbsp; You are comfortable working in a fast-changing environment.&nbsp; You are a fast and eager learner.&nbsp; Your English is fluent, both speaking and writing. Preferred qualifications:&nbsp; You have experience in applying for projects in the Horizon Europe funding framework. You have a general background in business development or were active in a client-facing role. Having experience with contracting or intellectual property management is considered&nbsp;an advantage.&nbsp; How to applyPlease apply using the application button on this webpage. Applications sent to us via email will not be considered.More information : bart.braem@uantwerpen.be", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "TheÂ University of Antwerp (Universiteit Antwerpen)Â is characterised by its high standards in education, internationally competitive research and entrepreneurial approach.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJlY2FcLzc1NlwvZWNhNzU2NzRiYmMzZGVlNjNmNjk0MWRmZTdmYWRmYTAucG5nIiwiZWRpdHMiOltdfQ=="}