{"url": "http://www.academictransfer.com/en/309292/assistant-professor-strategic-management-and-or-entrepreneurship/apply/", "title": "Assistant Professor Strategic Management and / or Entrepreneurship", "publish_date": "2022-02-09", "deadline": "2022-03-07", "location": "Burgemeester Oudlaan 50, 3062PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Assistant Professor", "field": "Economics; Behaviour and society", "salary": "â\u0082¬3821â\u0080\u0094â\u0082¬5230 per month", "max_working_hours": "38", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "The department of Strategic Management and Entrepreneurship at Rotterdam School of Management, Erasmus University (RSM) is inviting applications for a tenure-track position at the Assistant Professor level. We are looking for candidates with the potential to build a record of excellence in both research and teaching. Our search is not limited to any individual sub-discipline of the broader strategic management field, although the department would like to strengthen in some areas such as non-market strategies, platforms, business-level strategies, innovation strategies, scaling up, and digital strategies.<br><br>Joining the department of Strategic Management and Entrepreneurship at RSM means joining a terrific and exceptionally collegial and international group of tenure track faculty, including, Giuseppe Criaco (Jönköping International Business School), Andreas Distel (Copenhagen Business School), Richard Haans (Tilburg University), Yu Liu (Aalto University), Laura Rosendahl Huber (Max Planck Institute), Xena Welch Guerra (University of St. Gallen), Emanuel Ubert (Universita della Svizzera Italiana/ USI) Caroline Witte (Copenhagen Business School) and Zhiyan Wu (Zhejiang University). To get to know more about our activities and about our tenured faculty members, please visit: <a href=\"https://www.rsm.nl/research/departments/strategic-management-entrepreneurship/\">https://www.rsm.nl/research/departments/strategic-management-entrepreneurship/</a><br><br>The department takes pride in its own high-performance research culture, and that of RSM and the university as a whole. Erasmus University ranks third in Europe in terms of 2013-2018 UTD top journal output. Faculty members routinely publish in top tier journals like the <em>Academy of Management Journal</em>, <em>Academy of Management Review, Administrative Science Quarterly, Strategic Management Journal, Journal of International Business Studies, Journal of Management, Organization Science</em> and <em>Management Science</em>. RSM faculty members also regularly serve as Editors and Associate Editors of top journals like <em>Academy of Management Journal</em>, <em>Academy of Management Review</em>, <em>Journal of Management</em>, and <em>Journal of Management Studies</em>. We also take great pride in our outstanding PhD programme, which has a strong record of placements at peer institutions like INSEAD, HEC, Cambridge University (Judge), University of Warwick, University of South Carolina (Moore), Aalto University, and McGill University.<br><br><strong>Tenure-track requirements for teaching and research</strong><br><br>The teaching load for a tenure track contract is 3-0 or 2-1, plus the supervision of approximately 10 Master thesis students per year, provided that this covers the norms that our department and the school use for research and teaching assignments. The research culture and resources set by ERIM (the Erasmus Research Institute of Management, RSM's research institute) aims to provide assistant professors with the best context to conduct excellent research.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    Candidates should have a doctorate degree or be in their final year of dissertation research.<br/><br/><strong>Your required competences</strong><br/><ul>\n<li>You are an inspired, ambitious and competent researcher, with a strong commitment to high-quality research</li>\n<li>Enthusiastic about teaching, and an able presenter</li>\n<li>A familiarity with online education platforms and with techniques for inspiring successful blended learning</li>\n<li>You have strong English language skills at C1 level, in both writing and speaking.</li>\n<li>You value research with practical relevance that is impactful to academics and practitioners alike.</li>\n<li>An appreciation for academic research that is linked to real-world problems, and that can create impact both to the academic community and the business community.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: tenure track.</p>\n            \n            A tenure track assistant professor position with a tenure decision after six years. Tenure decisions are based on individual performance. This is a full-time position (1.0 FTE) with a contract for 38 hours per week. The starting date is 1 September 2022 (with some flexibility).<br/><br/>The conditions of employment correspond with the collective labour agreement for Dutch Universities (CAO NU). <a href=\"https://www.universiteitenvannederland.nl/files/documenten/CAO/2021/CLA_Universities_Netherlands_2021_2022.pdf\">https://www.universiteitenvannederland.nl/files/documenten/CAO/2021/CLA_Universities_Netherlands_2021_2022.pdf</a><br/><br/>Salary is subject to training and experience and may vary from a minimum of â\u0082¬ 3,821 (scale 11 CAO NU) gross per month and up to a maximum of â\u0082¬ 5,230 gross per month (scale 11 CAO NU), based on a full-time contract of 38 hours.<br/><br/>Erasmus University has attractive employment conditions, which include a holiday allowance of 8 per cent, an end-of-year bonus of 8.3 per cent, and a considerate amount of vacation days. More information is available at <a href=\"https://www.eur.nl/en/working/our-employer-vision/employment-conditions\">https://www.eur.nl/en/working/our-employer-vision/employment-conditions</a><br/><br/>RSM encourages learning, personal growth, and training for increased effectiveness for all colleagues. There will be opportunities for job-specific training and development where necessary and upon request, including training for the University Teaching Qualification. RSM has a mentoring programme available for all employees.<br/><br/>EUR offers all employees an annual personal career budget which can be used to advance your skills and competences, in addition to <a href=\"https://www.eur.nl/en/working/training-eur/development-opportunities-eur\">training, development, and coaching opportunities</a>.\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Rotterdam School of Management, Erasmus University</h4>\n              \n              Rotterdam School of Management, Erasmus University (RSM) is one of Europe's top-ranked business schools. RSM provides ground-breaking research and education furthering excellence in all aspects of management and is based in the international port city of Rotterdam - a vital nexus of business, logistics and trade. RSM's primary focus is on developing business leaders with international careers who can become a force for positive change by carrying their innovative mindset into a sustainable future. Our first-class range of bachelor, master, MBA, PhD and executive programmes encourage them to become critical, creative, caring and collaborative thinkers and doers. Study information and activities for future students, executives and alumni are also organised from the RSM office in Chengdu, China. <a href=\"https://eur03.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.rsm.nl%2F&amp;data=04%7C01%7Crmittertreiner%40rsm.nl%7C2fa16f23c74c4559c45908d8d42d11a2%7C715902d6f63e4b8d929b4bb170bad492%7C0%7C0%7C637492637312726975%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&amp;sdata=jVN3OGMT3Y0p%2BmfcqgUWvSMNKbeWqTK8XSGLO02atIM%3D&amp;reserved=0\">www.rsm.nl</a><br/><br/>RSM is a faculty of Erasmus University Rotterdam (EUR). EUR is an internationally oriented university with a strong social orientation in its education and research. Our scientists and students work in close collaboration with internal and external parties to solve global, social challenges, inspired by the always dynamic and cosmopolitan Rotterdam. Our mission is therefore \"Creating positive societal impact\". Our academic education is intensive, active and application-oriented. Our research increasingly takes place in multidisciplinary teams, which are strongly intertwined with international networks. With our research impact and thanks to the high quality of education, EUR can compete with the top European universities. The Erasmian values function as our internal compass and make Erasmus University recognizable to the outside world: engaged with society, world citizen, connecting, entrepreneurial and open-minded. <a href=\"http://www.eur.nl/\">www.eur.nl</a>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    Interested candidates are invited to make a formal application by uploading:<br/><br/>a cover letter, CV, job market paper, research statement, teaching statement, teaching evaluations (if available), and three letters of recommendation. Promising candidates will be invited for interview (which can be online).<br/><br/>For more information please contact the Chair of the hiring committee in the department of Strategic Management and Entrepreneurship, Prof. Taco Reus <a href=\"mailto:treus@rsm.nl\">treus@rsm.nl</a><br/><br/>The deadline for applications is Monday 7 March 2022.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}