{"url": "http://www.academictransfer.com/en/308736/postdoc-on-the-project-high-frame-rate-echography-of-the-heart/apply/", "title": "Postdoc on the project: high frame rate echography of the heart", "publish_date": "2022-01-27", "deadline": "2022-02-23", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Postdoc", "field": "Health", "salary": "â\u0082¬2986â\u0080\u0094â\u0082¬4707 per month", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "The current research line of high frame rate echography contains several projects, bringing high frame rate echography to the limit and beyond. We can slow down all fast cardiac motion and thus compile the full picture on the complex and adaptive cardiac beating, which encompasses blood flow, muscular motion, and blood perfusion. The postdoc is to further develop the techniques and bring them towards a preclinical (animal) study, to volunteers, and/or to pilot studies with patients. We have several technical implementations of the high frame technique, including a fully-programmable research scanner and high-end clinical scanners programmed to the needs of these projects.<br><br><em>Pre-clinical study</em><br>We will use 2D and 3D contrast-enhanced high frame rate imaging in a pre-clinical study to compare myocardial perfusion to gold-standard angiography around the left ventricle after induced ischemia (30 mins of occlusion vs. 2 h of occlusion, where no-reflow is expected for the second group but not the first). Pre-clinical experiments will be performed in close collaboration with the department of Experimental Cardiology.<br><br><em>Clinical study</em><br>In a pilot study (order of 45 subjects) we will use the perfusion measurements on volunteers and patients. We have a functioning framework for these 2D and 3D high frame rate techniques, including testing on performance.<br><br>For all tasks described above, the postdoc will be organising these experiments and overviewing the execution, and analysing the results in terms of both technical and physiological implication and relevance. Furthermore, the postdoc will contribute to the overall aims of the projects including national and international conference presentations, MSc and PhD supervision, and project reporting.<br><br>The work is part of the NWO-VIDI \"QUANTO\" project granted by the Dutch national research funding agency. These efforts aim at developing the technique from idea to bedside within 5 years, and will run both at the Erasmus MC University Medical Center Rotterdam and Delft University of Technology. The team consists of multi-disciplinary partners including PhD students, engineers and cardiologists and is supported by industry.<br><br>The research project should result in several peer-reviewed scientific publications.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You are a postdoc candidate with a PhD degree in a closely related field such as Biomedical Engineering, Clinical Technology or Physics, with experience in technical-medical research.</li>\n<li>Both Technical Medicine graduates with a strong technical background as well as technical graduates with a solid medical interest are encouraged to apply.</li>\n<li>Experience in diagnostic ultrasound, ultrasound contrast imaging, pre-clinical work, and/or image or signal processing is highly welcome.</li>\n<li>You are expected to work autonomously in an interdisciplinary, international environment and can supervise students.</li>\n<li>you have a can-do attitude and are an able experimentalist.</li>\n<li>Qualities as a scientist are evident from your publications and thesis.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    \n            \n            \n            The gross monthly salary amounts a maximum of â\u0082¬ 4.707,- (scale 10), depending on your level of education and relevant experience and based on a full-time working week of 36 hours. The terms of employment are in accordance with the Collective Bargaining Agreement for University Medical Centers (CAO UMC).\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus MC</h4>\n              \n              The sector <a href=\"https://www.erasmusmc.nl/en/research/groups/biomedical-engineering\">Biomedical Engineering</a> is part of Thoraxcenter, Cardiology, Erasmus MC, headed by Prof. Ton van der Steen. This project is lead by Principal Investigator <a href=\"https://www.erasmusmc.nl/en/research/researchers/vos-rik\">Dr.ir. Hendrik Vos.</a> At the crossroads of physics, technology, biology and medicine we are developing innovative techniques and methods to improve diagnosis and treatment of cardiovascular diseases.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about this position, please contact Dr.ir. Rik Vos, Associate Professor, phone number: <a>+31 (0)10 704 40 42</a> or e-mail: h.vos@erasmusmc.nl. For queries regarding your application, please contact Jeanette dos Santos Gomes, Recruiter, by phone number: <a>+31 (0)6 500 310 07.</a><br/><br/>If you are excited by the thought of this position and would like to apply, please do so by using the application form on our website.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}