{"url": "https://www.academictransfer.com/en/309248/informatieanalist-idm/apply/", "title": "Informatieanalist IDM", "publish_date": "2022-02-09", "deadline": "2022-03-06", "location": "Houtlaan 4, 6525 XZ, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "N/A", "max_working_hours": "40", "employer": "Radboud University", "job_description": "<p><em>De Radboud Universiteit zo goed mogelijk ondersteunen op het vlak van Identity Management. Daarvoor word jij ingezet als informatieanalist IDM. Je maakt een van de meest complexe en kritische systemen van de universiteit snel eigen en zorgt voor optimale beveiliging en gebruikerstevredenheid. Een afwisselende en uitdagende functie, in een open en collegiale cultuur met veel aandacht voor een prettige werksfeer.<br><br></em>Vanuit het team Domain Operations, binnen de afdeling Information &amp; Library Services, ben je verantwoordelijk voor een van de meest complexe en kritische systemen binnen de Radboud Universiteit. Als lid van het Identity Management (IdM) team ben je samen met zeven collega's verantwoordelijk voor de verdere ontwikkeling en het operationeel houden van het Identity Management. Jij bent de functionele expert met oog voor kwaliteit, continuïteit en maximale toegevoegde waarde. Je kunt behoeften identificeren, deze doorvertalen naar werkende oplossingen en ervoor zorgen dat ze worden gerealiseerd. Jij gaat voor een optimale gebruikerstevredenheid.<em><br><br></em>Wat we van jou verwachten, is dat je (mede) verantwoordelijk wordt voor het ondersteunen van de business bij het beheren en identificeren van de digitale identiteiten en bijbehorende autorisaties als beheerder van het IdM systeem. Je maakt het complexe systeem, het systeemlandschap waarin het draait en alle informatiestromen die van invloed zijn snel eigen. Hierdoor kun je eenvoudig analyses uitvoeren over complexe vraagstukken welke uiteindelijk leiden tot een voor alle partijen effectieve en efficiënte oplossing.<br><br>Doordat het identity management systeem een spin in het web systeem is, acteer je in een multidisciplinaire omgeving waarin je actief participeert. Je komt met concrete vragen, kunt ingewikkelde situaties uitleggen op het niveau van alle betrokkenen, van gebruiker zonder kennis tot super specialist,en komt met oplossingsvoorstellen.<br><br>Als onderdeel van het securitylandschap ben je in staat het beveiligingsbeleid te vertalen naar concrete stappen binnen het kader van Identity Management. Ook zet je je in voor het opstellen, vastleggen en beheren van alle formele procedures die nodig zijn om dit systeem op het gewenste niveau te brengen.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.ru.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/run-en-wide/13abf0bc0a611f32246d62b46488f997.jpg"}