{"url": "https://academicpositions.com/ad/ghent-university/2022/assistant-22553-department-of-economics/175007", "title": "Assistant (22553) - Department of Economics", "publish_date": "2022-02-08", "deadline": "2022-02-22", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Research Assistant", "field": "Accounting, Econometrics, Environmental Economics, Finance, Financial Economics, and 4 moreInternational Economics,Labour Economics,Macroeconomics,Welfare Economics", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp;&nbsp;&nbsp;â\u0086\u0092&nbsp;&nbsp; Apply until 22/02/2022&nbsp;(DD/MM/YYYY) 23:59 (Brussels time)&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Faculty of Economics and Business Administration&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Department EB21 - Department of Economics&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;&nbsp;AAP temporary appointment - 100%&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Number of openings: 4&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Reference number: 202202/EB21/AS/003&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University is a world of its own. Employing more than 8,000 people, it is actively involved in education and research, management and administration, and technical and social services on a daily basis. It is one of the largest, most exciting employers in the area and offers great career opportunities. With each of its 11 faculties and more than 100 departments offering state-of-the-art study programmes that are grounded in research in a wide range of academic fields, Ghent University is a logical choice for its employees as well as its students.&nbsp;&nbsp;YOUR TASKS&nbsp;The Department of Economics at Ghent University (Belgium) has four vacant positions for research and teaching assistants in its key research areas â\u0080\u0098Banking &amp; Financeâ\u0080\u0099, â\u0080\u0098Environmental Economicsâ\u0080\u0099, â\u0080\u0098International Trade, Investment and Migrationâ\u0080\u0099, â\u0080\u0098Labour Economics and Welfareâ\u0080\u0099 and â\u0080\u0098Macroeconomics, Policy and Econometricsâ\u0080\u0099. These vacant positions require good knowledge of Dutch.Your tasks:&nbsp;At least 50% of your assignment will be spent on academic research in preparation of a doctoral dissertation.You provide teaching assistance to courses given by professors of the Department and assist in supervising students for their bachelor's and/or master's thesis.You will assist in the internal and external services of the Department.&nbsp;In addition, the Department has four vacant scholarships which are mainly focused on research with a view to obtaining a PhD and with only very limited (max 10%) teaching-related tasks. One of these scholarships focuses on research in â\u0080\u0098quantitative and empirical approaches in macroeconomicsâ\u0080\u0099. We encourage international students to apply for these positions. The working language in most department activities and in our master programme in economics is English. Professors in the department also look at the pool of candidates for recruitment of researchers on their projects.&nbsp;WHAT WE ARE LOOKING FOR&nbsp;You hold a degree of Master of Science in Economics, or a closely related field and belong to the top 20% of your class.Candidates who obtain their diploma in the course of the academic year 2021-22 can also apply for these positions.An additional advanced / research master's degree in economics is an advantage.Candidates who do not have a master's degree that was awarded in a country of the European Economic Area (EEA), Switzerland or the UK must also submit GRE test scores or GMAT scores (percentile ranking).For diplomas awarded outside the European Union, a certificate of equivalence (NARIC) must be submitted. The degree requirements need to be fulfilled at the start of your appointment.You have a strong interest in scientific research with a view to obtaining a PhD.Teaching experience or participation in extra training, conferences, etc. is recommended.You have excellent didactic and communication skills.&nbsp;&nbsp;WHAT WE CAN OFFER YOU&nbsp;Research and teaching assistants obtain a two-year appointment, which may be renewed twice for two years, on condition that the previous term was given a positive evaluation. Attention: If you have been previously appointed as a junior assistant or doctoral fellow at a university within the Flemish Community, this appointment will be deducted from the maximum term of appointment, which is six years at the most according to the Codex of Higher Education.Scholarships that are mainly focused on research have a maximum duration of four years, conditional on positive evaluation after the first year.Your appointment will start on 1 September 2022 at the earliest.Your remuneration will be determined according to salary scale AAP3. More information about our salary scales.All Ghent University staff members enjoy a number of benefits, such as a wide range of training and education opportunities, 36 days of paid leave, bicycle commuting reimbursement, ecocheques, etc. A complete overview of all our fringe benefits (in Dutch).&nbsp;&nbsp;INTERESTED?&nbsp;Apply online through the e-recruitment system before the application deadline (see above). We do not accept late applications or applications that are not sent through the online system.&nbsp;Your application must include the following documents:&nbsp;In the field â\u0080\u0098Cvâ\u0080\u0099: (i) the completed form summarizing key information about you as a candidate (Link), (ii) your cv and an overview of the study results for the courses that you followed and for your masterâ\u0080\u0099s thesis (merged into one pdf file)In the field â\u0080\u0098Cover letterâ\u0080\u0099: your application/motivation letter in pdf formatIn the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of the required degree (if already in your possession). If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field â\u0080\u0098Certificate of equivalenceâ\u0080\u0099: only for diplomas awarded outside the European Union a certificate of equivalence (NARIC) must be submitted. (This can be requested via&nbsp;www.naricvlaanderen.be/en). For diplomas awarded in the UK before January 31st of 2020, a certificate of equivalence is not required.&nbsp;Note that the maximum file size for each field is 10 MB.&nbsp;As Ghent University maintains an equal opportunities and diversity policy, everyone is encouraged to apply for this position.&nbsp;MORE INFORMATION&nbsp;For more information about this vacancy, please contact Prof. Bruno Merlevede (Bruno.Merlevede@UGent.be, +32 9 2649833). More information about the Department of Economics can be found on the website https://www.ugent.be/eb/economics/en.&nbsp;Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}