{"url": "https://academicpositions.com/ad/ca-foscari-university/2022/assistant-professor-position-in-the-area-of-physical-chemistry/174124", "title": "Assistant professor position in the area of Physical chemistry", "publish_date": "2022-01-18", "deadline": "2022-02-17", "location": "Dorsoduro 3246 Venice, Italy", "city": "N/A", "country": "Italy", "position": "Assistant Professor", "field": "Computational Chemistry, Molecular Chemistry, Physical Chemistry,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Caâ\u0080\u0099 Foscari University of Venice", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><span style=\"color:#222222;\"><strong>Caâ\u0080\u0099 Foscari invites applications for a tenure track assistant professor position in the area of Physical chemistry.</strong></span></p><p><span style=\"color:#222222;\">Caâ\u0080\u0099 Foscari is a research intensive institution committed to competing for international scientific excellence through the recruitment of the best academic talents worldwide. Talented young researchers and experienced senior professors make Caâ\u0080\u0099 Foscari a stimulating environment for career development and research freedom. Our university is committed to research excellence, funding promising researchers and developing international partnerships. As a leading research university, Caâ\u0080\u0099 Foscari explores cutting-edge research directions across disciplinary boundaries, setting a new agenda designed around six global challenges.</span></p><p><span style=\"color:#222222;\">Caâ\u0080\u0099 Foscari is looking </span><span style=\"color:black;\">for a researcher </span>in the area of <span style=\"color:#222222;\">Physical chemistry capable of inspiring students to become game-changers in their own fields and to make a genuine difference in the world. </span></p><p><span style=\"color:black;\">The research activity will focus on the study both at the macroscopic and at the atomic-molecular level of the structure, properties and transformations of matter. These studies may be of both an experimental and computational nature and will have the aim of defining models of interpretation and prediction of the properties of complex systems of chemical, physical, biological interest. In particular, it is required to focus research on the application of microscopies for the study of materials.</span></p><p><span style=\"color:black;\">The selected candidate will be required to carry out teaching activities for no less than 60 hours. Teachings:</span></p><p><span style=\"color:black;\">-         Chimica fisica applicata ai beni culturali;</span></p><p><span style=\"color:black;\">-         Electron microscopy and scanning probe microscopy: introduction to SEM, TEM and AFM.</span></p><p><span style=\"color:#222222;\">The position is at the </span><a href=\"https://www.unive.it/pag/28233\" target=\"_blank\">Department of Molecular Sciences and Nanosystems</a><span style=\"color:black;\">.</span><span style=\"color:#222222;\"> The Department aims to stimulate research development and scientific education and is characterized by its research in innovative fields. The Department also interacts with local manufacturing firms and businesses, given the importance of its research on sustainability themes. The education focuses on both established research areas and more innovative ones like renewable energy sources, green chemistry, nanotechnologies and biotechnologies. </span></p><p><span style=\"color:#222222;\">The educational pathways offered by the Department are designed to implement the strong interaction between the university and the job market, using a blend of traditional methods and new Lifelong Learning projects (LLP). </span></p><p><span style=\"color:#222222;\">The Institution</span></p><p><span style=\"color:#222222;\">Since its foundation in 1868, Caâ\u0080\u0099 Foscari University of Venice has been a leader in Economics and Foreign Languages and Cultures. Today, Caâ\u0080\u0099 Foscari is exploring new frontiers in research, focusing on Climate Change, Digital Humanities, Digital and Social Innovation, and Nanosciences. An intellectual powerhouse of international repute in the heart of the city of Venice, Caâ\u0080\u0099 Foscari provides a one-of-a-kind blend of scientific research, cultural heritage and history, offering a life-changing experience to its students and researchers, with a transformative impact on the local community.</span></p><p><span style=\"color:#222222;\">Caâ\u0080\u0099 Foscari University of Venice has also obtained the full Human Resources Strategy for Researchers certificate, a set of initiatives to improve work conditions for researchers and to attract talents worldwide. Caâ\u0080\u0099 Foscari provides applicants with exclusive services and onboarding initiatives. Our </span><a href=\"https://www.unive.it/pag/19768/\" target=\"_blank\"><span style=\"color:#1155CC;\">Housing office</span></a><span style=\"color:#222222;\"> will help you search for a suitable and convenient accommodation, matching your needs and preferences with the available options.</span></p><p><span style=\"color:#222222;\">If you are a non-Italian applicant or if you have resided outside of Italy for more than 3 years, you will benefit from a favorable tax treatment for the first years of the contract.</span></p><p>Read the call here:  <a href=\"https://www.unive.it/data/38002/?id=2022-UNVE000-0002022\" target=\"_blank\">https://www.unive.it/data/38002/?id=2022-UNVE000-0002022</a> </p><p>Application deadline: 17th February at 1pm. </p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI2ZDhcL2NkMVwvNmQ4Y2QxNjU1NDIxOTEwNGU0ZTFjYzc2NDIyZTE4MjYucG5nIiwiZWRpdHMiOltdfQ=="}