{"url": "https://academicpositions.com/ad/life-science-zurich-graduate-school-1/2021/perform-your-phd-in-the-life-sciences-in-the-heart-of-europe/164418", "title": "International PhD Programs in the Life Sciences", "publish_date": "2021-10-12", "deadline": "2022-07-01", "location": "Winterthurerstr. 190 Building 55, Room K12CH-8057 Zurich Zurich, Switzerland", "city": "N/A", "country": "Switzerland", "position": "PhD", "field": "Animal Biology & Ethology, Animal Science, Biochemistry, Bioengineering, Bioinformatics, and 43 moreBiological Anthropology,Biomedical Engineering,Biomedicine,Biophysics,Biostatistics,Biosystems Engineering,Biotechnology,Botany and plant science,Cancer Research,Cell Biology,Chemical Biology,Chronobiology,Clinical Sciences,Computational Biology,Developmental Biology,Ecology,Entomology,Environmental Science,Epidemiology,Evolutionary Biology,Food Science,Genetics,Histology,Human Biology,Immunology,Limnology,Medicinal Chemistry,Microbiology,Molecular Biology,Molecular Chemistry,Molecular Medicine,Mycology,Nanobiology,Neuroscience,Paleobiology,Parasitology,Physiology,Structural Biology,Systematics (Taxonomy),Systems Biology,Toxicology,Virology,Zoology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Life Science Zurich Graduate School", "job_description": "Perform your PhD in the Life Sciences in the heart of Europe!What is the Life Science Zurich Graduate School? The Life Science Zurich Graduate School consists of several highly competitive PhD programs. We are run jointly by the ETH Zurich and the University of Zurich. Our programs offer research and education opportunities in a stimulating international environment for ambitious students who wish to work towards a PhD degree. If you are accepted to our school you will perform your research project in one of the participating research groups according to your scientific interest. Throughout the curriculum we offer advanced teaching and training courses. The program language is English. PhD studies usually last 4 years.Education: You must hold or anticipate receiving a Masterâ\u0080\u0099s degree or equivalent from a university in a relevant field before starting the PhD program. If you are accepted for the program you will have to register with either the University of Zurich or ETH Zurich, depending on the affiliation of the research group you are joining.How do I finance my PhD? All research groups within the Life Science Zurich Graduate School provide financial support in accordance with the PhD student salary set by the Swiss National Science Foundation (between CHF 47'040.- to CHF 50'040.-).How is the research environment? Our aim is to attract to Zurich the most promising young scientists from across the world. We offer you a challenging training environment, a clear mentoring system and the opportunity to perform cutting-edge research. As a PhD student you are part of a vivid scientific and social community and get the opportunity to work with the leading scientists in your field of interest. With around 500 research groups and more than 1â\u0080\u0099500 PhD students, the Life Science Zurich Graduate School is one of the larger graduate schools in Europe.How can I apply? Our web pages provide detailed information for submission of application. Please refer to the guidelines as we only take into consideration applications received in the required format: http://www.lifescience-graduateschool.uzh.ch/en/application.htmlOur application deadlines are 1 December and 1 July.Contact details: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Dr. Susanna Bachmann&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Life Science Zurich Graduate SchoolUniversity of ZurichWinterthurerstrasse 190CH-8057 Zurich SwitzerlandEmail: gradschool(at)lifescience.uzh.chhttp://www.lifescience-graduateschool.uzh.ch/en.html", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Life Science Zurich Graduate School (LSZGS) consists of 16 highly competitive PhD programs and one MD/PhD program, all of them run jointly by the ETH Zurich and the University of Zurich.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI2NzJcLzRhMVwvNjcyNGExYTFmNmIwYzdjODM3NjM2MDI4NjBkMjhjNmIucG5nIiwiZWRpdHMiOltdfQ=="}