{"url": "https://academicpositions.com/ad/universitat-oberta-de-catalunya-uoc/2022/faculty-of-psychology-and-education-sciences-faculty-member-in-the-field-of-developmental-disorder-interventions/174842", "title": "Faculty of Psychology and Education Sciences: Faculty member in the field of developmental disorder interventions", "publish_date": "2022-02-03", "deadline": "2022-02-20", "location": "Avinguda Tibidabo 39-43 Barcelona, Spain", "city": "N/A", "country": "Spain", "position": "Researcher", "field": "Applied Psychology, Developmental Psychology, Disability Research, Educational Psychology, Special Education,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Universitat Oberta de Catalunya (UOC)", "job_description": "The UOC is an innovative university rooted in Catalonia and open to the world. Its mission is to offer people lifelong learning to help them, and society, progress.In accordance with the vision of its Strategic Plan, and as part of the worldwide network of universities, the UOC works strategically to drive the creation of a global knowledge space and conduct cutting-edge research in the knowledge society.The UOC has its own unique educational model. Innovative and student-centred by nature, it provides quality education that can be customized to students' individual needs, enhancing their competitiveness and contributing to the progress of society.The person selected will join the UOC's Faculty of Psychology and Education Sciences, as a full-time member of the psychology team.Responsibilities:UOC faculty members promote and direct distance learning in their fields of expertise. Particular attention must be given to the preparation of programmes of study, course contents and teaching materials, as well as the supervision and coordination of students' learning processes. Faculty members are also responsible for driving innovation, especially in terms of methods and techniques used in distance learning and research activities in their fields of expertise.The UOC's Faculty of Psychology and Education Sciences is currently working on consolidating the quality of teaching on its bachelor's degrees and on developing new proposals for postgraduate studies. We are looking for candidates who will contribute to these objectives for developmental psychology, specifically in the field of developmental disorder interventions.&nbsp;Candidates are expected to have professional experience as well as university teaching and research experience in the field of interventions in developmental disorders, be this in psycho-educational treatment for development disorders, early care, psychological treatment for people with disabilities, or similar. Ideally, this experience will have been acquired treating people at different stages of their lives, from childhood to old age.&nbsp;The candidate may teach both bachelor's degree and postgraduate programmes, and should contribute to the development and deployment of new programmes being offered in the fields of Psychology and/or Education. In light of this, they should also be familiar with prevention and support strategies for students with specific education support requirements.&nbsp;The successful candidate will be awarded an open-ended, full-time contract. Scheduled start date: at the earliest opportunity, to be agreed once the candidate has been selected.The workplace will be the UOC's 22@ campus, Rambla del Poblenou 156, Barcelona.&nbsp;What we are looking for:&nbsp;PhD in psychology or educational psychology.&nbsp;Postgraduate education specializing in developmental disorders.University teaching experience (course design, teaching methods, teaching classes, preparing materials, etc.) in (bachelor's or master's degree) courses relating to developmental disorders, for instance: psycho-educational intervention in developmental disorders, disabilities in schools, prevention and support strategies for developmental disorders, early care and families, interventions for people with disabilities, etc.&nbsp;At least 5 years' research experience in the field of developmental disorders.&nbsp;Professional experience treating people at different stages of their lives.&nbsp;Oral and written communication skills in Spanish.Catalan language level C2.&nbsp;English language skills to at least CEFR level B2, or First Certificate equivalent.&nbsp;Good interpersonal and oral and written communication skills.Ability to work on a coordinated basis as part of a team, cooperating and collaborating with others.&nbsp;High level of initiative, and ability to work in innovative environments.&nbsp;Results-orientation, with the ability to bring added value to the job, seeking achievement and continuous improvement in order to achieve standards of excellence.&nbsp;Also of interest:&nbsp;Accreditation of teaching and research career from university quality agencies (ANECA/AQU).Professional experience in psychological and/or psycho-educational interventions in the field of psycho-educational treatment for developmental disorders.&nbsp;Teaching and/or professional experience relating to the use of digital technologies for psychological or psycho-educational treatment.Experience in innovative university environments.International teaching and/or research experience in the field of developmental disorders.&nbsp;Experience in designing and implementing new courses and/or programmes for bachelor's and master's degrees relating to developmental psychology or educational psychology.&nbsp;Applications:To take part in the selection process, you must register as a candidate in the Join our team section of our website (www.uoc.edu). Once you have registered, complete your profile in the candidate section in order to submit your application.&nbsp;Deadline for applications:The deadline for applications is 20 February 2022.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The UOC is an innovative university that is rooted in Catalonia and open to the world. It offers people lifelong learning to help them and society advance, while carrying out research into the knowledge society.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI4YTRcL2UzZlwvOGE0ZTNmYzMwODA4Y2VlMzM3ZmE3NTJkNGU0NDMwNmYucG5nIiwiZWRpdHMiOltdfQ=="}