{"url": "http://www.academictransfer.com/en/309314/projectleider-onderhoud-e-installaties/apply/", "title": "Projectleider onderhoud E-installaties", "publish_date": "2022-02-10", "deadline": "2022-03-14", "location": "Warandelaan 2, 5037 AB, Tilburg", "city": "Tilburg", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "N/A", "max_working_hours": "32—40", "employer": "Tilburg University", "job_description": "<p>Het betreft een installatietechnische functie in hoofdzaak gericht op E-installaties, waarbij er sprake is van drie hoofdbestanddelen in je werkzaamheden. De kerntaken richten zich op de gebouwinstallaties en ondergrondse infra.</p><p><em>Onderhoud</em>:<br> Je wordt belast met de voorbereiding, planning en aanbesteding van hoofdzakelijk onderhoudswerkzaamheden die uitgevoerd worden door externe contractpartners. Je houdt toezicht op kwalitatieve en tijdige uitvoering daarvan en stemt werkzaamheden af met de interne organisatie. Het betreft hier preventieve en correctieve onderhoudswerkzaamheden.</p><p><em>Beheer &amp; projecten</em>:<br> Het opzetten en managen van beheerprojecten is een andere belangrijke taak. Het team voert zelfstandig projecten uit, maar werkt ook veel samen met de collega&rsquo;s van het team projecten. Hierin kun je (deel) taken overnemen of werk je vanuit je onderhoudsexpertise samen met hen in de ontwerpfase.</p><p><em>Installatietechnisch infra-management</em>:<br> Het beheren en bewaken (in samenwerking met de senior projectleiders) van de boven en ondergrondse infrastructuur van de nutsvoorzieningen van Tilburg University middels o.m. een infra-managementsysteem (i-asset) en externe rapportages is ook onderdeel van je takenpakket. Tevens zoek je samen met je collega&rsquo;s naar verbeteringen en oplossingen die toe te passen zijn op de campus.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.uvt.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uvt-en-wide/8bbc452c034c71750be03f93fe602eca.png"}