{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/research-associate-fellow-fixed-term/175194", "title": "Research Associate/Fellow (fixed term)", "publish_date": "2022-02-11", "deadline": "2022-02-23", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Research Assistant", "field": "Organic Chemistry, Organometallic Chemistry, Physical Chemistry, Synthetic Chemistry,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference SCI367421X1Closing Date Wednesday, 23rd February 2022Job Type ResearchDepartment ChemistrySalary Â£31406 to Â£33309 per annum, (pro rata if applicable) depending on skills and experience (minimum Â£31406 with relevant PhD).We are seeking to recruit a highly motivated and enthusiastic organic chemist for a Research Fellow/Associate post within the research group of Dr Liam Ball, based in the School of Chemistry at the University of Nottingham. This is a highly challenging project in synthetic organic chemistry, which requires excellence in contemporary practical skills, preferably demonstrated by your previous publication record. The project will build on previous research from the Ball Group and will focus on the design, development and mechanistic interrogation of novel bismuth-mediated methods for organic synthesis.The successful candidate will carry out the following duties:&nbsp;- Undertake the development of new methodology as directed by Dr Liam Ball&nbsp;- Prepare high quality supporting information for publications resulting from the project.&nbsp;Candidates must:&nbsp;- Hold a PhD (or be close to completion) in synthetic organic chemistry. Experience in physical organic chemistry or organometallic chemistry is highly desirable.&nbsp;- Be available to take up the post as soon as possible&nbsp;- Have a proven track record of excellence in synthetic chemistry.&nbsp;&nbsp;- Have excellent organisational, communication and team working skills.This is a full time, fixed term post for 24 months. Job share arrangements may be considered.&nbsp;Informal enquiries may be addressed to Liam Ball LIAM.BALL@NOTTINGHAM.AC.UK. Please note that applications sent directly to this email address will not be accepted.Our University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}