{"url": "http://www.academictransfer.com/en/309346/communicatiemedewerker-faculteit-luchtvaart-en-ruimtevaarttechniek/", "title": "Communicatiemedewerker faculteit Luchtvaart- en Ruimtevaarttechniek", "publish_date": "2022-02-10", "deadline": "2022-03-06", "location": "Mekelweg 2, 2628 CD, Delft", "city": "Delft", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Delft University of Technology (TU Delft)", "job_description": "<p>Faculteit Luchtvaart- en Ruimtevaarttechniek<br>De faculteit Luchtvaart- en Ruimtevaarttechniek van de Technische Universiteit Delft is een van de hoogst scorende en meest volledige gemeenschappen voor onderzoek, onderwijs en innovatie in de wereld op het gebied van de luchtvaart- en ruimtevaarttechniek. Onze wetenschappers,  promovendi en BSc- en MSc-studenten zetten disciplines uit de luchtvaart- en ruimtevaarttechniek in om de grote wereldwijde maatschappelijke uitdagingen op te lossen die ons vandaag de dag bedreigen, zoals klimaatverandering. Onze focus: duurzame luchtvaart- en ruimtevaart, big data en kunstmatige intelligentie, bio-geïnspireerde technologie en slimme instrumenten en systemen. Werken aan de faculteit betekent samenwerken: met elkaar en buiten de grenzen van de faculteit. Dit gebeurt in field labs en innovatiehubs op onze universiteitscampus en ver daarbuiten.</p> <p>Mini-satellieten die klimaatverandering monitoren, v-vormige vliegtuigen die ons een klimaatneutrale toekomst in vliegen. Aan de faculteit Luchtvaart- en Ruimtevaarttechniek TU Delft werken onderzoekers, docenten en studenten aan grote maatschappelijke uitdagingen. Duurzame luchtvaart is een van onze belangrijkste thema’s. Als communicatiemedewerker help je om hun werk zichtbaar te maken en om onze gemeenschap van onder meer studenten, wetenschappers en alumni te verbinden. Samen met vier directe communicatiecollega’s werk je in een betrokken en enthusiast team. Ons kenmerk? Onze communicatie ráákt.</p> <p>Wat doe je?<br>Je ontwikkelt communicatietrajecten en voert deze – grotendeels zelfstandig – uit. Zo organiseer je online, hybride en live bijeenkomsten, zoals de opening van het collegejaar, events voor alumni en lunchlezingen. Je coördineert en begeleidt bezoeken van externe gasten en media. Daarnaast ga je over de productie en het beheer van facultaire communicatiemiddelen, zoals presentaties, animaties, video, fotografie. Je schrijft nieuwsberichten en social media posts. En je coördineert de communicatie over ons Mentor Alumni Programma. Veel van je activiteiten staan in het teken van het thema duurzame luchtvaart.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.tudelft.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tud-en-wide/4f5fb7eb63ad62ee5a7d5dfdc5376f8f.gif"}