{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/vice-president-for-administration-and-finance/174545", "title": "Vice President for Administration and Finance", "publish_date": "2022-01-27", "deadline": "2022-04-27", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Other Category", "field": "Accounting, Business Administration, Educational Leadership, Educational Management, Finance, and 5 moreFinancial Economics,Management,Organizational Economics,Risk Management,Strategic Management", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "Administration and Finance Office of The PresidentThis position will report directly to the President of AUIBJOB DESCRIPTION:The Vice President for Administration and Finance (VPAF) serves as the universityâ\u0080\u0099s fiscal officer: coordinating budgetary, financial operations; Human Resources: creating an environment that is conducive to employee development, creating operational excellence and sustainability; IT: ensuring that AUIB stays in the forefront of technological advancement; Student Life: creating an environment where student can reach full potential.&nbsp; The VPAF is responsible for balancing AUIBâ\u0080\u0099s operating and capital budgets, planning for changes in revenue, estimating enrollments, containing costs, and managing the institution's level of risk to protect its assets, the VP for Administration and Finance provides leadership, oversight, and stewardship for all aspects of the university's financial resources while ensuring absolute institutional integrity on fiscal and administrative matters. The VPAF has an oversight of the HR, Information Technology and Finance departments. The departments of Enrolment Management and Student Life will form part of VPAF division until such time President instruct differently.Roles and Responsibilities:The VP for Finance and Administration is a strategic advisor to the president and recommends financial and administrative objectives, policies, programs, and practices that ensure a sound financial structure for the university.Working with the President, his cabinet, Deans, VPs, and Directors, he is responsible for most key business functions within the university, including long-range financial planning, budget planning, capital financing and investments, to deliver a long-term, sustainable economic model that ensures both the viability and vitality of the university.The VP for Finance and Administration is a key financial and business executive of the university that will develop internal and external relationships and will be responsible for establishing and maintaining university-wide financial and administrative systems that ensure integrity, accuracy, and professionalism.&nbsp;The VP for Finance and Administration will be the institutional representative, with the President of AUIB on financial matters to the Founders, Minister for Higher Education and Minister of Education and any other stakeholders.The VP for Finance and Administration is a member of the President's Cabinet and is significant contributor to advancing the mission and strategic direction of the university, which includes promoting a climate of inclusion and equity.&nbsp;One of the primary roles of the VP for Finance and Administration will be to manage the financial status of AUIB through a continuously changing higher education landscape.&nbsp;Another primary role of the VP Finance and Administration is to create a work environment that is conducive to employee development, talent management and retention.VPAF will oversee the following departments:Finance and AccountingHuman ResourcesInformation TechnologyStudent LifeEnrolment ManagementHousing and Facilities Management unitVPAF will execute instructions form President of AUIB as relevant to operations of mission of AUIB.&nbsp;Education and Work Experience:Fifteen-plus years of experience in financial and administrative leadership roles in complex environments, with exposure to a broad range of financial, operational and risk management principles and practices.PhD/Masters or equivalent in HR/IT/Finance field or related fields.Extensive experience and knowledge of Educational Institutions.A strong, strategic orientation with the ability to serve as a strategic partner and advisor to the president as well as collaborate closely with other leaders on the senior administrative team and members of the board of trustees.Relevant use of financial models, financial analysis, performance measures and metrics to understand complex situations, inform decision making and communicate decision.Commitment to, and track record of, impact in the area of diversity, equity and inclusion. Experience building and leading in an inclusive environment.&nbsp;Critical leadership abilitiesLeading Financial Strategy&nbsp;The VPAF will be an innovative and strategic leader with a broad vision for the role of finance and administration in achieving institutional excellence. He will have a strong track record in managing change, along with proven experience as an organizational and financial leader.&nbsp;They must understand all facets of academic enterprises, including an understanding of how financial decisions impact the academic environment and vice-versa.&nbsp;They will develop a financial strategy that supports the vision, including risks and rewards, of the president and leadership team. They must understand and evaluate the financial implications to enable informed decision-making by the president and her leadership team.Driving Results&nbsp;In an organization where the financial and operational functions serve as partners supporting research and education, the VP for Administration and Finance will be a collaborative, communicative partner who will lead change through engagement, influence, and a strong service orientation.&nbsp;The VPAF will be a metric-driven leader who is focused on efficiency, effectiveness, and continuous improvement of operational processes, with a keen eye always on supporting AUIBâ\u0080\u0099s mission, encouraging innovation, and focusing on long-term sustainability.&nbsp;The VPAF will think creatively and strategically about how to optimize resources and set specific goals and priorities for improvements.Collaborating and Influencing&nbsp;Being adept at facilitating connections, building partnerships and collaborations, and serving as a trusted and respected member of the leadership team is key. Being comfortable building relationships of trust with the many communities that comprise the university and being astute at navigating both the internal and external political landscape is critical. The ability to recruit and mentor future leadership, including creating upward mobility for promising employees, is a necessity.Above all, the VP for Administration and Finance must fit within the AUIB culture that values the primacy of the institution's academic mission, as well as its commitment to excellence. In addition, this culture values collaboration, shared governance, and prudent management, while also respecting the traditions of the university.Application Procedure:Applications should include:Cover LetterCurriculum VitaePassport First Data PageContact Information For Three (3) Professional ReferencesCopies Of Degrees Or CertificationApplications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately.Please apply through AUIB website OR send your application and supporting documents to the following email address:jobs@auib.edu.iq&nbsp;with&nbsp;Karin.Jesuis@auib.edu.iq&nbsp;in copy.A declaration of a relation at AUIB is obligatoryWe will contact you if you are selected for interview.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "AUIB is a non-profit, private university that is fully accredited in Iraq by the Ministry of Higher Education and Scientific Research, thereby ensuring a high level of academic standards and institutional performance.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}