{"url": "http://www.academictransfer.com/en/309311/phd-in-sustainable-fuel-cell-technology-for-small-satellites/", "title": "PhD in sustainable fuel cell technology for small satellites", "publish_date": "2022-02-10", "deadline": "2022-03-10", "location": "Mekelweg 2, 2628 CD, Delft", "city": "Delft", "country": "Netherlands", "position": "PhD", "field": "Engineering", "salary": "â\u0082¬2434â\u0080\u0094â\u0082¬3111 per month", "max_working_hours": "N/A", "employer": "Delft University of Technology (TU Delft)", "job_description": "<p>Small and medium satellites are constrained in mass and volume, which limits their available power and propulsion capabilities. Neither Lithium-Ion batteries nor hydrogen fuel cells are currently solutions for the power subsystem, either due to the requirement of highly pressurised storage, complex systems or safety. Thus, exploring alternative sustainable fuel cell solutions is crucial to meet future satellite power and propulsion requirements.</p> <p>This research project investigates the applicability of green ethanol fuel cells for satellite power &amp; propulsion systems. The ethanol fuel cell has several advantages over hydrogen fuel cell, including multi-fuel additive capability, storage, and handling safety. It has a five times higher volumetric energy density than hydrogen. The power generated by ethanol with a fuel additive is expected to have comparable performance with hydrogen fuel cells. Although the theoretical efficiency of an ethanol fuel cell is 96%, in practice, at the highest power density, it is much lower for a variety of reasons which demand detailed research.</p> <p>This research project has the following objectives:</p> <p>(1) Design and process optimisation of electrode, and memberane to maximise the power output per volume/surface area, improving reliability and lifetime of subcomponents to improve the overall fuel cell efficiency in the space environment, (2) In depth characterisation of electrode and system performance, and (3) Realisation and demonstration of fuel cell prototype in a lab environment.</p> <p>This project will be carried out within the Space Systems Engineering Section (SSE) of the Department of Space Engineering at Faculty of Aerospace Engineering, Delft Universtity of Technology.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>You have an excellent track record from your MSc degree in Mechanical Engineering/Aerospace Engineering/Chemical Engineering/Applied Science/Applied Physics/ Chemistry with a specialisation in energy storage, generation systems, energy/power management, or fuel cell technology. You are passionate about solving multidisiplinary technical problems. You have the ability to skilfully develop experimental methods and to combine them with numerical methods.</p>\n<p>You are familiar with thermodynamics, mass and heat transfer, transport phenomenon and energy systems.You are experienced in the mechanical design of complex assemblies and use of various computer aided engineering method, such as CAD, and coupled thermal and flow analyses. You enjoy working at the intersection of several research domains with good experience in using analytical lab instrumentation for material analyses. Finally, you have excellent communication and networking skills and you a proficient level of English.</p>\n<p>Doing a PhD at TU Delft requires English proficiency at a certain level to ensure that the candidate is able to communicate and interact well, participate in English-taught Doctoral Education courses, and write scientific articles and a final thesis. For more details please check theÂ <a href=\"https://www.tudelft.nl/onderwijs/opleidingen/phd/admission\">Graduate Schools Admission Requirements</a>.</p>\n<p>Â </p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Doctoral candidates will be offered a 4-year period of employment in principle, but in the form of 2 employment contracts. An initial 1,5 year contract with an official go/no go progress assessment within 15 months. Followed by an additional contract for the remaining 2,5 years assuming everything goes well and performance requirements are met.</p>\n<p>Salary and benefits are in accordance with the Collective Labour Agreement for Dutch Universities, increasing from â\u0082¬ 2443 per month in the first year to â\u0082¬ 3122 in the fourth year. As a PhD candidate you will be enrolled in the TU Delft Graduate School. The TU Delft Graduate School provides an inspiring research environment with an excellent team of supervisors, academic staff and a mentor. The Doctoral Education Programme is aimed at developing your transferable, discipline-related and research skills.</p>\n<p>The TU Delft offers a customisable compensation package, discounts on health insurance and sport memberships, and a monthly work costs contribution. Flexible work schedules can be arranged. For international applicants we offer the Coming to Delft Service and Partner Career Advice to assist you with your relocation.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Delft University of Technology</h4>\n<p>Delft University of Technology is built on strong foundations. As creators of the world-famous Dutch waterworks and pioneers in biotech, TU Delft is a top international university combining science, engineering and design. It delivers world class results in education, research and innovation to address challenges in the areas of energy, climate, mobility, health and digital society. For generations, our engineers have proven to be entrepreneurial problem-solvers, both in business and in a social context. At TU Delft we embrace diversity and aim to be as inclusive as possible (see our <a href=\"https://www.tudelft.nl/en/about-tu-delft/strategy/integrity-policy/tu-delft-code-of-conduct/\">Code of Conduct</a>). Together, we imagine, invent and create solutions using technology to have a positive impact on a global scale.Â </p>\n<p>Challenge. Change. Impact!Â Â </p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For more information about this vacancy, please contact Dr.B.V.S.Jyoti, <a href=\"mailto:B.V.S.Jyoti@tudelft.nl\">B.V.S.Jyoti@tudelft.nl</a></p>\n<p>For more information about the application procedure, please contact Debby van der Sande, <a href=\"mailto:d.m.s.vandersande@tudelft.nl\">d.m.s.vandersande@tudelft.nlâ\u0080\u0082</a></p>\n<p>â\u0080\u0082â\u0080\u0082â\u0080\u0082â\u0080\u0082</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tudelft.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tud-en-wide/4f5fb7eb63ad62ee5a7d5dfdc5376f8f.gif"}