{"url": "https://www.academictransfer.com/en/309229/technicus-in-de-groep-dynamics-and-vibration-10-fte/apply/", "title": "Technicus in de groep Dynamics and Vibration (1,0 fte)", "publish_date": "2022-02-08", "deadline": "2022-03-30", "location": "Broerstraat 5, 9712 CP, Groningen", "city": "Groningen", "country": "Netherlands", "position": "Engineer/Technician", "field": "Natuurwetenschappen", "salary": "N/A", "max_working_hours": "38", "employer": "University of Groningen", "job_description": "De onderzoeksgroep Dynamics and Controle heeft een vacature voor een technicus die ondersteuning zal bieden bij experimentele onderzoeksactiviteiten in dynamica en controle gerelateerde projecten. Dit omvat technische ondersteuning van promovendi en postdocs en begeleiding van zowel bachelor- als masterstudenten van Industrial Engineering Management en Werktuigbouwkunde.<br> <br> Belangrijkste activiteiten:<br> <br> ● assisteren bij experimenteel onderzoek uitgevoerd door bachelor-, master- en postdocstudenten<br> ● assisteren van studenten bij de juiste bediening van de labapparatuur en materialen (training van labapparatuur aan postdoctorale en postdoctorale studenten)<br> ● laboratoriumprocedures en -onderzoek uitvoeren in het kader van lopende onderzoeksprojecten<br> ● helpen bij het onderhoud en de calibratie van de apparatuur<br> ● ontwikkelen van nieuwe (elektromechanische) experimentele opstellingen en gereedschappen<br> ● assisteren van de groepsleden bij projecten en experimenten, waaronder het ontwerpen en vervaardigen van laboratoriumstructuren, het opzetten van experimenten, het uitvoeren van experimenten, het verzamelen en registreren van gegevens<br> ● voorbereiden van gedetailleerde dagelijkse, wekelijkse en projectafgeronde rapporten en documentatie met inbegrip van projectvoortgang, problemen of problemen, aanbevelingen, testresultaten en analyses<br> ● deelnemen aan projectvergaderingen met inbegrip van, maar niet beperkt tot: kick-off vergaderingen, planningsvergaderingen en voortgangsvergaderingen<br> ● optreden als ARMICO (contactpersoon werk en omgeving), verantwoordelijk voor veiligheid, veiligheidsvoorschriften, etc.<br> ● verantwoordelijk voor de inkoop van laboratoriumapparatuur en -materiaal. Ervoor zorgen dat de voorraad altijd op peil is en dat alles duidelijk en correct geëtiketteerd is.<br> <br> Voorbeelden van uit te voeren testen:<br> <br> Modale testen waaronder hamertesten en shakertesten met behulp van Siemens testlab data acquisitie systeem, actieve trillingscontrole testen met behulp van d-Space systeem voor real time acquisitie en controle, metingen van elektromechanische systemen zoals inertiële actuatoren en piëzo-elektrische actuatoren, optische metingen met behulp van high-speed camera's.<br> <br> Assistentie bij sommige practica:<br> <br> ● assistentie bij technische tekeningen, bijvoorbeeld Solid works<br> ● assistentie bij het ontwerp van de structuur en voorstellen van vereiste wijzigingen<br> ● assisteren bij de fabricage van de testopstelling<br> ● voorbereiden van de testopstelling wanneer nodig<br> ● de algemene werking van het labo ondersteunen.<br> <br> In het bijzonder zal je:<br> <br> ● instrueren, adviseren en technische ondersteuning bieden aan MSc- en PhD studenten van de groep Dynamics and Vibration<br> ● opzetten van practica en deelnemen aan labexperimenten<br> ● coördinatie van labexperimenten voor cursussen zoals Advanced vibration, Dynamics, enz.<br> ● ontwerpen van methoden, technieken en apparatuur voor onderzoek<br> ● installeren en onderhouden van software op labcomputers en oplossen van problemen met labapparatuur<br> ● DV vertegenwoordigen op relevante ingenieursbeurzen, en ondersteuning bieden bij contacten met de industrie.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.rug.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/rug-en-wide/fce0dfff95a30233a4210a238918791e.gif"}