{"url": "https://academicpositions.com/ad/ait-austrian-institute-of-technology/2022/junior-scientist-m-f-d-for-molecular-diagnostics-limited-until-31-12-2024/175157", "title": "Junior Scientist (m/f/d) for Molecular Diagnostics (Limited until: 31.12.2024)", "publish_date": "2022-02-11", "deadline": "N/A", "location": "Giefinggasse 4 Vienna, Austria", "city": "N/A", "country": "Austria", "position": "Researcher", "field": "Bioinformatics, Biotechnology, Computational Biology, Immunology, Molecular Biology, and 2 moreMolecular Medicine,Systems Biology", "salary": "N/A", "max_working_hours": "N/A", "employer": "AIT Austrian Institute of Technology", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>We are Austriaâ\u0080\u0099s largest research and technology organisation and an international player in applied research for innovative infrastructure solutions. This makes us a powerful development partner for industry and a top employer in the scientific community. Our <strong>Center Health &amp; Bioresources</strong> is seeking to hire new Ingenious Partners for our location in Vienna:</p><h2>Junior Scientist (m/f/d) for Molecular Diagnostics (Limited until: 31.12.2024)</h2><h4>- Center for Health &amp; Bioresources</h4><h3>Imagine</h3><ul><li>As part of our team, you will support the <a href=\"https://www.ait.ac.at/en/solutions/molecular-diagnostics\" target=\"_blank\"><u>molecular biology laboratory</u></a> in the area of DNA and protein chip technology as well as Next Generation Sequencing applications.</li><li>Together with your colleagues, you will work on projects for the identification and validation of new biomarkers.</li></ul><h3>Engage</h3><ul><li>Your expertise in microarray, Next Generation Sequencing, qPCR and ELISA analyses enables you to apply them for biomarker discovery and verification in tissues and body fluids.</li><li>You plan and conduct experiments, prepare analytical data and write scientific publications largely independently.</li><li>You play an active role in contributing to our portfolio of our minimally-invasive biomarker technologies.</li></ul><h3>Achieve</h3><ul><li>Based on your research, you will prepare reports underlying your results and outcomes and will be in close contact to our research project partners.</li><li>You enjoy working in an interdisciplinary research team.</li></ul><p>Your qualifications as an <strong>Ingenious Partner</strong>:</p><ul><li>Completed studies (MSc) in the field of biotechnology, molecular biology</li><li>Vast and diverse laboratory experience in the field of molecular biology, biotechnology</li><li>Interest in handling projects, data preparation and preparing reports</li><li>Accuracy, reliability, and analytical thinking</li><li>Communication skills, sense of responsibility and commitment, ability to work in a team</li></ul><p><strong>What to expect:</strong><br/>The minimum gross annual salary according to the collective agreement is EUR 45.836,--. The actual salary will be determined individually, based on your qualifications and experience. In addition, we offer company benefits, flexible working conditions, individual training and career opportunities.</p><p>At AIT, the promotion of women is important to us - that's why we are especially looking forward to hearing from female applicants!</p><p>Please submit your application documents including CV, motivation letter and certificates online.</p><h4>TOMORROW TODAY - WITH YOU?</h4>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE0XC8xMlwvQUlULnBuZyIsImVkaXRzIjpbXX0="}