{"url": "http://www.academictransfer.com/en/309341/head-of-education-student-affairs-08-fte-1-fte/", "title": "Head of Education & Student Affairs 0,8 fte / 1 fte", "publish_date": "2022-02-10", "deadline": "2022-03-20", "location": "De Rondom 70, 5612 AP, Eindhoven", "city": "Eindhoven", "country": "Netherlands", "position": "Other Category", "field": "Engineering", "salary": "N/A", "max_working_hours": "30.4", "employer": "Eindhoven University of Technology (TU/e)", "job_description": "<strong>Eindhoven University of Technology</strong><br><br>TU/e is a University of Technology with a focus on Health, Energy and Mobility. TU/e is an open and inclusive university with short communication lines. The staff and students are curious, collaborative and strive for excellence. TU/e enables its academic staff to develop research and education at an internationally renowned level. Our lively campus community facilitates connections between staff and students, in an open, friendly, vibrant atmosphere that welcomes and inspires.<br><br><strong>Mechanical</strong><strong> </strong><strong>Engineering</strong><br><br>The mission of ME is to carry out long term, generic, world-class research within the Mechanical Engineering domain on carefully selected topics that fall within the research profile areas of the university, and that match the technological interests of high-tech, internationally oriented industry in the Netherlands and especially in Brainport Eindhoven. Furthermore, we want to realize an education and research program with a balanced combination of fundamental and application aspects, thereby aiming at providing industry with scientifically educated and application-driven engineers who are optimally equipped to address future challenges.<br><br><strong>Job description</strong><br><br>The Head of Education &amp; Student Affairs (ESA) reports to the Managing Director of the Department of Mechanical Engineering (ME) for departmental matters and to the Director of ESA-TU/e for TU/e matters in scope of Bachelor College, Graduate School and TU/e-ESA Policy.<br><br>You are part of the Educational Management of the Department of ME and member of the TU/e ESA organization and community. Together with the Director of ESA and your fellow leaders of ESA in the  other departments, you are responsible for improving the educational support processes at TU/e. As such you are responsible for connecting and supporting the policymaking processes at departmental  and institutional level.<br><br><strong>Tasks</strong><strong> </strong><strong>and</strong><strong> </strong><strong>responsibilities</strong><br><br>As Head of ESA, you are the first point of contact for educational support in the ME department.<ul> <li>You are responsible for the organizational aspects of all educational programs in the Graduate Program(s) and Bachelor college, in consultation with the Graduate and Bachelor Program Director(s).</li> <li>You manage the team of education support staff of the department (which a.o. contains education policy, teacher support, quality assurance, student guidance, administration and (operational) program coordination) and are the operational manager for the staff of the student administration (which fall under the ESA service).</li> <li>You are part of the Educational Management of the ME Department and of the managers ESA (MESA).</li> <li>You are responsible for the organization of the education support processes and services for students and lecturers at the department.</li> <li>You act as sparring partner for the Program Directors (Bachelor College [BSc] &amp; Graduate School) within the Department ME and advise the departmental board, departmental council,  program committees and exam committee on organization related education subjects.</li> <li>You will be managing a TU/e-ESA process chain.</li> </ul> <br>As Head of ESA at ME you are dealing with interactions and requirements of the department on one hand and university-wide requirements on the other, you need to connect with the department as well as with TU/e-ESA. Thus, you will take responsibilities in both areas of interest and will report to the Managing Director of the department and to the director of TU/e-ESA. To support this link up, you are for 0.1 fte a week dedicated to TU/e-ESA tasks that will be executed under the responsibility of Director ESA.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    You have a demonstrably strong affinity with Engineering education and educational innovation. You hold a MSc degree and have at least 5 years of relevant working experience. Next to that, you possess strong communication skills in Dutch and English, a clear focus Â on your working environment, a result-oriented approach and a clear ability to lead and motivate those around you. You are customer-oriented, you are a team player, and you have the ability to work independently. Furthermore, you have a helicopter view, and you know how to set and followÂ­ up on priorities. Negotiating skills, effectiveness, organizational awareness and problem-solving ability are also important aspects of the complex field in which you operate.\n  </div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<strong>We offer you:</strong><ul>\n<li>A challenging job (0.8 ft e/ 1 fte) in a dynamic department and in strong connection with Â TU/e-ESA.</li>\n<li>Temporary appointment for a period of one year with the prospect of a permanent contract Â of employment.</li>\n<li>The salary will depend on your education, knowledge and experience, and will be a minimum of â\u0082¬ 5.294.- and a maximum of â\u0082¬ 6.444.- gross per month on a fulltime basis (scale 13 CAO for the Dutch Universities).</li>\n<li>An attractive package of fringe benefits, including excellent work facilities, partially paid parental leave, commuting expenses, 41 days of holiday, extra holiday allowance 8% in May, end-of-year bonus of 8.3% in December and excellent sports facilities.</li>\n</ul>\n<br/>Depending on resume and work experience a contract via Euflex (the TU/e secondment organization) can be Â considered.\n          \n  </div>\n</div>", "employer_description": "N/A", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>For information about Mechanical Engineering department at TU/e please see: <a href=\"https://www.tue.nl/en/our-university/departments/mechanical-engineering/\">Mechanical Engineering (tue.nl)</a>.</li>\n<li>Questions regarding the position can be directed to the Managing Director of ME Jolanda Snelders, J.L.F.C.M.Snelders[at]tue.nl.</li>\n<li>For information about terms of employment, click <a href=\"https://www.tue.nl/en/working-at-tue/why-tue/conditions-of-employment/\">here</a> or contactÂ HRadviceME[at]tue.nl.</li>\n<li>And other information can also be obtained from the HR department, HRadviceME[at]tue.nl.</li>\n</ul>\n<br/>Are you inspired to know more about working at TU/e? Please visit <a href=\"http://www.tue.nl/jobs\">www.tue.nl/jobs</a>.<br/><br/><strong>Application</strong><br/><br/>We invite you to submit a complete application by using the 'apply now'-button on this page.<br/>The application should include a:<ul>\n<li>Personal motivation letter.</li>\n<li>CV including references.</li>\n</ul>\n<br/>A selection assessment may be part of the selection procedure.<br/><br/>We do not respond to applications that are sent to us in a different way.<br/><br/>Please keep in mind you can upload only 5 documents up to 2 MB each. If necessary, please combine files.<br/><br/>We look forward to your application and will screen it as soon as we have received it. Screening will continue until the position has been filled.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tue.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tue-en-wide_acOLN2b/6da05d7a14fc4cf4bb403c37bf055371.png"}