{"url": "https://www.academictransfer.com/en/309061/phd-student-on-the-project-hips-dont-lie/apply/", "title": "PhD student on the project hips don’t lie", "publish_date": "2022-02-03", "deadline": "2022-02-16", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "PhD", "field": "Health", "salary": "â\u0082¬2570â\u0080\u0094â\u0082¬3271 per month", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "You will study and develop innovative prediction models in the context of the <a href=\"https://www.worldcoachconsortium.com/\">World COACH consortium</a>. Through this consortium, you will have at your disposal all prospective data on hip osteoarthritis (OA) in the world. The main technical focus is on constructing machine learning models to predict disease development and progression. Aside from the clinical importance of these models, this project offers interesting challenges and opportunities for research into techniques for causal effect estimation, missing data, and learning from multiple data sources.<br><br>Background: OA of the hip is a chronic, painful, and disabling disease of the joints and is forecasted to become the most prevalent disease in the Netherlands by the year 2040. However, due to a lack of knowledge on the etiology and risk factors for hip OA there are no curative or preventive options and current treatment is therefore limited to a 'one size fits all' approach. By using a large dataset, a prediction model could potentially identify person specific risk factors for development and progression of hip OA, thereby creating opportunities for person-specific treatment and preventive actions.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You must have a master degree in Computer Science, Mathematics, Statistics, Physics, Biomedical Engineering, or a related field and have some experience with machine learning techniques.</li>\n<li>You should be familiar with programming (Python, R or a similar scientific programming language).</li>\n<li>You should be enthusiastic to bridge the gap between research and practice and have motivation and ability to work both independently and as a member of a large team.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You will receive a temporary position for 4 years. The gross monthly salary is â\u0082¬ 2.570 ,- in the 1st year and increases to â\u0082¬ 3.271,- in the 4th year (scale OIO). The preferable starting date is March 1st 2022.</li>\n<li>Excellent fringe benefits, such as a 13th month that is already paid out in November and a induvidual travel expense package.</li>\n<li>Pension insurance with ABP. We take care of approximately 2/3 of the monthly contribution.</li>\n<li>Special benefits, such as a incompany physiotherapist and bicycle repairer. And there is also a gym where you can work on your fitness after work.</li>\n</ul> The terms of employment are in accordance with the Collective Bargaining Agreement for University Medical Centers (CAO UMC).\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus MC</h4>\n              \n              You will be embedded in the Hip Research Group, Department of Orthopaedic Surgery and Sports Medicine, Erasmus MC, which is internationally in the forefront of OA research. Erasmus MC stands for groundbreaking work, pushing boundaries and leading the way in research, education, and healthcare. In addition, you will be affiliated to the Pattern Recognition &amp; Bioinformatics group, TU Delft, with a track record in artificial intelligence and machine learning. This offers you a dynamic, challenging, collaborative, and cooperative research environment. The combination of medical and technical people with a high level of expertise are there to improve and renew the healthcare of today and the public health of tomorrow. Moreover, this project is part of the Worldwide Collaborative initiative on OsteoArthritis prediCtion of the Hip <a href=\"https://www.worldcoachconsortium.com/\">(World COACH) consortium</a>, which is a unique international collaboration bringing together all prospective data available in the world on hip osteoarthritis (&gt;40.000 participants). This consortium gives you the possibility to collaborate with international experts as well.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about this position, please contact Dr. R. Agricola, Orthopaedic Surgeon and project leader, via <a href=\"tel:0107033281\">010 703 32 81</a>. For more information about the machine learning aspects of the position, please contact Dr. J.H. Krijthe, Assistant Professor in Machine Learning at TU Delft, via e-mail: j.h.krijthe@tudelft.nl.<br/><br/>For queries regarding your application, please contact Jeanette dos Santos Gomes, Recruiter, by phone number: <a href=\"tel:0031650031007\">+31 (0)6 500 310 07</a>.<br/><br/>If you are excited by the thought of this position and would like to apply, please do so by using the application form on our website. Applications should include a curriculum vitae, a motivation of your application, and if applicable a list of publications.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}