{"url": "https://academicpositions.com/ad/leiden-university/2022/postdoctoral-fellow-early-stage-quantitative-sustainability-assessment-of-emerging-technologies-0-8-1-0-fte/175188", "title": "Postdoctoral fellow, Early-stage quantitative sustainability assessment of emerging technologies (0.8-1.0 fte)", "publish_date": "2022-02-11", "deadline": "2022-03-03", "location": "Rapenburg 70 Leiden, Netherlands", "city": "N/A", "country": "Netherlands", "position": "Postdoc", "field": "Ecological Engineering, Ecology, Environmental Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "Vacancy number 22-079Function type Academic staffHours (in fte) 0,8 - 1,0External/ internal ExternalLocation LeidenPlaced on 8 February 2022Closing date 3 March 2022 20 more days to applyThe Faculty of Science and Institute of Environmental Sciences&nbsp; are looking for:Postdoctoral fellow, Early-stage quantitative sustainability assessment of emerging technologies (0.8-1.0 fte)Vacancy number: 22-079Key responsibilities &nbsp;We are looking for an outstanding postdoctoral fellow to support an ongoing European project. The project supports the research &amp; innovation around new ideas towards radically new future technologies. The project has been focusing on the development of a new generation of protonic devices, which could radically change the technological landscape. The 21st century has seen an unprecedented proliferation of electronic devices, sharply altering the world economic map and human sociological behaviour. A biomimetic solution is being sought in the project by the development of organic electrochemical transistors and proton transistors using organic/biopolymers and composites. You will be supporting the ongoing early-stage sustainability assessment of this new generation of technologies using life cycle assessment (LCA), working hand-in-hand with top material and technology developers in Europe. The ideal starting date for the position is May 1st 2022.Key tasks include:Develop new methods to support early-stage quantitative sustainability assessment of emerging technologies;Perform a quantitative sustainability assessment of the new technological setup using life cycle assessment (LCA);Innovate on LCA methods to assess emerging technologies at low TRLs;Support the technology developers in the project with the identification of the most promising design options from a sustainability perspective.Selection CriteriaYou should have a PhD in a relevant field, and ideally have proven already to be productive in terms of scientific output. Relevant backgrounds include, but are not limited to, PhDs in industrial ecology, quantitative sustainability science, innovation studies, engineering and modelling.Knowledge of and experience with LCA is a strong advantage.Data management, visualization and programming skills (e.g. in Matlab, Python or R) are an advantage.Experience with the techno-economic assessment of emerging technologies is an advantage.You must be proficient in spoken and written English, have good communication skills. Previous teaching experience will also be valued.Moreover, you are a team player, are able as well to work independently, take initiative, and have a strong interest and motivation to pursue academic research.Our organisationThe Faculty of Science is a world-class faculty where staff and students work together in a dynamic international environment. It is a faculty where personal and academic development are top priorities. Our people are driven by curiosity to expand fundamental knowledge and to look beyond the borders of their own discipline; their aim is to benefit science, and to make a contribution to addressing the major societal challenges of the future.The research carried out at the Faculty of Science is very diverse, ranging from mathematics, information science, astronomy, physics, chemistry and bio-pharmaceutical sciences to biology and environmental sciences. The research activities are organised in eight institutes. These institutes offer eight bachelorâ\u0080\u0099s and twelve masterâ\u0080\u0099s programmes. The faculty has grown strongly in recent years and now has more than 2,300 staff and almost 5,000 students. We are located at the heart of Leidenâ\u0080\u0099s Bio Science Park, one of Europeâ\u0080\u0099s biggest science parks, where university and business life come together.The Institute of Environmental Sciences (CML) is positioned in the Faculty of Sciences. The core focus of CML is to perform research and education in the interdisciplinary field of Environmental Sciences. CML has two Departments: Industrial Ecology (CML-IE) and Environmental Biology (CML-EB). Presently, about 125 fte (including postdocs and PhDs) are employed at CML. CML collaborates with the TU Delft and Erasmus University in the Leiden-Delft-Erasmus Centre for Sustainability (LDE-CfS), Naturalis Biodiversity Centre, and other partners.For more information, see&nbsp;www.science.leidenuniv.nl&nbsp;and&nbsp;workingat.leiden.edu. Information about CML can be found at&nbsp;www.cml.leiden.edu.Terms and conditions&nbsp;We offer a full-time two years term position with the possibility of renewal based on need, funding and performance. The salary range is from â\u0082¬ 2.846,- to â\u0082¬ 4.490,- gross per month (pay scale 10 in accordance with the Collective Labour Agreement for Dutch Universities).Leiden University offers an attractive benefits package with additional holiday (8%) and end-of-year bonuses (8.3 %), training and career development and sabbatical leave. Our individual choices model gives you some freedom to assemble your own set of terms and conditions. Candidates from outside the Netherlands may be eligible for a substantial tax break.InformationEnquiries can be made to Dr Stefano Cucurachi, email s.cucurachi@cml.leidenuniv.nl.ApplicationsTo apply for this vacancy, please send an email to sollicitaties@cml.leidenuniv.nl. Please ensure that you upload the following additional documents quoting the vacancy number:CVMotivation letterThe names and phone numbers of at least two refereesWe will consider applications submitted before March 3rd, 2022. After that date we will consider applications on a rolling basis, should the position not be yet filled.Interviews will take place on March 9th, 2022 between 10 PM and 5 PM. You are kindly requested to be available on this date.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Leiden University was founded in 1575 and is one of Europeâ\u0080\u0099s leading international research universities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5NWZcLzc3Y1wvOTVmNzdjYjE3YjNmODExNDlkZmNlYmIyYWRmYzc1MWQucG5nIiwiZWRpdHMiOltdfQ=="}