{"url": "http://www.academictransfer.com/en/308873/phd-position-1-utrecht-university-avoiding-tipping-of-savanna-ecosystems-10-fte-phd-position-2-leiden-university-spatial-patterns-and-multi-stability-10-fte/", "title": "PhD position 1 (Utrecht University) – Avoiding tipping of savanna ecosystems (1.0 FTE) & PhD position 2 (Leiden University) – Spatial patterns and multi-stability (1.0 FTE)", "publish_date": "2022-02-01", "deadline": "2022-03-02", "location": "Rapenburg 70, 2311 EZ, Leiden", "city": "Leiden", "country": "Netherlands", "position": "PhD", "field": "Natural sciences", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "<p>Key responsibilities</p><p>The&nbsp;PhD projects&nbsp;are&nbsp;part of the research project&nbsp;<strong><em>Resilience in complex systems through&nbsp;adaptive spatial pattern formation</em></strong>&nbsp;financed by the Dutch Research Council NWO. It is a collaboration between Utrecht University and Leiden University. There will be two PhD projects, one at Utrecht University and one at Leiden University.&nbsp;The&nbsp;PhD&nbsp;projects are strongly intertwined and the Utrecht and Leiden groups will be interacting intensely.&nbsp;The overall objective is to investigate and validate conditions for which tipping points will be circumvented through spatial pattern formation in ecosystems classically viewed as prone to critical transitions. A project description is available. The central research questions are:&nbsp;</p><ul> <li> <p>When does the classical non-spatial framework of tipping points breaks down and needs to be supplemented by the theory of spatial pattern formation?&nbsp;&nbsp;</p> </li> <li> <p>For which&nbsp;ecosystems and earth systems is this valid, including the planet as a whole?&nbsp;&nbsp;</p> </li> <li> <p>Under which&nbsp;conditions and for which spatial scales is this the case?&nbsp;&nbsp;</p> </li> </ul><p>PhD position 1 (Utrecht University) &ndash; Avoiding tipping of savanna ecosystems (1.0 FTE)</p><p>We are looking for a self-motivated PhD candidate interested in&nbsp;ecology, environmental sciences, mathematics and geospatial data.&nbsp;It will be your role:&nbsp;&nbsp;</p><ol> <li> <p>to develop and analyze universal spatial savanna ecosystem models;&nbsp;&nbsp;</p> </li> </ol><ol> <li> <p>to&nbsp;analyze&nbsp;observation of&nbsp;spatial patterns in savanna ecosystems&nbsp;related to circumvention of&nbsp;tipping points.&nbsp;</p> </li> </ol><p>PhD position 2 (Leiden University) &ndash; Spatial patterns and multi-stability (1.0 FTE)</p><p>We are looking for a self-motivated PhD candidate interested in mathematics, physics, ecology and environmental sciences. It will be your role:</p><ol> <li> <p>to investigate mechanism by which tipping may be evaded in ecosystem models;&nbsp;</p> </li> </ol><ol> <li> <p>to study the impact of (human induced) heterogeneities on these mechanisms.</p> </li> </ol>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>You have a MSc degree in Environmental Science, Ecology, Earth Sciences, Mathematics, Physics or a closely related field. You have an interest in ecology as well as reaction-diffusion systems. You are communicative, able to work in a multi-disciplinary team of scientists and able to demonstrate English language proficiency. </p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>You will be offered a temporary position (1.0 fte), initially for one year with an extension to a total of four years upon a successful assessment in the first year, and with the specific intent that it results in a doctorate within this period. The gross salary ranges between €2,434 in the first year and €3,111 in the fourth year of employment (scale P according to the Collective Labour Agreement Dutch Universities) per month for a full-time employment. Salaries are supplemented with a holiday bonus of 8% and a year-end bonus of 8.3% per year. Both universities offer excellent secondary conditions, for Utrecht see <a href=\"https://www.uu.nl/en/organisation/working-at-utrecht-university/terms-of-employment\">https://www.uu.nl/en/organisation/working-at-utrecht-university/terms-of-employment</a>  and for Leiden see <a href=\"https://www.universiteitleiden.nl/en/working-at/job-application-procedure-and-employment-conditions\">https://www.universiteitleiden.nl/en/working-at/job-application-procedure-and-employment-conditions</a>  </p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>The Faculty of Science, Leiden University / Utrecht University</h4>\n<p><strong>Leiden University</strong></p>\n<p>The Faculty of Science is a world-class faculty, where staff and students work together in a dynamic international environment. It is a faculty where personal and academic development are top priorities. Our people are committed by curiosity to expand fundamental knowledge and to look beyond the borders of their own scientific discipline. Their aim is to benefit science and to make a contribution to addressing the major societal challenges of the future. </p>\n<p>The research carried out at the Faculty of Science ranges from mathematics, computer science, astronomy, physics, chemistry and bio-pharmaceutical sciences to biology and environmental sciences. The research activities are organized in eight institutes. These institutes offer eight bachelor’s and twelve master’s programs. The faculty has grown strongly in recent years and now has more than 2,300 staff and almost 5,000 students. We are located in Leiden’s Bio Science Park, one of Europe’s biggest science parks, where university and business life come together. </p>\n<p>For more information, seeâ\u0080¯<a href=\"https://workingat.leiden.edu/\">https://workingat.leiden.edu/</a>â\u0080¯andâ\u0080¯<a href=\"https://www.science.leidenuniv.nl/\">https://www.science.leidenuniv.nl</a>â\u0080¯  andâ\u0080¯<a href=\"https://www.universiteitleiden.nl/en/science/about-faculty-of-science/diversity\">https://www.universiteitleiden.nl/en/science/about-faculty-of-science/diversity</a> </p>\n<p><strong>Utrecht University</strong></p>\n<p>A better future for everyone. This ambition motivates our scientists in executing their leading research and inspiring teaching. At Utrecht University, the various disciplines collaborate intensively towards major societal themes. Our focus is on Life Sciences and Sustainability, Dynamics of Youth, and Institutions for Open Societies.</p>\n<p>The mission of the Environmental Science group is to understand the interactions between terrestrial ecosystems and global environmental changes. Our research broadly covers the following themes: Biogeochemical cycles, Interactions and feedbacks over time and space, and Integrated assessment. The PhD will be embedded in the Environmental Sciences group.</p>\n<p> </p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>More information about <strong>PhD position 1 (Utrecht University)</strong> can be obtained from <br/>\nProf. Max Rietkerk (<a href=\"mailto:m.g.rietkerk@uu.nl\">m.g.rietkerk@uu.nl</a>)<br/>\nDr. Mariska te Beest (<a href=\"mailto:m.tebeest@uu.nl\">m.tebeest@uu.nl</a>) <br/>\nDr. Arie Staal (<a href=\"mailto:a.staal@uu.nl\">a.staal@uu.nl</a>). </p>\n<p>More information about <strong>PhD position 2 (Leiden University)</strong> can be obtained from<br/>\nProf. Arjen Doelman (<a href=\"mailto:doelman@math.leidenuniv.nl\">doelman@math.leidenuniv.nl</a>)  </p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.universiteitleiden.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/lei-en-wide/f66e61a821cf3294ef5ce4fcaacbdedb.png"}