{"url": "https://www.academictransfer.com/en/309386/decaan-faculteit-der-sociale-wetenschappen/apply/", "title": "Decaan Faculteit der Sociale Wetenschappen", "publish_date": "2022-02-11", "deadline": "2022-03-08", "location": "Houtlaan 4, 6525 XZ, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "Management", "field": "Gedrag en maatschappij", "salary": "N/A", "max_working_hours": "N/A", "employer": "Radboud University", "job_description": "Als decaan bent u het boegbeeld van de faculteit, zowel voor studenten als medewerkers van de Radboud Universiteit en de buitenwereld. U geeft sturing aan de faculteit, haar ambities en bent eindverantwoordelijk voor de algemene leiding. <br>Als decaan richt u zich op strategische ontwikkelingen, het bewaken van de eenheid van onderwijs, onderzoek, personeel, organisatie en financiën, en het onderhouden van universitaire en landelijke contacten. Studenten zijn voor u een serieuze gesprekspartner. U bouwt relaties op met externe partners zowel wetenschappelijk als maatschappelijk. U mengt zich in de landelijke discussies over ontwikkelingen in de sociale wetenschappen. <br><br>U evalueert en beoordeelt de leidinggevenden van het wetenschappelijk personeel en geeft met het faculteitsbestuur leiding aan het onderwijsinstituut FSW, de drie onderzoeksinstituten en de ondersteunende diensten. <br><br>Als decaan bent u voorzitter van het faculteitsbestuur en bent u gezamenlijk verantwoordelijk voor onderwijs, onderzoek en maatschappelijke impact. Het faculteitsbestuur bestaat uit de decaan, vice-decaan onderzoek, vice-decaan onderwijs en de directeur bedrijfsvoering. Er is een studentassessor en het bestuur wordt ondersteund door een secretaris. De bestuurssecretaris en studentassessor hebben een adviserende stem. De medezeggenschap krijgt vorm in de Facultaire Gezamenlijke Vergadering (FGV). <br><br>Samen met de decanen van de zes andere faculteiten vormt u het college van decanen van de Radboud Universiteit, waarbinnen u de faculteit vertegenwoordigt en onder meer bijdraagt aan de ontwikkeling en het bestuur van de universiteit. In dit gremium levert u met (strategische) voorstellen een constructieve bijdrage aan de strategie en missie van de Radboud Universiteit.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.ru.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/run-en-wide/13abf0bc0a611f32246d62b46488f997.jpg"}