{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/data-protection-researcher-in-the-area-of-biomedical-data-sciences-research-development-specialist-on-project/174949", "title": "Data protection researcher in the area of biomedical data sciences (Research & Development specialist on project)", "publish_date": "2022-02-07", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Researcher", "field": "Bioinformatics, Biomedicine, Computational Biology, Health Science, Medical Technology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>The <strong>University of Luxembourg</strong> is an <strong>international research</strong> university with a distinctly <strong>multilingual</strong> and <strong>interdisciplinary</strong> character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres ;focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.</p><p>Within the University, the <strong>Luxembourg Centre for Systems Biomedicine (LCSB) </strong>is a highly interdisciplinary <strong>research</strong> <strong>centre</strong> (IC), integrating experimental biology and computational biology approaches in order to develop the foundation of a future predictive, preventive and personalized medicine.</p><p>For our projects engaging in responsible research in the biomedical data sciences of the Luxembourgish ELIXIR Node, we are looking a data protection specialist to join our team.</p><p><strong>Your Role...</strong></p><ul><li>Contribute to policy research for responsible data use in national and European biomedical research collaborations and infrastructure projects, including the European 1+ Million Genomes Initiative  </li><li>Assist with the coordination of ELSI working groups in European and national collaborations</li><li>Assist research and data providing organisations to understand the ELSI implications and in particular the legal requirements of sharing biomedical data across Europe and internationally</li><li>Participate in the discussion and implementation of GDPR and general ELSI requirements for research on the national level; this will involve setting up a new initiative for clinical medicine and research</li><li>Contribute to the development of a national GDPR Code of Conduct for Scientific Research</li><li>Work closely with other team members and international researchers on the design and implementation of ELSI principles in a data driven research environment in the health sciences</li><li>Contribute to publications in scientific papers, books and other scientific documents</li><li>Ensure the sustainable collection, assessment, selection, availability, and transmission of data to the researcher community</li></ul><p><strong>What we expect from youâ\u0080¦</strong></p><ul><li>A Masterâ\u0080\u0099s degree with several years of work experience, (or a PhD degree) in biomedicine, bioinformatics, or a similar field with experience with ethical and legal challenges for research</li><li>Alternatively, a Masterâ\u0080\u0099s degree in law, bioethics, or a similar field with several years of experience in biomedicine (or a PhD degree)</li><li>You are enthusiastic about the practical implementation of ELSI aspects in data-driven biomedical research contexts and like to work collaboratively towards these goals</li><li>Good knowledge of the General Data Protection Regulation</li><li>Proven work experience addressing legal and ethical challenges in biomedical research, healthcare, and/or genomics</li><li>Experience working in international organisations and policy-making organisations</li><li>Knowledge of data sharing policy and open science practices, ideally also good understanding of intellectual property rights and/or on the medical device regulation with respect to its consequences for using smart devices and decision support systems in healthcare</li><li>Proven experience of collaborative research, managing a diverse research community, self-organisation and project management</li><li>Strong methodological, problem solving and interpersonal skills are required</li><li>Ability to effectively organise, prioritise and execute tasks in a highly dynamic environment</li><li>Experience in writing grants, academic papers etc.</li><li>Excellent communication skills and the ability to articulate clearly the ELSI needs to biomedical scientists and to work within an interdisciplinary setting, communicating with other internal and external partners</li><li>Proficiency in English, good language skills in French and/or German are an asset</li></ul><p><strong>We offer...</strong></p><ul><li>A fully funded position with competitive salaries</li><li>Working in an international environment and in close interaction with multiple stakeholders from researchers to government to authorities on national and international level</li><li>An exciting interdisciplinary environment bringing together ELSI experts, computational scientists, biologists and clinicians.</li><li>An opportunity to join the fast-growing ELIXIR Luxembourg headed by Prof. Dr. Reinhard Schneider at LCSB</li></ul><p><strong>In Short...</strong></p><ul><li>Contract Type: Fixed Term Contract 36 Month (renewable)</li><li>Work Hours: Full Time 40.0 Hours per Week</li><li>Starting date: As soon as possible</li><li>Location: Belval</li><li>Job Reference: UOL04312</li></ul><p><strong>How to apply...</strong></p><p>Applications (in English) should be submitted online and include:</p><ul><li>A detailed curriculum vitae</li><li>Cover letter mentioning the reference number</li><li>List of publications/software projects</li><li>Description of past experience and future interests</li><li>Name and contact information of three referees</li></ul><p>Applications should be addressed to: Prof. Dr. Reinhard Schneider (Head of the Bioinformatics Core Facility and Head of the ELIXIR-Luxembourg Node).</p><p>All applications will be handled in the strict confidence.</p><p>Please apply until 15 March 2022; then the position will remain online until filled.</p><p>The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.</p><p><strong>In return you will getâ\u0080¦</strong></p><ul><li><strong>Multilingual and international character</strong>. Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d (UniGR). </li><li><strong>A modern and dynamic university. </strong>High-quality equipment. Close ties to the business world and to the Luxembourg labour market. A unique urban site with excellent infrastructure.</li><li><strong>A partner for society and industry</strong>. Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic partners such as ministries, local governments, associations, NGOs â\u0080¦</li><li><a href=\"https://wwwen.uni.lu/university/about_the_university\" target=\"_blank\">Find out more about the University</a></li><li><a href=\"https://wwwen.uni.lu/contact\" target=\"_blank\">Addresses, maps &amp; routes to the various sites of the University</a></li></ul><p><strong>Further information...</strong></p><p>For further information, please contact:</p><p>Dr. Regina Becker (<a href=\"mailto:regina.becker@uni.lu\">regina.becker@uni.lu</a>)</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}