{"url": "https://academicpositions.com/ad/aarhus-university/2022/tenure-track-assistant-professor-or-associate-professor-in-science-studies/174587", "title": "Tenure-track assistant professor or associate professor in science studies", "publish_date": "2022-01-28", "deadline": "2022-04-13", "location": "Nordre Ringgade 1 Aarhus, Denmark", "city": "N/A", "country": "Denmark", "position": "Assistant Professor", "field": "Computational Sciences, Ethics, History of Science, Philosophy of Science, Sociology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Aarhus University", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><span style=\"color:rgb(0,0,0);\">The Centre for Science Studies invites applications for a tenure-track or tenured position in science studies with a special focus on the study of fields such as computational and data sciences, the development and application of digital technologies, and digitalization. We seek applicants with academic expertise in either history of science, history of technology, sociology of science, philosophy of science, science and technology studies (STS), or related fields. </span></p><p><span style=\"color:rgb(0,0,0);\">The Centre seeks to strengthen its research by attracting excellent researchers with an international research profile. The successful candidate is expected to take an active interest in developing the Centreâ\u0080\u0099s research portfolio in topics related to computer and data science and its scientific and societal impactbe opportunitiess. There will opportunities to collaborate with other staff members. The successful candidate will be expected to regularly apply for external research funding.</span></p><p><span style=\"color:rgb(0,0,0);\">The Centre teaches mandatory courses to almost all bachelor students in the Faculty of Science and the Faculty of Technology dedicated to historical, sociological, ethical, philosophical and societal questions relevant to their discipline. The teaching of these courses is usually shared by several staff members. The Centre has teaching needs in courses for students in the Data Sciences, Computer Science, and Engineering.  The successful candidate will be expected to contribute to the teaching in these courses, and to take responsibility as the lead instructor in some of these courses.</span></p><p><span style=\"color:rgb(0,0,0);\">The Centre runs a Masterâ\u0080\u0099s Program in science studies. The successful candidate is expected to contribute to teaching courses in this program and engage actively in the programâ\u0080\u0099s development and the supervision of students.</span></p><p><span style=\"color:rgb(0,0,0);\">The successful candidate is further expected to take a broad interest in science studies, be open to collaboration with scholars of history and philosophy of science and neighboring disciplines at the Centre, to participate in all aspects of the Centreâ\u0080\u0099s activities and to be present on a regular basis.</span></p><p><span style=\"color:rgb(0,0,0);\">Ensuring gender balance at the Department of Mathematics is a high priority at Aarhus University, and we particularly encourage women to apply for this position. No candidate will be given preferential treatment, and all applicants will be assessed on the basis of their qualifications for the position in question.</span></p><p><strong>Place of work </strong></p><p><span style=\"color:rgb(0,0,0);\">Place of employment is Aarhus University, and place of work is Department of Mathematics, Faculty of Natural Sciences, Ny Munkegade 118, 8000 Aarhus C.</span></p><p><span style=\"color:rgb(0,0,0);\">Expected starting date is October 1, 2022, or soon after.</span></p><p><strong>About the Centre</strong></p><p><span style=\"color:rgb(0,0,0);\">The Centre for Science Studies ranks as one of the major centers for the history and philosophy of science, technology, and mathematics in Europe. The Centre is part of the Department of Mathematics. For more information about the Centre, please see: </span><a href=\"http://www.css.au.dk/en\" target=\"_blank\"><u>www.css.au.dk/en</u></a><span style=\"color:rgb(0,0,0);\">. With 27 departments and approximately 38.000 students, Aarhus University (AU) is one of the largest and leading universities in Denmark.</span></p><p><span style=\"color:rgb(0,0,0);\">With about 300,000 inhabitants, Aarhus is the second biggest city in Denmark. More than 50,000 students live in the city, which means that Aarhus is a young and vibrant city. Aarhusâ\u0080\u0099 history goes back to the Viking Age. Today, the city not only offers numerous historical sites, but many internationally renowned cultural institutions.</span></p><p><strong>Natural Sciences Tenure Track</strong></p><p>Aarhus University offers talented scientists from around the world attractive career perspectives via the Natural Sciences Tenure Track Programme. Highly qualified candidates are appointed as Assistant Professors for a period of six years with the prospect of performance- based advancement to a tenured Associate Professorship position.<br/>The aim of the Natural Sciences Tenure Track Programme is to:</p><ul><li>attract outstanding talented individuals that are competitive at an international level</li><li>to promote the early development of independent research success early in the career of scientists</li><li>to create transparency in the academic career path</li></ul><p>As part of the tenure track position, the candidate is offered:</p><ul><li>access to research infrastructure</li><li>capability development, including postgraduate teacher training</li><li>a mentoring programme</li><li>support to develop scientific networks and to secure interdisciplinary research at the highest level</li></ul><p>As part of the Aarhus University Tenure Track Programme, the University carries out a mid-way evaluation to review the progress of the tenure track candidate after three years, according to the same criteria used in the final tenure review. The final tenure review is conducted after five and a half years. If the review is positive, the candidate will be offered a tenured position as Associate Professor at Aarhus University.</p><p>Please refer to the <a href=\"https://nat.au.dk/fileadmin/nat.au.dk/HR/Vejledninger_Nat_ENG/Tenure_Track_-_Engelsk__Nat_.pdf\" target=\"_blank\"><u>tenure track guidelines </u></a>for the tenure review criteria and for the tenure review process.</p><p><strong>Application procedure</strong></p><p>Shortlisting is used. This means that after the deadline for applications â\u0080\u0093 and with the assistance from the assessment committee chairman, and the assessment committee if necessary, â\u0080\u0093 the head of department selects the candidates to be evaluated. The selection is made on the basis of an assessment of who of the candidates are most relevant considering the requirements of the advertisement. All applicants will be notified within 6 weeks whether or not their applications have been sent to an expert assessment committee for evaluation. The selected applicants will be informed about the composition of the committee and will receive his/her assessment. Once the recruitment process is completed a final letter of rejection is sent to the deselected applicants.</p><p><strong>Letter of reference</strong></p><p>If you want a referee to upload a letter of reference on your behalf, please state the refereeâ\u0080\u0099s contact information when you submit your application. We strongly recommend that you make an agreement with the person in question before you enter the refereeâ\u0080\u0099s contact information, and that you ensure that the referee has enough time to write the letter of reference before the application deadline. Unfortunately, it is not possible to ensure that letters of reference received after the application deadline will be taken into consideration.</p><p><strong>Formalities and salary range</strong></p><p>Natural Sciences refers to the <a href=\"http://www.medarbejdere.au.dk/job_structure_for_academic_staff_at_Universities_2013\" target=\"_blank\"><u>Ministerial Order on the Appointment of Academic Staff at Danish Universities under the Danish Ministry of Science, Technology and Innovation.</u></a></p><p>Applicants should include cover letter, CV, publication list (highlight the five most significant publications), copies of diplomas, a teaching portfolio (including the applicantâ\u0080\u0099s thoughts on teaching historical, sociological, ethical, philosophical and/or societal issues to science students) and a research statement (maximum two pages). They should also explain in their cover letter how their research would fit into the profile of the Centre. Please consult the Facultyâ\u0080\u0099s guidelines for applicants <a href=\"https://nat.au.dk/fileadmin/ingen_mappe_valgt/Vejledning_til_ansoegere_-_faste_of_temporaere_videnskabelige_stillinger_-_Engelsk_Nat_.pdf\" target=\"_blank\"><u>here</u></a>.</p><p>Appointment shall be in accordance with the collective labour agreement between the Danish Ministry of Finance and the Danish Confederation of Professional Associations. Further information on qualification requirements and job content may be found in the <a href=\"https://medarbejdere.au.dk/fileadmin/www.medarbejdere.au.dk/hr/Rekruttering/Onboarding/Ministerial_Order_no._1443_of_11_December_2019_on_Job_Structure_for_Academic_Staff_at_Universities.pdf\" target=\"_blank\"><u>Memorandum on Job Structure for Academic Staff at Danish Universities</u></a>.</p><p>Salary depends on seniority as agreed between the Danish Ministry of Finance and the Confederation of Professional Associations.</p><p>Aarhus Universityâ\u0080\u0099s ambition is to be an attractive and inspiring workplace for all and to foster a culture in which each individual has opportunities to thrive, achieve and develop. We view equality and diversity as assets, and we welcome all applicants.</p><p>Research activities will be evaluated in relation to actual research time. Thus, we encourage applicants to specify periods of leave without research activities, in order to be able to subtract these periods from the span of the scientific career during the evaluation of scientific productivity.</p><p>Aarhus University offers a broad variety of services for international researchers and accompanying families, including relocation service and career counselling to expat partners. Read more <a href=\"http://ias.au.dk/au-relocation-service/\" target=\"_blank\"><u>here</u></a>. Please find more information about entering and working in Denmark <a href=\"http://international.au.dk/research/\" target=\"_blank\"><u>here</u></a>.</p><p><i>The application must be submitted via Aarhus Universityâ\u0080\u0099s recruitment system, which can be accessed under the job advertisement on Aarhus University's website</i>.</p><h3><strong>Aarhus University</strong></h3><p><i>Aarhus University is an academically diverse and research-intensive university with a strong commitment to high-quality research and education and the development of society nationally and globally. The university offers an inspiring research and teaching environment to its 38,000 students (FTEs) and 8,000 employees, and has an annual revenues of EUR 885 million. Learn more at </i><a href=\"http://www.international.au.dk/\" target=\"_blank\"><i><u>www.international.au.dk/</u></i></a></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxNjJcL2YwYlwvMTYyZjBiNmQ2MWE5NDQwYzRjMWYxOTlkYzEyNDIzNzAucG5nIiwiZWRpdHMiOltdfQ=="}