{"url": "https://academicpositions.com/ad/ait-austrian-institute-of-technology/2021/senior-scientist-m-f-d-food-system-microbiomes/170265", "title": "Senior Scientist (m/f/d) Food System Microbiomes", "publish_date": "2021-12-01", "deadline": "2022-03-01", "location": "Giefinggasse 4 Vienna, Austria", "city": "N/A", "country": "Austria", "position": "Researcher", "field": "Food Science, Microbiology, Molecular Biology, Soil Science, Systems Biology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "AIT Austrian Institute of Technology", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>We are Austriaâ\u0080\u0099s largest research and technology organisation and an international player in applied research for innovative infrastructure solutions. This makes us a powerful development partner for industry and a top employer in the scientific community. Our<strong> Center for Health &amp; Bioresources</strong> is seeking to hire new Ingenious Partners for our location in Tulln (in immediate vicinity to Vienna):</p><h3>Senior Scientist (m/f/d) Food System Microbiomes</h3><h4>- Center for Health &amp; Bioresources -</h4><h4>Imagine</h4><ul><li>You are part of the <strong>Bioresources</strong> Unit exploring biological resources such as soil, plant, air and food microbiomes for novel applications. Based on understanding as well as active interaction with multiple stakeholders, including the industry, you explore microbiome functions and develop innovative applications.</li><li>By translating fundamental knowledge into innovative solutions, you will improve the food system and human health.</li></ul><h4>Engage</h4><ul><li>Together with the team, you will elaborate a novel understanding of the role of microbiomes in the food system and develop approaches for microbiome-based improvement of the food system and human health.</li><li>You will coordinate and be involved in national and international research projects as well as in customer-oriented research and contribute to our international positioning and visibility.</li><li>Participation in the scientific dissemination process and definition of research strategies in national and international committees is an integral part of your job.</li><li>You acquire exciting research and customer projects and convince project partners of our solutions.</li><li>You will motivate, lead and develop a team of researchers.</li></ul><h4>Achieve</h4><ul><li>With your innovative work you will obtain a further understanding on the functioning of food systems microbiomes and their link to human health and translate knowledge into innovations.</li><li>You will successfully acquire research projects and represent AIT in research networks and cooperate with international research institutions.</li><li>Your publication activities in journals and presentations at conferences as well as your networking activities will contribute significantly to the international reputation of the team.</li><li>You will represent a competent contact person for our customers and develop technical and scientific concepts out of their requirements.</li><li>You will contribute to the ongoing development of the research and business strategy.</li></ul><p>Your qualifications as an <strong>Ingenious Partner</strong>:</p><ul><li>Ph.D. in microbiology, molecular biology, food sciences or equivalent</li><li>Extensive knowledge and proven track record in food systems microbiomes</li><li>Several years of experience in managing complex research projects as well as proven competence in leading and developing teams in a research environment</li><li>Experience in successfully soliciting of external funding for R&amp;D projects</li><li>Good network in the international research field of food systems microbiomes</li><li>Enthusiasm for creative solutions and innovations, application-oriented thinking</li><li>Very good proficiency in English; proficiency in German is advantageous but no requirement</li></ul><p><strong>What to expect:</strong><br/>The gross annual salary according to the collective agreement is at least EUR 55.594,-- as a basis and is supplemented by further, variable salary components. The actual total salary package will be determined individually according to your qualifications and experience. Furthermore, in addition to benefits, we offer flexible working conditions, individual further training and career opportunities in a highly innovative environment.<br/>At AIT, the promotion of women is important to us - that's why we are especially looking forward to applications from female candidates.<br/>Please submit your application documents including CV, motivational letter and certificates online.</p><h4><strong>TOMORROW TODAY - WITH YOU?</strong></h4>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE0XC8xMlwvQUlULnBuZyIsImVkaXRzIjpbXX0="}