{"url": "http://www.academictransfer.com/en/309230/technician-in-dynamics-and-vibration-group-10-fte/", "title": "Technician in Dynamics and Vibration Group (1.0 FTE)", "publish_date": "2022-02-08", "deadline": "2022-03-30", "location": "Broerstraat 5, 9712 CP, Groningen", "city": "Groningen", "country": "Netherlands", "position": "Engineer/Technician", "field": "Natural sciences", "salary": "max. â\u0082¬4093 per month", "max_working_hours": "38", "employer": "University of Groningen", "job_description": "The Dynamics and Control research group has a vacancy for a technician who will support in experimental research activities in dynamics and control related projects. This includes technical supports for PhD students and postdoc staffs and supervision of both Bachelor and Master students from Industrial Engineering Management and Mechanical Engineering.<br> <br> Main activities:<br> <br> ● assist with experimental research performed by undergraduate, postgraduate students and postdocs<br> ● assist students with the right operation of the lab equipment and materials (training of lab equipment to postgraduate and undergraduate students)<br> ● perform laboratory procedures and research as part of on-going research projects<br> ● help with the maintenance and calibration of the equipment<br> ● develop of new (electromechanical) experiments set-ups and tools<br> ● assist the group members with projects and experiments including designing and manufacturing laboratory structures, setting up experiments, running experiments, collecting and recording data<br> ● prepare detailed daily, weekly, and project completion reports and documentation that includes project progress, issues or problems, recommendations, test results and analyses<br> ● participate in project meetings including but not limited to: kickoff meetings, planning meetings and progress meetings<br> ● act as ARMICO (work and environment contact person), responsible for safety, safety regulations, etc.<br> ● responsible for purchasing lab equipment and material. Ensure the inventory is always stocked and that everything is clearly and correctly labelled.<br> <br> Examples of tests to be performed:<br> <br> Modal testing including hammer tests and shaker tests using Siemens test lab data acquisition system, active vibration control tests using d-Space system for real time acquisition and control, measurements from electro-mechanical systems such as inertial actuators and piezoelectric actuators, optical measurements from high-speed cameras.<br> <br> Assist with some practicals:<br> <br> ● assist with technical drawings for example Solid works<br> ● assist with the design of the structure and suggest required modification <br> ● assist with manufacturing of the test set-up<br> ● prepare the test set-up when necessary<br> ● support the general operation of the lab.<br> <br> In particular, you will:<br> <br> ● provide instruction, advise and offer technical support to MSc and PhD students from Dynamics and Vibration group<br> ● set up of practicums and participate in lab experiments<br> ● coordination of lab experiments for courses such as Advanced vibration, Dynamics, etc.<br> ● design methods, techniques and equipment for research<br> ● install and maintain software on lab computers and solve issues with lab equipment<br> ● represent DV at relevant engineering fairs, and provide support in contacts with industry.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    Masters' degree in Mechanical Engineering, Electro-Mechanical Engineering, Electrical Engineering, Applied Physics, or equivalent, or a Bachelors' degree in the same fields with additional relevant experience.<br/>\n<br/>\nâ\u0097\u008f fluent in English and Dutch<br/>\nâ\u0097\u008f a dynamic, creative and pioneering professional attitude<br/>\nâ\u0097\u008f the ability to work independently and with colleagues<br/>\nâ\u0097\u008f a problem solving ability<br/>\nâ\u0097\u008f cross-cultural sensitivity and strong communication skills<br/>\nâ\u0097\u008f enjoys working with young people of several educational backgrounds.\n  </div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 12 months.</p>\n            \n            The University of Groningen offers, in accordance with the Collective Labour Agreement for Dutch Universities:<br/>\n<br/>\n- a salary dependent on qualifications and work experience with a minimum of â\u0082¬ 2,710 (salary scale 8) up to a maximum of â\u0082¬ 4,093 gross per month (salary scale 9) for a full-time position<br/>\n- a holiday allowance of 8% gross annual income and an 8.3% year-end bonus<br/>\n- a position initially for 1 year. After 1 year indefinite extension is possible if the outcome of the evaluation of the job performance during the Result and Development Interview is positive.\n          \n  </div>\n</div>", "employer_description": "N/A", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    Prof. M. Ghandchi Tehrani<br/>\n+31 50 3634943<br/>\nm.ghandchitehrani@rug.nl\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.rug.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/rug-en-wide/fce0dfff95a30233a4210a238918791e.gif"}