{"url": "http://www.academictransfer.com/en/309376/housing-officer-international-office-08-fte/apply/", "title": "Housing Officer International Office (0,8 fte)", "publish_date": "2022-02-11", "deadline": "2022-02-23", "location": "Warandelaan 2, 5037 AB, Tilburg", "city": "Tilburg", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Tilburg University", "job_description": "<p><strong>Jouw werkzaamheden</strong><br> Als Housing Officer ben je zowel intern (binnen de universiteit) als extern het aanspreekpunt rondom veel zaken die te maken hebben met huisvesting van internationale studenten. Extern heb je zowel een rol richting de student als richting de verhuurders. Beide kanten van de markt (vraag en aanbod) staan met jou in contact. Dit betekent ook dat je zowel tactisch als operationeel actief zult zijn. De kerntaken betreffen:</p><p><br> &bull;&nbsp;&nbsp; &nbsp;Het adviseren en begeleiden van nieuwe inkomende internationale studenten. De student is zelf verantwoordelijk voor het vinden van huisvesting maar aan jou wel de taak om de student actief te begeleiden en ervoor te zorgen dat deze goed ge&iuml;nformeerd is zodat hij/zij hiertoe ook in staat is.<br> &bull;&nbsp;&nbsp; &nbsp;Het mede onderhouden van een constructieve goede relatie met verschillende partijen (woningcorporaties, gemeente, etc.) waar Tilburg University mee samenwerkt. Daarnaast ben jij verantwoordelijk voor het plannen en bewaken van de periodieke overleggen met deze partijen.&nbsp;<br> &bull;&nbsp;&nbsp; &nbsp;Het informeren van en bemiddelen en contact onderhouden met (potenti&euml;le) verhuurders waar Tilburg University niet direct mee samenwerkt met als doel meer aanbod te cre&euml;ren voor internationale studenten. Denk hierbij aan het maken van afspraken met hostels/hotels/vakantieparken of het bemiddelen van hospitaverhuur tijdens piekperiodes.<br> &bull;&nbsp;&nbsp; &nbsp;Het op diverse manieren onderhouden van de communicatie richting studenten, waaronder het up to date houden van de Accomodation website, het opstellen van e-mailcampagnes, presenteren van webinars en het uitzetten van korte enqu&ecirc;tes. &nbsp;<br> &nbsp;</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.uvt.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uvt-en-wide/8bbc452c034c71750be03f93fe602eca.png"}