{"url": "http://www.academictransfer.com/en/309373/postdoc-position-plasma-aided-nitrogen-fixation-fm/", "title": "Postdoc position: plasma aided nitrogen fixation (F/M)", "publish_date": "2022-02-11", "deadline": "2022-02-23", "location": "De Zaale 20, 5612 AP, Eindhoven", "city": "Eindhoven", "country": "Netherlands", "position": "Postdoc", "field": "Natural sciences; Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "DIFFER", "job_description": "<p>With increasing global interest in renewable energy technology given the backdrop of climate change, storage of electrical energy has become particularly relevant. Most sustainable technologies (e.g., wind and solar) produce electricity intermittently. Thus, converting electrical energy and base molecules (i.e., H2O, N2) into chemical feedstock (e.g. H2, NH3, NOx) is of paramount importance. While H2O splitting is compatible with renewable electricity, N2 fixation is currently dominated by thermally activated processes. This postdoctoral position will focus on the development and evaluation of plasma for nitrogen fixation in a close collaboration with industry.</p><p>The research tasks are highly interdisciplinary and will perfectly align with emerging research lines and granted projects at DIFFER.</p><ul> <li>Development and characterization of materials for solid oxide electrolysis cells: electrodes and ionic conducting membranes.</li> <li>Physical-, chemical- and structural characterization (XRD, XPS, SEM).</li> <li>Gas phase analysis of reaction products (GC, MS, FTIR).</li> <li>Preparation of scientific papers and conference communications.</li> <li>Supervision of bachelor and master students.</li> <li>Contribution to the scientific and collaborative research environment at DIFFER.</li> </ul>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>We are looking for a qualified and motivated candidate that meets the following requirements:</p>\n<ul>\n<li>PhD in material science or electrochemistry or relevant fields.</li>\n<li>Practical experience in the areas of solid oxide electrolysers and fuel cells.</li>\n<li>Strong communication skills and attitude to participate successfully in multidisciplinary projects.</li>\n<li>Ability to work well individually and as a team member.</li>\n<li>Good communication skills in English (both written and spoken).</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>This position is for 1,0 fte and is graded in pay scale 10. Your salary will be up to a maximum of 4,514 euro gross per month, depending on your level of experience. This concerns a one year postdoc position (with the perspective to be extended) is available in the group of Catalytic and Electrochemical Processes for Energy Applications in the area of plasma aided nitrogen fixation.</p>\n<p>The position will be based at DIFFER (www.differ.nl) and the working location will be Eindhoven. When fulfilling a position at DIFFER, you will have an employee status at NWO. You can participate in all the employee benefits NWO offers. We have a number of regulations that support employees in finding a good work-life balance. At DIFFER we believe that a workforce diverse in gender, age and cultural background is key to performing excellent research. We therefore invite all those who consider they match the vacancy to apply. More information on working at NWO can be found at the NWO website (<a href=\"https://www.nwo-i.nl/en/working-at-nwo-i/jobsatnwoi/\">https://www.nwo-i.nl/en/working-at-nwo-i/jobsatnwoi/</a>)</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Dutch Institute for Fundamental Energy Research</h4>\n<p>DIFFER (Dutch Institute for Fundamental Energy Research) is the Dutch research institute that performs leading fundamental research on materials, processes, and systems for a global sustainable energy infrastructure. We work in close partnership with (inter)national academia and industry. Our user facilities are open to industry and university researchers. As an institute of the Dutch Research Council (NWO) DIFFER plays a key role in fundamental research for the energy transition.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Further information on the vacancy please see: <a href=\"http://www.differ.nl/research/cepea\">www.differ.nl/research/cepea</a></p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.differ.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/differ-en-wide/6fc1280036fd952b50db6c0ee581c92d.jpeg"}