{"url": "http://www.academictransfer.com/en/309307/onderwijscoordinator-htric-06-fte/", "title": "Onderwijscoördinator HTRIC (0,6 fte)", "publish_date": "2022-02-10", "deadline": "2022-02-20", "location": "Broerstraat 5, 9712 CP, Groningen", "city": "Groningen", "country": "Netherlands", "position": "Other Category", "field": "Natuurwetenschappen", "salary": "N/A", "max_working_hours": "23", "employer": "University of Groningen", "job_description": "Health Technology Research and Innovation Cluster; We are HTRIC<br> <br> Health Technology and Innovation Cluster (HTRIC) is een gezamenlijk initiatief van de Rijksuniversiteit Groningen en het UMCG, samen met onder andere De Hanzehogeschool, NHL Stenden en het Life Cooperative. HTRIC verbindt onderzoek, gezondheidstechnologie en klinische praktijk voor meer gezonde jaren.<br> Om onze ambitie “gezondheidstechnologie voor meer gezonde jaren” waar te maken zijn wij op zoek naar een energieke en verbindende onderwijscoördinator. <br> In de rol van onderwijscoördinator ben je verantwoordelijk om de ambitieuze doelstelling van HTRIC te vertalen naar concrete onderwijsprogramma’s. Centraal hierbij staat de methodiek design thinking die in alle programma’s de basis moet vormen. Je verbindt hierbij het interne netwerk van kennispartners onderling en aan dat van onze bedrijfspartners. Aan de kennisinhoudelijke collega’s voeg je organisatiekracht toe en voer je strakke regie als het om planning en rolverdeling gaat. Door jouw enthousiasme en inzet leveren netwerkpartners graag hun bijdrage. <br> <br> ● Je bent het eerste aanspreekpunt voor HTRIC op het gebied van onderwijs.<br> ● Je weet bij al onze kennispartners inhoudelijke experts te vinden en binden aan HTRIC.<br> ● Je houdt je bezig met het programmatisch uitwerken van het onderwijs van HTRIC waarbij de “Design thinking course voor PhD” (zie bijlage 1) het startpunt vormt.<br> ● Je draagt zorg voor gestructureerde realisatie van de samenwerking met business partners. <br> ● Je helpt inzichtelijk maken welke behoeftes bedrijfspartners in Noord Nederland hebben op het gebied van young human capital in het kader van health technology en helpt dit vorm te geven in (aanvullende) onderwijsprogramma’s.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.rug.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/rug-en-wide/fce0dfff95a30233a4210a238918791e.gif"}