{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/devops-engineer-research-development-specialist/161774", "title": "DevOps Engineer (Research & Development specialist)", "publish_date": "2022-02-07", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Engineer/Technician", "field": "Computer Communications (Networks), Computing in Mathematics, Natural Science, Engineering and Medicine, Informatics, Information Systems (Business Informatics), Operating Systems, and 2 moreProgramming Languages,Software Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "The University of Luxembourg is an international research university with a distinctly multilingual and interdisciplinary character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s&nbsp;faculties and interdisciplinary centres&nbsp;;focus on&nbsp;research in the areas of&nbsp;Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History.&nbsp;In addition, the University focuses on&nbsp;cross-disciplinary research in the areas of&nbsp;Data Modelling and Simulation as well as Health and System Biomedicine.&nbsp;Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.The Luxembourg Centre for Systems Biomedicine (LCSB) is an interdisciplinary research centre at the University of Luxembourg. LCSB develops and applies systems-level approaches to gain insight into the molecular and cellular mechanisms of human diseases. Experimental and computational approaches are combined to analyse the complexity of biological systems underlying disease pathogenesis. The LCSB is pioneering the way for a predictive, preventive, and personalised medicine. Neurodegenerative diseases, especially Parkinsonâ\u0080\u0099s disease are major targets within LCSBâ\u0080\u0099s research activities. LCSB is coordinating the ELIXIR (the European life-sciences Infrastructure for biological Information www.elixir-europe.org) national node of Luxembourg focusing on â\u0080\u009cClinical and Translational Medicine Research Informaticsâ\u0080\u009d.For our research activities and projects within ELIXIR Luxembourg, we are looking for a DevOps engineer with a strong background in programming to support the setup, implementation and monitoring of ELIXIR research IT services and infrastructures (based on OpenStack and RHEV-M). In addition, the hired candidate will help with the development and setup of new state of the art solutions.Your Role..Evaluate and deploy existing implementations of federated data management and analysis solutions such as ELIXIR Cloud (GA4GH compatible cloud) and Federated EGA.Research existing technologies and contribute to new and ongoing research projects by applying technology, benchmarks, selection, and methodologies.Conceptually design IT solutions within ELIXIR related research projects.Participate in international working groups and conferences to strengthen the ELIXIR Luxembourg offered services.Contribute to research activities, new approaches and IT solutions.Setup and provide support to ELIXIR-LU data management IT services.Assist with provisioning, installation/configuration, operation, upgrade and maintenance of systems and related infrastructure in and for biomedical, translational, and clinical research.Assist with system backup/recovery services, system administration processes, firewalls, networks, and storage.Monitor performance and troubleshoot issues and outages/incidents.Maintain and monitor support information in ticketing systems and related tools related to the ELIXIR services.Work closely with other team members aiming for a high level of quality and user satisfaction.Write and maintain documentation for technical procedures.Assist in the procurement of in-house services via external vendors, if/when so desired.Become a key actor of continuous improvement and innovation within the group.What we expect from youâ\u0080¦A higher-education degree (MSc, University or equivalent) in computer science, engineering or in another field but with equivalent proven experience as DevOps engineer, cloud engineer or systems engineer.An interest in state-of-the-art technologies.Autonomous, dynamic, and curious.Proven experience with the setup of IT platforms, especially with a focus on data management.Proven experience with the following technologies:Linux (RHEL/Ubuntu), Linux scripting (shell / bash)Kubernetes, DockerOpenStack, Ceph, Keystone, ..Good programming experience in Python.Good knowledge of modern web development technologies (OIDC, SAML, React, Vue.js, Django, etc..).Knowledge of or experiences with GA4GH / ELIXIR Cloud, Federated EGA or similar technology stacks will be considered an asset.Experience with any of the following will be considered an asset: Puppet, Ansible, git, oVirt / RHEV, RedHat IdM / Keycloak, LDAP / AD, Icinga / Nagios.Excellent communication skills and the ability to articulate clearly the scientific and technical needs and to work within an interdisciplinary setting, communicating with other internal/external partners.We offer..A fully funded DevOps Engineer (Research &amp; Development specialist) position with a competitive salary based on the candidate's experience.Participate in the building of state-of-the-art IT infrastructure to enable precision medicine.An opportunity to join the fast-growing Bioinformatics Core Facility group headed by Prof. Dr. Reinhard Schneider at LCSB.An exciting international environment.In Short..Contract Type: Fixed Term Contract 36 Month (extension possible up to 60 months)Work Hours: Full Time 40.0 Hours per WeekStarting date: As soon as possibleLocation:&nbsp;BelvalJob Reference:&nbsp;UOL04296How to apply..Online applications should be addressed to:Prof. Dr. Reinhard Schneider / Head of the Bioinformatics core facility and head of the ELIXIR Luxembourg nodeApplications (in English) should contain the following documents:A detailed curriculum vitaeCover letter mentioning the reference numberList of infrastructure/software projects and/or publicationsDescription of past experience and future interestsName and addresses of three refereesAll applications will be handled in the strict confidentiality.Early application is highly encouraged, as the applications will be processed upon reception. Please apply formally through the HR system. Applications by email will not be considered.The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.In return you will getâ\u0080¦Multilingual and international character.&nbsp;Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d&nbsp;(UniGR).&nbsp;A modern and dynamic university.&nbsp;High-quality equipment.&nbsp;Close ties to the business world and to the Luxembourg labour market.&nbsp;A unique urban site with excellent infrastructure.A partner for society and industry.&nbsp;Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic&nbsp;partners such as ministries, local governments, associations, NGOs â\u0080¦Find out more about the UniversityAddresses, maps &amp; routes to the various sites of the UniversityFurther information..For further information, please contact:Dr Christophe Trefois (christophe.trefois@uni.lu)Team leader R3 infrastructure and deputy technical coordinator of the ELIXIR Luxembourg node.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Luxembourg aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international, multilingual and interdisciplinary character.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}