{"url": "http://www.academictransfer.com/en/308846/management-assistente/", "title": "Management assistent(e)", "publish_date": "2022-02-01", "deadline": "2022-02-15", "location": "Rapenburg 70, 2311EZ, Leiden", "city": "Leiden", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "<p>Faculteit Wiskunde en Natuurwetenschappen, instituut voor Biofarmaceutische Wetenschappen (LACDR) zoekt een</p><p><strong>Management assistent(e)</strong></p><p>Heb jij een passie voor het ondersteunen van managementleden bij alle voorkomende werkzaamheden op een afdeling? Hou je ervan om veel ballen tegelijk in de lucht te houden en met veel verschillende taken bezig te zijn? En krijg je energie van het helpen van collega&rsquo;s? Dan ben jij de nieuwe collega die wij zoeken!</p><p>Met ingang van&nbsp;<strong>1 maart 2022&nbsp;</strong>komt de functie van<strong>&nbsp;management assistent</strong>&nbsp;(0,8-1 fte) beschikbaar.</p><p>Vanuit jouw rol ben je verantwoordelijk voor de administratieve ondersteuning van de HR-processen binnen het instituut. Daarnaast werk je samen met de collega&rsquo;s van het instituutsbureau bij het organiseren van evenementen en bij de ondersteuning van de instituutsmanager en wetenschappelijk directeur.</p><ul> <li>Je biedt administratieve ondersteuning bij de verwerking van personeel gerelateerde vragen en mutaties</li> <li>Je bewaakt deadlines en ziet toe op aflopende contracten en verlengingen</li> <li>Je voorziet leidinggevenden van HR-gerelateerde management informatie</li> <li>Je begeleidt benoemingsadviescommissies (BAC&rsquo;s)</li> <li>Je maakt afspraken en indien nodig beheer je de agenda&rsquo;s&nbsp; Je beheert e-mails en handelt waar mogelijk e-mails af</li> <li>Je informeert interne en externe betrokkenen over lopende zaken</li> <li>Je bereidt vergaderingen voor</li> <li>Je notuleert</li> <li>Je organiseert evenementen</li> </ul><p>Je weet wat er speelt binnen het instituut en pakt zaken snel op. Je hebt snel in de gaten hoe de onderlinge verhoudingen zijn en speelt daar op de juiste manier op in. Samenwerken levert jou dan ook veel energie op. Als werk effici&euml;nter kan, dan zie je dat en kom je met voorstellen tot verbetering.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.universiteitleiden.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/lei-en-wide/f66e61a821cf3294ef5ce4fcaacbdedb.png"}