{"url": "https://www.academictransfer.com/en/309319/post-doctoral-researcher/", "title": "Post doctoral researcher", "publish_date": "2022-02-10", "deadline": "2022-03-23", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Postdoc", "field": "Health", "salary": "â\u0082¬4000â\u0080\u0094â\u0082¬5483 per month", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "You will be appointed on a career stimulation grant issued by Astra Zeneca. The grant endorses the production of a publication in a very highly ranked journal publication with the scope to provide the post-doc fellow a strong basis for building up an academic career as an independent researcher. The fellow will study the consequences of vascular aging on renal function. Our hypothesis is that a gradually increasing hypoperfusion of the kidney occurs in aging, which will cause an aberrant energetic profile and senescence. Further, the fellow will investigate treatment options.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You have completed a thesis and hold a PhD degree in Biosciences, Medicine, Biochemistry or any related discipline. The topic of the thesis is related to mitochondrial function.</li>\n<li>You have ample experience with cell cultures, preferably also with renal or vascular function measurements, and a more than superficial knowledge of cardiovascular and renal function and pharmacology.</li>\n<li>Some experience with cloning techniques is recommended.</li>\n<li>A training in physiology and anatomy during the master study or PhD employment needs to be demonstrated (e.g. diploma's, testimonies, grades, publications).</li>\n<li>You must be able to present and communicate excellently in English, and have experience in presenting at international congresses.</li>\n<li>You will very likely be conducting part of your research in the laboratories of Astra Zeneca. In this case a periodic stay in the United Kingdom will take place.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You will receive a contract for the duration of 3 years.</li>\n<li>A gross monthly salary based on scale 11 and a full-time working week of 36 hours.</li>\n<li>Excellent fringe benefits, such as a 13th month that is already paid out in November and a individual travel expense package.</li>\n<li>Pension insurance with ABP. We take care of approximately 2/3 of the monthly contribution.</li>\n<li>Special benefits, such as a incompany physiotherapist and bicycle repairer. And there is also a gym where you can work on your fitness after work.</li>\n</ul> The terms of employment are in accordance with the Collective Bargaining Agreement for University Medical Centers (CAO UMC).\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus MC</h4>\n              \n              The department of Internal Medicine is the single largest clinical, research and educational entity in the Netherlands. With well over 125 researchers in reach within the same department the post-doctoral researcher will be ensured of a very stimulating working environment with almost unlimited possibilities to develop an excellent career.<br/><br/>The project will be strengthened by a collaboration with Astra Zeneca, which will be partly take place at their premises in Cambridge, United Kingdom. Astra Zeneca is one of the leading pharmaceutical companies worldwide.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about this position, please contact Dr. Anton J.M. Roks, principle investigator, phone number: <a href=\"tel:00107043547\">+31 (0)10 704 35 47</a> or B. Breemerkamp, secretary, phone number: <a href=\"tel:00107043547\">+31 (0)10 704 35 47</a>. Due to the collaboration, a delegation of Astra Zeneca will be involved in the selection process.<br/><br/>For queries regarding your application, please contact Jeanette dos Santos Gomes, Recruiter, by phone number: <a href=\"tel:00650031007\">+31 (0)6 500 310 07</a>.<br/><br/>If you are excited by the thought of this position and would like to apply, please do so by using the application form on our website.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}