{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/research-associate-fellow-in-manufacturing-fixed-term/174921", "title": "Research Associate / Fellow in Manufacturing (fixed term)", "publish_date": "2022-02-04", "deadline": "2022-02-16", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Research Assistant", "field": "Manufacturing Engineering, Materials Engineering, Mechanical Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference ENG034622Closing Date Wednesday, 16th February 2022Job Type ResearchDepartment EngineeringSalary Â£27924 to Â£40927 per annum, (pro rata if applicable) depending on skills and experience (minimum Â£31406 with relevant PhD). Salary progression beyond this scale is subject to performanceApplications are invited for the above post based in the Department of Mechanical, Materials and Manufacturing Engineering in the Faculty of Engineering at University Park, Nottingham. &nbsp;This post will complement and strengthen research related activities within The Rolls-Royce University Technology Centre (UTC) in Manufacturing and On-Wing Technology at the University of Nottingham. The research of the UTC has been highly ranked in the field of manufacturing related areas and is carrying out the leading technologies in these fields.&nbsp;This post will focus on the study of advanced manufacturing technologies and surface integrity inspection methods for difficult-to-machine materials (e.g. composites and superalloys). It is supposed to study the material machining performance through different techniques in detail. Another objective is to study the materials properties (including microstructures, micro/macro mechanical performance etc.) influenced by the advanced machining process.&nbsp;The successful candidate will be expected to join the Rolls-Royce UTC in Manufacturing and On-Wing Technology and contribute high quality research. Candidates should have good independent research capabilities, publications in high-impact academic journal, ability to work with industrial/academic partners, and experience of carrying out successful projects.&nbsp;Candidates must possess a good first degree in mechanical engineering, and a PhD degree (or be near completion). Better understanding of materials properties will be beneficial.&nbsp;This full-time post is available from 01 March 2022, but late start could be agreed, and will offered on a fixed-term contract for a period of 2 years, if starts on or before 01 April 2022 as the funding ends on 31 March 2024.Hours of work are full-time (36.25 hours per week). Job share arrangements may be considered.&nbsp;Informal enquiries may be address to Dr. Zhirong Liao (Zhirong.Liao@nottingham.ac.uk). Please note that applications sent directly to this email address will not be accepted.Our University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileAdditional InformationApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}