{"url": "https://academicpositions.com/ad/tu-wien/2022/post-doc-position-structural-reorganization-in-nano-porous-4h-sic-layers/173829", "title": "Postâ\u0080\u0090doc Position Structural reorganization in nanoâ\u0080\u0090porous 4Hâ\u0080\u0090SiC layers", "publish_date": "2022-01-11", "deadline": "2022-02-18", "location": "Karlsplatz 13 Vienna, Austria", "city": "N/A", "country": "Austria", "position": "Other Category", "field": "Electrical Engineering, Electrochemistry, Electronics, Materials Chemistry, Materials Engineering, and 3 moreMaterials Physics,Nanotechnology,Optics", "salary": "N/A", "max_working_hours": "N/A", "employer": "TU Wien", "job_description": "TU Wien is located in the heart of Europe, in a cosmopolitan city of great cultural diversity. Our identity as a research university means that we build our reputation through our research. TU Wien combines basic and applied research and researchâ\u0080\u0090oriented teaching at the highest level.The group of Prof. Ulrich Schmid at the Institute of Sensor and Actuator Systems invites applications for a 2â\u0080\u0090year Postâ\u0080\u0090doc position (starting March 1, 2022) in the field of porous wide band gap semiconductors.The ProjectDue to outstanding properties in comparison to silicon such as a large bandgap ensuring a high electric breakdown strength and a high thermal conductivity foregrounds silicon carbide (SiC) as one of the most promising wide band gap semiconductors for future high power and high frequency electronic devices. Besides these wellâ\u0080\u0090known material parameters, advanced device architectures request novel approaches for fabrication. In the recent years, electrochemically porosified SiC emerged as promising technology to integrate optical elements (e.g. Rugate mirror) into singleâ\u0080\u0090crystalline SiC and to realize robust MEMS devices (e.g. membranes) in a tailored surface micromachining process. Furthermore, the surface to volume ratio could be increased for chemical sensor applications as well as the realization of membranes liftedâ\u0080\u0090off from the SiC mother substrate was demonstrated.To exploit the full potential of photoelectrochemically porosified SiC layers, a deeper understanding on pore reorganization at high temperatures above 1400Â°C under defined conditions, such temperature profiles, gas atmospheres and gas pressure levels, is needed which we want to address in this project experimentally and theoretically. For more information about the project please contact the principal investigators Dr. Georg Pfusterschmied (georg.pfusterschmied@tuwien.ac.at) or Prof. Ulrich Schmid (ulrich.e366.schmid@tuwien.ac.at).Your ProfileFor this most ambitious project we are looking for a motivated experienced researcher fulfilling these requirements:PhD or comparable degree in material science, chemistry, physics, electrical engineering microsystems, or in a related subject.Expertise in the fabrication and characterization of porous materials.Expertise in the modelling and simulation of pore reorganization at high temperatures is considered a strong plus.Knowledge in semiconductor technology, especially of wide band gap semiconductors such as SiC or GaN.Solid written and oral communication skills in English.We OfferThe successful candidate will work in the group of Prof. Ulrich Schmid at the Institute of Sensor and Actuator Systems located in the center of Vienna. The institute offers an international environment and excellent infrastructure. You can find more information about the group and the institute at https://mst.isas.tuwien.ac.at/home/.Salary of the position are according to collective labor agreement for employees at universities, salary group B1, based on 40 hours per week, a gross salary of currently EUR 55242 per year.Your ApplicationWe invite highly qualified and motivated researchers with a PhD having a strong interest in porous semiconductors to send us your detailed application documents (including a letter of motivation and CV) in a single pdf file containing via emailto postdoc3662@tuwien.ac.at until February 18, 2022.Candidates are not eligible for a refund of expenses for travelling and lodging related to the application process.TU Wien intends to increase the number of women on its faculty and therefore specifically invites applications by women. Among equally qualified applicants, women will receive preferential consideration.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "TU Wien (Vienna) is Austria's largest research and educational institution in the field of technology and natural sciences.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIzYzVcL2JhMVwvM2M1YmExNWM3MTZmMDcxNjljMWZmNzNmZTZkOWI4YTEucG5nIiwiZWRpdHMiOltdfQ=="}