{"url": "https://www.academictransfer.com/en/309315/vacature-medewerker-studentenzaken-08-fte-onderwijsinstituut-faculty-of-health-medicine-and-life-sciences-oi-fhml/apply/", "title": "Vacature Medewerker Studentenzaken (0,8 FTE), Onderwijsinstituut Faculty of Health, Medicine and Life Sciences (OI-FHML)", "publish_date": "2022-02-10", "deadline": "2022-02-24", "location": "Universiteitssingel 60, 6229 ER, Maastricht", "city": "Maastricht", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "30.4", "employer": "Maastricht University (UM)", "job_description": "<p>In het Onderwijsinstituut Faculty of Health, Medicine and Life Sciences (OI-FHML) zijn alle facultaire onderwijstaken voor de opleidingen Geneeskunde, Gezondheidswetenschappen incl. European Public Health en Biomedische Wetenschappen ondergebracht. Het OI-FHML is bij de uitvoering van de onderwijstaken zowel verantwoordelijk voor de inhoud als voor de uitvoering, logistiek, beheer en planning.<br> Het OI-FHML bestaat naast de Directie uit vier afdelingen: Onderwijszaken, Bedrijfsbureau, Marketing, en Strategie &amp; Beleid.<br> De onderstaande vacature voor Medewerker Studentenzaken is gesitueerd binnen de afdeling Onderwijszaken OI-FHML, Team Examens.</p><p>Team Examens bestaat uit 2 componenten: twee secretarissen van de Examencommissies en de Examenadministratie. De secretarissen ondersteunen de drie Examencommissies van de FHML, te weten Geneeskunde, Gezondheidswetenschappen incl. European Public Health en Biomedische Wetenschappen.<br> De Examenadministratie richt zich in het bijzonder op het registreren van studenten voor onderwijs en toetsen, het verwerken van resultaten en het afstuderen tot en met de diploma-uitreiking. Voor de ondersteuning van de twee secretarissen zoeken wij een collega die de twee secretarissen kan ondersteunen en vervangen tijdens verlof/ziekte etc. en ook werkzaamheden verricht voor de Examenadministratie.</p><p>Wat ga je doen:<br> Examencommissie:</p><ul> <li>Ondersteuning c.q. vervanging secretarissen Examencommissies door bijwonen van vergaderingen, notuleren DB en EC-vergaderingen en alle overige werkzaamheden van de secretarissen;</li> <li>Verwerken benoemingen thesisbeoordelaars;</li> <li>Administratieve verwerking van toetsplannen.</li> </ul><p>Examenadministratie:</p><ul> <li>Registreren van studenten voor onderwijs en toetsen;</li> <li>Verwerken van resultaten in het SAP systeem;</li> <li>Afhandelen van vragen/verzoeken van studenten via askFHML;</li> <li>Alle andere voorkomende administratieve werkzaamheden rondom het examenproces.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.maastrichtuniversity.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/um-en-wide/0c1dd83b22059d7ee90c38e0f0c254be.jpg"}