{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/full-professor-in-nursing-sciences/174006", "title": "Full Professor in Nursing sciences", "publish_date": "2022-01-14", "deadline": "2022-02-21", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Full Professor", "field": "Clinical Sciences, Health Science, Nursing Science, Public Health,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>Founded in 2003, the University of Luxembourg is the only public university in the Grand Duchy of Luxembourg. Multilingual, international and focused on research, it also defines itself as a modern institution with a human face.</p><p>The University of Luxembourg, through its Faculty of Science, Technology and Medicine, aims for excellence in research and in the education of biomedical sciences and health professions. A new Bachelor's degree in Medicine started in September 2020. Three Medical Specialisations, in General Medicine, Neurology and Oncology are also offered. Seven new Bachelors of Science in Nursing (Bachelor of Nursing in general care, and other Bachelors in the fields of surgery, anaesthesia, paediatrics, mental health, midwifery, radiology) are now planned to commence in September 2023.</p><p>The University of Luxembourg will organise these Bachelors in Nursing by combining theoretical training using the latest technology with practical training in hospitals, clinics or outpatient clinics in collaboration with the various institutes in the country and foreign partners.</p><p>In this context, the University is recruiting a Full Professor in Nursing sciences.</p><p><strong>Your Role...</strong></p><p>The professor will be attached to the University on a full-time basis. He/she will have a leadership role in building and coordinating nursing education.</p><p>The academic part will be divided between teaching and research:</p><p><strong>Teaching:</strong></p><p>The holder of the position will build and co-direct the Bachelors in Nursing and will be responsible for the selection of students into the programme, the establishment of the training plan for nurses, the organisation of theoretical and practical teaching, and the evaluation during and at the end of the course, in relation with the teachers and tutors of the clinical placements. More particularly, the presence on the campus of students in medicine, biology and nursing provides us with the possibility to establish common courses, to help students discover and understand the specificities of their different training and future professions at a very early stage and to have them work together in modern professional simulation environments. This pooling of teaching will be based on the collaborative and joint work of teachers from the different health programmes.</p><p><strong>Research:</strong></p><p>The candidate will be responsible for developing nursing research aimed at:</p><ul><li>The improvement of the quality of care</li><li>Patient well-being</li><li>Quality of work life</li></ul><p>And this within the general framework of improving public health, in collaboration with the patient him/herself (â\u0080\u009cpartner patientâ\u0080\u009d), with internal partners in the various Faculties or interdisciplinary Centres, and with external national or international partners.</p><p>The holder will therefore have teaching and research experience and ideally significant clinical experience in nursing.</p><p>The distribution between the different activities (academic/research, or even professional) will be adapted according to the holderâ\u0080\u0099s profile.</p><p><strong>What we expect from youâ\u0080¦</strong></p><p>The ideal candidate hired by the University is a teacher-researcher who meets the following criteria:</p><ul><li>Holder of a nursing degree and a doctorate (PhD) with an internationally recognised reputation and research expertise based on the quality of his/her research work as evidenced by international publications in the field of nursing</li><li>Administrative experience and leadership qualities are also essential</li><li>Field experience in nursing education, including theoretical teaching and supervision of trainees</li><li>Experience in nursing research and supervision of research or PhD thesis</li><li>Connection to nursing education departments in universities abroad</li><li>Responsibilities in European nursing societies</li></ul><p><strong>Language profile:</strong></p><p>The University of Luxembourg operates in a multilingual context. The person selected for this position must be fluent in English and in one of the following two languages: French or German. The University encourages its staff to learn another administrative language of Luxembourg and provides access to language courses for this purpose.</p><p><strong>In Short...</strong></p><ul><li>Contract Type: Permanent</li><li>Work Hours: Full Time 40.0 Hours per Week</li><li>Location: Belval</li><li>Job Reference: UOL04702</li></ul><p><strong>How to apply...</strong></p><p>Applications should include:</p><ul><li>Detailed curriculum vitae, including periods of absence from work (or where the effect has been equivalent to absence), including family leave and career breaks</li><li>Letter of motivation</li><li>Record of research work, record of teaching experience, including but not limited to:<ul><li>Full list of publications</li><li>List and brief description of research projects executed during the last 5 (five) years</li><li>List of supervised doctoral theses</li><li>List of teaching activities during the last 5 (five) years</li><li>Proposal of research projects in the framework of the theme and mission of the profile</li></ul></li></ul><p>To ensure full consideration of applications, please apply by February 21st, 2022.</p><p>The University of Luxembourg considers inclusion and diversity as key values. We are fully committed to removing any discriminatory barriers.</p><p><strong>Gender equality:</strong></p><p>The University of Luxembourg is committed to gender equality among its academic staff and aims to remove barriers to the recruitment and career development of female professors. In the event that two candidates present equivalent CVs, the University will give preference to the female candidate in all departments where gender balance is not achieved.</p><p><strong>Further information...</strong></p><p>For further information, please contact Prof. Dr. Jean-Luc BUEB (<a href=\"mailto:jean-luc.bueb@uni.lu\">jean-luc.bueb@uni.lu</a>).</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}