{"url": "https://academicpositions.com/ad/kimep-university/2022/faculty-open-rank-in-operations-management/174578", "title": "Faculty (Open Rank) in Operations Management", "publish_date": "2022-01-28", "deadline": "2022-02-24", "location": "KIMEP University 2 Abay Ave Almaty, Kazakhstan", "city": "N/A", "country": "Kazakhstan", "position": "Management", "field": "Business Administration, Entrepreneurship, Management,", "salary": "N/A", "max_working_hours": "N/A", "employer": "KIMEP University", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><span style=\"color:#212529;\"><i><strong>Department of Management, Marketing &amp; OMIS</strong></i></span></p><p><span style=\"color:#212529;\"><i><strong>Bang College of Business, KIMEP University</strong></i></span></p><p><span style=\"color:#212529;\"><strong>Operations Management Faculty Position Description</strong></span></p><p><span style=\"color:#212529;\">The Bang College of Business invites applications for one faculty position (open rank) in <strong>Operations Management</strong>. Faculty are expected to teach various courses in Operations Management for both undergraduate and graduate programs. The Bang College of Business offers Bachelor, Master, MBA and PhD programs. The appointment is for twelveÂ­months (including vacation period) with a starting date of August 15, 2022. Responsibilities involve teaching in-person and online, research, and service.</span></p><p><span style=\"color:#212529;\"><strong>Minimum Qualifications</strong></span></p><p><span style=\"color:#212529;\">Applicants must have an earned doctorate in <strong>Operations Management</strong> or relevant area from AACSB accredited institutions (ABDs will be considered but must complete their PhD by August 1, 2022). Applicants should have at least 3-5 years of teaching experiences in reputable universities and extensive professional experiences in the field of major areas. Applicants should be able to teach in English. Candidates must have a record of scholarship, which includes published research in refereed journals and/or books. Applicants with industry experience will be given extra consideration.</span></p><p><span style=\"color:#212529;\"><strong>KIMEP University</strong></span></p><p><span style=\"color:#212529;\">KIMEP University is the leading American style, internationally accredited, English language academic institution in the Commonwealth of Independent States. The university provides a world class academic experience and a unique international environment to all its students and faculty. KIMEP was established in 1992 and has built a very strong regional reputation as a leading provider of higher education. The Bang College of Business currently has 29 fullÂ­time. All graduate and undergraduate programs are accredited by at least one recognized international accreditation agency. Academic programs are regularly rated in the top rank of provision by national bodies.</span></p><p><span style=\"color:#212529;\"><strong>Almaty, Kazakhstan</strong></span></p><p><span style=\"color:#212529;\">The city of Almaty is situated at the base of majestic Tien Shan Mountains in Southeast Kazakhstan. About 2 million people live in or near Almaty because it is the financial, cultural, summer and winter sports and cosmopolitan capital of Kazakhstan. Kazakhstan is located in the heart of Eurasia with important commercial inroads bridging Asia and Europe. Boasting the Silk Road of the 21st century, Kazakhstan offers unique positions in oil and gas, economic development, and trade. With a transitioning economy that has witnessed fourÂ­fold growth over the past decade, Kazakhstan's dynamically changing economic, social, educational and cultural environment provides incredible opportunities for significant and original research.</span></p><p><span style=\"color:#212529;\"><strong>Compensation</strong></span></p><p><span style=\"color:#212529;\">Rank and salary are competitive and commensurate with experience and qualifications. Compensation after-tax compares favorably with net salaries in western countries.</span></p><p><span style=\"color:#212529;\">Limited on campus housing is available to rent. In addition to salary, a benefits package includes basic healthcare, reduced tuition rates for KIMEP courses, and subsidy for relocation allowance. New faculty members are provided with a reduced teaching schedule during the first semester. Summer paid teaching is typically available. The salary will be subject to a deduction of 10% income tax.</span></p><p><span style=\"color:#212529;\"><strong>Application Process</strong></span></p><p><span style=\"color:#212529;\">Please submit the following documents to KIMEP University <strong>HR portal: </strong></span><a href=\"https://hr.kimep.kz/en-US/Home/Vacancy/389\" target=\"_blank\"><span style=\"color:#333366;\">https://hr.kimep.kz/en-US/Home/Vacancy/389</span></a></p><ul><li>Filled and submitted application form</li><li>Cover letter that indicates the position applied, how you meet the minimum and preferred qualifications, course(s) you can teach, and salary expectations in KZT gross.</li><li>ShortÂ­listed candidates are required to submit 2 refereesâ\u0080\u0099 names/contact details and if you have the recommendation letters<strong>.</strong></li><li>The teaching evaluation forms for last 2 semesters.</li></ul><p><span style=\"color:#212529;\">Address any questions to: </span><a href=\"mailto:recruitment@kimep.kz\"><span style=\"color:#333366;\">recruitment@kimep.kz</span></a></p><p><span style=\"color:#212529;\"><strong>Closing date for submission of applications: February 24, 2021 (Thursday, 11:59 pm based on Almaty time).</strong></span></p><p><span style=\"color:#212529;\"><i><strong>Personal data provided by applicants will be kept confidential and used for recruitment purpose only.</strong></i></span></p><p><span style=\"color:#212529;\">Only shortÂ­listed candidates will be informed and invited for interviews by BCB search committee.</span></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI0ZmNcLzNkZVwvNGZjM2RlMjFhYjUwN2ZkZmY4NTQ0NGM3OTE4YmY2YjMucG5nIiwiZWRpdHMiOltdfQ=="}