{"url": "https://academicpositions.com/ad/wenzhou-kean-university/2022/2022-assistant-associate-professor-lecturer-in-psychology/173662", "title": "2022 Assistant/Associate Professor/Lecturer in Psychology", "publish_date": "2022-01-05", "deadline": "N/A", "location": "88 Daxue Rd, Ouhai, Zhejiang Province Wenzhou, China", "city": "N/A", "country": "China", "position": "Associate Professor", "field": "Abnormal Psychology, Applied Psychology, Behavioural Science, Biological Psychology, Cognitive Psychology, and 21 moreCommunity Psychology,Developmental Psychology,Differential Psychology,Educational Psychology,Emotion,Evolutionary Psychology,Experimental Psychology,Forensic Psychology,Health Psychology,Intrapersonal Communications,Legal Psychology (Psychology and Law),Media Psychology,Neuropsychology,Organizational Psychology,Personality Psychology,Positive Psychology,Psychoanalysis,Psychophysics,Quantitative Psychology,Social Psychology,Sport Psychology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Wenzhou-Kean University", "job_description": "About Wenzhou-Kean UniversityWenzhou-Kean University (WKU) is approved by the Ministry of Education of China. Launched in 2012, WKU offers a unique model of higher education in partnership with Kean University, a comprehensive, public university in the state of New Jersey that is accredited by the Middle States Commission on Higher Education. WKU sits on approximately 500 beautiful acres and currently enrolls about 3,500 undergraduate students, and it is now in the midst of a rapid growth that will bring enrollment to 7,000 students within the next five years. All instruction is in English, and all curriculum is provided by Kean University. In addition to its current 18 undergraduate programs, WKU has been approved by the Ministry of Education for offering 8 Masterâ\u0080\u0099s and 3 doctorate programs. Wenzhou is one of the most vibrant and economically advanced developed cities on Chinaâ\u0080\u0099s East Coast, located one hour by plane and just over three hours by high-speed train from Shanghai.Wenzhou-Kean University currently offers the following degree programs: Doctor of Educational Leadership (Ed.D.), Biotechnology Science (M.S.), Computer Information Systems (M.S.), Instruction and Curriculum (M.A.), Global Management (M.B.A.), and Architecture (M. Arch.); Finance (B.S.), Accounting (with emphasis on international standards and practices) (B.S.), Global Business (B.S.), Marketing (B.S.), Management (Business Analytics option/ Supply Chain &amp; Information Management option) (B.S.), Economics (B.S.), Graphic Design (B.F.A.), Interior Design (B.F.A), Industrial Design (B.I.D.), Architectural Studies (B.A.), Computer Science (B.S.), Mathematical Sciences (Data Analytics Option) (B.A.), Biology (Cell and Molecular option) (B.S.), Chemistry (B.S.); Earth Science (Environmental Science option) (B.S.); English (English in Global Settings option) (B.A.); Psychology (General option/ Forensic Psychology option)(B.A.); and Communication (Public Relations option) (B.A.). In addition, WKU has a substantial commitment to the teaching of ESL/EFL.&nbsp;About the Job:The College of Liberal Arts at WKU is seeking vibrant candidates to teach Master level courses for Human Behavior and Organizational Psychology. The candidates should be able to teach a range of courses under Individual Processes, Socio-Psychological Processes, Organizational Behavior, and Advanced Abnormal Psychology.&nbsp;We are also seeking candidates to teach a full range of undergraduate Psychology courses including, but not limited to: General Psychology, Professional Psychology, Industrial/Organizational Psychology, Psychological Statistics, Experimental Psychology, Tests and Measurements, Child Psychology and Psychotherapy and Counseling Techniques.&nbsp;&nbsp;In addition to teaching and research, faculty are expected to contribute to the growth of the programs, including, but not limited to: curriculum development, program assessment, student recruitment/advising, office hours, senior project supervision, internship opportunities, research experience for undergraduates.&nbsp;All faculty positions are full-time assignments, effective for the start of the fall 2022 semester.A tenure-track Assistant/Associate Professor is a full time, 10-month employee who teaches 24 credits per academic year (course release is available for grant proposal development and other substantial research initiatives). Candidates will be expected to participate in the full range of faculty responsibilities, including high quality teaching, research, advising; student learning support; service to the university and/or professional community. Tenure-track appointment requires publications in internationally recognized and vigorously peer-reviewed journals on Psychology or other closely related subjects.&nbsp;A Lecturer is a full-time, 12-month employee who teaches 39 credits per year and provides student and learning support services during the assigned period. Lecturers will be expected to provide high quality teaching, student advisement and learning support services, and service to the university and/or professional community; and perform related work as required. Lecturer positions are non-tenure track and may be renewed on an annual basis.Teaching assignments and related responsibilities may include day, evening, weekend and online courses. Interest or experience in using advanced instructional technologies to improve the teaching/learning process is highly desirable. All faculty may be required to teach General Education courses as needed. Opportunities are also available to teach disciplinary support courses. Candidates with an interest in teaching across disciplines are encouraged to apply.&nbsp;Qualifications:A Ph.D. in Psychology or a closely related field is required for tenure-track positions. ABD can be considered with completion prior to the effective date of employment. A Master's degree in Psychology is required for Lecturer positions. A minimum of two years of teaching experience at the post-secondary level and English fluency are required for all positions.&nbsp;Application Information:Review of applications will begin immediately and continue until positions are filled. Please send cover letter, resume, statement of teaching philosophy, research statement describing research interest, past accomplishments in research and research plan (for tenure track positions only), unofficial transcripts and contact information of three professional references by email to Search Committee Chairperson at wkupsych@wku.edu.cn. Official transcripts for all degrees and three current letters of recommendation are required before appointment.&nbsp;Faculty positions at WKU offer:Annual salary is commensurate with qualifications and experience with the range from $60,000-$70,000 for lecturers, $68,000-$75,000 for Assistant Professors; $70,000-$79,000 for Associate Professors. Salary of extraordinary candidates&nbsp;shall be determined on a case by case basis.A well-rounded healthcare coverage, academic travel up to $2,000, housing options and subsidy up to $3,000, home traveling up to $6,000 (2 international round-trip airfares), a reimbursement to cover relocation expenses up to $1,000, shuttle bus to campus for work, and up to 8% front-load retirement benefits with in accordance with completion of years of service with the University.WKU tuition waiver up to 80% for spouse/dependent children of faculty for undergraduate programs.A collegial environment.The opportunity to teach high quality students. About 45% of graduates have been admitted to the graduate schools at the Worldâ\u0080\u0099s Top 50 Universities, and about 60% of graduates at the Worldâ\u0080\u0099s Top 100 Universities.&nbsp;Background Screening:Wenzhou-Kean University conducts background screenings on all job candidates upon acceptance of a contingent offer and may use a third party administrator to conduct background Screenings.We thank all applicants for their interest; however, please note that only shortlisted candidates will be contacted.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Wenzhou-Kean University is a Chinese-American jointly established higher education institution with Independent legal person status and limited liabilities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyODNcLzY0NFwvMjgzNjQ0MTViNjFlMWM1NTViMTU2ZjljNjM5MjZmMTYucG5nIiwiZWRpdHMiOltdfQ=="}