{"url": "https://academicpositions.com/ad/ghent-university/2022/post-doctoral-assistant-22284-department-of-economics/174317", "title": "Post-doctoral assistant (22284) - Department of Economics", "publish_date": "2022-01-21", "deadline": "2022-02-15", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Accounting, Development Economics, Econometrics, Environmental Economics, Finance, and 5 moreFinancial Economics,International Economics,Labour Economics,Macroeconomics,Welfare Economics", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp;&nbsp;&nbsp;â\u0086\u0092&nbsp;&nbsp; Apply until 15/02/2022&nbsp;(DD/MM/YYYY) 23:59 (Brussels time)&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Faculty of Economics and Business Administration&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Department EB21 - Department of Economics&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;&nbsp;AAP temporary appointment - 100%&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Number of openings: 1&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Reference number: 202201/EB21/DA/001&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University is a world of its own. Employing more than 8,000 people, it is actively involved in education and research, management and administration, and technical and social services on a daily basis. It is one of the largest, most exciting employers in the area and offers great career opportunities. With each of its 11 faculties and more than 100 departments offering state-of-the-art study programmes that are grounded in research in a wide range of academic fields, Ghent University is a logical choice for its employees as well as its students.&nbsp;YOUR TASKS&nbsp;The Department of Economics at Ghent University (Belgium) has a vacant position for post-doctoral researcher (â\u0080\u0098post-doctoral assistantâ\u0080\u0099) in one of its key research areas, i.e. â\u0080\u0098banking &amp; financeâ\u0080\u0099, â\u0080\u0098environmental economicsâ\u0080\u0099, â\u0080\u0098international trade, investment and migrationâ\u0080\u0099, â\u0080\u0098labour economics and welfareâ\u0080\u0099, and â\u0080\u0098macroeconomics, policy and econometricsâ\u0080\u0099.&nbsp; In addition, the Department funds a mandate for a post-doctoral researcher from its own resources, also in one of the Department's research areas. We especially encourage candidates with expertise in development economics to apply, because of the many linkages and complementarities of development economics with our key areas. However, candidates from all fields will be considered, the strength of the profile being the main selection criterion.The Department encourages international candidates to apply. The working language in most department activities and in our master programme in economics is English.&nbsp;Your tasks:At least 70% of your assignment will be spent on academic research, targeted at publications in highly ranked peer-reviewed scientific journals.You fulfill other tasks, depending on your profile and own interests. This may include:contribution to education at the Bachelor's or Master's level, e.g. as a (co-)teacher for a course related to your expertise, or as a supervisor of students in the context of exercises, and their Bachelor's or Master's thesis.support for initiatives to strengthen research in the department, e.g. through the guidance of PhD students, or through the acquisition of external research funding.&nbsp;&nbsp;WHAT WE ARE LOOKING FOR&nbsp;You hold a doctoral degree in Economics or in closely related discipline. In the latter case your research has clear added value for (researchers in) economics.For diplomas awarded outside the European Union, a certificate of equivalence (NARIC) must be submitted. The degree requirements need to be fulfilled on August 31 2022 at the latest.You obtained your PhD after 30 September 2017.You have already conducted research within the field of Economics or a closely related discipline relevant for the department (https://www.ugent.be/eb/economics/en/research).You have distinguished yourself as a promising researcher in your doctoral work, as is reflected in relevant scientific publications in (inter)national peer-reviewed academic journals that are widely disseminated.You are profoundly interested in coaching students in the Bachelorâ\u0080\u0099s, Masterâ\u0080\u0099s and/or Advanced Masterâ\u0080\u0099s programmes.Recommended are:International mobility, in particular related to research stays at institutions external to the one where you acquired your PhD;Proof of efforts to professionalize education, e.g. by participating at training programmes for didactic skills.&nbsp;&nbsp;WHAT WE CAN OFFER YOU&nbsp;We offer you a temporary appointment of 3 years. A second appointment of up to 3 years can follow, subject to a favourable evaluation of the first term. Even if you have already been appointed earlier in a first term of up to three years (whether or not at another university and whether or not in the same field of discipline), you can apply.The second appointment does not have to be immediately connected to a first termYour appointment will start on 1 September 2022 at the earliest.Your remuneration will be determined according to salary scale AAP5. More information about our salary scales.All Ghent University staff members enjoy a number of benefits, such as a wide range of training and education opportunities, 36 days of paid leave, bicycle commuting reimbursement, ecocheques, etc. A complete overview of all our fringe benefits (in Dutch).&nbsp;&nbsp;INTERESTED?&nbsp;Apply online through the e-recruitment system before the application deadline (see above). We do not accept late applications or applications that are not sent through the online system.&nbsp;Your application must include the following documents:&nbsp;In the field â\u0080\u0098Cvâ\u0080\u0099: (i) your cv and a list of your relevant scientific publications, and (ii) your job market paper or your best publication&nbsp;(merged into one pdf file)In the field â\u0080\u0098Cover letterâ\u0080\u0099: (i) your motivation letter, and (ii) a research statement, a description of the research you plan to carry out (+/- 2 pages)&nbsp;(merged into one pdf file) &nbsp;In the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of the required degree (if already in your possession). If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field â\u0080\u0098Certificate of equivalenceâ\u0080\u0099: only for diplomas awarded outside the European Union a certificate of equivalence (NARIC) must be submitted. (This can be requested via www.naricvlaanderen.be/en). For diplomas awarded in the UK before January 31st of 2020, a certificate of equivalence is not required.&nbsp;Note that the maximum file size for each field is 10 MB.&nbsp;Two reference letters. These letters should be sent&nbsp;directly (separately) by the advisors to&nbsp;Economics.Vacancies@UGent.be, not later than 15 February 2022. The e-mail should clearly mention the candidateâ\u0080\u0099s name as subject.â\u0080\u008bâ\u0080\u008bâ\u0080\u008bâ\u0080\u008bâ\u0080\u008bâ\u0080\u008bâ\u0080\u008bAs Ghent University maintains an equal opportunities and diversity policy, everyone is encouraged to apply for this position.&nbsp;MORE INFORMATION&nbsp;For more information about this vacancy, please contact prof. Ferdinand Vieider (Ferdinand.Vieider@UGent.be, +32 (0)9/2647881). More information about the Department of Economics can be found on the website https://www.ugent.be/eb/economics/en.Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}