{"url": "https://academicpositions.com/ad/aalborg-university/2022/2021-224-03823-one-or-more-assistant-professors-in-computer-science-with-the-possibility-of-tenure-track/173854", "title": "2021-224-03823 One or More Assistant Professors in Computer Science (with the Possibility of Tenure-track)", "publish_date": "2022-01-12", "deadline": "2022-02-15", "location": "Fredrik Bajers Vej 5 Aalborg, Denmark", "city": "N/A", "country": "Denmark", "position": "Assistant Professor", "field": "Artificial Intelligence, Artificial Neural Network, Big Data, Cyber Security, Data Mining, and 6 moreDatabases,Distributed Computing,Human-computer Interaction,Information Systems (Business Informatics),Machine Learning,Software Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "Aalborg University (AAU)", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>Department of Computer Science at Aalborg Universityâ\u0080\u0099s Technical Faculty of IT is looking to appoint a number of Assistant Professors (with possibility of tenure-track) for our Aalborg and Copenhagen Campus, starting August 1, 2022, or soon after this.</p><h4>JOB DESCRIPTION</h4><p><strong>About the Department</strong><br/>Department of Computer Science at Aalborg University is highly regarded in Denmark among researchers, students, and external partners because of our leading research, education, and collaboration. The department currently has more than 130 scientific staff, 15 administrative staff, and 1300 students.<br/>Our research is recognised internationally and nationally to be at the highest level of excellence according to community standards, prioritizing quality over quantity. We balance applications and theory, and societal and scientific impact, applying research to solve real-world problems, while also conducting foundational research with potential long-term impact. As part of this, we are acknowledged and respected for close collaboration with industry and for applying research to create impact and value for society, in particular within the area of sustainable development.<br/>Our educations are problem-based and recognised for producing highly skilled graduates with very high employability, who are experienced with project work on solving real-world problems in diverse teams and able to think critically about the technologies they develop. In the workplace, we strive for diversity in nationality, culture, and gender, success as a team effort, maintaining an inspiring physical work environment, and ensuring a good work-life balance.<br/>Over the last two years, the department has grown over 35% in scientific staff, hiring more than 25 assistant/associate professors and 7 full professors. This expansion is fueled by the success of our educations and our steady growth in externally funded research projects.<br/>In 2020 we have established a new unit on Aalborg Universityâ\u0080\u0099s Campus in Copenhagen, responsible for establishing a new bachelor's and master's educations in â\u0080\u009cSoftwareâ\u0080\u009d. This unit will over time build its own research profile and capacity, growing to around 20 scientific staff by 2025.<br/>For more about the department see: <a href=\"https://www.cs.aau.dk/about\" target=\"_blank\"><strong>https://www.cs.aau.dk/about</strong></a><br/>For more information about living in Denmark and Aalborg UniversityÂ´s international staff support, see <a href=\"https://www.isu.aau.dk/\" target=\"_blank\"><strong>https://www.isu.aau.dk/</strong></a><br/><strong>About the position</strong><br/>We are looking to further expand our academic capacity with up to 8 new positions within existing strongholds, as well as further develop selected areas of strategic importance. We therefore welcome strong applications in the areas of Computer Science covered by our three research groups, and in particular in the areas of Artificial Intelligence/Machine Learning, Security, Systems Development, and Networks.</p><p>As Assistant Professor in Computer Science, you will be conducting research, teaching and engagement with society at an international standard. Facilitating this, you are associated with one of the departmentâ\u0080\u0099s three research groups, on either the Aalborg or the Copenhagen campus.</p><p><strong>Distributed, Embedded and Intelligent Systems</strong></p><p>This group emphasizes on foundational and logical theories, algorithms and tools for verification and validation, methodologies for real-time and embedded systems, security, networks and operating systems, probabilistic graphical models, machine learning, and programming technologies. <a href=\"http://www.cs.aau.dk/research/distributed-embedded-intelligent-systems/\" target=\"_blank\"><strong>http://www.cs.aau.dk/research/distributed-embedded-intelligent-systems</strong></a></p><p><strong>Database and Web Technologies</strong></p><p>This group emphasizes querying, data mining, and machine learning in two broad areas: data-intensive systems, including spatio-temporal and multidimensional data management and analytics; and web science and knowledge engineering, including graph data management, knowledge graphs, recommender systems. <a href=\"https://www.cs.aau.dk/research/Database-and-Web-Technologies/\" target=\"_blank\"><strong>https://www.cs.aau.dk/research/Database-and-Web-Technologies</strong></a></p><p><strong>Human-Centered Computing</strong></p><p>This group emphasizes on the design, development, and use of interactive computer systems from a human-centered perspective, including software development, human-computer interaction, digitalization, human-centred artificial intelligence, interaction design, user experience, and innovation. <a href=\"http://www.cs.aau.dk/research/human-centered-computing\" target=\"_blank\"><strong>http://www.cs.aau.dk/research/human-centered-computing</strong></a></p><p><strong>Teaching</strong></p><p>If appointed at the Aalborg Campus, your teaching will primarily be on the Computer Science departmentâ\u0080\u0099s own portfolio of educations but may also include other studies at the University. For information on the departmentâ\u0080\u0099s educations, see <a href=\"https://www.cs.aau.dk/education/\" target=\"_blank\"><strong>https://www.cs.aau.dk/education</strong></a></p><p>If appointed at the Copenhagen Campus you will be delivering teaching on the â\u0080\u009cSoftwareâ\u0080\u009d education. Specifically, you should be able to teach one or more of the following subjects:</p><ul><li>Programming</li><li>Interaction Design</li><li>Language and Compilers</li><li>Database systems</li><li>Modelling and cyber-physical systems</li></ul><p>You will also be supervising student groups through problem-based learning (PBL) in the topics of the Software education,  </p><p>All new Assistant Professors will participate in a PBL course during the first semesters of their employment. For more information about PBL at Aalborg University, see <a href=\"https://www.en.aau.dk/about-aau/aalborg-model-problem-based-learning.\" target=\"_blank\"><strong>https://www.en.aau.dk/about-aau/aalborg-model-problem-based-learning.</strong></a></p><p>Documented proficiency in English is also a requirement, and the department may require proof of proficiency in the form of results from a TOEFL iBT test. For more information on language requirements, please see: <a href=\"https://bit.ly/388Y8On\" target=\"_blank\"><strong>https://bit.ly/388Y8On</strong></a><br/>For further information, please contact Head of Department Peter Axel Nielsen, <a href=\"mailto:pan@cs.aau.dk\"><strong>pan@cs.aau.dk</strong></a></p><p><strong>Tenure-track</strong></p><p>Department of Computer Science at Aalborg University offer highly qualified candidates an attractive career path via tenure-track. Tenure-track assistant professors are appointed for a period of six years with the prospect of performance-based promotion to a tenured position as Associate Professor. Tenure-track assistant professors are expected to have international academic standing, demonstrating acclaimed competitive research, and/or have a recognized high potential for future impact.</p><p>If appointed on tenure-track, an internal assessment committee will conduct a mid-term evaluation after 3 years, and an external assessment committee will conduct a final review after 5.5 years. If the final review is positive, the candidate will be offered a tenured position as Associate Professor.</p><p><strong>Qualification requirements</strong></p><p>Appointment as Assistant Professor presupposes scientific academic qualifications at PhD level  or similar scientific qualifications. The research potential of each applicant will be emphasized in the overall assessment.<br/>Appointment as an Assistant Professor cannot exceed a period of four years in total in a temporary position. (appointment at Assistant Professor levet cannot exceed a periode of eight years in total in Denmark).<br/><strong>Application</strong></p><p>If you are interested in this position, we welcome a motivated application containing:</p><ul><li>Clearly stating:<ol><li>which of the 3 research groups you wish to be associated with,</li><li>which campus (Aalborg or Copenhagen) you wish to be located at, and<ul><li>for placement in Copenhagen, which of the listed topics you are able to teach and supervise.</li></ul></li></ol></li><li>Brief statement outlining your reasons for applying, and visions for the position</li><li>Curriculum vitae, including personal data, educational background, scientific qualifications, dissemination skills, participation in committees and boards, and additional qualifications relevant for the position</li><li>Complete publication list</li><li>Up to 5 publications you wish to have considered</li><li>Description of teaching qualifications and portfolio</li><li>Copies of relevant diplomas (PhD, Masters). You may be asked for an official English translation</li><li>References/recommendations</li></ul><p>Shortlisting will be applied. After the review of any objections regarding the assessment committee, the head of department, with assistance from the chair of the assessment committee, selects the candidates to be assessed. All applicants will be informed as to whether they will advance to assessment or not.</p><p><strong>Submission</strong></p><p>Applications can only be submitted online, using the \"Apply online\" button below.</p><p>For further information concerning the application procedure please contact Lisbeth Palmelund by mail <a href=\"mailto:est-st-hr@adm.aau.dk\"><strong>est-st-hr@adm.aau.dk </strong></a>or phone (+45) 9940 7553.</p><p>Aalborg University wishes to reflect the diversity of society and welcomes applications from all qualified candidates regardless of personal background or belief.</p><p>Information regarding guidelines, ministerial circular in force, teaching portfolio and procedures can be seen <a href=\"https://www.vacancies.aau.dk/academic-positions/appointment-and-assessment/application-requirements---academic-positions.cid259144\" target=\"_blank\"><strong>here</strong></a>  </p><h4>AGREEMENT</h4><p>Employment is in accordance with the Ministerial Order on the Appointment of Academic Staff at Universities (the Appointment Order) and the Ministry of Finance's current Job Structure for Academic Staff at Universities. Employment and salary are in accordance with the collective agreement for state-employed academics.</p><h4>VACANCY NUMBER</h4><p>2021-224-03823</p><h4>DEADLINE</h4><p>15/02/2022</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wNVwvYWFsYm9yZy1lbi1sb2dvLmpwZyIsImVkaXRzIjpbXX0="}