{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/research-associate-fellow-fixed-term-part-time/174745", "title": "Research Associate/Fellow (Fixed term, Part time)", "publish_date": "2022-02-01", "deadline": "2022-02-21", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Research Assistant", "field": "Abnormal Psychology, Applied Psychology, Behavioural Science, Biological Psychology, Cognitive Psychology, and 21 moreCommunity Psychology,Developmental Psychology,Differential Psychology,Educational Psychology,Emotion,Evolutionary Psychology,Experimental Psychology,Forensic Psychology,Health Psychology,Intrapersonal Communications,Legal Psychology (Psychology and Law),Media Psychology,Neuropsychology,Organizational Psychology,Personality Psychology,Positive Psychology,Psychoanalysis,Psychophysics,Quantitative Psychology,Social Psychology,Sport Psychology", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference: SCI026522Closing Date: Monday, 21st February 2022Job Type: ResearchDepartment: PsychologySalary: Â£27924 to Â£36382 per annum, pro rata depending on skills and experience (minimum Â£31406 with relevant PhD).This is a re-advertisement for SCI514421, previous applicants need not apply.We are looking for a research Associate/Fellow to join an international collaborative replication study exploring how autistic people communicate with, and learn from, each other.The Opportunity:The research fellow will be responsible for the recruitment and co-ordination of autistic and non autistic adult participants, data collection using innovative experimental methods, and data management in tandem with other data collection sites in the UK and US. They will also contribute to dissemination of results at conferences and in journal publications.Your skills and attributes for success:The ability to recruit autistic and non-autistic research participants, and communicate effectively orally, in writing and electronically with those participantsThe ability to liaise closely with other members of the research team across sitesPositive and progressive attitude to neurodiversity, and enthusiasm and conscientiousness for the projectProblem-solvingExcellent organisational skillsAs a valued member of our team you can expect:An exciting, positive, creative, challenging and rewarding place to work. We give you support, nurture your talent and reward success. You will benefit from a competitive reward package and a wide range of staff benefits, which includes a generous holiday entitlement, a defined benefits pension scheme, staff discounts, family friendly initiatives, flexible working and much more.The role is fixed term until 31/08/2023. Hours of work are part time (29 hours).Informal enquiries may be addressed to Danielle Ropar, 0115 9515288 or email danielle.ropar@nottingham.ac.uk. Please note that applications sent directly to this email address will not be accepted.Our University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileAdditional InformationApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}