{"url": "https://academicpositions.com/ad/lut-university/2022/research-engineer-in-wood-processing-technology-and-biorefinery-technology/174936", "title": "Research engineer in wood processing technology and biorefinery technology", "publish_date": "2022-02-07", "deadline": "2022-02-28", "location": "Yliopistonkatu 34 Lappeenranta, Finland", "city": "N/A", "country": "Finland", "position": "Engineer/Technician", "field": "Bioengineering, Biotechnology, Industrial Engineering, Materials Engineering, Safety Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "LUT University", "job_description": "We are looking for a research engineer for a permanent employment relationship.&nbsp;Your work will primarily be located at the Department of Separation Technology of the LUT School of Engineering Science on the universityâ\u0080\u0099s Lahti campus. New research laboratories are being built on the Lahti campus. We will do research in collaboration with ANDRITZ Oy on areas such as refining wood biomass into fibre products. The operation of the laboratories will start in autumn 2022.The Department of Separation Technology is Finlandâ\u0080\u0099s largest academic research unit specialising in separation and purification technologies. The department operates in Lappeenranta, Lahti and Mikkeli, and it applies method-driven research to water purification, biorefining, mineral enrichment and metal refining.You will work in close cooperation with the departmentâ\u0080\u0099s analysis and technical staff and research groups. The laboratories in Lahti, Lappeenranta and Mikkeli boast a wide and comprehensive range of analysis equipment.Your responsibilities will include tasks related to the operating the laboratory, including areas such as the design and supervision &nbsp;of various tests and analyses, the maintenance and service of test and analysis equipment, and related organisational activities and contacts with partners in cooperation. Initially, your work will also include tasks related to the starting up the activities of the laboratory.We expect you to have an applicable higher education degree, good English skills, a safety-oriented approach to work, and skills to use electrical tools and systems. Finnish skills are an advantage. We prefer several years of experience in experimental work in, for example, refining biomass into fibre products in a laboratory or industrial plant.In addition, we welcome any of the following:experience in the supervision and organisation of laboratory workstudies related to laboratory work, wood processing or biorefineriesexperience in fibre product analyses and testsexperience in process industry research or process developmentexperience in laboratory safety.You will work in close cooperation with other members of your working community and with partners in cooperation, which is why we value advanced collaboration skills. A positive and solution-focused outlook and active communication in a busy environment will help you to carry out your duties successfully.We offer you meaningful work, a highly skilled working community and possibilities for a good work-life balance. We support our employees in maintaining and developing their professional skills.Your salary will be defined in accordance with the university salary system for other staff. The requirement level is 8. In addition, your salary will include a personal element based on job performance; your initial starting salary will be roughly â\u0082¬ 3 250/month. The work will start with a six-month trial period.Submit your application and CV by 28&nbsp;February 2022 Finnish local time (UTC +2 h) through our electronic system.&nbsp;For more information, please contact Assistant Professor (tenure track)&nbsp;Kristian Melin, kristian.melin@lut.fi or +358 50 349 7383. Call on Tuesday 15 February between 13:00 and 15:00 &nbsp;(UTC + 2h) or Thursday 17 February between 10:00 and 12:00 (UTC + 2h). &nbsp;Join our team of trailblazers. Clean energy, water and air are life-giving resources for which we at LUT University seek new solutions with our expertise in technology and business. We help society and businesses in their sustainable renewal. Our international community consists of 6500 members. Our modern campuses are in Lappeenranta and Lahti. Video of our strategy:&nbsp;https://youtu.be/PpFawdT8CDE&nbsp;Technical support for using the recruitment system: recruitment@lut.fi", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "LUT University has been a pioneering scientific university, bringing together the fields of science and business since 1969.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDExXC8xMFwvTFVULUxvZ28xLnBuZyIsImVkaXRzIjpbXX0="}