{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/assistant-associate-professor-of-physics/174807", "title": "Assistant/ Associate Professor of Physics", "publish_date": "2022-02-02", "deadline": "2022-05-02", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Associate Professor", "field": "Accelerator Physics, Acoustics, Applied Physics, Atomic, Molecular and Optical Physics, Biophysics, and 24 moreChemical Physics,Computational Physics,Condensed Matter Physics,Cryogenics,Electromagnetism,Experimental Physics,Fluid Dynamics,Fluid Mechanics,Geophysics,Laser Physics,Materials Physics,Mathematical Physics,Medical Physics,Molecular Physics,Nuclear Physics,Optics,Particle Physics,Photonics,Plasma Physics,Quantum Physics,Solid-state Physics,Theoretical Physics,Thermodynamics,Vehicle Dynamics", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "Faculty Position/ College of Arts &amp; Sciences&nbsp;Why the American University of Iraq â\u0080\u0093 Baghdad?Opening its doors in January of 2021, the new American University of Iraq â\u0080\u0093 Baghdad (AUIB) began as a dream of influential individuals in Iraqi and the United States business, industry and government who want to see a world-class institution of higher learning established in the city, reminiscent of the days when Baghdad was an educational mecca and flourishing capital of the Muslim world.&nbsp; With a great library, palatial college buildings and student centers, state-of-the-art classrooms, laboratories, and athletic facilities, AUIB will be a beautiful campus attracting students, faculty, and staff from throughout the world.&nbsp; We invite you to join us in this exciting new venture.We invite applications and nominations for the position of:Assistant/ Associate Professor of PhysicsThis position will report directly to the Dean of the College of Arts &amp; SciencesJob description/ duties and responsibilities include, but not limited to:Teach basic and advanced physics courses for undergraduate majors in physics and related fields.&nbsp;Set up physics labs and supervise lab instruction.Contribute to ongoing physics program review, assessment, and evaluation.&nbsp;Advise major students on all matters that relate to their course selection and academic success.&nbsp;Participate in department/college meetings, take part in various committees, and assist in recruitment activities.&nbsp;Assist in departmental and programmatic planning and preparations as relevant.&nbsp;Undertake research activities, collaborate with faculty on research projects, and establish research collaborations with external members of the academic community.&nbsp;Be familiar with all the rules, regulations and policies that govern teaching, research, and interactions with members of the university community and always observe them.Qualifications:&nbsp; Candidate must have:PhD in physics from an accredited North American university.Minimum of 3 years of teaching experience post- graduation in a college/ university setting.Familiarity with American system of higher education.&nbsp;Application Procedure:&nbsp;Applications should include:Cover Letter&nbsp;Curriculum VitaPassport First Data PageContact Information For Three (3) Professional ReferencesCopies Of Degrees Or CertificationApplications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately.&nbsp;Please apply through AUIB website OR send your application and supporting documents to the following email address:jobs@auib.edu.iq&nbsp;with&nbsp;Karin.Jesuis@auib.edu.iq&nbsp;in copy.&nbsp;A declaration of a relation at AUIB is obligatoryWe will contact you if you are selected for interview.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "AUIB is a non-profit, private university that is fully accredited in Iraq by the Ministry of Higher Education and Scientific Research, thereby ensuring a high level of academic standards and institutional performance.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}