{"url": "https://academicpositions.com/ad/wenzhou-kean-university/2022/2022-computer-science-assistant-associate-professor-positions/173666", "title": "2022 Computer Science Assistant/Associate Professor Positionsâ\u0080¨", "publish_date": "2022-01-05", "deadline": "N/A", "location": "88 Daxue Rd, Ouhai, Zhejiang Province Wenzhou, China", "city": "N/A", "country": "China", "position": "Associate Professor", "field": "Algorithms, Artificial Intelligence, Artificial Neural Network, Big Data, Computational Sciences, and 25 moreComputer Architecture,Computer Communications (Networks),Computer Graphics,Computer Vision,Computer and Society,Computing in Mathematics, Natural Science, Engineering and Medicine,Computing in Social science, Arts and Humanities,Cyber Security,Data Mining,Data Structures,Databases,Distributed Computing,Game Design,Human-computer Interaction,Informatics,Information Science,Information Systems (Business Informatics),Machine Learning,Machine Vision,Operating Systems,Parallel Computing,Programming Languages,Quantum Computing,Software Engineering,Theory of Computation", "salary": "N/A", "max_working_hours": "N/A", "employer": "Wenzhou-Kean University", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>Wenzhou-Kean University (WKU), located in Wenzhou, China, one of three Sino-American universities along with NYU Shanghai and Duke Kunshan University, is approved by the Ministry of Education of China. Launched in 2012, WKU offers a unique model of higher education in partnership with Kean University, a comprehensive, public university in the state of New Jersey that is accredited by the Middle States Commission on Higher Education. WKU sits on approximately 500 beautiful acres and currently enrolls about 3,500 undergraduate students, and it is now in the midst of a rapid growth that will bring enrollment to 7,000 students within the next five years. All instruction is in English, and all curriculum is provided by Kean University. In addition to its current 18 undergraduate programs, WKU has been approved by the Ministry of Education for offering 8 Masterâ\u0080\u0099s and 3 doctorate programs. Wenzhou is one of the most vibrant and economically advanced developed cities on Chinaâ\u0080\u0099s East Coast, located one hour by plane and just over three hours by high-speed train from Shanghai.</p><p>Wenzhou-Kean University currently offers the following degree programs: Doctor of Educational Leadership (Ed.D.), Biotechnology Science (M.S.), Computer Information Systems (M.S.), Instruction and Curriculum (M.A.), Global Management (M.B.A.), Architecture (M.Arch.), Educational Administration (M.A.), Psychology (M.A.), Finance (B.S.), Accounting (with emphasis on international standards and practices) (B.S.), Global Business (B.S.), Marketing (B.S.), Management (Business Analytics option/ Supply Chain &amp; Information Management option) (B.S.), Economics (B.S.), Graphic Design (B.F.A.), Interior Design (B.F.A), Industrial Design (B.I.D.), Architectural Studies (B.A.), Computer Science (B.S.), Mathematical Sciences (Supply Chain and Management Information option and Analytics Option) (B.A.), Biology (Cell and Molecular option) (B.S.), Chemistry (B.S.); Earth Science (Environmental Science option) (B.S.); English (English in Global Settings option) (B.A.); Psychology (General option/Forensic Psychology option) (B.A.); and Communication (Public Relations option) (B.A.). In addition, WKU has a substantial commitment to the teaching of ESL/EFL.</p><p><strong>About the Job:</strong><br/>All faculty positions are 10-month full-time assignments, with initial appointments starting August 16, 2022. Tenure-track Assistant/Associate Professors are required to teach 24 credits per academic year (course release may be available to faculty for national level grant proposal development or other substantial research initiatives); service to the university and/or professional community; and conduct student engaging research. All instruction is in English and all curriculum is provided by Kean University in USA. English fluency is required.</p><p>Tenure-track candidates should demonstrate scholarly capability and an active research agenda in core areas of computer science, information system, and information technology. The University will provide start-up grants to support the candidates to start their research programs.</p><p><strong>Qualifications:</strong> <br/>A doctorate degree is required in the relevant field(s) for tenure-track positions, including Computer Science, Software Engineering, or other related field; ABD will be considered for the Assistant Professor positions with completion date prior to the effective date of employment. Candidates for the Associate Professor position must be active in their research and communities, with preferences be given to those who serve as editors in reputable journals or as PC members of premier conferences. Tenure track candidates are expected to plan and conduct research and develop extramurally funded research programs involving students, which is essential for the tenure and promotion. Tenure track candidates are also expected to publish peer-reviewed journal articles in impactful journals in fields closely related to computer science. English fluency and ability to teach introductory and intermediate Computer Science courses such as Introduction to Programming in Java/C/C++, Data Structures and Algorithms and Operating Systems are required for all positions. Candidate will also have opportunity of teaching graduate level courses in their fields of interest. Industrial experiences are welcome. In addition to teaching duties, candidates are also expected to contribute to the growth of the programs, including but not limited to curriculum development, program assessment, student recruitment/advisement, senior project supervision, internship opportunities, research experiences for undergraduates (REU), etc.</p><p>Teaching assignments and related responsibilities may include day, evening and online courses. Interest or experience in using advanced instructional technologies to improve the teaching/learning process is highly desirable. All faculty may be required to teach General Education courses as needed. Opportunities are also available to teach disciplinary support courses.</p><p>All candidates must demonstrate a commitment to teaching and best practices in international education. </p><p><strong>Application Information:</strong><br/>Review of applications will begin immediately and continue until the position is filled. Please send <strong>cover letter, resume, statement of teaching philosophy, statement of research goals, unofficial transcripts, three most recent publications (for associate professor position) and contact information of three professional references</strong> by email to Search Committee Chairperson at <a href=\"mailto:wkucomputersci@wku.edu.cn\">wkucomputersci@wku.edu.cn</a>. Official transcripts for all degrees and three current letters of recommendation are required before appointment.</p><p>Faculty positions at WKU offer:</p><ul><li>Annual salary is commensurate with qualifications and experience with the range from $72,000-$85,000 for Assistant Professors; $80,000-$100,000 for Associate Professors. Salary of extraordinary candidates shall be determined on a case by case basis.</li><li>A well-rounded healthcare coverage, academic travel up to $2,000, housing options and subsidy up to $3,000, home traveling up to $6,000 (2 international round-trip airfares), a reimbursement to cover relocation expenses up to $1,000, shuttle bus to campus for work, and up to 8% front-load retirement benefits with in accordance with completion of years of service with the University.</li><li>WKU tuition waiver up to 80% for spouse/dependent children of faculty for undergraduate programs.</li><li>A collegial environment.</li><li>The opportunity to teach high quality students. About 45% of graduates have been admitted to the graduate schools at the Worldâ\u0080\u0099s Top 50 Universities, and about 60% of graduates at the Worldâ\u0080\u0099s Top 100 Universities.</li><li>Extraordinarily strong candidates at Professor level may be considered for a special research track position with high research output expectations, low teaching load, generous research start-up funding, a 10-month salary of RMB 0.8-1.0 million (about USD $125-158K), and RMB 1 million in housing subsidy.</li></ul><p><strong>Background Screening:</strong><br/>Wenzhou-Kean University conducts background screenings on all job candidates upon acceptance of a contingent offer and may use a third-party administrator to conduct background Screenings.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyODNcLzY0NFwvMjgzNjQ0MTViNjFlMWM1NTViMTU2ZjljNjM5MjZmMTYucG5nIiwiZWRpdHMiOltdfQ=="}