{"url": "https://academicpositions.com/ad/university-of-agder-uia/2022/postdoctoral-research-fellow/174922", "title": "Postdoctoral Research Fellow", "publish_date": "2022-02-04", "deadline": "2022-03-10", "location": "Gimlemoen 25 Kristiansand, Norway", "city": "N/A", "country": "Norway", "position": "Postdoc", "field": "Applied Linguistics, Philology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Agder (UiA)", "job_description": "About the positionA fixed-term 100 % position is available at the University of Agder, Faculty of Humanities and Education, as a Post-Doctoral Research Fellow affiliated to the Department of Foreign Languages and Translation, for a period of two years. The position is located at the University of Agderâ\u0080\u0099s Kristiansand campus. The starting date is according to agreement. About the Faculty:h ttps://www.uia.no/en/about-uia/faculties/faculty-of-hhumanities-and-educationThe position is affiliated with the research group Agder Forum for Translation Studies (AFO): https://www.uia.no/en/research/humaniora-og-pedagogikk/agder-forum-for-translation-studies. The research group was established in 2019 and is in a process involving both expansion and consolidation as it establishes itself in national and international arenas. The fellowship will contribute to further strengthening the research activity of the group.ResponsibilitiesThe primary responsibility of the postdoctoral research fellow will be the successful completion of a two-year research project. In addition, the successful applicant is expected to contribute to the ongoing development of the research group, also in its function of supporting the Masterâ\u0080\u0099s programme in Translation and Professional Communication. This development effort includes organising seminars, participating in national and international research and professional events, contributing to public engagement activities, and generally promoting the research group and its activities. Supporting the MA programme may involve participating in student research seminars, contributing a small number of lectures on specific areas of expertise, and supporting programme development initiatives. &nbsp;Required qualificationsA PhD degree in Translation Studies or in a related field with a relevant translation-oriented dissertation and/or a publication record of relevance to Translation Studies.Candidates must have obtained their doctorate or have submitted their doctoral thesis before the appointment decision is made and must have defended their thesis by the starting date.A plan for a postdoctoral research project within Translation Studies. Postdoctoral projects drawing on Cognitive Translation Studies will be particularly welcome, although the competition is open to all other strands of scholarship in Translation Studies.Excellent proficiency (written and oral) in English.Further provisions relating to the positions as Post-Doctoral Research Fellows can be found in the Regulations Concerning Terms and CConditions of Employment for the post of Post-Doctoral Research Fellow, Research Fellow, Research Assistant and Resident.Desired qualificationsDocumented record of international publicationExperience in developing grant proposalsUnderstanding of and ability to contribute to public engagement activitiesExperience in working collaborativelyPersonal qualitiesGood communication and teamwork skills, scientific curiosity and creativity, interest and motivation, attention to detail, commitment and concentration, patience.Personal qualities and suitability for the position will be emphasised.We offerprofessional development in a large, exciting and socially influential sorganisationa positive, inclusive and diverse working environmentmodern facilities and a comprehensive set of welfare offersmembership of the Norwegian Public Service Pension FundMore about working at UiAThe position is remunerated according to the State Salary Scale, salary plan 17.510, code 1352, NOK 563&nbsp;900 â\u0080\u0093 594&nbsp;300, gross salary per year. Higher salary grades may be considered for particularly well-qualified applicants. A compulsory pension contribution to the Norwegian Public Service Pension Fund is deducted from the pay according to current statutory provisions.General informationUiA&nbsp;is an open and inclusive university. We believe that diversity enriches the workplace and makes us better. We, therefore, encourage qualified candidates to apply for the position independent of gender, age, cultural background, disability or an incomplete CV.Women are encouraged to apply for the position.The successful applicant will have rights and obligations in accordance with the current regulations for the position, and organisational changes and changes in the duties and responsibilities of the position must be expected. The appointment is made by the University of Agderâ\u0080\u0099s Appointments Committee for Teaching and Research Positions.Short-listed applicants will be invited for an interview. With the applicantâ\u0080\u0099s permission, UiA will also conduct a reference check before the appointment. Read more about the employment process.In accordance with the Freedom of Information Act Â§ 25 (2), applicants may request that they are not identified in the open list of applicants. The University, however, reserves the right to publish the names of applicants. Applicants will be advised of the Universityâ\u0080\u0099s intention to exercise this right.ApplicationThe application and any necessary information about education and experience (including diplomas and certificates) are to be sent electronically. Use the link â\u0080\u009cApply for this jobâ\u0080\u009d.The following documentation must be uploaded electronically:An application letter in English that addresses the desired qualifications for the position as described aboveA curriculum vitae in English, including a complete list of publicationsCertificates with gradesA brief project proposal describing the postdoctoral project the applicant wishes to pursue (2,500 words ex. references).Up to 5 publications or academic articles (including the Doctoral thesis)List of reference persons: 2-3 references to be contacted at the final stage of the application processThe applicant is fully responsible for submitting complete digital documentation before the closing date. All documentation must be available in a Scandinavian language or in English.Application deadline: 10 March 2022.ContactFor questions about the position:Professor Sandra L. Halverson, sandra.l.halverson@uia.noFor questions about the application process:Head of Department Tale M. Guldal, tale.guldal@uia.no", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University was officially established in 2007, but has a history dating back to 1839, and was formerly known as Agder University College.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjNWRcLzYyOFwvYzVkNjI4MGVhN2ZjMjA3MDU2ZWRkZjU0YjAwMGRlNzYucG5nIiwiZWRpdHMiOltdfQ=="}