{"url": "https://academicpositions.com/ad/western-university/2022/director-of-lawrence-national-centre-for-policy-and-management/174502", "title": "Director of Lawrence National Centre for Policy and Management", "publish_date": "2022-01-27", "deadline": "2022-02-28", "location": "1151 Richmond St London, Canada", "city": "N/A", "country": "Canada", "position": "Management", "field": "Business Administration, Business Economics, Management, Public Administration, Public Economics, and 1 morePublic Policy", "salary": "N/A", "max_working_hours": "N/A", "employer": "Western University", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>The <a href=\"https://www.ivey.uwo.ca/\" target=\"_blank\"><strong>Ivey Business School</strong></a><strong> </strong>at Western University, London, Ontario invites applications for the position of Director of the <a href=\"https://www.ivey.uwo.ca/lawrencecentre/\" target=\"_blank\"><strong>Lawrence National Centre for Policy and Management</strong></a>. This endowed position is funded by a generous donation from the late Jack Lawrence, HBA â\u0080\u009956. The Director will lead research initiatives and academic programming that support the development of evidence-based public policy in Canada. They will provide leadership in thinking critically about the future of public policy related to business and management, and in developing innovative educational programs.</p><p>The <strong>Lawrence National Centre for Policy and Management </strong>is an independent public policy centre that aims to strengthen connections between business and government. Since the founding of the Centre in 2001, it has contributed significantly to policy dialogue and development across several policy areas, including advanced manufacturing, trade, environment, competition, infrastructure development, taxation and fiscal issues. The Centre benefits from an engaged <a href=\"https://www.ivey.uwo.ca/lawrencecentre/about-us/advisory-council/\" target=\"_blank\">Advisory Council</a> that provides support and guidance.</p><p>The Director will be appointed as a faculty member at the Associate or Full Professor level. A Limited Term appointment may also be considered, with the rank determined by qualifications and experience. The ideal candidate will have a PhD in economics, business, or a related social science discipline, an accomplished academic publication record, and/or extensive career experience at senior leadership levels in government. They will be a recognized academic and/or practitioner expert in the area of public policy and business. Prior administrative experience is also an asset. The position is available to begin on July 1, 2022, although alternate start dates may be arranged. The initial appointment for the role of Director will be up to a five-year term, with the potential for renewal. </p><p>The Lawrence National Centre Director will act as a thought leader related to Canadaâ\u0080\u0099s economic competitiveness. As a forward-thinking innovator in the field of public policy and business, the Director thinks critically about the public sectorâ\u0080\u0099s influence on Canadaâ\u0080\u0099s future economy. The Centre Director is a champion for the School while also being responsible for advancing excellence in research, teaching and learning. They are also responsible for the development, delivery and ongoing review of innovative programs and initiatives within the Centre. Along with in-depth knowledge of public policy, the Lawrence National Centre Director brings outstanding communication and relationship building skills, as well as being a visionary leader with the ability to share their knowledge with faculty in all program areas.  Personal characteristics include someone who is highly creative, innovative, and enjoys working with colleagues across disciplines to support faculty to develop their public policy understanding through showcasing new strategies, best practices and innovations.</p><p>Tenured Appointment: Applicants for a tenured appointment at the rank of Associate or Full Professor will hold a PhD or other earned Doctorate. The successful candidate will be an internationally recognized scholar in their field, as demonstrated by publications in the highest quality academic journals, an active continuing research program, external research funding, scholarly awards, and invited presentations at seminars and major conferences. Preference will be given to candidates who provide evidence of strong teaching at the undergraduate and graduate level. </p><p>Limited term: Applicants are expected to have a PhD or related graduate degree plus significant relevant experience as a practitioner expert in the area of public policy and business. </p><p>Application Procedure: The Recruitment Committee is being assisted in its search by Katherine Frank and Mark Gillis from Knightsbridge Robertson Surrette (KBRS). Applicants are encouraged to submit the following materials to <a href=\"http://www.kbrs.ca/Career/14899\" target=\"_blank\">www.kbrs.ca/Career/14899</a>:<u> </u></p><ul><li>Completed application form<i> (</i><a href=\"http://www.uwo.ca/facultyrelations/faculty/Application-FullTime-Faculty-Position-Form.pdf\" target=\"_blank\"><i>http://www.uwo.ca/facultyrelations/faculty/Application-FullTime-Faculty-Position-Form.pdf</i></a><i>)</i></li><li>Cover letter</li><li>Curriculm vitae</li><li>Copies of research papers and/or reports</li><li>Names and email addresses of three referees (who will not be approached without permission)</li></ul><p><i>Please ensure that the application form is completed and included in your application submission. </i>All materials will be provided to the Recruitment Committee. Review of applicants will commence on <strong>February 28, 2022. </strong>Applications will be considered until the position is filled.</p><p>To learn more about this opportunity, contact Katherine Frank (<a href=\"mailto:kfrank@kbrs.ca\">kfrank@kbrs.ca</a>) or Mark Gillis (<a href=\"mailto:mgillis@kbrs.ca)\">mgillis@kbrs.ca)</a> at KBRS.</p><p>The <strong>Ivey Business Schoolâ\u0080\u0099s</strong> mission is to develop leaders who think globally, act strategically and contribute to the societies within which they operate. Ivey is committed to values and practices of equity, diversity and inclusion. It is Canadaâ\u0080\u0099s premier business school and is recognized globally for the quality of its research and management education. The School is internationally oriented in terms of research, curricula, faculty, and student exchanges, with campuses in London (Canada), Toronto and Hong Kong. Ivey is the worldâ\u0080\u0099s second largest producer of case studies.</p><p><strong>Effective September 7, 2021, all employees and visitors to campus are required to comply with Western's </strong><a href=\"https://www.uwo.ca/univsec/pdf/policies_procedures/section3/mapp311_covid19.pdf\" target=\"_blank\"><strong>COVID-19 Vaccination Policy</strong></a><strong>.  </strong></p><p>Western University has recently committed $6 million in funding for EDI initiatives (<a href=\"https://news.westernu.ca/2021/06/western-invests-6-million-to-support-new-edi-initiatives/\" target=\"_blank\">https://news.westernu.ca/2021/06/western-invests-6-million-to-support-new-edi-initiatives/</a>). Ivey has established an EDI Advisory Council and launched a series of initiatives to ensure that our faculty, staff and students are a diverse community, committed to long-term career development. We especially encourage applicants from under-represented populations to apply. Spousal and family relocation assistance programs are in place. <i>The University invites applications from all qualified individuals. Western is committed to employment equity and diversity in the workplace and welcomes applications from women, members of racialized groups/visible minorities, Aboriginal persons, persons with disabilities, persons of any sexual orientation, and persons of any gender identity or gender expression.</i></p><p><i>Positions are subject to budget approval. Applicants should have fluent written and oral communication skills in English. </i></p><p><i>In accordance with Canadian Immigration requirements, priority will be given to Canadian citizens and permanent residents. </i></p><p><i>Accommodations are available for applicants with disabilities throughout the recruitment process. If you require accommodations for interviews or other meetings, please contact </i><a href=\"mailto:accommodate@kbrs.ca\"><i>accommodate@kbrs.ca</i></a><i>. </i></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJmNDFcLzQzOFwvZjQxNDM4OGIxYjJjMmU1NGEwMWNhZDgxOGVmYmNiOWIuZ2lmIiwiZWRpdHMiOltdfQ=="}