{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/research-assistant-fixed-term/174712", "title": "Research Assistant (Fixed term)", "publish_date": "2022-02-01", "deadline": "2022-03-02", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Research Assistant", "field": "Experimental Psychology, Medical Imaging, Neuropsychology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference SCI020122Closing Date Wednesday, 2nd March 2022Job Type ResearchDepartment PsychologySalary Â£27924 to Â£30497 per annum (pro-rata if applicable) depending on skills and experience. Salary progression beyond this scale is subject to performance.The School of Psychology, University of Nottingham, is seeking to appoint a Research Assistant to assist Professor Stephen Jackson and colleagues with an NIHR-funded research programme being conducted within the Nottingham Biomedical Research Centre. &nbsp;The position is available until 30th November 2022 and will involve a range of duties, including but not limited to: assisting with participant recruitment; assessment of research participants using standard assessments (training will be given where needed); assisting with experimental studies using brain stimulation and/or brain imaging techniques (training and supervision would be provided where necessary); and data analysis. This post would suit an individual with a first degree in Psychology or preferably a masters degree in Psychology or a closely related subject.Hours of work are full time (36.25 hours). Job share arrangements maybe considered.Informal enquiries may be addressed to Stephen.jackson@nottingham.ac.uk. Please note that applications sent directly to this email address will not be accepted.Our University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileAdditional InformationApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}