{"url": "https://academicpositions.com/ad/dalhousie-university/2022/tenure-stream-assistant-professor-of-computer-science-3-positions-designated-for-women/173652", "title": "Tenure-Stream Assistant Professor of Computer Science (3 positions; designated for women)", "publish_date": "2022-01-05", "deadline": "2022-02-28", "location": "Halifax Halifax, Canada", "city": "N/A", "country": "Canada", "position": "Assistant Professor", "field": "Algorithms, Artificial Intelligence, Artificial Neural Network, Big Data, Computational Sciences, and 25 moreComputer Architecture,Computer Communications (Networks),Computer Graphics,Computer Vision,Computer and Society,Computing in Mathematics, Natural Science, Engineering and Medicine,Computing in Social science, Arts and Humanities,Cyber Security,Data Mining,Data Structures,Databases,Distributed Computing,Game Design,Human-computer Interaction,Informatics,Information Science,Information Systems (Business Informatics),Machine Learning,Machine Vision,Operating Systems,Parallel Computing,Programming Languages,Quantum Computing,Software Engineering,Theory of Computation", "salary": "N/A", "max_working_hours": "N/A", "employer": "Dalhousie University ", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>The Faculty of Computer Science at Dalhousie University (https://www.dal.ca/faculty/computerscience.html) invites applications for up to three tenure-stream Assistant Professor positions in any area of research focus for the Faculty (https://www.dal.ca/faculty/computerscience/researchindustry/fcs_research.html). <br/> </p><p>In the Faculty of Computer Science, we are committed to having both a diverse student body and a diverse group of professors and instructors, and to creating an inclusive environment that supports all members of our community. The goal of the three advertised positions is to take an important step towards addressing the underrepresentation of women in Computer Science. Therefore, this position is restricted to candidates who self-identify as women. </p><p><strong>About the Faculty of Computer Science:  </strong>The Faculty has research clusters in Big Data Analytics, Artificial Intelligence &amp; Machine Learning, Human-Computer Interaction, Visualization &amp; Graphics, Systems, Networks &amp; Security, Algorithms &amp; Bioinformatics, and Computer Science Education. More information is available at <a href=\"https://www.dal.ca/faculty/computerscience/researchindustry/fcs_research.html\" target=\"_blank\"><strong>https://www.dal.ca/faculty/computerscience/researchindustry/fcs_research.html</strong></a>. </p><p>Dalhousieâ\u0080\u0099s Faculty of Computer Science offers a supportive, inclusive, multicultural, research-oriented environment with a firm commitment to justice, equality, diversity, and inclusion. The Faculty offers reasonable teaching loads (with excellent TA support), and competitive pay and benefits (including health insurance, dental insurance and an exceptional pension plan). The Faculty supports new hires with moving assistance and start-up funding. Early-career researchers will enjoy the collaborative lab environment; mentoring; peer support for teaching, research, and grant writing; and extensive ties to local industry. </p><p>The Faculty of Computer Science is a research-intensive unit that currently comprises over 50 faculty members, including Tier I and Tier II Canada Research Chairs, a CIFAR AI chair, and many cross-appointments and adjunct faculty members. We are a fast-growing faculty in the university, with approximately 1400 students, one third of whom are graduate students at the Masterâ\u0080\u0099s or Doctoral level. The Faculty of Computer Science offers research-intensive and applied training at the undergraduate, Masterâ\u0080\u0099s, PhD, and postdoctoral levels, including the new Master of Digital Innovation program. The Faculty hosts the </p><p>Dalhousie Institute for Big Data Analytics, which has academic and industry partnerships centred on deep learning and artificial intelligence. The Faculty is also an integral partner of the recently launched <a href=\"https://www.herewecode.ca/\" target=\"_blank\"><strong>Here We Code</strong></a> initiative to grow the digital economy in Nova Scotia. </p><p><br/><strong>About Dalhousie University:  </strong>Dalhousie University is located in Halifax, Nova Scotia (http://www.discoverhalifaxns.com), which is the largest city in Atlantic Canada and affords its residents a high quality of life. Dalhousie University is a leading academic and research institution in Atlantic Canada and a member of the U15 research-intensive universities in Canada. </p><p>Dalhousie University is committed to fostering a collegial culture grounded in diversity and inclusiveness. In keeping with the principles of employment equity and with the aim of correcting historic underrepresentation, this position is restricted to candidates who self-identify as women. Dalhousie recognizes that candidates may self-identify in more than one equity-seeking group, and in this spirit, encourages applications from Indigenous persons (especially Miâ\u0080\u0099kmaq), persons with a disability, racialized persons, including persons of Black/African descent (especially African Nova Scotians), persons of a minority sexual orientation and/or gender identity. For more information, please visit <a href=\"http://www.dal.ca/hiringfordiversity\" target=\"_blank\"><strong>www.dal.ca/hiringfordiversity</strong></a>.<br/> </p><p><strong>Qualifications: </strong> The successful candidate will demonstrate a strong commitment to and aptitude for both research and teaching, will be an outstanding scholar who holds or will have completed a PhD in Computer Science or a related area by the appointment date, and should have demonstrated potential to establish independent scholarly research. Evidence of a strong publication record is essential. The ideal candidate will be open to collaborative research within the Faculty and across campus. The successful candidate will teach both undergraduate and graduate courses, develop graduate-level courses, and support the Facultyâ\u0080\u0099s initiatives. The applicant will be expected to establish a strong externally funded research program, supervise graduate student research, and foster existing and new collaborations with NGOs, government, and/or industry, as well as with members of Dalhousieâ\u0080\u0099s research community. </p><p><strong>Application process:  </strong>A complete application will include a cover letter, curriculum vitae, statements of research and teaching interests, sample publications, and the names, email addresses and physical addresses of three referees.  <br/>Applicants are encouraged to indicate in their research statement how they see their research fit in one or more of the Facultyâ\u0080\u0099s research focus areas. Candidates should also be prepared to have their referees forward their letters of reference upon request. </p><p>Review of applications will begin February 1st, 2022 and will continue until positions are filled. </p><p>All application materials should be submitted directly at http://dal.peopleadmin.ca/postings/7541 except for the letters of reference.  Candidates should be prepared to have their referees forward their letters of refence upon request.   <br/>All qualified candidates are encouraged to apply; however, Canadians and permanent residents will be given priority. The successful candidate will be required to provide proof of full vaccination or may seek an accommodation from Dalhousieâ\u0080\u0099s vaccine requirements on grounds <a href=\"https://humanrights.novascotia.ca/know-your-rights/individuals\" target=\"_blank\"><strong>protected under provincial human rights legislation</strong></a>. Visit the <a href=\"https://www.dal.ca/covid-19-information-and-updates/covid-19-resources/campus-check-vaccination-and-testing-requirements.html\" target=\"_blank\"><strong>Campus Check website</strong></a> for more information.<br/><i>The successful candidate will be required to provide proof of full vaccination or may seek an accommodation from Dalhousieâ\u0080\u0099s vaccine requirements on grounds </i><a href=\"https://humanrights.novascotia.ca/know-your-rights/individuals\" target=\"_blank\"><i><strong>protected under provincial human rights legislation</strong></i></a><i>. Visit the </i><a href=\"https://www.dal.ca/covid-19-information-and-updates/covid-19-resources/campus-check-vaccination-and-testing-requirements.html\" target=\"_blank\"><i><strong>Campus Check website</strong></i></a><i> for more information.</i></p><p><strong>Open Date</strong> 12/21/2021</p><p><strong>Close Date </strong>02/28/2022</p><p><strong>Open Until Filled</strong> Yes</p><p><strong>Quick Link for Direct Access to Posting</strong> http://dal.peopleadmin.ca/postings/7541</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE1XC8wM1wvZGFsaG91c2llLWxvZ28yLmpwZyIsImVkaXRzIjpbXX0="}