{"url": "https://academicpositions.com/ad/coventry-university/2022/assistant-professor-in-international-business-management/174416", "title": "Assistant Professor in International Business Management", "publish_date": "2022-01-25", "deadline": "2022-02-24", "location": "Priory Street Coventry Coventry, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Assistant Professor", "field": "Business Administration, Business Economics, Entrepreneurship, International Economics, Management,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Coventry University", "job_description": "School of Strategy and Leadership,Faculty of Business and LawAssistant Professor in International Business ManagementGrade 8 Â£40,927 â\u0080\u0093&nbsp;Â£58279 per annumRole: Full time and Permanent&nbsp;We are seeking an Assistant Professor (Senior Lecturer) in International Business Management for the School of Strategy and Leadership.&nbsp;Coventry University is achieving an unprecedented level of success. Having earned a place in the 2019 Times Higher Education (THE) Young University Rankingsâ\u0080\u0099 world top 250, secured 15th spot in the 2020 Guardian league table, and achieved a gold rating in the UK governmentâ\u0080\u0099s 2017 Teaching Excellence Framework (TEF), our vision is to continue&nbsp;to enhance our position as a leading global provider of innovative education and impactful research.The Faculty of Business and Law is a key part of this dynamic and innovative University Group, with excellent links to major national and international organisations and close partnerships with universities around the world; we are currently home to around 8,500 students, of whom 40% are international.&nbsp; If you are a talented and ambitious individual who thrives on challenge, this could be your next move.&nbsp;The School of Strategy and Leadership is one of four schools in the Faculty of Business and Law and is home to subject disciplines in International Business Management, Strategy, Leadership, Project Management, Decision Making, Logistic and Risk Management. The School is the largest in the Faculty and is comprised of a wide range of programmes and an increasing number of activities in the area of enterprise and innovation.&nbsp; Our collaborative and supportive ethos builds a strong community of academics and makes it a place where people want to work. We have made significant investment in staff areas and resources to create a modern working environment, which also allows colleagues the freedom to build their own communities on campus and online in virtual settings.The Faculty has two vibrant centres, producing world leading research&nbsp;- Centre&nbsp;for Business in Society and Centre for Financial and Corporate and Financial Integrity. Successful candidates who are established independent researchers may be eligible to join a Centre immediately as an Associate Member.In addition to teaching and research, there are also opportunities for career progression through internationalisation and enterprise tracks.&nbsp;To support these ambitious plans, we are seeking new talent to join our expanding team.If you share our values and ambition and want to be part of this vibrant academic community, we look forward to hearing from you.&nbsp;To fulfil this role, you will need a PhD or an equivalent, in a relevant subject, and have a record of accomplishment in teaching and/or scholarship and/or research and/or enterprise.&nbsp;All Applicants must complete our online application form, but may include a CV and covering letter.&nbsp;For further information or for an informal discussion, please contact Curriculum Lead (Associate Professor) Suresh George aa3262@coventry.ac.ukClosing date: 24/02/22", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Coventry University is one of the top universities for working with business and are proud to be seen as a â\u0080\u0098business facingâ\u0080\u0099 university. Our commercial activities are delivered through our trading subsidiaries.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE1XC8wM1wvY292ZW50cnktdW5pLWxvZ28uanBnIiwiZWRpdHMiOltdfQ=="}