{"url": "https://academicpositions.com/ad/ghent-university/2022/professor-in-doping-and-steroid-analysis-bof-21620-faculty-of-medicine-and-health-sciences/174239", "title": "Professor in Doping and Steroid Analysis (BOF) (21620) - Faculty of Medicine and Health Sciences", "publish_date": "2022-01-19", "deadline": "2022-03-01", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Assistant Professor", "field": "Clinical Sciences, Endocrinology, Gastroenterology, Health Science, Medical Technology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Apply until 01/03/2022&nbsp;23:59 (Brussels time)&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Discipline: Doping and Steroid Analysis&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;&nbsp;100% Full professor / Senior full professor&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Reference number: 202111/GE/ZAP-BOF/014&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University is one of the most important education and research institutions in the Low Countries. On a daily basis, over 9,000 staff members and 41,000 students implement its motto \"Dare to Think\". Ghent University's mission statement is characterised by qualitative education, internationally renowned research and a pluralistic social responsibility.&nbsp;&nbsp;ASSIGNMENT&nbsp;This position in the rank of assistant professor, funded by the Special Research Fund, is a tenure track appointment for a period of 5 years with a focus on research and with a teaching load limited to no more than 8 ECTS credits per semester on average over a period of 3 years. For the further development of the academic career, please see â\u0080\u0098Appointment informationâ\u0080\u0099 below.&nbsp;Academic educationYou lecture various course units in the discipline of chromatography-mass-spectrometry&nbsp;In addition to subject-specific assignments, you also take on more generic teaching assignments. You also supervise masterâ\u0080\u0099s theses within the Faculty. The assignment can evolve according to needs and changes.&nbsp;Academic ResearchYou conduct research in the discipline of Chromatography â\u0080\u0093 Mass Spectrometry and can continue previously established research activities and/or join research activities within the department of Diagnostic SciencesResearch in this domain relates to:Development of innovative analytical methods to detect and dose products used in doping (anabolic steroids, stimulants, diuretics, peptides, proteins, hormones, etc.);Investigation of the metabolism of these substances, to discover more specific markers or to extend the detection time;Investigation of the kinetics and metabolism of endogenous substances, in order to distinguish administration of these substances (or precursors) from normal; metabolism. Research on the biological passport of athletes, including the factors that influence the parameters that are studied.&nbsp;Academic servicesYou take part in the internal and external service provision of the department of Diagnostic Sciences, amongst others by translating the results of your research to the broader public. &nbsp;During your career, you are willing to include roles and management positions that are relevant to the department and/or faculty.&nbsp;PROFILE&nbsp;ExperienceYou have already conducted excellent academic research in the given discipline, which is clearly reflected in outstanding publications in national and international peer-reviewed books and/or journals;Experience in supervising research and/or coaching Ph.D. students;You are didactically skilled to teach university students to develop academic competences;Recommended are:Experience in supervising research and/or coaching Ph.D. students;International mobility, among other things thanks to research stays at institutions external to the&nbsp; one where you acquired your highest academic degree;Positively evaluated experience in provided or organised academic lecturing;Professionalisation of education;Having access to existing networks and contacts providing clinical relevant research cases and clinical materials;Broad experience with â\u0080\u0098Chromatography â\u0080\u0093 Mass Spectrometry on Human Matrices and broad experience with detection of doping agents;Experience in medically relevant and translational scientific research in the field of Chromatography â\u0080\u0093 Mass Spectrometry.&nbsp;Skills / AttitudeYou are quality-oriented;You have experience of working in an accredited environment;You take initiative;You have good didactic skills;You are a team player;You have good organisational, interpersonal and communication skills;You develop leadership in your area of expertise;You have an excellent capacity to acquire funds and grants for scientific research.&nbsp;Admission requirementsYou hold a thesis-based doctorate or a diploma or certificate that is recognised as equivalent (article V.20 Codex Higher Education), demonstrating experience in the field of the vacancy.&nbsp;Upon evaluation of a foreign (non-EU) diploma, a certificate of equivalence may still have to be requested at NARIC. If this is the case, we advise you to initiate this recognition procedure as soon as possible. You are required to have the recognition no later than on the date of your appointment.&nbsp;You have at least two years of postdoctoral experience on 1 September 2022. This term of two years is determined by the date written on the above-mentioned required diploma.&nbsp;&nbsp;APPOINTMENT INFORMATION&nbsp;We offer you a permanent appointment in the starting grade of full professor or senior full professor, without prejudice to the possibility of a temporary appointment offered in article V.28 of the Codex of Higher Education. During the first period of 5 years, your focus is primarily on research. Subsequently, the time devoted to research, education and academic services may be altered.&nbsp;The recruitment is possible no sooner than 1 September 2022.&nbsp;&nbsp;OUR OFFER&nbsp;The career and evaluation policy for Professorial Staff is based on talent development and growth, prioritizing vision development and strategy - at the personal as well as the group level. At UGent we focus on career support and coaching of the Professorial Staff in the different phases of the career. More information can be found on www.ugent.be/en/work/mobility-career/career-aspects/professorial-staff&nbsp;Ghent University is committed to properly welcoming new professorial staff members and offering them appropriate guidance. The basic teacher training and courses of 'Dutch' and 'English' for foreign-speaking lecturers are only a few examples of our wide range of training and education opportunities. Furthermore, each Ghent University staff member can count on a number of benefits such as a bike allowance, reimbursement of public transport commuting costs, daycare, a wide range of sports facilities and EcoCheques. A complete overview of all our employee benefits (in Dutch).&nbsp;Ghent University also invests in welcoming international professorial staff. It offers various housing options, a relocation bonus, the International School for school-aged children (with a discount on the tuition fee), support when registering at the City of Ghent, support with the procedure of family reunification and other administrative matters in connection with moving to Ghent. More information can be found on www.ugent.be/en/work/talent.&nbsp;Candidates who are newly appointed at Ghent University with an appointment as autonomous academic staff of at least 50% or candidates whose appointment as autonomous academic staff at Ghent University is increased to a minimum of 50% receive a Starting Grant of â\u0082¬210.000 to contribute towards the personnel, operating and/or equipment costs of establishing a research team.&nbsp;&nbsp;GENDER AND DIVERSITY&nbsp;Ghent University conducts an equal opportunities policy and encourages everyone to apply. Ghent University also strives for a gender balance in which a maximum of 60% of the academic staff with a PhD degree is of the same gender. Female applications are thus especially welcomed.&nbsp; As long as this goal is not achieved at the level of the group of scientific disciplines involved, the university board will in principle, for positions within this group, give priority to candidates of the underrepresented gender but only in case of equal qualifications of the applicants. This priority is neither automatic nor unconditional; the personal situation of each candidate needs to be taken into consideration in the evaluation at all times.&nbsp;&nbsp;SELECTION PROCEDURE&nbsp;After the final application date, all received applications will be sent to the faculty assessment committee assembled for this vacancy. This committee will first evaluate the application files. Therefore it will match all elements of the file against the required expertise for the position in terms of education, research and scientific service. Based on this deliberation, relevant candidates will be shortlisted to be invited for further selection (interview, possible presentation or test lecture â\u0080¦). Afterwards, the committee will rank the suitable candidates and present this ranking to the Faculty Board. The advice of the Faculty Board will then be presented to the Research Council for advice and subsequently be sent to the University Board for approval.&nbsp;Candidates are asked to further discuss their 5 most impactful academic achievements. Next to academic publications, the candidate is thus also able to show merit of knowledge transfer by academic dissemination, social valorisation, public awareness, seminars or conference presentations. These competences are also taken into account when evaluating the candidates.&nbsp;The evaluation of the required international mobility is broad and partly takes the gender perspective into account, thus not only considering longer stays abroad by also other forms of internationalisation.&nbsp;Pregnancy leave, prolonged sick leave, parental leave, filial leave or other forms of absence are taken into account when evaluating the available time for the realisation of academic output.&nbsp;&nbsp;HOW TO APPLY&nbsp;Apply online through the e-recruitment system before the application deadline (see above). We do not accept late applications or applications that are not sent through the online system.&nbsp;Your application must include the following documents:&nbsp;In the field â\u0080\u0098Application formâ\u0080\u0099: the BOF Tenure Track professorial staff application form + all annexes mentioned in the form (a.o. 5-year research plan and long term research vision), merged into one file of maximum 10 MB.In the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of your doctoral degree. If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field â\u0080\u0098Certificate of equivalenceâ\u0080\u0099: only for diplomas awarded outside the European Union: certificate of equivalence (NARIC) (if already in you possession).&nbsp;&nbsp;MORE INFORMATION&nbsp;For further information regarding this vacancy, please contact Professor Katrien Devreese (katrien.devreese@ugent.be,+32 9 332 65 67), head of department Diagnostic Sciences at the faculty of Medicine and Health Sciences.Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}