{"url": "http://www.academictransfer.com/en/309405/tenure-track-ai-assisted-ultrasound-imaging/apply/", "title": "Tenure track AI-assisted Ultrasound Imaging", "publish_date": "2022-02-11", "deadline": "2022-05-11", "location": "Geert Grooteplein-Zuid 10, 6525 GA, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "Assistant Professor", "field": "Health", "salary": "â\u0082¬3922â\u0080\u0094â\u0082¬6122 per month", "max_working_hours": "32—36", "employer": "Radboud University Medical Center (Radboudumc)", "job_description": "<em><strong>To use all opportunities that Artificial Intelligence (AI) offers for AI-assisted Ultrasound Imaging, the Radboud AI for Health team is looking for a specialist and researcher in AI technology at the level from postdoc to assistant professor in a 5-year tenure track.</strong></em><br><br>In this challenging and new position your aim is to establish a successful research group on the crossroad of ultrasound imaging and diagnostic image analysis. As a leading researcher you will closely work together with the departments of Radiation Oncology and Radiology &amp; Nuclear Medicine of the Radboudumc. Your focus will be on doing research and effectuate groundbreaking innovations in AI for healthcare in your field. This in an international team of highly skilled and inspiring specialists with the ambition to significantly improve the quality of care by using AI technology. At the same time, as an inspiring teacher, you will share your knowledge with our PhD's and master students and participate in developing new educational courses.<br><br>In your research the centre of attention will be AI for constructing ultrasound images containing geometric as well as functional information and on the automated analysis of these images to further improve the diagnostic yield of ultrasound. And additionally on the combination of AI tools and low cost handheld echo devices in order to develop diagnostic tools that can be used in low resource countries and for primary care (e.g. general practitioners, physiotherapists).<br><br>A responsible position with direct impact on the quality and possibilities of AI-assisted Ultrasound Imaging at the global leader in Artificial Intelligence for healthcare.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    You are a talented and international experienced researcher in AI technology and you have the ambition to develop as an inspiring teacher. Contributing to a stimulating, honest and ambitious team culture comes natural to you. You are an open and empathetic colleague for your team members. Pleasant collaboration within your research group and with our medical staff is one of your main goals and you are able to carry out your innovative vision and ideas in close cooperation with all the professionals involved. Therefore you have excellent communication skills and you are a real motivator for others to develop, with a modern view on team science.<br/><br/>In addition:<ul>\n<li>You have a PhD degree and at least two years of work experience after completion of your PhD.</li>\n<li>You have contributed to excellent and innovative research, linked to AI, preferably to AI-assisted Ultrasound Imaging.</li>\n<li>You have an international and relevant network and you have published in international journals and have participated in international panels (or want to in the future).</li>\n<li>You are successful in gathering grants in cooperation with others.</li>\n<li>Finally, you recognize yourself in the <a href=\"https://www.radboudumc.nl/werken-bij/de-radboud-manier-van-werken/de-radboud-manier-van-werken\">Radboud way of working</a>.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 5 years with a possible extension.</p>\n            \n            Working at Radboud university medical center means that you are ahead of the curve and working together on the healthcare of the future. But there is more. Our secondary terms of employment are impressive. These are fully tailored to you thanks to our Employment Conditions Selection Model. At Radboud university medical center, you will be given trust, and you will take the responsibility to handle everything together. We provide annual courses, both professional and personal.<ul>\n<li>In addition to your monthly salary and an annual vacation allowance of 8%, you will receive an end-of-year bonus of 8.3%.</li>\n<li>As a full-time employee, you are entitled to approximately 168 vacation hours (over 23 days) per year.</li>\n<li>Radboud university medical center pays 70% of the pension premium. You pay the rest of the premium with your gross salary.</li>\n<li>You get a discount on health insurance as well: you can take advantage of two group health insurance plans. UMC Zorgverzekering and CZ collectief.</li>\n</ul> In addition to our <a href=\"https://www.radboudumc.nl/werken-bij/wat-bieden-wij/arbeidsvoorwaarden\">terms of employment</a>, we also offer employees various other <a href=\"https://www.radboudumc.nl/werken-bij/wat-bieden-wij/faciliteiten\">attractive facilities,</a> such as childcare and sports facilities. Want to learn more? Take a look at the <a href=\"https://www.nfu.nl/voor-umc-medewerkers/cao-universitair-medische-centra\">CAO UMC</a>.\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Radboudumc</h4>\n<strong>Radboud AI for Health</strong> is the global leader in Artificial Intelligence for healthcare. A rapidly growing international group of about 60 highly skilled researchers in AI with the ambition to make groundbreaking advances in healthcare by using AI technology. Radboud AI for Health is a cooperation between the Radboudumc and the Radboud University, based in the beautiful Dutch historic city of <a href=\"https://www.radboudumc.nl/en/working-at/international-office/living-in-nijmegen\">Nijmegen</a>.<br/><br/>Read more about <a href=\"https://www.radboudumc.nl/en/werken-bij/maak-jij-het-verschil/artificial-intelligence\">Radboud AI for Health</a> and its ambition.<br/><br/><strong>Radboudumc</strong><br/>Radboud university medical center is a university medical center for patient care, scientific research, and education in Nijmegen. With 10.000 employees and a turnover of over 1 Billion Euro, the Radboud university medical center strives to be at the forefront of shaping the healthcare of the future. We do this in a person-centered and innovative way, and in close collaboration with our network. We want to have a significant impact on healthcare. We want to improve with each passing day, continuously working towards better healthcare, research, and education. And gaining a better understanding of how diseases arise and how we can prevent, treat, and cure them, day in and day out. This way, every patient always receives the best healthcare, now and in the future. That's why we do what we do.<br/><br/>Read more about our <a href=\"https://www.radboudumc.nl/werken-bij/wat-bieden-wij/arbeidsvoorwaarden\">strategy</a> and what <a href=\"https://www.nfu.nl/voor-umc-medewerkers/cao-universitair-medische-centra\">working at Radboud university medical center</a> means. <a href=\"https://www.instagram.com/radboudumc/\">Our colleagues</a> would be happy to tell you about it. <strong>#weareradboudumc</strong><br/><strong>Radboud University</strong><br/>At Radboud University we want to get the best out of science, others and ourselves. Why? Because this is what the world around us desperately needs. Leading research and education make an indispensable contribution to a healthy, free world with equal opportunities for all. This is what unites the more than 22,000 students and 5,000 employees at Radboud University. And this requires even more talent, collaboration and lifelong learning. You have a part to play!\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    All additional information about the vacancy can be obtained from <a href=\"mailto:Chris.deKorte@radboudumc.nl\">Prof. Chris de Korte</a>, full professor and head of MUSIC. Use the Apply button to submit your application.<br/><br/>Is it too soon for you to directly apply for this job? Do you first want to know more about <a href=\"https://www.radboudumc.nl/en/werken-bij/maak-jij-het-verschil/artificial-intelligence\">Radboud AI for Health</a> and what it can bring you? Please read more about our AI research leaders and why they chose for Radboudumc.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.radboudumc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/umcr-en-wide/97d713b7978d980e8e69b0f8db97cabe.png"}