{"url": "https://academicpositions.com/ad/institute-of-science-and-technology-austria-ist/2022/ist-bridge-international-postdoctoral-program/162456", "title": "IST-BRIDGE: International Postdoctoral Program", "publish_date": "2022-02-05", "deadline": "2022-05-05", "location": "Campus 1 Klosterneuburg, Austria", "city": "N/A", "country": "Austria", "position": "Postdoc", "field": "Accelerator Physics, Acoustics, Algebra, Algorithms, Analysis, and 126 moreAnalytical Chemistry,Applied Mathematics,Applied Physics,Artificial Intelligence,Artificial Neural Network,Atmospheric Chemistry,Atmospheric Sciences,Atomic, Molecular and Optical Physics,Big Data,Biochemistry,Biogeography,Biophysics,Cartography,Catalysis,Cell Biology,Chemical Biology,Chemical Physics,Chemical Thermodynamics,Chemo-informatics,Climatology,Computational Chemistry,Computational Mathematics,Computational Physics,Computational Sciences,Computer Architecture,Computer Communications (Networks),Computer Graphics,Computer Vision,Computer and Society,Computing in Mathematics, Natural Science, Engineering and Medicine,Computing in Social science, Arts and Humanities,Condensed Matter Physics,Cryogenics,Cyber Security,Data Mining,Data Structures,Databases,Distributed Computing,Ecology,Electrochemistry,Electromagnetism,Environmental Chemistry,Evolutionary Biology,Experimental Physics,Fluid Dynamics,Fluid Mechanics,Game Design,Geochemistry,Geodesy and Surveying,Geography,Geoinformatics (GIS),Geology,Geometry and Topology,Geomicrobiology,Geomorphology,Geophysics,Geostatistics,Human-computer Interaction,Hydrogeology,Hydrology,Immunochemistry,Informatics,Information Science,Information Systems (Business Informatics),Inorganic Chemistry,Laser Physics,Logic,Machine Learning,Machine Vision,Marine Geoscience,Materials Chemistry,Materials Physics,Mathematical Chemistry,Mathematical Physics,Medical Physics,Medicinal Chemistry,Meteorology,Mineralogy,Molecular Chemistry,Molecular Physics,Nanobiochemistry,Nanochemistry,Nanotechnology,Neuroscience,Nuclear Chemistry,Nuclear Physics,Number Theory,Oceanography,Operating Systems,Optics,Organic Chemistry,Organometallic Chemistry,Paleoclimatology,Paleontology,Parallel Computing,Particle Physics,Petrochemistry,Petrology,Photochemistry,Photonics,Physical Chemistry,Phytochemistry,Plasma Physics,Polymer Chemistry,Probability Theory,Programming Languages,Quantum Computing,Quantum Physics,Radiochemistry,Remote Sensing,Seismology,Software Engineering,Solid-state Chemistry,Solid-state Physics,Spectroscopy,Statistics,Stochastics,Surface Chemistry,Synthetic Chemistry,Theoretical Chemistry,Theoretical Physics,Theory of Computation,Thermochemistry,Thermodynamics,Vehicle Dynamics,Volcanology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Institute of Science and Technology Austria (IST Austria)", "job_description": "Are you eager to perform cutting edge basic research in an international environment? Do you want to push the frontiers of science and work with supervisors and colleagues that are among the best in the world?The&nbsp;IST-BRIDGE program at IST Austria&nbsp;offers fully funded (two-year) postdoctoral fellowships for highly qualified candidates who have completed or will soon complete their PhD or equivalent in the natural or computer sciences, mathematics or any related discipline.IST-BRIDGE postdocsâ\u0080\u0099 careers will be enhanced by a flexible â\u0080\u0098career-tracksâ\u0080\u0099 training program and optional non-academic secondments, placements in IST Austria research support units, and academic secondments to outstanding international BRIDGE Network partners.Benefits of an IST-BRIDGE fellowship International, Interdisciplinary, and Intersectoral fellowship program 2-year, fully funded postdoctoral position (optional extensions for placements/secondments) Profiled competency training: 4 flexible â\u0080\u0098career-tracksâ\u0080\u0099 Optional BRIDGE placements and secondments â\u0080\u0098Marie SkÅ\u0082odowska-Curie fellowâ\u0080\u0099 title â\u0080\u0093 internationally recognized mark of research excellence Eligibility All research fields supported at IST Austria will be eligible (see&nbsp;https://ist.ac.at/en/research). At the date of the deadline, applicants must hold a PhD (or equivalent) or have at least four years of full-time equivalent research experience and anticipate the completion of their PhD degree before the start of their fellowship (which should not be later than ~7 months post-deadline â\u0080\u0093 see guide for applicants). A fellowship contract will not be issued until a copy of the diploma/proof of successful defense is provided. Applicants cannot have resided or carried out their main activity (work, studies, etc.) in Austria for more than 12 months in the 36 months immediately prior to the call deadline. Researchers already employed at IST Austria at the call deadline are not eligible to apply. Calls for proposals:&nbsp;IST-BRIDGE will recruit 60 fellows over 5 globally-advertised calls (approximately 12 per call).Call deadlines: 05/11/21 â\u0080\u0093 05/05/22 â\u0080\u0093 05/11/22 â\u0080\u0093 05/05/23 â\u0080\u0093 05/11/23See â\u0080\u0098How to applyâ\u0080\u0099 section below for the&nbsp;Guide for Applicants&nbsp;and application links. Should you have questions on the IST-BRIDGE fellow application process, please see the FAQ section below or contact:&nbsp;ist-bridge@ist.ac.atHow to apply (incl. downloads)Application Process: Overview Download and carefully review the Guide for Applicants (below) Create an account at apply.app.ist.ac.at. Verify your account by following the instructions contained within the email sent to you. Complete the application by entering all required information and uploading all required documents (see Guide for Applicants). Submit your application. Following application, top-ranked applicants will be invited for a remote interview (4-7 weeks post-deadline) with international Selection Committee members. All applicants will be notified of the outcome of their applications no later than 3 months after the application deadline (including reserve list status where relevant).Downloads Guide for Applicants Ethics Self-Assessment form ", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Institute of Science and Technology Austria (IST Austria) is a multidisciplinary research institution dedicated to cutting-edge basic research in the natural, mathematical, and computer sciences.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJhOTBcL2Q0MFwvYTkwZDQwOGZhOWMwYmM3OWM4MjlhODc4MmYxOTRlMTMuanBlZyIsImVkaXRzIjpbXX0="}