{"url": "http://www.academictransfer.com/en/309369/phd-researcher-in-data-protection-and-cybersecurity-law/apply/", "title": "PhD researcher in Data Protection and Cybersecurity Law", "publish_date": "2022-02-11", "deadline": "2022-03-15", "location": "Warandelaan 2, 5037 AB, Tilburg", "city": "Tilburg", "country": "Netherlands", "position": "PhD", "field": "Law", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "40", "employer": "Tilburg University", "job_description": "<p>TILT is looking for a PhD researcher in data protection and cybersecurity for the project INTERSECT &ndash; An Internet of Secure Things (<a href=\"https://intersct.nl/\">http://intersct.nl</a>). The candidate will be working on the Governance &amp; Privacy perspective of the project, which, amongst other things, aims at investigating the relationship between privacy and data protection, on the one hand, and security, on the other hand.&nbsp;</p><p>INTERSECT holds that when building security-by-design, security-by-default, robustness, and resilience into IoT devices themselves is not possible, we must also have legal, regulatory, and governance capabilities to address or prevent potential threats. The first line of inquiry of the project thus relates about how personal data protection law and neighbouring legislation (e.g. GDPR, NIS Directive, ePrivacy Directive, the proposed ePrivacy Regulation, the AI Act Proposal) can be used to engender privacy and security in the IoT space, when security cannot be designed into IoT devices from the outset. Yet, while the axiom according to which &lsquo;there is no privacy without security&rsquo; still holds true, rethinking modern security practices for the IoT age can possibly lead to trade-offs between security, on the one hand, and the rights to privacy and personal data protection, on the other hand. The use of machine learning (ML) and artificial intelligence (AI) more generally for security purposes is not devoid of potential threats to individuals&rsquo; privacy and data protection. Hence, this project&rsquo;s second line of inquiry investigates whether and how privacy and (IoT) security can clash.</p><p>The aim of this project is thus to analyse the privacy and data protection implications of autonomous vulnerability and exploitation detection and management in the IoT environment, with a particular reference to the methods and approach developed by the INTERSECT consortium. The project will identify the applicable norms and principles, delineate their scope, and formulate recommendations for the pursuit of an optimal trade-off between IoT security and personal data protection.</p><p>The successful candidate will:</p><ul> <li>Actively contribute to the INTERSECT research project.&nbsp;</li> <li>Independently pursue path-breaking research leading to an excellent PhD dissertation.</li> <li>Collaboratively pursue interdisciplinary research in collaboration with the project partners.</li> <li>Participate in the Tilburg Graduate Law School courses and activities.</li> <li>Be an active member of the department by participating in and organizing events and activities, presenting and discussing research output within the department, and representing the department outside Tilburg University.</li> <li>Supervise students in writing their Master thesis in Law &amp; Technology and reading and grading Master theses on a variety of topics.</li> </ul>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Tilburg University believes that academic excellence is achieved through the combination of outstanding research and education, in which social impact is made by sharing knowledge. In doing so, we recognize that excellence is not only achieved through individual performance, but mostly through team effort in which each team member acts as a leader connecting people. <br/>\n <br/>\nApplicants must:<br/>\n•    Have a Bachelor’s degree in Law.<br/>\n•    Have completed a Master’s degree in Law with a curriculum that includes privacy, data protection, and/or cybersecurity.<br/>\n•    Have an interdisciplinary mindset and a strong interest in doing research.<br/>\n•    Be able to formulate views, ideas and concepts based upon complex information.<br/>\n•    Have good planning, management, and organization skills. <br/>\n•    Be able to undertake certain administrative duties autonomously. Be proactive and accountable, able to manage varied commitments simultaneously.<br/>\n•    Have excellent interpersonal and communication skills. <br/>\n•    Have perfect command of English. Knowledge of Dutch is an asset, but not required. <br/>\n•    Demonstrate scientific integrity.<br/>\n•    Contribute to an open and diversified culture of excellence.</p>\n<p>Post-graduate research experience or work experience in the area of privacy, data protection, and/or cybersecurity in either the public or private sector is appreciated.</p>\n<p>The successful candidate is expected to manage some of TILT’s INTERSECT administrative tasks, join and present at project meetings, and may be asked to perform other duties occasionally which are not included above, but which will be consistent with the PhD topic and position, such as supervising LLM students or helping with the organisations of seminars and events.<br/>\nTilburg University believes that academic excellence is achieved through the combination of outstanding research and education in which social impact is made by sharing knowledge. In doing so, we recognize that excellence is not only achieved through individual performance but mostly through team effort in which each team member acts as a leader, connecting people. </p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Tilburg University offers excellent terms of employment. We believe flexibility, development, and good employee benefits are very important. We make clear agreements on career paths and offer several facilities and schemes to maintain an optimum balance between work and private life. Tilburg University fosters diversity and inclusion; that is why we pursue an active policy for inclusive teams where diverse talents can flourish.</p>\n<p>The starting gross salary varies between € 2,443 and € 3,122 per month (full time) based on scale P of the <a href=\"https://www.universiteitenvannederland.nl/files/documenten/CAO/2021/CLA_Universities_Netherlands_2021_2022.pdf?utm_source=Ledenlijst+Nieuwsbrief+Arbeidszaken&amp;utm_campaign=71cbe727ad-EMAIL_CAMPAIGN_2018_05_25_12_15_COPY_01&amp;utm_medium=email&amp;utm_term=0_cfac4b55aa-71cbe727ad-232144929\">Collective Labour Agreement Universities (vsnu.nl</a>). Tilburg University actively promotes equal and transparent salary between men and women by strictly applying predetermined parameters based on the candidate’s experience. Employees recruited from abroad may be eligible for the 30% tax facility—this means that 30% of your salary will be paid as a tax-free reimbursement.</p>\n<p>Tilburg University offers you an employment agreement which will initially be for a fixed period of 16 months with a statutory probationary period of two months. After 12 months, an evaluation will take place. If the performance evaluation is positive, your employment agreement will be extended for the remaining period of 32 months. </p>\n<p>You are entitled to a holiday allowance amounting to 8% and a year-end bonus of 8.3% of your gross yearly income. If you work 40 hours per week, you receive 41 days of paid recreational leave per year.</p>\n<p>Please visit <a href=\"https://www.tilburguniversity.edu/about/working\">Working at Tilburg University</a> for more information on our employment conditions. </p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Tilburg University</h4>\n<p>Under the motto “Understanding society”, <a href=\"https://www.tilburguniversity.edu/\"><strong>Tilburg University</strong></a>’s more than 1,500 employees develop knowledge, transfer it to over 19.000 students of 110 nationalities, and bring people from various disciplines and organizations together to learn from each other. In this way, we want to contribute to solving complex social issues. Our focus areas are economics, business and entrepreneurship, social and behavioral sciences, law and public administration, the humanities and digital sciences, and theology. We seek the connection between different disciplines in order to find solutions to the major issues we face as a society. Our students are trained to be responsible and entrepreneurial thinkers, driven by solidarity, a sense of responsibility and empathy, who are able to influence and give direction to a rapidly changing society in an innovative way. Tilburg University has a culture of collaboration and co-creation, at local, regional, national, and international levels.</p>\n<p>Since its founding in 1963, <a href=\"https://www.tilburguniversity.edu/nl/over/schools/law\"><strong>Tilburg Law School</strong></a> has become one of the leading law schools in Europe.  Through top-level research and the provision of high-quality university education, the School contributes to society. Tilburg Law School is organized into five Departments: Public Law and Governance (PLG); Law, Technology and Society (TILT); Private, Business and Labour Law (PBLL); the Fiscal Institute Tilburg (FIT) and Criminal Law. The mission of the School is to understand and improve the role of law and public administration in addressing the social problems of today and tomorrow. Through research and education, our scholars contribute to that mission. </p>\n<p>More than 4,000 students pursue a Bachelor's, pre-Master's or Master's degree at Tilburg Law School. Through this education, we train students in law, public administration, and data science. The Tilburg Educational Profile (TEP) is unique in the Netherlands. Central to it are three core concepts: knowledge, skill and character. A university education provides students with the latest substantive knowledge and trains them to be critical thinkers and resilient professionals. In addition, the School is committed to innovative educational concepts and, partly in response to the coronavirus crisis, has invested heavily in the quality of online education and in innovative didactic tools to make and keep students inquisitive. </p>\n<p>Tilburg Law School's research is highly regarded nationally and internationally. The Tilburg Law School Departments work closely together in their research in four signature research programs: 1) Global Law and Governance; 2) Law and Security; 3) Connecting Organizations; and 4) Regulating Socio-Technical Change.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>An Internet of Secure Things – INTERSECT</strong><br/>\nThe Internet-of-Things (IoT), which seamlessly connects the digital and the physical world, is turning out to be one of the weakest spots in the global digital infrastructure. Billions of physical devices with computing and networking capabilities both exacerbate the privacy and security risks of ‘traditional’ IT settings, and create an entirely new threat surface. A pervasive cyber-physical system of systems, entwined with a myriad of IoT devices, will oversee our lives and economy, while at the same time, from a privacy and security perspective, being completely unmanageable at scale.</p>\n<p>The amount, heterogeneity, and varying longevity of IoT devices challenges conventional information, application, and network security practices. It constitutes a serious threat to our ability to safeguard individuals’ security and safety, on the one hand, and their privacy and data protection rights, on the other hand. IoT devices are different from traditional computing infrastructure in that they are oftentimes dispersed across large geographical areas, even when operated by the same entity, which renders updating and fixing them oftentimes complicated and costly. Their product support lifespan is frequently shorter than the period during which they are used or installed, which results in a plethora of old devices riddled with vulnerabilities and ripe for exploitation deployed in the wild. The IoT category is also extremely heterogeneous and diverse when compared to ‘traditional’ computing infrastructures: the intermixture of millions of disparate IoT devices and applications, manufactured and managed in countries all over the globe, compounds the challenges of supervising, handling, and controlling the cyber-physical domain.</p>\n<p>The INTERSECT project thus holds that traditional security paradigms, based on targeted solutions developed and deployed specifically for each system, are doomed to eventually fail. Such assessment is compounded by the fact that such a heterogeneous, complex, and globe-spanning environment is easily mismanaged by its human component. The INTERSECT project maintains that, from a technological perspective, there is the need to re-think the security paradigm, delegating part of the security management to the system that needs to autonomously adapt to the changing environment, while remaining under our supervision. When designing or engineering these properties into the devices themselves is not possible, we must be able to resort to other kinds of capabilities, such as the ones deriving from legislation, or from other regulatory and governance instruments.</p>\n<p><strong>Information</strong><br/>\nMore information about the vacancy can be obtained from dr. Lorenzo Dalla Corte (<a href=\"mailto:L.DallaCorte@tilburguniversity.edu\">L.DallaCorte@tilburguniversity.edu</a>). </p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uvt.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uvt-en-wide/8bbc452c034c71750be03f93fe602eca.png"}