{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/research-associate-at-the-center-for-policy-research/174816", "title": "Research Associate at the Center for Policy Research", "publish_date": "2022-02-02", "deadline": "N/A", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Research Assistant", "field": "Politics, Public Policy, Social Research, Sociology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>Why the American University of Iraq â\u0080\u0093 Baghdad?</strong></p><p>Opening its doors in January of 2021, the new American University of Iraq â\u0080\u0093 Baghdad (AUIB) began as a dream of influential individuals in Iraqi and the United States business, industry and government who want to see a world-class institution of higher learning established in the city, reminiscent of the days when Baghdad was an educational mecca and flourishing capital of the Muslim world.  With a great library, palatial college buildings and student centers, state-of-the-art classrooms, laboratories, and athletic facilities, AUIB will be a beautiful campus attracting students, faculty, and staff from throughout the world.  We invite you to join us in this exciting new venture.</p><p>We invite applications and nominations for the position of:</p><p>This position reports to the <strong>Director of CPR at AUIB.</strong></p><p><strong>Position Summary:</strong></p><p>The American University of Iraq - Baghdad (AUIB) invites applications for the position of Research Associate at the Center for Policy Research from people who will provide superior and distinguished scholarship. AUIB is a non-profit University and officially opened its doors in January 2021. This university envisions to create a new foundation for Iraq, and become the first of its kind in Baghdad and the largest academic and research institution in the Middle East. The Center for Policy Research was established in September 2021, to enhance the research profile of the university.</p><p><strong>Key Responsibilities:</strong></p><ul><li>Manage and conduct research projects and draft appropriate research materials.</li><li>Organize academic lectures relate to CPR research programs and themes</li><li>Develop internal processes, systems, and contact lists.</li><li>Organize conferences, community dialogues, and workshops.</li><li>Promote the work of CPR through online communications and the development of relationships with crucial partners in Baghdad, whole Iraq, and wide Middle East.</li><li>General administrative work</li><li>Draft grant proposals and manage donor relations.</li></ul><p><strong>Qualifications and Experience:</strong></p><ul><li>Hold a PhD degree from a reputable university in a relevant field.</li><li>Minimum of two years of experience in research on public policy, sociology, political science, or other relevant social science disciplines.</li><li>Very good skills in quantitative and/or qualitative research.</li><li>Strong communication skills.</li><li>Experience in a multicultural, diverse, and inclusive setting.</li><li>Have initiative and a willingness to innovate.</li><li>Native or native level fluency in Arabic language.</li><li>Fluent in written and spoken English.</li></ul><p><strong>Application Procedure: </strong></p><p>Applications should include:</p><ul><li><strong>Cover Letter</strong> </li><li><strong>Curriculum Vita</strong></li><li><strong>Passport First Data Page</strong></li><li><strong>Contact Information For Three (3) Professional References</strong></li><li><strong>Copies Of Degrees Or Certification</strong></li></ul><p>Applications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately. </p><p>Please apply through AUIB website OR send your application and supporting documents to the following email address:</p><p><a href=\"mailto:jobs@auib.edu.iq\">jobs@auib.edu.iq</a> with <a href=\"mailto:Karin.Jesuis@auib.edu.iq\">Karin.Jesuis@auib.edu.iq</a> in copy.<strong> </strong></p><p><strong>A declaration of a relation at AUIB is obligatory</strong></p><p><strong>We will contact you if you are selected for interview.</strong></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}