{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/physics-lab-teaching-assistant-full-time-position/174835", "title": "Physics Lab Teaching Assistant Full-Time Position", "publish_date": "2022-02-03", "deadline": "2022-05-03", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Teaching Assistant", "field": "Accelerator Physics, Acoustics, Applied Physics, Atomic, Molecular and Optical Physics, Biophysics, and 24 moreChemical Physics,Computational Physics,Condensed Matter Physics,Cryogenics,Electromagnetism,Experimental Physics,Fluid Dynamics,Fluid Mechanics,Geophysics,Laser Physics,Materials Physics,Mathematical Physics,Medical Physics,Molecular Physics,Nuclear Physics,Optics,Particle Physics,Photonics,Plasma Physics,Quantum Physics,Solid-state Physics,Theoretical Physics,Thermodynamics,Vehicle Dynamics", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "College of Arts and SciencesWhy the American University of Iraq â\u0080\u0093 Baghdad?Opening its doors in the Spring of 2021, the new American University of Iraq â\u0080\u0093 Baghdad (AUIB) began as a dream of influential individuals in Iraqi and the United States business, industry and government who want to see a world-class institution of higher learning established in the city, reminiscent of the days when Baghdad was an educational mecca and flourishing capital of the Muslim world.&nbsp; With a great library, palatial college buildings and student centers, state-of-the-art classrooms, laboratories, and athletic facilities, AUIB will be a beautiful campus attracting students, faculty, and staff from throughout the world.&nbsp; We invite you to join us in this exciting new venture.We invite applications and nominations for a position of:Physics Lab Teaching Assistant Full-Time PositionThis position will report directly to the Dean of College of Arts and Sciences.JOB DESCRIPTION:Assist faculty members in teaching physics lab courses.&nbsp;Set up equipment and material for lab sessions.&nbsp;Prepare and maintain documentation of lab inventory of equipment, materials, and supplies.Arrange purchase orders for lab material and supplies, and lab budget.&nbsp;Prepare and maintain documentation of all lab protocols and procedures, and safety rules.&nbsp;EXPERIENCE, SKILL AND EDUCATIONAL REQUIREMENTS:Masterâ\u0080\u0099s degree in physics from a reputable college/ university.Minimum of 2 years of teaching experience. Work experience in a college/ university setting is a plus.&nbsp;Familiarity with lab safety rules.&nbsp;Ability to work and coordinate with faculty and other lab staff as member of a team.&nbsp;Ability to interact effectively with students, supervise and guide them in the lab.Strong computer skills, English communication skills, and good time management skills.&nbsp;Application Procedure:&nbsp;Applications should include:Cover Letter&nbsp;Curriculum VitaPassport First Data PageContact Information For Three (3) Professional ReferencesCopies Of Degrees Or CertificationApplications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately.&nbsp;Please apply through AUIB website OR send your application and supporting documents to the following email address:jobs@auib.edu.iq&nbsp;with&nbsp;Karin.Jesuis@auib.edu.iq&nbsp;in copy.&nbsp;A declaration of a relation at AUIB is obligatoryWe will contact you if you are selected for interview.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "AUIB is a non-profit, private university that is fully accredited in Iraq by the Ministry of Higher Education and Scientific Research, thereby ensuring a high level of academic standards and institutional performance.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}