{"url": "https://www.academictransfer.com/en/309399/jurist-gezondheidsrecht/apply/", "title": "Jurist Gezondheidsrecht", "publish_date": "2022-02-11", "deadline": "2022-03-10", "location": "Geert Grooteplein-Zuid 10, 6525 GA, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "Other Category", "field": "Recht; Gezondheid", "salary": "N/A", "max_working_hours": "36", "employer": "Radboud University Medical Center (Radboudumc)", "job_description": "<strong><em>Als jurist Gezondheidsrecht ontwikkel en implementeer je juridisch beleid, richtlijnen en procedures. Je adviseert de Raad van Bestuur en het strategische management over gezondheidsrechtelijke casuïstiek en geeft hier mede uitvoering aan. Kom jij ons team versterken?</em></strong><br><br>Je gaat aan de slag met gezondheidsrechtelijke werkzaamheden binnen het ziekenhuis. Dit doe je voor zowel de Raad van Bestuur, de zorgverleners en andere afdelingen die juridische vraagstukken hebben. Je werkt samen met de privacy office, de functionaris gegevensbescherming en de klachtenfunctionarissen. Overige taken die je krijgt zijn afhankelijk van je ervaring.<br><br><strong>Taken en verantwoordelijkheden</strong><ul> <li>Je behandelt binnen een klein team, zelfstandig medische letselschadeclaims en bent contactpersoon voor de aansprakelijkheidsverzekeraar. Hier ligt in deze functie de nadruk op.</li> <li>Je behandelt verzoeken om inzage/afschrift en verzoeken om vernietiging in samenwerking met het secretariaat.</li> <li>Je ondersteunt medewerkers bij (tucht)klachten.</li> <li>Waar nodig vertegenwoordig je het ziekenhuis in juridische procedures.</li> <li>Je adviseert individuele zorgverleners bij alle voorkomende (acute) gezondheidsrechtelijke casuïstiek, ook (roulerend) in de anw-uren.</li> <li>Op aanvraag geef je onderwijs/voorlichting aan afdelingen en/of studenten over het gezondheidsrecht.</li> <li>Je adviseert aan de (medisch ethisch) toetsingscommissie voor wetenschappelijke onderzoek.</li> <li>Je neemt als (juridisch) inhoudsdeskundige en als vertegenwoordiger van het Radboudumc deel aan diverse interne en externe commissies, werkgroepen en projecten.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.radboudumc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/umcr-en-wide/97d713b7978d980e8e69b0f8db97cabe.png"}