{"url": "http://www.academictransfer.com/en/309296/principal-consultant-wetenschapsbeleid/", "title": "Principal Consultant Wetenschapsbeleid", "publish_date": "2022-02-09", "deadline": "2022-03-01", "location": "Spuistraat 283, 1012 VR, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "Researcher", "field": "Gedrag en maatschappij; Techniek", "salary": "N/A", "max_working_hours": "32—40", "employer": "Technopolis BV", "job_description": "<p>Op basis van onze expertise op het gebied van wetenschap, technologie en innovatie, ondersteunen wij beleidsmakers bij maatschappelijke uitdagingen. Een van onze kernthema&#39;s is wetenschapsbeleid. Recente voorbeeldprojecten zijn:</p><ul> <li>Evaluatie van de uitbreiding van het ius promovendi in Nederland (Min. OCW, NL)</li> <li>Evaluatie van het onderzoekscentrum Neuro Electronic Research Flanders (Dep. EWI, BE)</li> <li>Evaluatie van de relevantie en de interne coherentie van Horizon 2020 (EC DG RTD, EU)</li> <li>Monitoring van ontwikkelingen in het WTI-beleid in Europa (Japan Science and Technology Agency, JAP)</li> <li>Studie naar kennisecosystemen voor de nieuwe Europese Onderzoeksruimte (EC DG RTD, EU)</li> <li>Onderzoek naar de mechanismen en de omvang van het uitvallen van vrouwen in de wetenschap tijdens en na de zwangerschap (Min. OCW, NL)</li> <li>Ondersteuning van de Universiteiten van Nederland bij hun beleidsontwikkeling (UvN/VNSU, NL)</li> <li>Ontwikkeling van een wetenschaps- en innovatiebeleid voor Myanmar (Ministerie van Wetenschappen en Onderwijs Myanmar, UNESCAP)</li> <li>Ondersteuning van de evaluatiecommissie voor evaluaties van NWO, SIA en KNAW (Min. OCW, NL)</li> <li>Ondersteuning van de ontwikkeling van de Vlaamse Open Science strategie (Vlaamse Overheid, FL)</li> </ul><p>Om onze activiteiten op het gebied van wetenschapsbeleid in Nederland en daarbuiten te versterken, zijn wij in Amsterdam op zoek naar <strong>een gemotiveerde expert met bewezen trackrecord op het gebied van wetenschapsbeleid</strong>. Wij zoeken een collega die aantoonbare ervaring heeft met zowel beleidsadvies, beleidsimplementatie en/of beleidsevaluatie, als met het managen van complexe projecten, bij voorkeur op Europees niveau.&nbsp;</p><p>In deze functie identificeer en genereer je nieuwe business leads en schrijf je projectvoorstellen op het snijvlak van wetenschapsbeleid en maatschappelijke uitdagingen. Als projectleider ben je verantwoordelijk voor de goede uitvoering van projecten die kunnen vari&euml;ren in omvang, duur en complexiteit. Je werkt graag in teamverband en bent in staat om samen te werken met, en ondersteuning te bieden aan, een projectteam van ervaren en beginnende consultants. Je overlegt met klanten en partners in binnen- en buitenland, waarvoor je bereid bent te reizen indien nodig.</p><p>Om (complexe) beleidsvraagstukken te kunnen beantwoorden, ben je in staat om een gedegen methodologische aanpak te ontwikkelen voor beleidsstudies, evaluaties en strategische ondersteuning. Je verricht analytisch werk zowel zelfstandig als in teamverband. Verworven inzichten weet je treffend te vertalen in heldere rapportages, waarbij partijen uit het beleids- en onderzoeksdomein je voornaamste doelgroep zijn. Je werkt samen met collega&#39;s in Amsterdam, maar ook regelmatig met collega&#39;s in buitenlandse kantoren van Technopolis en met externe partners. Tot slot draag je met je strategisch inzicht bij aan kennisdeling en strategieontwikkeling van Technopolis Group.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "https://www.technopolis-group.com/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/technopolis-en-wide_srqoNgJ/39a6f4f35e5f2678d431b8bba1b164db.jpg"}