{"url": "https://academicpositions.com/ad/iu-international-university-of-applied-sciences/2022/academic-writer-m-f-d-as-a-level-mathematics/174904", "title": "Academic Writer (m/f/d) â\u0080\u0093 as/a Level Mathematics", "publish_date": "2022-02-04", "deadline": "N/A", "location": "N/A", "city": "N/A", "country": "Germany", "position": "Other Category", "field": "Algebra, Analysis, Applied Mathematics, Computational Mathematics, Geometry and Topology, and 5 moreLogic,Number Theory,Probability Theory,Statistics,Stochastics", "salary": "N/A", "max_working_hours": "N/A", "employer": "IU International University of Applied Sciences", "job_description": "Be part of a growing business â\u0080\u0093 start your career at IU!&nbsp;&nbsp;Since its founding in 1998, the IU International University of Applied Sciences has developed into the largest private university for online and dual study programs in Europe. We offer more than 80 career-oriented bachelor and master programs in various disciplines. These English and German language programs are all accredited and state-recognized. As a pioneer in digital education, we continuously improve the learning experience of our students with the help of innovative technologies and consistently focus on their satisfaction. Through our employeesâ\u0080\u0099 entrepreneurial mindset we continue to achieve our ambitious goals and high growth rate of more than 50 percent.&nbsp;We are currently looking for an&nbsp;Freelance Academic Author&nbsp;(m/f/d)&nbsp;with an additional option to become a Lecturer in bachelor preparation courses&nbsp;for:&nbsp; &nbsp;AS/A Level MathematicsYOUR RESPONSIBILITIESCreating a coursebook and reading list (130-180 pages) from an existing module description&nbsp;&nbsp;Creating various assessment types&nbsp;&nbsp;Creating videos per chapterYOUR PROFILEA completed academic degree and profile (Master or Ph.D.) related to the subject areaOwn AS/A level experience desirablePrevious experience developing course materials for AS/A Levels is advantageousIndustry experience in the advanced education sector and/or topic fieldAn affinity for online-education / e-learning and web-based programsSound knowledge of MS Office&nbsp;WHAT WE OFFERRemote and freelance contract&nbsp;&nbsp;Ability to develop your academic writing&nbsp;&nbsp;Guidelines and support from internal departments&nbsp;Opportunities to work on similar future projects&nbsp;&nbsp;For your application to be considered please submit the following documents (in English and in a single .pdf file):&nbsp;&nbsp;Tailored CV and Cover Letter (including your earliest start date)&nbsp;An independent writing sample (3-5 pages) related to one of the topics listed under â\u0080\u0098Course Contentâ\u0080\u0099&nbsp;&nbsp;Academic TranscriptsWe look forward to your application.â\u0080¯For questions and/or further details about the course content please contact Ms Koller (lehrbeauftragte-fernstudium@iu.org).For further information please visit our career page or www.iu.de/en/.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Since its founding in 1998, the IU International University of Applied Sciences has developed into the largest private university for online and dual study programmes. With this growth, we are continuously hiring freelancers to assist with the curriculum development in more than 80 career-orientated Bachelor and Master programs.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIzNTBcL2M3NlwvMzUwYzc2ZjY1MTBlMGIwNDc1MDE4NGI2MzQ4ZjhmMmYucG5nIiwiZWRpdHMiOltdfQ=="}