{"url": "http://www.academictransfer.com/en/308826/phd-in-innovation-operations-management-with-a-focus-on-knowledge-productivity/apply/", "title": "PhD in Innovation & Operations Management with a focus on Knowledge Productivity", "publish_date": "2022-01-31", "deadline": "2022-02-20", "location": "De Rondom 70, 5612 AP, Eindhoven", "city": "Eindhoven", "country": "Netherlands", "position": "PhD", "field": "Engineering", "salary": "N/A", "max_working_hours": "38", "employer": "Eindhoven University of Technology (TU/e)", "job_description": "Eindhoven University of Technology is looking for a PhD candidate with a background in Econometrics, Operations Research, Data Science, Innovation Management, Industrial Engineering, Innovation Sciences, Business Administration, Technology Management, Business Economics or Management Sciences, interested in quantitative and qualitative empirical research on the interface of Innovation and Operations Management.<br><br><strong>Organization</strong><br>Eindhoven University of Technology is one of the world's leading research universities (ranked by the Times Higher Education Supplement) and is particularly well known for its joint research with industry (ranked number one worldwide by the Centre for Science and Technology Studies). The Department of Industrial Engineering &amp; Innovation Sciences (IE&amp;IS) of Eindhoven University of Technology is one of the longest-established engineering schools in Europe, with a strong presence in the international research and education community, especially in the fields of Operations Management and Innovation Management, which are at the core of the undergraduate BSc program. The graduate programs (MSc and PhD) in Operations Management &amp; Logistics and Innovation Management attract top-level students from all over the world.<br><br><strong>Group</strong><br>The PhD project is conducted in close collaboration with ASML. The PhD student works for 50% of his/her time on-site at the ASML campus and 50% within the Innovation, Technology Entrepreneurship &amp; Marketing (ITEM) group on the TU/e campus. The ITEM group is part of the School of Industrial Engineering of the department IE&amp;IS. The ITEM group focusses on managing innovation processes and new product development, including marketing of new products and marketing analytics.<br><br><strong>Short description of the PhD Project</strong><br>'Improving the Productivity of Knowledge Flows through Tacit and Explicit Knowledge Repositories'<br><br>Over the past decades, ASML's customers increasingly demand greater lithography machine accuracy that enables them to deliver highly advanced integrated circuits (IC) to the market. ASML has the objective to be first-to-market to give customers first-mover advantages. This requires ASML to introduce new machines in rapid succession. Therefore, every new product introduction (NPI) must go through a steep learning curve to reduce development, manufacturing, and service cycle times.<br><br>This ability to be first-to-market and reduce cycle times by mastering the learning curve explains most of ASML's success in the past 30 years. The current learning curve progress that is driven by cumulative experience and the build-up and utilization of knowledge repositories embedded in employees, tasks, and technology. However, as experience and knowledge become more distributed, complex, and heterogeneous, and because the volume of experience per system (both hours and numbers) is lower, knowledge management becomes one of the key areas of attention to be able to quickly descend the learning curve of the next-generation machines.<br><br>The aim of this PhD project is (1) to better understand the productivity of current tacit and explicit knowledge flows, (2) to optimize the creation, coordination, and utilization of explicit and tacit knowledge flows, and (3) to develop policy recommendations on how to improve the management of tacit and explicit knowledge flows.<br><br>The project builds on our two previous projects conducted together with ASML on cycle time reduction and organizational learning respectively.<br><br><strong>Job description</strong><br>You, as a successful applicant, will perform the research project outlined above in an international team. The research will be concluded with a PhD thesis. A small teaching load is part of the job.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You have a master's degree in Econometrics, Operations Management, Operations Research, Data Science, Innovation Management, Industrial Engineering, Innovation Sciences, Business Administration, Technology Management, Business Economics and/or Management Sciences.</li>\n<li>You have a strong affinity with interdisciplinary research, as well as collaboration with industry.</li>\n<li>You have strong analytical skills and demonstrated competencies in quantitative, econometric research methods for quantitative modeling, orÂ mixed method approaches combining qualitative and quantitative data analysis.</li>\n<li>Potential and ambition to become a high-level management scholar.</li>\n<li>You can work on a topic that requires both basic and applied research skills.</li>\n<li>You have excellent social, communication and organization skills to work effectively in a university and industry setting.</li>\n<li>You are fluent in spoken and written English. The ability to speak Dutch is highly appreciated.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>A meaningful job in a dynamic and ambitious university with the possibility to present your work at international conferences.</li>\n<li>A full-time employment for four years, with an intermediate evaluation (go/no-go) after nine months.</li>\n<li>To develop your teaching skills, you will spend 10% of your employment on teaching tasks.</li>\n<li>To support you during your PhD and to prepare you for the rest of your career, you will make a Training and Supervision plan and you will have free access to a personal development program for PhD students (<a href=\"https://www.tue.nl/en/working-at-tue/phdpdeng/professional-development/\">PROOF program</a>).</li>\n<li>A gross monthly salary and benefits (such as a pension scheme, pregnancy and maternity leave, partially paid parental leave) in accordance with the Collective Labor Agreement for Dutch Universities.</li>\n<li>Additionally, an annual holiday allowance of 8% of the yearly salary, plus a year-end allowance of 8.3% of the annual salary.</li>\n<li>Should you come from abroad and comply with certain conditions, you can make use of the so-called '30% facility', which permits you not to pay tax on 30% of your salary.</li>\n<li>A broad package of fringe benefits, including an excellent technical infrastructure, moving expenses, and savings schemes.</li>\n<li>\n<a href=\"https://www.tue.nl/en/working-at-tue/why-tue/support-for-internationals/\">Family-friendly initiatives</a> are in place, such as an international spouse program, and excellent on-campus children day care and sports facilities.</li>\n</ul>\n</div>\n</div>", "employer_description": "N/A", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<strong>More information</strong><br/>Do you recognize yourself in this profile, and would you like to know more?Â Please contactÂ <br/>dr. Alex Alblas (a.a.alblas[at]tue.nl) or prof.dr. Fred Langerak (F.Langerak[at]tue.nl).<br/><br/>For information about terms of employment, clickÂ <a href=\"https://www.tue.nl/en/working-at-tue/why-tue/compensation-and-benefits/\">here</a>Â or contact Susan Opgenoorth,<br/>personnel officer (pz.ieis[at]tue.nl).<br/><br/>Please visit <a href=\"http://www.tue.nl/jobs\">www.tue.nl/jobs</a> to find out more about working at TU/e!<br/><br/><strong>Application</strong><br/>We invite you to submit a complete application by using the 'apply now'-button on this page.Â <br/>The application should include a:<ul>\n<li>Cover letter (2-page max.), which includes your motivation and an explanation of why you would fit well with the project.</li>\n<li>Detailed curriculum vitae, including an elaboration of your experience in quantitative methodologies (e.g., statistics and/or econometrics, time series and longitudinal statistical analysis techniques, experiments) and qualitative methodologies (e.g., case studies,Â  natural/field experiments, qualitative comparative analysis (QCA)).</li>\n<li>List of courses taken in master and bachelor programs (incl. grades).</li>\n<li>Brief description of your MSc thesis.</li>\n<li>Results of a recent TOEFL, IELTS test.</li>\n<li>Name and contact information of two references.</li>\n</ul>\n<br/>We look forward to your application and will screen it as soon as we have received it. Screening will continue until the position has been filled.<br/><br/>We do not respond to applications that are sent to us in a different way. Please keep in mind you can upload only 5 documents up to 2 MB each. If necessary, please combine files.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tue.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tue-en-wide_acOLN2b/6da05d7a14fc4cf4bb403c37bf055371.png"}