{"url": "https://academicpositions.com/ad/leiden-university/2022/meijers-phd-position/173948", "title": "Meijers PhD position", "publish_date": "2022-01-13", "deadline": "2022-03-31", "location": "Rapenburg 70 Leiden, Netherlands", "city": "N/A", "country": "Netherlands", "position": "PhD", "field": "Criminology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "The Meijers Research Institute / Graduate School&nbsp;of the Faculty of Law&nbsp;is looking for aMeijers PhD position&nbsp;(1,0&nbsp;FTE)&nbsp;&nbsp;Vacancy number 22-006 10501Project DescriptionThe Graduate School currently has a Meijers PhD position in Law or Criminology, and welcomes proposals that fit one of the 8 research programmes of Leiden Law School. The PhD-position is available from September 1st 2022. Closing date for application is March 31st 2022, 23.59 hrs.&nbsp;The appointment will be initially a temporary one for a period of one year. Upon a satisfactory performance outcome, the appointment will be extended for a period of another three years.ProcedureThe Meijers PhD position is open for candidates inside and outside Leiden Law School. Candidates must have completed a LL.M, Master Criminology, or another relevant graduate programme, with excellent grades. Special emphasis is placed on the grading of the thesis and other advanced, independent educational elements in addition to relevant methodology courses;Applicants may apply for the PhD position before the accomplishment of their master degree. This applies only if the degree is expected to be achieved at the end of the academic year 2021-2022;Before the proposal is submitted, the candidate establishes contact with the envisaged superÂ­visor (professor), appointed at Leiden Law School, and comes to an agreement regarding supervision. The candidate attaches a letter of intent of the envisaged supervising professor, declaring the willingness to act as supervisor and mentioning the envisaged second supervisor (compulsory).Our&nbsp;facultyWith over 5,000 students and 450 members of staff, Leiden Law School is one of the largest faculties in the Netherlands. Yet, in all its diversity, it is still known for its ability to provide education on a small scale. The Faculty focuses on multi-faceted high-level teaching and research, both nationally and internationally. It does so by working with talented people and stimulating and supporting them in their professional and personal ambitions. The Faculty is housed in the beautifully restored Kamerlingh Onnes Building on the Steenschuur in Leiden. Working for the Leiden Law School means working in an inspiring scientific environment. For more information, see&nbsp;https://www.universiteitleiden.nl/en/law.Our InstituteThe Meijers Research Institute and Graduate School is the research institute of Leiden Law School. Research at Leiden Law School means research at the highest level. Leiden Law School has eight&nbsp;research programmes.Terms and conditionsThe appointment as a PhD candidate will be for a period of four years (initially for a period of one year with an extension of three years after positive evaluation of progress and skills development) leading to the successful completion of a PhD thesis. The appointment will be under the terms of the CAO (Collective Labour Agreement) of Dutch Universities&nbsp;.&nbsp;Salary range from â\u0082¬&nbsp;2434.- to â\u0082¬&nbsp;3111.- gross per month on a full-time basis (pay scale P), in accordance with the Collective Labour Agreement for Dutch Universities).Leiden University offers an attractive benefits package with additional holiday (8%) and end-of-year bonuses (8.3 %), training and career development and sabbatical leave. Our individual choices model gives you some freedom to assemble your own set of terms and conditions. For international spouses we have set up a dual career programme.&nbsp;Candidates from outside the Netherlands may be eligible for a substantial tax break.&nbsp;More at&nbsp;https://www.universiteitleiden.nl/en/working-at/job-application-procedure-and-employment-conditions.In your daily activities you will have access to confidential information. &nbsp;We therefore require candidates for this position to submit a Statement of Good Conduct (VOG). This statement can be obtained from the Civic Affairs department of the municipality where you are registered. The costs of this statement will be reimbursed. You can find detailed information about the VOG on&nbsp;https://www.justis.nl/producten/vog/.Diversity and inclusionFostering an inclusive community is a central element of the values and vision of Leiden University. Leiden University is committed to becoming an inclusive community which enables all students and staff to feel valued and respected and to develop their full potential. Diversity in experiences and perspectives enriches our teaching and strengthens our research. High quality teaching and research is inclusive.InformationEnquiries can be made to Dean of PhD-studies, (promovendidecaan@law.leidenuniv.nl).&nbsp;If&nbsp;you have any enquiries about the procedure, please contact the Executive Director of the Graduate School, Mr. Sven Bontje (Meijersinstituut@law.leidenuniv.nl).Information about&nbsp;the Graduate School&nbsp;and about Leiden University at&nbsp;www.leiden.edu.Information on the advanced research qualification and research programmes of the Graduate School of Legal Studies can be found on:&nbsp;https://www.universiteitleiden.nl/en/law/researchApplicationsPlease submit online your application&nbsp;no later than&nbsp;03/31/2022&nbsp;via the blue button in&nbsp;our application system.To apply for this vacancy, please uploadregistration form;letter of motivation;CV;letter of intent of your envisaged supervising professor.On the basis of received applications, a selection will be made. The selected applicants will be requested to elaborate their research proposal (deadline June 1st 2022).&nbsp;The selection committee invites the selected candidates for an interview mid-June.Enquiries from agencies are not appreciatedApply now", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Leiden University was founded in 1575 and is one of Europeâ\u0080\u0099s leading international research universities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5NWZcLzc3Y1wvOTVmNzdjYjE3YjNmODExNDlkZmNlYmIyYWRmYzc1MWQucG5nIiwiZWRpdHMiOltdfQ=="}