{"url": "https://academicpositions.com/ad/imec/2022/photonic-project-and-scientific-lead/174827", "title": "Photonic Project and Scientific Lead", "publish_date": "2022-02-03", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Researcher", "field": "Applied Physics, Image Processing, Optics, Photonics, Systems Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Lead photonic projects and guide and mentor project contributorsWhat you will doWithin imecâ\u0080\u0099s Sensor and Actuator Technology department, our group focuses on integrated and flat optic systems by leveraging imecâ\u0080\u0099s advanced manufacturing capabilities in technologies such as SiN, Si photonics and many more. We design and characterize PICs and optical systems to target various applications in diverse domains such as sensing for metrology or life sciences, beamforming for location, ranging or telecommunication, and flat optics for display and imaging.&nbsp;&nbsp;We are looking for a project lead who has a strong knowledge of photonic and integrated photonic systems and who can quickly understand and expand on new system concepts. Someone who can provide both project leadership and scientific and operational guidance in a fast-growing group. Good communication skills are a must.&nbsp;Your Role:Lead photonic projects and guide and mentor project contributorsDevelopment of project planning, resources and timelinesDevelop and propose photonic systems and conceptsFollow up on project deliverables and commitmentsCustomer interaction during project follow up and proposal developmentContribute to key scientific results and drive scientific directionWhat we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will define the society of tomorrow.We are&nbsp;committed to being an inclusive employer&nbsp;(http://www.imec-int.com/en/careers#diversity)&nbsp;and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. In everything we do, your future colleagues are guided by the imec values of passion, excellence, connectedness and integrity. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a market appropriate salary with many fringe benefits.&nbsp;Who you areYou have a PhD (or equivalent) and at least 5 yearsâ\u0080\u0099 experience.You have a strong background in integrated photonics and photonic systems.You have experience as project lead.You have experience in making project proposals - you are organized and you can structure a complex project.&nbsp;You have excellent communication skills, that you will use to interface with internal and external customers.&nbsp;You can work according to agreed customer timelines and manage time efficiently according to the project schedules.You take initiative and work on your own, while being part of a team.You are result-driven and flexible to meet stringent deadlines with quality output.The imec environment requires a good team player with customer-oriented communication and reporting skills.&nbsp;Given the international character of imec, a good knowledge of English is mandatory.The imec environment requires a good team player with customer-oriented communication and reporting skills.&nbsp;Given the international character of imec, a good knowledge of English is mandatory.Apply online at&nbsp;www.imec.be/jobs.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}