{"url": "https://academicpositions.com/ad/silicon-austria-labs-sal/2022/research-engineer-electromagnetic-compatibility-for-power-electronics-f-m-d/174943", "title": "Research Engineer - Electromagnetic Compatibility for Power Electronics (f/m/d)", "publish_date": "2022-02-07", "deadline": "2022-05-07", "location": "Inffeldgasse 33 Graz, Austria", "city": "N/A", "country": "Austria", "position": "Engineer/Technician", "field": "Applied Physics, Electrical Engineering, Electromagnetism, Electronics, Engineering Physics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Silicon Austria Labs (SAL)", "job_description": "YOUR FUTURE RESPONSIBILITIESWorking in all aspects of Electromagnetic Compatibility (EMC) for Power Electronics.Power electronic component modeling (active and passive devices) used for simulations in EMC, including simplification of the models (Model order reduction).3D Field simulations, transient circuit simulations and frequency domain circuit simulations.Designing and building additional circuits and mechanical fixtures for power electronics and EMC investigations.Design laboratory measurement setups, build them and execute measurements.Automatization of the setups with MATLAB including Postprocessing of result data with MATLAB.YOUR PROFILEBachelor in Electrotechnics, Telematics or similar.Excellent written and oral communication skills in English.Solid foundations in Electronics, Power Electronics Hardware and Electromagnetic Compatibility.Knowledge in Electrodynamics and EM field theory.Programming knowledge in MATLAB.Soldering electronic circuits.Lab equipment usage.Ocilloscopes, power supplies, multimeters.(Ideally) impedance analyzers, network analyzers.Experience in using simulation tools forTansient electronics circuit simulation (e.g. LTspice).(Ideally) field simulations (like Ansys HFSS) and RF circuit simulations (e.g. Keysight ADS).IMPORTANT FACTS ABOUT SALBeginÂ­ning of the employÂ­ment: March 2022.Flexible hours without coretime.Free coffee/tea/milk and fresh fruits.Family/Kids friendly.â\u0082¬ 4.- food allowance in restaurants / â\u0082¬ 2.- in supermarkets.Homeoffice possible.â\u0080\u008bThis position is subject to the Collective Agreement for employees in non-university research (Research CA) starting in occupational group E. We offer competitive salaries and additional benefits based on your experience and qualifications. For this position, your monthly salary starts with EUR 3.274, paid 14 times a year.&nbsp;ABOUT USSilicon Austria Labs (SAL) is a top research center for Electronic Based Systems (EBS). At three locations (Graz, Villach, Linz), SAL is conducting research along the entire EBS value chain in the areas of sensor systems, power electronics, RF (radiofrequency) systems, system integration and embedded systems to develop future-oriented solutions for industrial production, health, energy, mobility, safety and more. SAL brings together key players from industry, science and research and thus valuable expertise and know-how and conducts cooperative, application-oriented research along the value chain. Cooperative projects are co-financed by SAL and enable a fast and unbureaucratic project start. SAL is thus shaping the high-tech location Austria and Europe and developing the future&nbsp;Innovation is our top priority and so are our employees. We are a family-friendly company and support the compatibility of work and family as much as possible. That is why we have been awarded the Work and Family Certificate until 2023. But we are constantly working on new measures to offer our employees an environment where they feel good, healthy and motivated.Innovation is our top priority and so are our employees. We are a family-friendly company and support the compatibility of work and family as much as possible. That is why we have been awarded the Work and Family Certificate until 2023. But we are constantly working on new measures to offer our employees an environment where they feel good, healthy and motivated.You want to get more SAL insights?", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "In the network of science and industry, we carry out reÂ­search at the highest global reÂ­search level.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI3YjZcLzM0NlwvN2I2MzQ2ODRlNjQ2YThlYmM4ODM3ZmI2NDQ4OGM1NTcuc3ZnIiwiZWRpdHMiOltdfQ=="}