{"url": "https://academicpositions.com/ad/imec/2022/r-d-engineer-thermal-modeling-and-characterization/174880", "title": "R&D engineer thermal modeling and characterization", "publish_date": "2022-02-04", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Computational Physics, Electronics, Engineering Physics, Experimental Physics, Fluid Dynamics, and 2 moreFluid Mechanics,Thermodynamics", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "What you will doThe Thermal Modeling and Characterization teamâ\u0080\u0099s R&amp;D activities focus on the understanding of the thermal behavior and cooling needs in electronic systems, at all relevant length scales from the device level to the system level, for a wide ride of applications such as advanced packaging, 3D stacking technology, nano-interconnect, silicon photonics, scaled transistors, RF and GaN. To support the imec technology programs and projects, we characterize the thermal performance of new technologies, improve the thermal design and develop novel, integrated cooling solutions, using a combination of numerical modeling and experimental thermal characterization techniques.&nbsp;As an R&amp;D engineer thermal modeling and characterization, you will work on the development of the cooling solutions for future electronic products. In this role you will:&nbsp;contribute to all aspects of the development of advanced cooling solutions, including liquid cooling for high performance applications and heat spreading solutions for mobile applications (design, modeling, experimental characterization).perform thermal modeling studies to assess the thermal performance of new technologies and to improve this thermal performance.perform experimental thermal characterization of materials, packages and integrated test vehicles.design thermal test structures and experimental set-ups.develop novel thermal metrology techniques for applications where the common techniques are not sufficiently accurate.collaborate with the integration engineers from the technology departments to define design of experiments for test structures.communicate the results to internal stakeholders, to imecâ\u0080\u0099s industrial partners and to the scientific community.What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will determine the society of tomorrow.We are committed to being an inclusive employer and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a competitive salary with many fringe benefits.&nbsp;Who you areYou have MSc or PhD degree in (Fluid &amp; Thermal) Engineering, Physics or Mathematics, preferably PhD.You have a strong background in numerical modeling, preferably computational heat transfer (FEM) and fluid dynamics (CFD).Experience with experimental heat transfer, the design of thermal test structures and experimental set-ups is considered a plus.Experience with electronic applications is not required, but considered a plus.You are a team player with experience working in an interdisciplinary team.You are fluent in English and have good communication skills to interact with various research groups in project partners.Your are flexible in this challenging environment where priorities can switch easily.You like to try new approaches and you have a critical mindset.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}