{"url": "http://www.academictransfer.com/en/309273/phd-candidate-the-development-and-contestation-of-gender-knowledge-in-international-organisations/", "title": "PhD Candidate: The Development and Contestation of Gender Knowledge in International Organisations", "publish_date": "2022-02-09", "deadline": "2022-02-27", "location": "Houtlaan 4, 6525 XZ, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "PhD", "field": "Economics", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "N/A", "employer": "Radboud University", "job_description": "<p><em>Many organisations struggle with questions surrounding gender equality, diversity and inclusion. To help organisations progress in these areas, we need more insights into the origin and development of gender knowledge. As a PhD candidate, your cutting-edge research into gender knowledge in international organisations can help us better understand and facilitate successful gender mainstreaming.</em></p> As a PhD candidate, you will carry out research on gender knowledge creation and contestation in international organisations. Focusing on the International Labour Organization (ILO), it will be of particular interest to determine the pathways of and the causes for the emergence of gender knowledge as well as conflictual or consensual processes associated with it. Given that gender knowledge forms the basis of gender mainstreaming policies adopted by both national and international bureaucracies, learning about its origin is crucial to understand and facilitate successful gender mainstreaming. The project is based on a qualitative research design and involves field research in Geneva, archival research, document analysis and conducting interviews. It is also closely linked to the research hotspot '<a href=\"https://www.ru.nl/nsm/imr/our-research/hot-spots/gender-power-politics-management/\">Gender and Power in Politics and Management</a>', which both PhD supervisors are affiliated with and which offers researchers from different disciplines a platform for exchange, collaboration and exchange. <br>You will be responsible for carrying out the core of the data collection and analysis for this project, which will include travelling to conduct semi-structure interviews and collect documents at the International Labour Organization in Geneva. In addition, you will be expected to co-author publications in which the project findings are reported and individually report on your own research in highly-regarded academic journals and in the form of a PhD manuscript. Research findings will also be presented at international and national academic conferences. At different points throughout the project, you will have the opportunity to engage in knowledge valorisation activities, such as briefings to policymakers. Supervision will be provided by Dr Inge Bleijenbergh (Department of Business Administration) and Dr Jutta Joachim (Department of Political Science) who will jointly act as PhD supervisors.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You have a Master's degree in one of the social sciences such as political science/international relations, public/business administration or sociology (or a related discipline).</li>\n<li>You have excellent research skills, and knowledge of and experience with conducting qualitative interviews, archival research and qualitative content analysis.</li>\n<li>You are fluent in English and French, and have excellent academic writing skills in English.</li>\n<li>You are able to work independently as well as in a team.</li>\n<li>You have good organisational and project management skills.</li>\n<li>Particular knowledge of and experience in organisational and gender studies is a plus.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: You will be employed for an initial period of 18 months, after which your performance will be evaluated. If the evaluation is positive, the contract will be extended by 2.5 years (4 year contract) or 3.5 years (5 year contract).</p>\n<ul>\n<li>Employment for 0.8 (5 year contract) - 1.0 FTE (4 year contract).</li>\n<li>The gross starting salary amounts to â\u0082¬2,443 per month based on a 38-hour working week, and will increase to â\u0082¬3,122 from the fourth year onwards (<a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/\">salary scale P)</a>.Â </li>\n<li>You will receive 8% holiday allowance and 8.3% end-of-year bonus.</li>\n<li>You will be employed for an initial period of 18 months, after which your performance will be evaluated. If the evaluation is positive, the contract will be extended by 2.5 years (4 year contract) or 3.5 years (5 year contract).</li>\n<li>You will be able to use our <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/our-way-working-personal-approach/dual-career-family-support-service/\">Dual Career and Family Care Services</a>. Our Dual Career and Family Care Officer can assist you with family-related support, help your partner or spouse prepare for the local labour market, provide customized support in their search for employmentÂ  and help your family settle in Nijmegen.</li>\n<li>Working for us means getting extra days off. In case of full-time employment, you can choose <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/more-info-working/flexible-working-times/\">between 29 or 41</a> days of annual leave instead of the legally allotted 20.</li>\n</ul>\n<em>Additional employment conditions</em>\nWork and science require good employment practices. This is reflected in Radboud University's primary and secondary <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/\">employment conditions</a>. You can make arrangements for the best possible work-life balance with flexible working hours, various leave arrangements and working from home. You are also able to compose part of your employment conditions yourself, for example, exchange income for extra leave days and receive a reimbursement for your sports subscription. And of course, we offer a good pension plan. You are given plenty of room and responsibility to develop your talents and realise your ambitions. Therefore, we provide various training and development schemes.\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    \n              \n              The <a href=\"https://www.ru.nl/nsm/\">Nijmegen School of Management</a> is an academic centre of research and higher learning. It has seven focus areas: <a href=\"https://www.ru.nl/businessadministration/\">Business Administration</a>, Public Administration, <a href=\"https://www.ru.nl/politicalscience/\">Political Science</a>, Economics, Social and Political Sciences of the Environment, Human Geography, and Spatial Planning. NSM strives for a multidisciplinary approach whenever possible. Altogether, NSM employs 350 FTEs, 75% of whom are academics.Â \n\n<br/>Both Bachelor's and Master's degree programmes are offered in the seven focus areas, which are organised in NSM's educational institute. The educational programme is characterised by small-scale teaching and provides a stimulating learning environment with an emphasis on the development of academic skills. NSM currently has approximately 5,000 students. NSM's research activities fall under the responsibility of the interdisciplinary <a href=\"https://www.ru.nl/nsm/imr/\">Institute for Management Research</a> (IMR). Under the motto 'Responsible Governance for Sustainable Societies', our researchers carry out state-of-the-art research into complex problems of governance and management, in order to explain the causes of these problems, and to use that knowledge to create potential solutions. They combine knowledge and expertise from multiple disciplines with collaboration with relevant societal actors.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For questions about the position, please contact Jutta Joachim, Associate Professor at +31 24 361 21 13 or <a href=\"mailto:jutta.joachim@ru.nl\">jutta.joachim@ru.nl</a>. Alternatively, you can contact Inge Bleijenbergh, Associate Professor at +31 24 361 14 74 or <a href=\"mailto:inge.bleijenbergh@ru.nl\">inge.bleijenbergh@ru.nl</a>.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.ru.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/run-en-wide/13abf0bc0a611f32246d62b46488f997.jpg"}