{"url": "https://www.academictransfer.com/en/309204/ambtelijk-secretaris-examencommissie/", "title": "Ambtelijk secretaris examencommissie", "publish_date": "2022-02-08", "deadline": "2022-02-27", "location": "Houtlaan 4, 6525 XZ, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Radboud University", "job_description": "<p><em>Examencommissies vervullen in elke opleiding een cruciale rol. Zij richten zich op de kwaliteit van toetsing en beslissen over verzoeken van studenten. Als ambtelijk secretaris ondersteun je examencommissies op administratief, organisatorisch en beleidsvoorbereidend vlak. Zo heb jij invloed op het doorvoeren van beslissingen die de kwaliteit van onderwijs aan de Radboud Universiteit verbeteren.</em></p> <p>De examencommissies van de Faculteit der Natuurwetenschappen, Wiskunde en Informatica (FNWI) zijn belast met het toezicht op de toepassing van de Onderwijs- en Examenregeling (OER) en behandelen individuele verzoeken van studenten, verzoeken rondom vrijstellingen, de goed- of afkeuring van individuele studieprogramma’s en verzoeken tot uitzonderingen op facultaire regelingen.</p> <p>Daarnaast ontwikkelen de examencommissies beleid over de kwaliteit van de toetsing van tentamens en schriftelijke stukken, zoals essays en scripties, en dragen zij zorg voor de borging ervan. De vier onderwijsinstituten van de Faculteit der Natuurwetenschappen, Wiskunde en Informatica verzorgen in totaal zeven bacheloropleidingen en negen masteropleidingen. Als ambtelijk secretaris ondersteun je, samen met je collega's, de vier examencommissies van de faculteit op beleidsmatig en administratief vlak. <br><br>Je toetst de voorgenomen standpunten en besluiten van de examencommissies aan de relevante besluitvormingskaders, procedures en wettelijke bepalingen, bijvoorbeeld de Onderwijs- en Examenregeling (OER) en de Wet op het Hoger Onderwijs (WHW). Verder verzorg je de voorbereiding en afhandeling van studentverzoeken voor extra tentamens, aanvragen van keuzevakken en klachten met betrekking tot tentamens/examens. Je coördineert fraude- en plagiaatzaken en beroepsprocedures. Tevens draag je bij aan de beleidsontwikkeling en besluitvorming van de examencommissies, onder andere door het opstellen en bewaken van procedures en reglementen en het hieraan toetsen van besluiten. Je levert informatieve kern- en stuurgetallen aan voor de totstandkoming van het jaarverslag en werkt samen met je collega's aan een gestructureerde database om deze gegevens vast te leggen. Ook signaleer je relevante ontwikkelingen met betrekking tot de bevoegdheden en het functioneren van de examencommissies. Je draagt bij aan de kwaliteitszorg rondom toetsing en scripties. Tot slot ben je verantwoordelijk voor het organiseren, voorbereiden en vastleggen van de vergaderingen van de individuele examencommissies en de halfjaarlijkse overkoepelende vergaderingen met het faculteitsbestuur. <br><br>In je functie als ambtelijk secretaris van de examencommissies val je onder directe aansturing van het hoofd Onderwijscentrum (OWC) van FNWI. Daarbij werk je nauw samen met verschillende teams binnen het OWC.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.ru.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/run-en-wide/13abf0bc0a611f32246d62b46488f997.jpg"}