{"url": "https://academicpositions.com/ad/orebro-university/2022/postdoctoral-researchers-in-computer-science/174964", "title": "Postdoctoral researchers in Computer Science", "publish_date": "2022-02-07", "deadline": "2022-02-28", "location": "Fakultetsgatan 1 Ã\u0096rebro, Sweden", "city": "N/A", "country": "Sweden", "position": "Postdoc", "field": "Algorithms, Artificial Intelligence, Computer Vision, Human-computer Interaction, Information Systems (Business Informatics), and 5 moreMachine Learning,Programming Languages,Robotics,Software Engineering,Theory of Computation", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ã\u0096rebro University", "job_description": "The School of Science and Technology at Ã\u0096rebro University is seeking up to two postdoctoral researchers in Computer Science for a fixed-term 2-year appointment.The researchers are to be based at Ã\u0096rebro University's Center for Applied Autonomous Sensor Systems (AASS, http://www.oru.se/aass), which carries out multi-disciplinary research at the intersection of robotics, machine learning, artificial intelligence, computer vision, computer science, and measurement technology. Our research in general is carried out in close partnership with world-leading corporations such as Volvo, Epiroc, Scania, LKAB and Bosch, as well as with the public sector. Our research on perception, planning and coordination systems for mobile robots is recognized world-wide.The positions are associated with a research project that aims to develop novel solutions for teams of robots working with and for humans. The ambition is to develop methods in one of the following two areas:(1) methods for instructing robots and enabling robots to learn from each other(2) methods that make it possible for humans and robots to understand each otherâ\u0080\u0099s intentions.Please indicate in your application which of the above areas best fits your profile.The positions provide the opportunity to work on exciting and practically relevant problems in close cooperation with leading industrial stakeholders, including Epiroc, Scania, and Volvo. The developed approaches will be relevant in several application domains, including mining, construction, public transport, and factory automation.The successful candidate is required to have a solid theoretical background in one or more of the following topics:Machine learning and applications to robotics, including reinforcement learning and imitation learning for robot controlIntention understandingComputer vision and applications to robotics, including visual localization and visual teach and repeatRobot navigation and robot controlWe seek candidates with:significant track record in one or more of the fields above including publications in relevant conferences and journalsproven ability to combine theoretical investigation and practical work with real applicationsstrong expertise in system development, programming and use of current frameworks for robotics and machine learning, e.g., ROS, PyTorch, TensorFlowExperience in the use of AI methods with real robot systems is a plus.Duties and responsibilitiesThe successful candidate shall be engaged in both research and integration work and is expected to produce both scientific publications and project demonstrators.The successful candidate will be required to work closely with our industrial partners, engaging in problem elicitation and demonstration activities, and testing, where appropriate and possible, in real production settings.It is not necessary to be familiar with the Swedish language, but proficiency in written/spoken English is mandatory.EligibilityEligible for the appointment as postdoctoral researcher are applicants holding a doctoral degree in Computer Science or in related subject areas. Candidates who are expected to complete a doctoral degree after the application deadline will also be given full consideration but in that case proof of a completed degree must be presented before an appointment decision can be taken. The doctoral degree should have been awarded no more than three years prior to the application deadline. Candidates who have obtained their doctoral degree prior to that may however also be considered if special grounds exist (leave of absence due to illness, parental leave, clinical duties, an elected position in a trade union, or other similar circumstances).Assessment criteriaThe assessment of the candidates is based on previous research and publication records and the suitability to the topics outlined above, as well as demonstrated programming and deployment skills.Good communication skills in English, both written and spoken, is a requirement.EqualityOur ambition is to create a place of work that is characterized by gender equality and diversity. All genders are most welcome to apply.InformationThe positions are full-time positions for a fixed term of two years. The salary depends on the successful candidateâ\u0080\u0099s qualifications and experience.For more information about the scientific aspects of this position, please contact Professors Federico Pecora (federico.pecora@oru.se), Johannes Andreas Stork (johannesandreas.stork@oru.se), &nbsp;Stephanie Lowry (stephanie.lowry@oru.se), and Marjan Alirezaie (marjan.alirezaie@oru.se).For other information regarding this position, please contact the Head of AASS, Professor Lars Karlsson (lars.karlsson@oru.se).For the application to be complete, the following electronic documents must be included:Cover letter (max 1 page, in English)CV, including names of two academic references who may be contacted (if needed)An account of research qualificationsCopies of relevant degree certificatesScientific publications for consideration (maximum of 10)Only documents written in English, Swedish, Norwegian and Danish and received via Ã\u0096rebro Universityâ\u0080\u0099s web-based recruitment system can be reviewed.The application deadline is 2022-02-28, with an expected start date in Spring 2022. We look forward to receiving your application!We decline any contact with advertisers or recruitment agencies in the recruitment process.As directed by the National Archives of Sweden (Riksarkivet), Ã\u0096rebro University is required to deposit one file copy of the application documents, excluding publications, for a period of two years after the appointment decision has gained legal force.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The university provides education and research in humanities, law, social science, science, technology, health care, medicine, education, music and sport science.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIwN2NcL2NiMVwvMDdjY2IxODE3NzRlM2RiMjhiN2U5OGIxNGE0YTgxM2IucG5nIiwiZWRpdHMiOltdfQ=="}