{"url": "https://www.academictransfer.com/en/309286/medewerker-accounts-receivable-ar-10-fte/", "title": "Medewerker Accounts Receivable (AR) - (1.0 fte)", "publish_date": "2022-02-09", "deadline": "2022-02-22", "location": "Burgemeester Oudlaan 50, 3062PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "40", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "<p>De Dienst Finance is verantwoordelijk voor alle zeer strak geleide operationele financi&euml;le en transactie verwerkende activiteiten die binnen de Erasmus Universiteit Rotterdam plaatsvinden.<br> <br> Als medewerker AR ben je met het team verantwoordelijk voor de debiteurenadministratie en de inning van de collegegelden van studenten van de Erasmus Universiteit Rotterdam. Je draagt mede zorg voor het verwerken van bankmutaties, zorgdragen voor incasso- en restitutieopdrachten, het periodieke afsluitproces, het bewaken van tussenrekeningen, het analyseren van verschillen en je bent verantwoordelijk voor een tijdige en betrouwbare financi&euml;le verslaglegging. Je wordt functioneel aangestuurd en ondersteund door een teamleider.</p><p>Indicatie van werkzaamheden:</p><ul> <li>Verwerken facturen</li> <li>Verwerken van bankafschriften</li> <li>Beantwoorden van vragen van klanten/studenten</li> <li>Aanmanen</li> <li>Het maandelijks opschonen van de AR tussen- en balansrekeningen</li> <li>Je verzorgt de maandelijkse AR afsluiting en afstemming met het grootboek</li> <li>Het incassoproces en alle daaruit voortkomende werkzaamheden, zoals o.a. het verwerken van de machtigingen, het aanmanen aan studenten en uit handen geven van zaken aan een incassobureau</li> <li>Ondersteunen bij andere ad-hoc werkzaamheden op de afdeling</li> </ul><p>Bij ons is de werksfeer informeel en deze wordt gekenmerkt door een grote mate van loyaliteit en collegialiteit. Naast een moderne en dynamische werkomgeving bieden wij een hoge mate van zelfstandigheid waarbij veel ruimte is voor persoonlijke groei en vakinhoudelijke ontwikkeling.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}