{"url": "https://academicpositions.com/ad/international-max-planck-research-school-for-molecular-life-sciences-imprs-ls/2021/upcoming-phd-positions-autumn-2021-at-international-max-planck-research-school-for-molecular-life-sciences-munich/172097", "title": "Upcoming PhD Positions Autumn 2022 at International Max Planck Research School for Molecular Life Sciences, Munich", "publish_date": "2021-12-10", "deadline": "2022-08-01", "location": "Am Klopferspitz 18 Munich, Germany", "city": "N/A", "country": "Germany", "position": "PhD", "field": "Biochemistry, Bioinformatics, Biophysics, Computational Biology, Genetics, and 6 moreImmunology,Neurology,Neuroscience,Signal Processing,Structural Biology,Systems Biology", "salary": "N/A", "max_working_hours": "N/A", "employer": "International Max Planck Research School for Molecular Life Sciences (IMPRS-LS)", "job_description": "Thanks to all the academics who submitted their application!The application deadline has passed and the selection process started. More information for the new call-out will come up during Autumn 2022. Stay tuned!The International Max Planck Research School for Molecular Life Sciences: From Biological Structures to Neural Circuits (IMPRS-LS) currently has an open call for fully funded PhD student positions. We are looking for outstanding graduates from all over the world to join our network of passionate young scientists in one of Europe's most attractive cities.We offer you:Excellent career opportunities in a vibrant international research community.An English-speaking structured PhD program organized by Munich-based Max Planck Institutes and Universities.State-of-the-art facilities and cutting-edge research projects.Individual supervision and mentoring from research scientists who are leaders in their respective fields.Full funding for international and German students, with no tuition costs and additional funding for scientific meetings and trainings.JOIN OUR NETWORKThe strongest asset of our graduate program is a vivid research network that our students have access to. IMPRS-LS brings together two renowned Max Planck Institutes, the MPI of Biochemistry and the MPI of Neurobiology as well as two leading partner universities, the LMU and TUM, to deliver first class training for the worldâ\u0080\u0098s most promising young scientists.Connecting different research groups in Munich, IMPRS-LS also connects diverse research topics and fosters interdisciplinary collaborations. Our studentsâ\u0080\u0099 and their supervisorsâ\u0080\u0099 research activities center around three distinct but well-connected research branches: they strive to uncover molecular mechanisms regulating biological processes, analyze the resulting complex biological systems and decipher the intricate network of neural circuits. More than 60 distinguished and internationally recognized group leaders actively participate in the PhD program and offer challenging and cutting-edge PhD projects in the following areas:BiochemistryBiophysicsBio-imagingComputational BiologyGene RegulationImmunologyNeurobiologyNeurodegenerationProtein StructureSignalingSystems BiologySTRUCTURED PHD PROGRAM FOR FUTURE LEADERS IN SCIENCEIMPRS-LS provides comprehensive scientific training in a superb and vibrant research environment with state-of-the-art facilities to students aiming for a successful career in science. Our doctoral students work within international teams of scientists in an interdisciplinary setting with extensive access to expertise and support. Seminars, summer schools, elective courses, career development training and participation in international conferences supplement laboratory work.LIVING IN MUNICHThe cosmopolitan city of Munich is at the forefront of scientific research in Germany and, situated in the heart of Bavaria, uniquely combines traditions and history with great infrastructure of the modern city. Munich has a lively, international feel, with cultural and entertainment opportunities for each taste and beautiful Alpine nature within just an hour of travel.Munich benefits from the presence of a large number of research institutes, two worldwide high-ranked universities and many non-university science-related establishments as well as numerous biotech and pharmaceutical companies. Thus, Munich is not only a great place to live in, but also a vivid environment for research and fruitful collaboration within academia and between academia and industry.We invite highly qualified candidates with a strong commitment to basic science to apply.Applicants should hold an MSc (or equivalent degree) with a strong background in biological sciences, neurosciences, biochemistry, biophysics, biotechnology or a related discipline.Outstanding candidates with a first class BSc degree (or equivalent degree) are eligible to apply for the fast-track option.For more information, eligibility criteria and online application please visit our website: www.imprs-ls.de", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The IMPRS for Molecular Life Sciences: From Biological Structures to Neural Circuits is a center of excellence for the training of PhD students in the areas of biochemistry, cell biology, molecular medicine, neurobiology and structural biology.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI4NTdcL2RmNlwvODU3ZGY2NzRlNzc1MDM2NjZkZjFiZTVkZWY2NTBlMWMucG5nIiwiZWRpdHMiOltdfQ=="}