{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/core-micro-lab-manager/175072", "title": "CORE-MICRO Lab Manager", "publish_date": "2022-02-09", "deadline": "2022-05-09", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Management", "field": "Biotechnology, Food Science, Microbiology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "College of Healthcare TechnologyWhy the American University of Iraq â\u0080\u0093 Baghdad?Opening its doors in January of 2021, the new American University of Iraq â\u0080\u0093 Baghdad (AUIB) began as a dream of influential individuals in Iraqi and the United States business, industry and government who want to see a world-class institution of higher learning established in the city, reminiscent of the days when Baghdad was an educational mecca and flourishing capital of the Muslim world.&nbsp; With a great library, palatial college buildings and student centers, state-of-the-art classrooms, laboratories, and athletic facilities, AUIB will be a beautiful campus attracting students, faculty, and staff from throughout the world.&nbsp; We invite you to join us in this exciting new venture.This position will report directly to Associate Vice President for Academic AffairsJOB DESCRIPTIONUnder the overall guidance and supervision of the Dean of the College of Healthcare Technologies (CHT), the Manager of CORE â\u0080\u0093 MICRO duties and responsibilities include, but will not necessarily be limited to, the following:Performance of food microbiology diagnostics testing including food pathogen diagnosis and food quality control among othersManagement of the daily laboratory operation including staff, supplies and expensesWorking with the Quality Assurance Manager to achieve and maintain laboratory accreditation under ISO17025-2017, ISO15189 and relevant certifications.Planning, budgeting, and staffing and resources for current and future operationsNegotiate contracts relating to maintenance of instruments, safety and waste disposal and other related activities contractsImplement, verify, and validate new food microbiology, food safety, food technology and other testing as neededEnsure evolving practices in the various applications of the facilityBe involved in academic and continuous education and research including patent and/or manuscript drafting and submissionDevelop professional relationships ensuring smooth cooperation with manufacturers, suppliers, academia, and other partners and maintain continuous improvement of facility staffProblem solving of all issues that occur in high throughput molecular diagnosis testing laboratoriesAssist the CHT dean with the coordination of work between CORE â\u0080\u0093 MICRO, other colleges and departments and programs and external partnersOther related duties as assigned.REQUIREMENTSMasterâ\u0080\u0099s degree Microbiology, Food Science, Food Technology, or related fieldTechnical procedures, or governmental regulations are preferred or pursuing or equivalent work experienceA minimum of 5 to 10 years of relevant full-time professional experience in food microbiology, food safety and food technologyProven leadership and management experienceExcellent written and spoken English language skills at a level consistent with high profile publications and professional communicationAbility to coordinate closely and effectively with AUIB healthcare-related colleges, as well as subordinate staff in a complex and dynamic institutional missionExcellent organization and multi-tasking skills, and the ability to maintain production levels while driving innovationExceptional positive and compelling attitude and demonstration of professionalism, teamwork, flexibility, and working under pressureProven ability to interact positively with colleagues from various backgrounds regardless of nationality, religion, or genderProfessional mastering of Microsoft 365 applications including Word, Excel, and PowerPoint among others. Substantial Knowledge of computer literacy including software and hardwareWillingness to work flexible hours including late evenings and weekendsApplication Procedure:&nbsp;Applications should include:Cover Letter&nbsp;Curriculum VitaPassport First Data PageContact Information For Three (3) Professional ReferencesCopies Of Degrees Or CertificationApplications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately.&nbsp;Please apply through AUIB website OR send your application and supporting documents to the following email address:jobs@auib.edu.iq&nbsp;with&nbsp;Karin.Jesuis@auib.edu.iq&nbsp;in copy.&nbsp;A declaration of a relation at AUIB is obligatoryWe will contact you if you are selected for interview.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "AUIB is a non-profit, private university that is fully accredited in Iraq by the Ministry of Higher Education and Scientific Research, thereby ensuring a high level of academic standards and institutional performance.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}