{"url": "https://academicpositions.com/ad/university-of-padova/2021/postdoctoral-fellowship-in-mechanobiology-and-cancer/171445", "title": "Postdoctoral fellowship in mechanobiology and cancer", "publish_date": "2021-12-07", "deadline": "N/A", "location": "Via 8 Febbraio 1848, 2 Padua, Italy", "city": "N/A", "country": "Italy", "position": "Postdoc", "field": "Cancer Research, Cell Biology, Molecular Biology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Padova", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><img class=\"image_resized\" src=\"https://ap-production-media-archive.s3.eu-north-1.amazonaws.com/uploads/QMfmpc25ZdJGqFvBsjC93oz4POAjHdEouwAQzc3N.jpg\" style=\"width:18.48%;\"/>          <img class=\"image_resized\" src=\"https://ap-production-media-archive.s3.eu-north-1.amazonaws.com/uploads/ylt4r8FuO9stWm5Efhju9zqCcWeYqIul1x1EpVWQ.png\" style=\"width:17.42%;\"/></p><p>The laboratory of Dr. Sirio Dupont investigates how the 3D cell microenvironment regulates cell behavior. The lab is looking for a highly motivated postdoctoral researcher to join the team and lead the next step in our research.</p><p>Our lab significantly contributed to understanding how tissue mechanics and physiology integrate within cells. Dr. Dupont spearheaded the discovery that YAP/TAZ proteins respond to the mechanical properties of the extracellular matrix surrounding the cells, and how this pathway regulates homeostasis and cancer development in the mouse liver (Dupont Nature 2011; Aragona Cell 2013; Pocaterra J Hepatology 2019; Pocaterra CommsBio 2021). More recently we discovered how mechanical cues profoundly shape cell metabolism and contribute to cancer cell metastatic dissemination (Romani Nature Cell Biology 2019; Romani NatRevMolCellBiol 2020; Romani Nature Cell Biology in press; Dupont and Wickstrom NatRevGen under review). Dr. Dupont has been recently awarded as Clarivate Highly Cited Researcher in 2021. The current aim of the lab is understanding how cancer cell mechanics regulates key cell processes and metabolic pathways, and the importance of such regulation for therapy.</p><p>Lab website: <a href=\"https://www.medicinamolecolare.unipd.it/labdupont\" target=\"_blank\">https://www.medicinamolecolare.unipd.it/labdupont</a> </p><p>Lab publications: <a href=\"https://www.ncbi.nlm.nih.gov/myncbi/sirio.dupont.1/bibliography/public/\" target=\"_blank\">https://www.ncbi.nlm.nih.gov/myncbi/sirio.dupont.1/bibliography/public/</a></p><p>Lab account on Twitter: @SirioDupont</p><p>Project:</p><p>How the mechanical properties of the tumor microenvironment regulate metabolism, and how this impact metastatic cancer cell response to treatment.</p><p>Among the many factors that influence cancer cell growth and response to therapy, a powerful but still poorly investigated one are the mechanical properties of the tumor microenvironment. Many studies have concentrated so far on the notion that primary breast cancer growth entails the stiffening and remodeling of the collagenous ECM to drive cell proliferation and invasiveness. However, when cancer cells disseminate to distant organs they almost invariably find themselves in very soft tissue environments (brain, bone marrow, lung, liver), and what are the effects of such â\u0080\u009cmechanical transitionâ\u0080\u009d remains poorly understood. This is particularly important in light of the notion that the primary cause of cancer-associated death in patients is metastasis, not primary tumor growth. The objectives of the study are to study how cancer cell signaling and metabolism are rewired in response to such â\u0080\u009cmechanical transitionâ\u0080\u009d, including the underlying mechanotransduction molecular mechanisms. A primary goal is to identify metabolic traits bestowed on cells by the mechanical microenvironment that can be used as liabilities to develop new therapy approaches aimed at eradicating disseminated dormant cancer cells, and thus potentially preventing metastatic relapse.</p><p>Fellowship:</p><p>The Postdoctoral position is opened immediately and will be filled as soon as a suitable candidate is found. The position if for three years, with a one-year starting contract and a two-year extension already covered by available grants (Worldwide Cancer Research, Italian Association for Cancer Research). The net salary is equivalent to that of an Italian entry-level Assistant Professor, and adequate to comfortably support a foreign worker in Italy. Fellows will be encouraged to apply for competitive National and International Fellowships (e.g. Marie Curie), as well as to young investigators grants towards scientific independence (e.g. University of Padua STARS Grant).</p><p>Responsibilities:</p><p>The Postdoctoral Fellow will work independently on their research project, but in close collaboration with other team members. The Fellow will have close interactions and exchanges with the PI to ensure a timely and efficient progression of the project, including peer-reviewed publication.</p><p>Profile:</p><p>The applicant should have a PhD (or should obtain a PhD within the first months of year 2022) in biological, biotechnology or pharmaceutical sciences. They should have a strong background in cell culture, imaging techniques and basic molecular biology. They are expected to have a passion for science and are motivated to work on a highly innovative project in an open and dynamic team. Previous experience in metabolism studies and/or a certificate of experimentation on laboratory animals is a plus but is not required. The ability to write and speak in English is mandatory. Good communication skills and the ability to work both independently and as part of a team are required. Priority will be given to candidates with a proven record of scientific publication (published or under review) in international peer-reviewed journals.</p><p>Techniques used in the lab:</p><p>Cell culture on micropatterned surfaces and hydrogels with controlled mechanical properties, conventional and confocal fluorescence microscopy, high throughput/high content image analyses, Fluorescence-Activated Cell Sorting (FACS), gene expression analysis, metabolic analyses, RNAi and CRISPR/CAS9 loss-of-function approaches, in vivo metastasis assays with Bioluminescent Intravital Imaging, multiplexed automated IF analyses of cancer tissues.</p><p>Environment:</p><p>We are a growing laboratory, and we are seeking for highly motivated individuals to push forward the next step in our research. We have several projects ongoing with the possibility of immediate contribution. We have an extensive network of National and International collaborations providing us with state-of-the art experimental techniques and approaches. The University of Padua is one of the top biomedical research campuses in Northern Italy and among the top-250 universities worldwide according to QS Ranking ( <a href=\"https://www.natureindex.com/institution-outputs/italy/university-of-padova-unipd/513906c234d6b65e6a00084a\" target=\"_blank\">https://www.natureindex.com/institution-outputs/italy/university-of-padova-unipd/513906c234d6b65e6a00084a</a> <a href=\"https://www.unipd.it/ranking-internazionali\" target=\"_blank\">https://www.unipd.it/ranking-internazionali</a> ). Our Research Institute hosts more than 100 laboratories, including several PIs with international recognition and many international Postdoctoral Fellows, and is the home to three PhD Schools in the Life Sciences (Biology, Molecular Medicine and Biomedical Sciences). It is easy to find accommodations within walking or biking distance from our Research Institute. Padua is a pleasant mid-sized student town with a lively life, within 2-3 hours from main Italian tourist cities by train (30min from Venice, 1hr from Bologna and Verona, 2hr from Firenze and Milan, 3.5hr from Rome).</p><p>Interested?</p><p>For more information, please write an email to prof. Sirio Dupont <a href=\"mailto:sirio.dupont@unipd.it\">sirio.dupont@unipd.it</a> and we will organize an interview.</p><p>Your application should contain (i) a complete CV with birth date, Nationality, University and PhD degrees and including a brief summary of past research achievements and publications, a motivation letter, and contact information for at least 2 (better 3) previous supervisors for reference.</p><p>The University of Padua is committed in developing an Academic environment where all talents can flourish regardless of gender, cultural background, nationality or impairments. See <a href=\"https://www.unipd.it/en/hr-excellence-research\" target=\"_blank\">https://www.unipd.it/en/hr-excellence-research</a> for more information on how the University of Padua implements the principles established by the European Charter for Researchers and the Code of Conduct for the Recruitment of Researchers.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZDVcLzQxZFwvY2Q1NDFkY2RjZTNlYWQyZTVkZmMyNzVkZmE1MDM3YTkuanBlZyIsImVkaXRzIjpbXX0="}