{"url": "https://academicpositions.com/ad/university-of-antwerp/2021/senior-researcher-on-applied-artificial-intelligence/165082", "title": "Senior Researcher on Applied Artificial Intelligence", "publish_date": "2021-10-26", "deadline": "N/A", "location": "Prinsstraat 13 Antwerp, Belgium", "city": "N/A", "country": "Belgium", "position": "Researcher", "field": "Artificial Intelligence, Computer Communications (Networks), Computer Science, Electrical Engineering, Engineering, and 3 moreEngineering Physics,Machine Learning,Mechanical Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Antwerp", "job_description": "IMECimec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique. By leveraging our world-class infrastructure and local and global ecosystem of partners across a multitude of industries, we create groundbreaking innovation in application domains such as healthcare, smart cities and mobility, logistics and manufacturing, and energy. &nbsp;As a trusted partner for companies, start-ups and universities we bring together close to 3,500 brilliant minds from over 70 nationalities. Imec is headquartered in Leuven, Belgium and also has distributed R&amp;D groups at a number of Flemish universities, in the Netherlands, Taiwan, USA, China, and offices in India and Japan. All of these particular traits make imec to be a top-class employer.&nbsp;University of Antwerp â\u0080\u0093 imec IDLab Research groupThe Internet &amp; Data Lab (IDLab) is an imec research group at the University of Antwerp and Ghent University. IDLab&nbsp;focuses its research on&nbsp;internet technologies&nbsp;and&nbsp;data science. IDLab is a joint research initiative between Ghent University and the University of Antwerp. Bringing together 300 internet experts, we develop technologies outperforming current solutions for communication subsystems, high speed and low power networking, distributed computing and multimedia processing, machine learning, artificial intelligence and web semantics. Within Antwerp, the overall IDLab&nbsp;research areas&nbsp;are machine learning and wireless networking. &nbsp;IDLab has a unique&nbsp;research infrastructure&nbsp;used in numerous national and international collaborations.&nbsp; &nbsp;IDLab collaborates with many universities and research centres worldwide and jointly develops&nbsp;advanced technologies with industry&nbsp;(R&amp;D centers from international companies, Flandersâ\u0080\u0099 top innovating large companies and SMEâ\u0080\u0099s, as well as numerous ambitious startups).For further development&nbsp;of the IDLab AI Applications program, we are looking for a Senior Researcher in Artificial Intelligence.The AI Applications team aims to bring state-of-the-art machine learning methods to industry, bridging the gap between fundamental research and industrial applications. The team performs applied and fundamental research in areas such as data-driven modeling, deep learning and reinforcement learning to tackle real world challenges in industry. Our goal is to make AI safely and reliably applicable in an industrial context, where it should complement, enhance, or replace the state of the art in complex control scenarios where current techniques fail to deliver. The team applies its AI solutions in domains such as chemical engineering, autonomous shipping, beyond-5G wireless communication, mobility, and logistics, in collaboration with key industry partners in their respective domains.The jobWe are looking for a senior researcher in to strengthen our research in applied artificial intelligence research. Together with a team of PhD students you will research how to bring state-of-the-art in AI-driven modelling and decision-making techniques to industry, tackling challenges such as sim-to-real, safety and robustness. You will work in close collaboration with industry, lead national and international research projects, drive consortium building and develop new research proposals. You will be responsible for the management of research projects in the context of machine learning with a strong focus on domains such as industry 4.0, logistics &amp; mobility, and smart shipping. You can translate the business requirements of partners to technical challenges, and â\u0080\u0093 together with researchers â\u0080\u0093 define clear methodologies for addressing them across different application domains. You follow up on progress within research projects and are able to communicate the accomplished / in-process work to internal and external stakeholders and adapt where needed. You lead a technical team going forward in implementing research projects. You develop project proposals for the Horizon Europe Program and national projects, both in fundamental and collaborative programs. You interface and collaborate on a technical level with research partners from industry and academia. You can also be involved in the technical project execution, if interested, in parallel to the project management. You will participate in the framework of European and national research projects (in collaboration with industry). Job requirements You have a PhD, preferable in Computer Science, Engineering, Physics, Electrical Engineering, Electromechanical Engineering, or equivalent. You have affinity with academic research, but also want to make a difference in todayâ\u0080\u0099s industrial and societal challenges. You have a general background in AI and hands-on experience with machine learning projects. Prior experience with reinforcement learning and/or graph neural networks is a plus. You have experience with managing and supervising team members. You consider yourself a machine learning expert. You can explain the challenges of machine learning to a broad non-technical audience, but also have an in-depth understanding of the technical aspects Having experience with participating / leading in national and/or international research projects is an advantage. Having experience in proposal writing in national and / or international research projects is an advantage You are a team player and have strong communication skills. Your English is fluent, both speaking and writing. How to applyPlease apply using the application button on this webpage. Applications sent to us via email will not be considered.Program Manager AI Applications: siegfried.mercelis@uantwerpen.beMore HR-related/administrative information: michelle.nietvelt@uantwerpen.be", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "TheÂ University of Antwerp (Universiteit Antwerpen)Â is characterised by its high standards in education, internationally competitive research and entrepreneurial approach.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJlY2FcLzc1NlwvZWNhNzU2NzRiYmMzZGVlNjNmNjk0MWRmZTdmYWRmYTAucG5nIiwiZWRpdHMiOltdfQ=="}