{"url": "https://academicpositions.com/ad/bi-norwegian-business-school/2022/msca-postdoctoral-fellowship-nordic-centre-for-internet-and-society-ncis/175091", "title": "MSCA Postdoctoral Fellowship - Nordic Centre for Internet and Society (NCIS)", "publish_date": "2022-02-09", "deadline": "2022-03-06", "location": "Nydalsveien 37 Oslo, Norway", "city": "N/A", "country": "Norway", "position": "Postdoc", "field": "Computer and Society, Computing in Social science, Arts and Humanities, Distributed Computing, Information Systems, Management,", "salary": "N/A", "max_working_hours": "N/A", "employer": "BI Norwegian Business School", "job_description": "CALL FOR EXPRESSIONS OF INTEREST TO APPLY FOR A MSCA POSTDOCTORAL FELLOWSHIP AT BI NORWEGIAN BUSINESS SCHOOL, NORDIC CENTRE FOR INTERNET AND SOCIETY (NCIS)Deadline for Expressions of Interest: 6 March 2022&nbsp;The Nordic Centre for Internet and Society (NCIS) at BI Norwegian Business School (BI) currently invites researchers outside of Norway to apply for a two-year EU-funded Marie SkÅ\u0082odowska-Curie Action Postdoctoral Fellowship (MSCA-PF).&nbsp;This highly regarded fellowship gives candidates the opportunity to pursue a two-year research project as part of the centre at BI and under the supervision of an experienced professor in the field.Eligible candidates must hold a PhD, have a maximum of 8 yearsâ\u0080\u0099 research experience from the time the PhD was awarded, and cannot have lived or worked in Norway for 12 months or more over the past three years.ABOUT THE NORDIC CENTRE FOR INTERNET AND SOCIETY (NCIS)NCIS is a research centre at the Department of Communication and Culture, BI, financed by Horizon 2020 and the Research Council of Norway. It is a globally oriented research centre, dedicated to understanding the influence of new internet technologies on working life and society. As an interdisciplinary research centre, NCIS combines a wide range of disciplines and methodologies to understand the impact of emerging Internet technologies on working life and society.NCIS researchers are also involved in the Nordic Alliance for Communication and Management (NORA), which is a knowledge hub that aims to leverage communication as a strategic driver of organizational performance and success in a changing world. Members strive for leveraging communication excellence through a close exchange on best practices paired with high-level scientific reflection from latest research.Together, NCIS and NORA, as growing teams of international researchers, aim to explore the re-invention of work and working life within a digital, networked, and media-rich environment, as well as the ethical challenges that accompany these changes. We embrace the opportunity to combine business and management research within the growing field of Internet research. Following our ambition to conduct theoretically solid research that is closely connected to current developments, we closely collaborate with entrepreneurs, policymakers, innovators, technologists, and users.CANDIDATE QUALIFICATIONSNCIS invites candidates with a strong quantitative background and interest in computer-mediated communication in teams, digital team management to apply for a two-year EU-funded MSCA Postdoctoral Fellowship (MSCA-PF-2022). Enabling employees in teams to work in an efficient and sustainable way in either office, home, or hybrid settings is one of todayâ\u0080\u0099s critical organizational and societal challenges. The candidate should be interested in doing research on digital team management and the interpersonal dynamics within digital teams to aid organizational evidence-based decision-making that can help employees and organizations deal with collaboration and communication challenges and ethical issues at work associated with the new forms of working (varying from hybrid to entirely virtual) that have been widely used during the COVID-19 pandemic.The candidate should be interested in doing research on digital teams, providing theoretical contributions to the literature in the domains of communication, digitalization, and organization behaviour that are worthy of publication in the top journals in the field. Themes related to, e.g., distributed teams, team dynamics, and leadership and interpersonal behaviour in digital teams are of particular relevance. We value creativity and methodological rigour.The successful candidate will be supervised by either Professor Sut I Wong or Associate Professor Suzanne van Gils.Professor Sut I Wongâ\u0080\u0099s research focuses on the roles of digital technologies on work-life, including the use of virtual teams, human-machine interaction, crowdworkersâ\u0080\u0099 online participation and career development, digital transformation management, new ways of working, team innovation and coordination, leadership and employee adaptability in digital transformation. Beside invited talks and seminars by the industry, her work is published in esteemed scientific journals such as The Leadership Quarterly, Journal of Management, Human Resource Management, Human Resource Management Journal, Human Relations, California Management Review, and Harvard Business Review. Sut I has been and is involved in numerous funded research projects, such as Fair Labour in the Digitized Economy, funded by Norwegian Research Council, and Organizational Design in the Digital, Era funded by the Slovenian Research Agency.Dr Suzanne van Gils is Associate Professor in management communication and ethics. Her research interests focus on (im)moral behaviour in organizations, identity processes, and leader-employee interactions. Recent projects focus on ethical leadership communication and moral behaviour in digital contexts. Suzanne has published in top tier journals such as Human Relations, Leadership Quarterly, and Journal of Applied Psychology. She is a section editor at Journal of Business Ethics and research coordinator for NORA.&nbsp;APPLICATION PROCEDUREWith this call for Expressions of Interest, we invite candidates to submit an initial two-page outline of their proposed project and a CV to research@bi.no by 6 March 2022.&nbsp;The project outline should include a brief description of:the purpose of the project, including the hypothesis or central research question that the project seeks to test/answerwhy it is important to undertake this research, including how the project contributes to the state of the artwhat research methodology and approach will be usedthe complementary between the candidate and supervisor, and why BI is an appropriate host institutionThe Expressions of Interest will be evaluated internally at BI and candidates will be selected for full application development, including participating in the MSCA-PF Master Class hosted by BI at the end of April 2022. The selected candidates will develop their MSCA-PF applications in collaboration with their BI supervisor and with the support from the team for external financing at BI. The deadline for submitting the MSCA-PF proposal is 14 September 2022.For more information about the MSCA-PF funding scheme and the application process at BI, contact research@bi.no.ABOUT BIBI is an independent, not-for-profit foundation, whose sole purpose is teaching and research. BI is the main provider of research-based knowledge in the business and management disciplines in Norway. Since its founding in 1943, BI has focused on bridging the gap between academia and practice. The schoolâ\u0080\u0099s strategy for 2025 is â\u0080\u009cShaping people and business for an international, digital and sustainable futureâ\u0080\u009d. BI has approximately 20,000 students and 430 academic staff, including over 70 doctoral students. The research faculty is organized into 9 separate departments, with research centres dedicated to business administration, marketing, finance, and general management. With accreditations from AACSB (The Association to Advance Collegiate Schools of Business), EQUIS (European Quality Improvement System) and AMBA (The Association of MBAs), BI is a \"Triple Crown\" school. In 2019, the Financial Times ranked BI as Norwayâ\u0080\u0099s best business school for the fifth year in a row in its yearly European Business School ranking. BI has extensive support for faculty, such as a highly professional and modern library and a Learning Resource Centre for research and teaching support. There are well-equipped research laboratories and a faculty club to facilitate the transfer and application of knowledge.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "BI Norwegian Business School is ranked among the top business schools in Europe combining internationally recognized research and a wide range of educational offerings from bachelor to master and doctoral degree programmes as well as executive programmes.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5ZDRcLzlmZlwvOWQ0OWZmMjA0NmFlYzg4YTQ4OTRiOTgzMDJiNGY2YzAucG5nIiwiZWRpdHMiOltdfQ=="}