{"url": "https://academicpositions.com/ad/mcmaster-university/2021/tenure-track-faculty-positions/170268", "title": "Tenure-track Faculty Positions", "publish_date": "2021-12-01", "deadline": "2022-03-01", "location": "1280 Main Street West Hamilton, Canada", "city": "N/A", "country": "Canada", "position": "Assistant Professor", "field": "Acoustic Engineering, Aeronautical Engineering, Aerospace Engineering, Agricultural Engineering, Audio Systems Engineering, and 46 moreAutomotive Engineering,Automotive Systems Engineering,Bioengineering,Biomedical Engineering,Biosystems Engineering,Chemical Engineering,Civil Engineering,Communication Engineering,Computational Engineering,Computer Engineering,Control Systems Engineering,Ecological Engineering,Electrical Engineering,Electronics,Energy Technology,Engineering Education,Engineering Physics,Environmental Engineering,Fire Safety Engineering,Geotechnical Engineering,Hydraulics,Image Processing,Industrial Engineering,Instrumentation Engineering,Manufacturing Engineering,Marine Engineering,Materials Engineering,Mechanical Engineering,Mechanics,Mechatronics,Military Engineering,Mining Engineering,Nuclear Engineering,Optical Engineering,Petroleum Engineering,Quality Assurance Engineering,Railway Engineering,Renewable Energy,Robotics,Safety Engineering,Signal Processing,Structural Engineering,Systems Engineering,Technology Management,Telecommunications Engineering,Transportation Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "McMaster University", "job_description": "McMaster Universityâ\u0080\u0099s Faculty of Engineering is committed to the advancement of Black academic excellence and is recruiting for tenure-track faculty positions across all departments.The Faculty of Engineering at McMaster University in Hamilton, Ont., Canada is building on its international ranking as one of the worldâ\u0080\u0099s top engineering schools by expanding its recruitment of Black faculty for tenure-track appointments across multiple departments.OUR COMMITMENT TO INCLUSIVE EXCELLENCEAt McMaster University, we are committed to investing in our faculty members and to building a community of mentorship. We believe that this encourages a culture where excellence is fostered by diversity and inclusivity, which brings unique perspectives together to solve the worldâ\u0080\u0099s biggest challenges.We believe that finding solutions to real-world problems depends on sharing creative, diverse thoughts and ideas. To us, collaborative thinking is a gateway to smarter solutions and greater optimism. Itâ\u0080\u0099s helping us create a brighter world. The diversity of our community is at the core of our innovation and creativity and strengthens our research and teaching excellence.As a signal of our commitment, McMaster University announced a new hiring initiative through the Strategic Equity and&nbsp;Excellence Recruitment and Retention Program within&nbsp;McMasterâ\u0080\u0099s EDI Strategy and Action Plan, which will see 16&nbsp;Black faculty members recruited across all six Faculties.As part of this initiative, McMaster Engineering is seeking six tenure-track candidates with specialization in any of our departments and related research cluster areas.ELIGIBILITYSuccessful applicants will demonstrate a record or evidence of strong potential for excellence in teaching, research and service and a willingness and ability to:Contribute actively to undergraduate and graduate programsSupervise graduate students; establish independent research programs and engage in research collaborations across departments within or across facultiesContribute to the Universityâ\u0080\u0099s inclusive excellence goals and prioritiesABOUT MCMASTER ENGINEERINGWith more than 180 faculty members, approximately 6,000 undergraduate and 1,000 graduate students, McMaster Engineering has earned a strong reputation for innovative programs, leading research, industry collaborations, top faculty and aspiring students. Recently 14 academic disciplines at McMaster Engineering were ranked among the best in Canada by Shanghai Ranking. Earlier this year,&nbsp;McMaster ranked 17th in the world in the Times Higher Education&nbsp;Impact Rankings&nbsp;and ranked number one in Canada for good health and well-being and decent work and economic&nbsp;growth.Discover more of what McMaster Engineering and the Hamilton area have to offer academic professionals and their families by viewing our&nbsp;Information Guidehighlighting our research excellence, family-friendly resources and rich local culture. Opportunities for continuous personal and professional growth are also made available through our Facultyâ\u0080\u0099s&nbsp;Fireball Academy&nbsp;and the&nbsp;MacPherson Institute.LEARN MORE ABOUT THE INITIATIVES WE ARE SUPPORTING TO STRENGTHEN DIVERSITY WITHIN OUR COMMUNITYNational Society of Black Engineers McMaster Chapter Entrance AwardIndigenous and Black Engineering and Technology (IBET) Momentum FellowshipsWomen in Engineering CommitteeStudent Groups:&nbsp;McMaster EngiQueers&nbsp;and&nbsp;McMaster Women in Engineering SocietyCONTACTFor questions about applying to this opportunity with Faculty of Engineering, please contact Christina Pellegrini, Office of Research, Innovation and External Relations (engadr@mcmaster.ca)", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Founded in 1887, McMaster University is one of only four Canadian universities consistently ranked in the Top 100 in the world.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8wN1wvbWNtYXN0ZXItdW5pLWxvZ28uanBnIiwiZWRpdHMiOltdfQ=="}