{"url": "https://academicpositions.com/ad/international-baccalaureate-ib/2021/become-an-ib-examiner-for-danish-a-literature/138114", "title": "Become an IB Examiner for Danish A: Literature", "publish_date": "2021-11-26", "deadline": "N/A", "location": "N/A", "city": "N/A", "country": "United Kingdom", "position": "Other Category", "field": "Applied Linguistics, Educational Assessment, Germanic languages, International Education, Language Education, and 2 moreScandinavian languages,World Literatures", "salary": "N/A", "max_working_hours": "N/A", "employer": "International BaccalaureateÂ® (IB)", "job_description": "As part of assessment processes, the IB works with educators in a variety of different roles. We are always looking to recruit new, skilled examiners and senior examiners as the IB continues to grow.As an examiner you will play an important role in maintaining the quality of assessment for which the IB is known worldwide. This experience will enable you to:Enhance your professional developmentExpand your subject knowledgeEarn extra income working from the convenience of your homeFounded in 1968, the International BaccalaureateÂ® (IB) is a non-profit educational foundation offering four highly respected programmes of international education that develop the intellectual, personal, emotional and social skills needed to live, learn and work in a rapidly globalizing world.We strive to develop students who will build a better world through intercultural understanding and respect.Through the study of a wide range of literature, the language A: literature course encourages students to appreciate the artistry of literature and to develop an ability to reflect critically on their reading. Works are studied in their literary and cultural contexts, through close study of individual texts and passages, and by considering a range of critical approaches. In view of the international nature of the IB and its commitment to intercultural understanding, the language A: literature course does not limit the study of works to the products of one culture or the cultures covered by any one language. The study of works in translation is especially important in introducing students, through literature, to other cultural perspectives.&nbsp;Applicants must have:a degree or equivalent in the subject (or a related subject) for which they are applying,a minimum of one yearâ\u0080\u0099s experience teaching the subject (or a related subject) to students in an appropriate age range:16 to 19 years of age â\u0080\u0093 DPapplicants who are no longer teaching must have taught or examined within the last three yearsaccess to the internet, via a broadband (or faster) connection, in an environment that is suitable for marking confidential assessment materialIB teaching experience is not essential.For more information and to apply, please visit our website:http://www.ibo.org/examiners&nbsp;&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Founded in 1968, the International BaccalaureateÂ® (IB) is a non-profit educational foundation offering four highly respected programmes of international education that develop the intellectual, personal, emotional and social skills needed to live, learn and work in a rapidly globalizing world.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvaWItbG9nby5qcGciLCJlZGl0cyI6W119"}