{"url": "http://www.academictransfer.com/en/308824/medewerker-hr-services-06-fte/", "title": "Medewerker HR Services (0,6 fte)", "publish_date": "2022-01-31", "deadline": "2022-02-18", "location": "De Rondom 70, 5612 AP, Eindhoven", "city": "Eindhoven", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "22.8", "employer": "Eindhoven University of Technology (TU/e)", "job_description": "Mensen zijn het hart en ziel van de Technische Universiteit Eindhoven (TU/e). Met uitstekende onderzoeks- en onderwijsprogramma's, maken we deel uit van nationale en internationale academische netwerken, nemen we deel aan samenwerkingsverbanden met industrie en maatschappelijke organisaties en zijn we het academische hart van de toptechnologieregio Brainport. De TU/e is een belangrijke spil in een wereldklasse hightech ecosysteem. We staan internationaal bekend om onze expertise op het gebied van wetenschappelijke en technologische basisdisciplines.<br><br>De TU/e heeft de ambitie om bij de leidende universiteiten op het gebied van wetenschap en technologie te behoren. Drie uitdagingen zijn fundamenteel voor onze visie voor 2030: een duurzame wereld, de technologische revolutie en de impact van technologie op de samenleving. De TU/e is een mensgerichte werkgever die kansen biedt aan talent - zowel voor wetenschappelijk als ondersteunend personeel - voor persoonlijke ontwikkeling en om de uitdagingen van morgen samen aan te gaan.<br><br>Dienst Human Resources Management (HRM) bestaat uit ca. 100 enthousiaste collega's. Naast HR Services bestaat HRM verder o.a. uit de afdelingen HR advice, Professional Development en Occupational Health, Safety, Environment &amp; Radiation Protection (OHSE&amp;R).<br><br>In de functie van Medewerker HR Services werk je voor een of meerdere faculteiten. Het team van HR Services is divers en bestaat uit 20 leuke collega's. Je zorgt ervoor dat  de personeelsadministratie op orde is en informeert medewerkers en leidinggevenden over wet- en regelgeving, over de CAO Nederlandse Universiteiten en over de TU/e arbeidsvoorwaarden. Je werkt samen met collega HR Services medewerkers en HR adviseurs.<br><br><strong>Kerntaken </strong><br><br>Als medewerker HR Services heb je veel contact met de medewerkers en leidinggevenden van de faculteiten waarvoor je werkt. Daarnaast ben je bezig met het verwerken van de personeelsadministratie. Dat vereist dat je nauwkeurig en accuraat werkt. Binnen je functie heb je te maken met een zeer gevarieerd takenpakket. Dat betekent aan de ene kant veel afwisseling en aan de andere kant worden daarmee ook hoge eisen aan je gesteld. Je bent goed op de hoogte van de arbeidsvoorwaarden en regelingen die van belang zijn voor medewerkers en de leidinggevenden. Je bent voor hen het eerste aanspreekpunt. Veel medewerkers spreken geen Nederlands dus je Engels moet op orde zijn.<br><br>Voor de personeelsadministratie ben je onder meer bezig met het verwerken van mutaties rondom in-, door-, en uitstroom en personeelsregelingen. Sinds vorig jaar werken we met AFAS.<br><br>Daarnaast lever je een bijdrage aan het soepel laten verlopen van de HR procedures. Denk daarbij bijvoorbeeld aan het uniformeren en optimaliseren van procedures. Daarbij verwachten we een actieve houding van je om mee te denken over verbeteringen.<br><br>Kortom: geen dag is hetzelfde en door jouw flexibiliteit kun  je snel  schakelen  in werkzaamheden, processen, en in contactmomenten met medewerkers, leidinggevenden en HR collega's. Ook heb je veel contact met het Payroll Administration Team en het Staff Immigration Team over buitenlandse medewerkers.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.tue.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tue-en-wide_acOLN2b/6da05d7a14fc4cf4bb403c37bf055371.png"}