{"url": "http://www.academictransfer.com/en/309186/universitair-docent-sociologie-10-fte/", "title": "Universitair Docent Sociologie (1,0 fte)", "publish_date": "2022-02-08", "deadline": "2022-02-28", "location": "Broerstraat 5, 9712 CP, Groningen", "city": "Groningen", "country": "Netherlands", "position": "Lecturer", "field": "Gedrag en maatschappij", "salary": "N/A", "max_working_hours": "38", "employer": "University of Groningen", "job_description": "• U verzorgt onderwijs over sociologische en maatschappelijke vraagstukken die betrekking hebben op (de interactie tussen) één of meerdere van de “sociale ordes” overheid, markt, organisaties en primaire sociale groepen. Hierbij heeft u speciale aandacht voor beleidsrelevante vraagstukken. U bent inzetbaar in het onderwijs op alle niveaus van de BA-opleiding en in de MA-opleiding.<br> • Uw onderzoeksinteresse sluit aan bij een of meer van de onderzoekslijnen van het ICS-Groningen (www.ics-graduateschool.nl) en SCOOP (http://www.scoop-program.org); u bent een collega die een actieve bijdrage levert aan het in stand houden van de goede samenwerkingsverbanden binnen en tussen de onderzoekslijnen in de vakgroep.<br> • Uw taken zijn (in een verhouding onderwijs/onderzoek van 60/40):<br> o het verzorgen van hoor- en werkcolleges in de bachelor- en masteropleidingen, op één of meerdere van de bovengenoemde inhoudelijke terreinen<br> o het begeleiden van bachelorwerkstukken- en masterscripties<br> o het uitvoeren en begeleiden van probleem- en theoriegestuurd (empirisch) onderzoek binnen de kaders van het onderzoeksprogramma van ICS-Groningen, de landelijke onderzoeksschool ICS en/of SCOOP, alsmede het verwerven van onderzoekssubsidies voor toekomstig onderzoek binnen een van deze onderzoeksprogramma’s.<br> o bijdragen aan het uitvoeren van organisatietaken t.b.v. onderwijs en/of onderzoek op het niveau van de afdeling Sociologie.<br>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.rug.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/rug-en-wide/fce0dfff95a30233a4210a238918791e.gif"}