{"url": "https://academicpositions.com/ad/wenzhou-kean-university/2022/assistant-professor-in-marketing/173671", "title": "Assistant Professor in Marketing", "publish_date": "2022-01-05", "deadline": "N/A", "location": "88 Daxue Rd, Ouhai, Zhejiang Province Wenzhou, China", "city": "N/A", "country": "China", "position": "Assistant Professor", "field": "Marketing,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Wenzhou-Kean University", "job_description": "Along with NYU Shanghai and Duke University Kunshan, Wenzhou-Kean University (WKU) is one of only three full legal-person Sino-American universities approved by the Ministry of Education in China. We invite applications for one full-time tenure track position at the rank of Assistant Professor in Marketing to begin in Fall or Spring 2022. Ability to demonstrate quality teaching is a must.&nbsp; The successful candidate will be able to teach courses such as Marketing Research and Consumer Behavior, as well as participate in the full range of faculty responsibilities, including scholarly research and service to the University. Applicants should possess an earned doctorate in Marketing from an AACSB accredited program, or anticipate completion by July 2022. Applicants with terminal Social Science degrees from top universities and proven research records in Marketing are also strongly encouraged to apply. To receive full consideration by the search committee, candidates need to submit a cover letter, CV, research statement, unofficial transcripts and contact information for three references by email to: Search Committee Chairperson at wkucbpm@wku.edu.cn. Official transcripts for terminal degrees and three current letters of recommendation are required before appointment. &nbsp;A branch campus of Kean University (USA), WKU sits on over 500 beautiful acres with a brand new state-of-the-art business building (http://www.wku.edu.cn/en/cbpm/). All instruction is in English and all curricula are provided by Kean USA, a comprehensive New Jersey state university located just 30 minutes from downtown New York City. A city of 9 million people, Wenzhou is only one hour by plane and just over three hours by high-speed train from Shanghai and Hong Kong.&nbsp;Business faculty positions at WKU offer:&nbsp;Extremely competitive salaries that are multi-year Tax-Free for citizens of countries such as U.S.A.Generous home leave, housing, schooling, and relocation allowances, as well as 8% front-load retirement benefits with immediate vesting.Research fundingA collegial environmentThe opportunity to teach high quality students with more than half of them go the graduate schools at Top 50 Universities in the world.Wenzhou-Kean University is an Equal Opportunity Employer", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Wenzhou-Kean University is a Chinese-American jointly established higher education institution with Independent legal person status and limited liabilities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyODNcLzY0NFwvMjgzNjQ0MTViNjFlMWM1NTViMTU2ZjljNjM5MjZmMTYucG5nIiwiZWRpdHMiOltdfQ=="}