{"url": "https://academicpositions.com/ad/university-of-lausanne/2022/call-for-applications-for-a-postdoctoral-research-fellowship-on-the-role-of-non-coding-rnas-in-diabetes/173935", "title": "Call for applications for a postdoctoral research fellowship on the role of non-coding RNAs in diabetes", "publish_date": "2022-01-13", "deadline": "2022-02-15", "location": "Unicentre Lausanne, Switzerland", "city": "N/A", "country": "Switzerland", "position": "Postdoc", "field": "Cell Biology, Endocrinology, Genetics, Molecular Biology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Lausanne", "job_description": "PresentationA postdoctoral position is available in the laboratory of Prof. Romano Regazzi at the University of Lausanne, Switzerland. The University of Lausanne is a higher teaching and research institution composed of seven faculties where approximately 15,500 students and nearly 5000 collaborators, professors, and researchers work and study.Job informationExpected start date in position: 1.4.2022 or to be agreedContract length: 1 year, possibility to be renewed, maximum 3 years Activity rate: 100%Workplace: Department of Fundamental Neurosciences, LausanneYour responsibilitiesInsulin secretion from pancreatic Î² -cells plays a central role in the control of body metabolism. Dysfunction and/or loss of Î²-cells can result in the release of insufficient insulin and in the development of different forms of diabetes mellitus. Recent studies from different laboratories including ours provided evidence that non-coding RNAs play an important role in the control of Î²-cell activities. The goal of the project will be to determine the involvement of microRNAs and other newly discovered classes of non-coding RNAs in the regulation of Î²-cell functions and to evaluate their contribution in the appearance of diabetes mellitus.Your qualificationsThe position requires a doctoral degree in Life Sciences or related disciplines. The candidate should be highly motivated, self-driven, be able to work well in a team as well as independently. Candidates with experience in molecular biology, gene expression analysis and animal experimentation will be preferred. Good communication skills in English are essential.What the position offers youOur laboratory offers an exciting and enthusiastic work environment with excellent infrastructure, including core facilities for transcriptomics, imaging, FACS analysis, and animal experimentation and a strong national and international collaboration network.Contact for further informationProf. Romano Regazzi, Department of Fundamental Neurosciences,Rue du Bugnon 9CH-1005 LausanneRomano.Regazzi@unil.chhttps://wwwfbm.unil.ch/dnf/group/role-of-non-coding-rnas-in- the-control-of-pancreatic-%ce%b2-cell-functions-and-development-of-diabetes-mellitusYour applicationDeadline: 15.2.2022Applications should include a cover letter with a statement of research interests and qualifications for the position, complete CV and the names of two academic references. Please upload your full application in word or PDF format on the following website:https://www.unil.ch/carrieres/en/home/menuinst/emplois.htmlYou will find the call under current vacancies. The position ID of this call is: 19044", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Founded in 1537, the University of Lausanne is composed of seven faculties where approximately 12,400 students and 2,300 researchers work and study. ", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEyXC8wM1wvVW5pdmVyc2l0eS1vZi1MYXVzYW5uZS5wbmciLCJlZGl0cyI6W119"}