{"url": "https://academicpositions.com/ad/ku-leuven/2022/professor-in-computational-methodologies-for-advanced-optimization-and-control-of-chemical-and-biochemical-reactor-processes/175062", "title": "Professor in Computational Methodologies for Advanced Optimization and Control of Chemical and Biochemical Reactor Processes", "publish_date": "2022-02-09", "deadline": "2022-03-31", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Assistant Professor", "field": "Biochemistry, Chemical Engineering, Computational Chemistry, Control Systems Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. ZAP-2022-11)In the Science, Engineering and Technology Group, Faculty of Engineering Science, Department of Chemical Engineering, division Bio- &amp; Chemical Systems Technology, Reactor Engineering and Safety (CREaS) at KU Leuven, there is a full-time academic vacancy in the field of 'Computational Methodologies for Advanced Optimization and Control of Chemical and Biochemical Reactor Processes' at Leuven (Arenberg). We are looking for internationally oriented candidates with an excellent research record and with educational competence within the field of (bio)chemical engineering that provides a fertile range of applications for the computational optimization and control methodologies to be developed. To accomplish its mission of exploiting and enhancing (bio)chemical reactor processes and process safety, CREaS integrates expertise, methodologies and techniques from different (bio)chemical reactor and process engineering domains, going from macro- and microscopic analysis of (bio)chemical processes, via modelling and design, to process optimization and control. The CREaS Research division is embedded within the Department of Chemical Engineering and is housed with its Leuven (Arenberg) based cohort in the Chem&amp;Tech facility, which is a recently built high-tech centre for chemistry and chemical engineering research. Moreover, in 2021 an adjacent brand new didactical building (Quadrivium) is inaugurated, which hosts new didactics lab and pilot hall spaces, together with PC, seminar and breakout rooms. The department has very strong links with the chemical industry throughout its industrial advisory board, research collaborations, structural embedding in its Chemical Engineering curriculum and its Safety Engineering curriculum. The latter is coordinated by the professor holding the Chair in Safety Engineering, installed by essenscia, which is the federation for the chemistry and life sciences industry. The chemical and live sciences industry is a very prominent sector in Belgium and Europe. The fifth largest chemical industry cluster worldwide is located in the port of Antwerp and Europe is the second largest chemical producer in the world.Website unitDutiesResearchYou are expected todevelop a research programme at an international level related to new computational methodologies that are to be used for model driven analysis, optimization and control of existing and/or innovative processes in the broad field of chemical and biochemical reactor engineering;have a thorough knowledge in the field of (bio)chemical engineering since the emphasis is primarily on applications in this field;strengthen the computational expertise of the division and the department, and be complementary to the more experimentally oriented profiles already present;&nbsp;validate your theoretical research results through relevant experimental and/or industrial applications;build a research group of international level with strong visibility;initiate collaborations with other research groups at KU Leuven with interest in (bio)chemical reactor engineering, computational methods, systems analysis and process control;publish at the highest scientific level, acquire competitive resources for research, supervise PhDs and set up international collaborations around your research programme.EducationYou ensure high-quality education, in particular in educational programmes at the bachelor and master level in Chemical Engineering. The courses on Systems Analysis and Process Control will belong to your educational portfolio. In addition, your teaching duties will include courses related to your specific research expertise. You also contribute to the pedagogic project of the faculty/university through the supervision of master theses and as a promoter of PhD students. You develop your teaching in accordance with KU Leuvenâ\u0080\u0099s vision on activating and research-based education and make use of the possibilities for the educational professionalisation offered by the faculty and the university.ServiceAs academic staff of KU Leuven, you play an important role in society through your research and teaching, but also, in function of the needs and your personal interests, through your participation in the public debate, contributions to policy-supporting research projects for governments from the local to the European level, and participation in research-for-development projects. You take up an active role in councils, educational committees, working groups of the university and in particular, of the division, department and faculty you will belong to.ProfileYou have a PhD in engineering science, preferably (bio)chemical engineering, or equivalent.You have a strong research profile in the field of interest. The quality of your research is proven by publications in prominent international journals. International research experience is an important advantage.If you have recently been admitted to the degree of doctor, it is important that you support your research and growth potential with academic references.You have demonstrable qualities related to academic education. Teaching experience is an advantage.You possess organisational skills and have a cooperative attitude. You also possess leadership capacities within a university context.Proficiency in English is required. The official language used at KU Leuven is Dutch. If you do not speak Dutch (or do not speak it well) at the start of employment, KU Leuven will provide language training to enable you to take part in meetings. Before teaching courses in Dutch or English, you will be given the opportunity to learn Dutch, respectively English, to the required standard.OfferWe are offering full-time employment in an intellectually challenging environment. KU Leuven is a research-intensive, internationally oriented university that carries out both fundamental and applied scientific research. Our university is highly inter- and multidisciplinarily focused and strives for international excellence. In this regard, we actively work together with research partners in Belgium and abroad and provide our students with an academic education that is based on high-quality scientific research.You will work in Leuven, a historic, dynamic and lively city located in the heart of Belgium, within 20 minutes from Brussels, the capital of the European Union, and less than two hours from Paris, London and Amsterdam.Depending on your record and qualifications, you will be appointed to or tenured in one of the grades of the senior academic staff: assistant professor, associate professor, professor or full professor. In principle, junior researchers are appointed as assistant professor on the tenure track for a period of 5 years; after this period and a positive evaluation, they are permanently appointed (or tenured) as associate professor.KU Leuven is well set to welcome foreign professors and their family and provides practical support with regard to immigration &amp; administration, housing, childcare, learning Dutch, partner career coaching, â\u0080¦&nbsp;To facilitate scientific onboarding and accelerate research in the first phase, a starting grant of 100.000 euro is offered to new professors without substantial other funding, appointed for at least 50%.Interested?For more information please contact Prof. dr. Christian Clasen, tel.: +32 16 32 23 54, mail: christian.clasen@kuleuven.be or Prof. dr. ir. Ilse Smets, tel.: +32 16 32 26 87, mail: ilse.smets@kuleuven.be.For problems with online applying, please contact solliciteren@kuleuven.be.Add to your application following documents (more information is available on the KU Leuven job site):- your biosketch in which you indicate your added value as an academic for research, education and service to society of your past career and of your future activities (maximum 2 pages);- a file on your five most important publications or realizations;- an extensive cv including a full publication list and if applicable a portfolio of your architectural projects;- your research plan with focus on the development of your research line and research team in relation with the colleague-researchers of the entity of employment (maximum 5 pages);- your vision on academic education and its organization (maximum 2 pages);- your contribution to society by outreach and public communication on science and technology, internal representation in boards and councils and service activities directly in relation to your developed expertise (maximum 1 page);- your vision on leadership (maximum 1 page).KU Leuven places great importance on research integrity and ethical conduct and will therefore ask you to sign an integrity statement upon appointment.You can apply for this job no later than March 31, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}