{"url": "https://www.academictransfer.com/en/309396/coordinator-bedrijfsvoering-tisem-eor/apply/", "title": "Coordinator bedrijfsvoering TiSEM - E&OR", "publish_date": "2022-02-11", "deadline": "2022-04-11", "location": "Warandelaan 2, 5037 AB, Tilburg", "city": "Tilburg", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Tilburg University", "job_description": "<p><strong>Tilburg University | University Services</strong><br> is op zoek naar een</p><p><strong>Co&ouml;rdinator Bedrijfsvoering voor het departement Econometrie &amp; Operations research</strong></p><p>Full time equivalent&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;: 0,5 fte (20 uur per week)<br> Maandelijks full time brutosalaris&nbsp;&nbsp; &nbsp;: &euro;2.979 &ndash; &euro;4.093<br> Duur arbeidsovereenkomst&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;: 12 maanden, met uitzicht op een vaste aanstelling</p><p>De Tilburg School of Economics and Management (TiSEM) maakt deel uit van Tilburg University. TiSEM streeft naar het geven en doen van kwalitatief hoogstaand onderwijs en onderzoek, met een ambitieuze, internationale gemeenschap van docenten en studenten. De bachelor- en masteropleidingen van TiSEM staan over het algemeen hoog in de ranglijsten en trekken een toenemend aantal studenten. Wat onderzoek betreft kan TiSEM zich op veel gebieden meten met de Europese top.&nbsp;</p><p><br> Het departement Econometrie en Operationele Research (EOR) is een onderdeel van TiSEM. Het bestaat uit ongeveer 55 stafleden en 35 PhD studenten. Het is verantwoordelijk voor het onderwijs in het bachelor programma Econometrics and Operations Research en de drie masterprogramma&rsquo;s Econometrics and Mathematical Economics, Quantitative Finance and Actuarial Science en Business Analytics and Operations Research. Bovendien verzorgt het departement de statistiek- en wiskundevakken in de andere bacheloropleidingen van TiSEM en de kwantitatieve vakken in de researchmasterprogramma&rsquo;s in economics en business en de bachelor Data Science. De meeste stafleden hebben een kwantitatieve achtergrond en zijn naast het onderwijs ook actief als onderzoeker. Op onderzoeksgebied heeft het departement een internationale reputatie op diverse terreinen als actuari&euml;le wetenschappen, econometrie, kwantitatieve financiering, operations research, statistiek en wiskunde. Er wordt fundamenteel onderzoek gedaan maar er is ook veel aandacht voor onderzoek met maatschappelijke relevantie.</p><p><br> De co&ouml;rdinator bedrijfsvoering vervult een spilfunctie binnen het departement. Als rechterhand van het departementshoofd en als eerste aanspreekpunt voor tal van organisatorische, financi&euml;le en facilitaire vragen heb je als voornaamste taak het wetenschappelijke personeel te ontlasten en te ondersteunen zodat zij zich kunnen concentreren op hun onderwijs- en onderzoekstaken. Daarnaast ben je (mede) verantwoordelijk voor de afwikkeling van tal van financi&euml;le geldstromen binnen het departement. Hierbij werk je niet alleen samen met de managementassistenten van het departement, maar ook met verschillende andere stafafdelingen en externe partijen.</p><p><br> <strong>Functie</strong><br> In grote lijnen zijn de taken en verantwoordelijkheden van de co&ouml;rdinator bedrijfsvoering als volgt:</p><ul> <li>Het ondersteunen van het departementshoofd bij de administratieve en organisatorische werkzaamheden van de bedrijfsvoering,</li> <li>Het leveren van input bij beleidsvoorbereiding,</li> <li>Het dragen van de verantwoordelijkheid voor een juiste financi&euml;le afwikkeling van de geldstromen op het gebied van onderwijs en onderzoek van het departement,</li> <li>Het voorbereiden van de jaarlijkse taakbelastingoverzichten van de departementsleden op basis van onderwijs en onderzoek,</li> <li>Het samenwerken met collega&rsquo;s van Finance &amp; Control,</li> <li>Het leveren van input en advies aan het departementshoofd met betrekking tot de 2-maandelijkse financi&euml;le rapportages en jaarlijkse departementsbegroting,</li> <li>Het fungeren als budgethouder,</li> <li>Het uitvoeren van het financi&euml;le beleid zoals bijvoorbeeld het goedkeuren van declaraties en facturen,</li> <li>Het eerste aanspreekpunt van departementsleden betreffende financi&euml;le verzoeken,</li> <li>Het geven van adviezen met betrekking tot externe financieringsmogelijkheden,</li> <li>Het samenwerken met de projectadministratie voor wat betreft de tweede en derde geldstroom projecten en terugkoppeling hiervan aan het departementshoofd,</li> <li>Het hebben van contact met de ondersteunende divisies HR, IT en Finance voor afstemming van financi&euml;le, personele en facilitaire besluitvorming.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.uvt.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uvt-en-wide/8bbc452c034c71750be03f93fe602eca.png"}