{"url": "https://academicpositions.com/ad/ghent-university/2022/postdoctoral-fellow-bioinformatics-in-splicing-dysregulation-in-cancer-20988-department-of-biomolecular-medicine/175004", "title": "Postdoctoral Fellow (bioinformatics) in splicing dysregulation in cancer (20988) - Department of Biomolecular Medicine", "publish_date": "2022-02-08", "deadline": "2022-02-14", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Biochemistry, Bioinformatics, Cancer Research, Cell Biology, Computational Biology, and 4 moreGenetics,Molecular Biology,Oncology,Systems Biology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Apply before [[14.02.2022]]&nbsp;(DD/MM/YYYY) 23:59 (Brussels Time)&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Faculty of Medicine and Health Sciences&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Department:&nbsp;[[Biomolecular Medicine]]&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Occupancy rate: [[100%]]&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Number of positions: [[1]]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Type of employment:&nbsp;[[Postdoctoral Fellow-Bioinformatics (WP2)]]&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Term of&nbsp;assignment:&nbsp;[[6 years]]&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Wage scale:&nbsp;&nbsp;[[PD1-PD4]]&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Required diploma:&nbsp;[[PhD]]&nbsp;&nbsp;&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University is a world of its own. Employing more than 8,000 people, it is actively involved in education and research, management and administration, as well as technical and social service provision on a daily basis. It is one of the largest, most exciting employers in the area and offers great career opportunities. With its 11 faculties and more than 80 departments offering state-of-the-art study programmes grounded in research in a wide range of academic fields, Ghent University is a logical choice for its staff and students.&nbsp;&nbsp;YOUR TASKS&nbsp;At least 70% of your assignment will be spent on academic research.The candidate should be able to think independently, design and execute bioinformatics analysis of high-throughput RNA and DNA sequencing data and of proteomics studies, write original research manuscripts and review articles.The candidate will be part of a multidisciplinary team, with expertise in molecular and cancer biology and bioinformatics, and with the aim to understand oncogenic mechanisms in leukemia.The research focus of the position is on RNA biology and biochemistry and the study of splicing factors and phenomena, RNA modifications and RNA-protein interactions.&nbsp;About the Ntziachristos lab and the Department of Biomolecular MedicineThe Ntziachristos laboratory studies the mechanistic aspects of oncogenesis with an emphasis on posttranslational and epigenetic regulation of acute leukemia. We focus on how oncogenes interact with each other and with epigenetic modulators to influence gene expression programs as well as how their function is related to tri-dimensional (3D) structure of the nucleus and other biological aspects of cancer cells, like metabolism. Recent studies from our group focus on how active deubiquitination controls aspects of oncogenesis, including transcription factors or splicing, and ultimately leads to drug resistance in leukemia. To address these questions, we use high-throughput molecular and cell biology techniques like RNA-Seq, ChIP-Seq, 4C-Seq and HiC, fluorescent in situ hybridization, biochemical analysis e.t.c., in cell lines and primary cells of human origin and tissues of mouse models of disease. In addition to understanding cancer biology these finding help us design and test targeted therapies in preclinical models of leukemia. Our research is currently supported by the Research Foundation Flanders (FWO) via a generous Odysseus Grant (Brussels Times &amp;&nbsp;FWO-Odysseus) and by UGent start-up funds.The group is a member of the Faculty of Medicine and Health Sciences and the Department of Biomolecular Medicine situated in the campus of Ghent University, in the heart of the Ghent metropolitan area. The team has access to cutting-edge technology and facilities and is exposed to the vibrant scientific community of Ghent University, the Flemish Institute for Biotechnology (VIB) and other research centers in Belgium. Scientists in the group have the opportunity to present their work and get feedback in Institutional, National and International forums.&nbsp;Related links:https://www.ntziachristoslab.com/https://www.ncbi.nlm.nih.gov/pubmed/?term=ntziachristos+phttps://www.fwo.be/media/1024349/results-odysseusprogramme-2020.pdfhttps://www.ugent.be/ge/biomolecular-medicine/en&nbsp;&nbsp;WHAT WE ARE LOOKING FOR&nbsp;You hold a thesis-based doctorate.Highly-motivated and collaborative scientistA strong track record and expertise in bioinformatics, with a focus on RNA biology and the analysis of splicing phenomena, computational systems biology or related fields.Knowledge of gene expression biology and of high-throughput methodologies such as RNA-Seq, ChIP-Seq, HiC, and 4C-Seq is an asset.Experience in conducting research and/or supervising PhD students is an asset.International mobility is an asset.&nbsp;&nbsp;WHAT WE CAN OFFER YOU&nbsp;We offer you a contract of indefinite duration with a maximum term of 6&nbsp;yearsYour contract will start on 01/03/2022 at the earliest.Your remuneration will be determined by salary scale as determined by UGent. Click here for more information about our salary scales.All Ghent University staff members enjoy a number of benefits, such as a wide range of training and education opportunities, 36 days of holiday leave (on an annual basis for a full-time job) supplemented by annual fixed bridge days, a bicycle allowance and eco vouchers. Click here for a complete overview of all the staff benefits (in Dutch).&nbsp;&nbsp;INTERESTED?&nbsp;Apply online through the e-recruitment system before the application deadline (see above). We do not accept late applications or applications that are not submitted through the online system.&nbsp;Your application must include the following documents:&nbsp;In the field â\u0080\u0098CVâ\u0080\u0099: your CV and an overview of your study results (merged into one pdf file)In the field â\u0080\u0098Cover letterâ\u0080\u0099: your application letter in pdf formatIn the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of the required degree (if already in your possession). If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field â\u0080\u009cother documentsâ\u0080\u009d: please list the names and contact details of two referees.&nbsp;&nbsp;Note that the maximum file size for each field is 10 MB.&nbsp;As Ghent University maintains an equal opportunities and diversity policy, everyone is encouraged to apply for this position.&nbsp;MORE INFORMATION&nbsp;For more information about this vacancy, please contact directly Prof. Panos Ntziachristos (panagiotis.ntziachristos@ugent.be). Important: do NOT send your application by email, but apply online.&nbsp;Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}