{"url": "https://www.academictransfer.com/en/309366/devops-leader-at-datahub-maastricht/", "title": "DevOps Leader at DataHub Maastricht", "publish_date": "2022-02-11", "deadline": "2022-02-24", "location": "Universiteitssingel 40, 6229 GR, Maastricht", "city": "Maastricht", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "â\u0082¬2846â\u0080\u0094â\u0082¬5230 per month", "max_working_hours": "30.4—38", "employer": "Maastricht University (UM)", "job_description": "<p>DataHub Maastricht is looking for a talented DevOps professional who is comfortable with performing server administration duties in a challenging environment. As a DevOps Leader, you will be the manager of our DevOps team. You will work in close collaboration with our Scrum Developers team (4 persons) and colleagues of the university and hospital central IT-services. You will also have an active role in the national health-data infrastructure led by the Health-RI foundation in which DataHub acts as one of the nodes.</p><p>Besides (Linux) system and software administration, the position will also challenge you in configuration and automated deployment of both proven and experimental technologies. Additionally, you will build and manage our continuous testing framework and will get familiar with data management standards and interoperability.</p><p><strong>&nbsp;Major duties</strong>:</p><ul> <li>Manage and coordinate the work of our growing DevOps team<br> (currently 4 persons);</li> <li>Act as Information Security Officer at DataHub;</li> <li>Representative concerning services in our regional and national<br> Health-RI community;</li> <li>Monitor for and identify potential security breaches and vulnerabilities;</li> <li>Maintain and update automated deployment and configuration procedures;</li> <li>Develop our technical infrastructure and ensure compatibility with demands from developers and clients;</li> <li>Systems administration of our virtual Linux server stack (&plusmn; 45 Ubuntu<br> and CentOS systems);</li> <li>Monitoring of servers and applications;</li> <li>Application management and customer support.</li> </ul>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Your Profile:</strong><br/>\nWe require:</p>\n<ul>\n<li>Excellent interpersonal and communication skills;</li>\n<li>A BSc in Information Technology, bio-informatics or equivalent;</li>\n<li>Comfortable with Linux (Ubuntu and CentOS distros);</li>\n<li>Knowledge of concepts like CI/CD, configuration management, version control, etc.;</li>\n<li>Experience with virtualization (VMware) and containerization (Docker);</li>\n<li>Certified DevOps Leader (or willingness to attain);</li>\n<li>Certified Information Systems Security Professional (or willingness to attain);</li>\n<li>Comfortable with working in an Agile team;</li>\n<li>Comfortable with context switching;</li>\n<li>Working proficiency in English.</li>\n</ul>\n<p>Experience in these areas is appreciated:</p>\n<ul>\n<li>Experience with automation software (Ansible, Jenkins etc.);</li>\n<li>Experience with database technologies (MySQL, PostgreSQL, mongoDB, etc.);</li>\n<li>Experience with the iRODS system;</li>\n<li>Experience with programming in Python, PHP, Javascript or other relevant languages.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 1 year, with the option to get a permanent contract thereafter.</p>\n<p>We offer a temporary contract of 1 year (32 - 40 hours per week), discussable with the option to get a permanent contract thereafter.</p>\n<p>Remuneration will be according to standard salary levels, depending on education and relevant work experience, in salary scale 10 or 11 (between € 2.846 and € 5.230,- gross per month, based on a fulltime appointment) according to the collective labour agreement (CAO) of Dutch Universities, including 8% holiday pay and an 8,3% end of year payment. A preliminary scale might apply in case the suitable candidate has yet to develop certain professional skills.</p>\n<p>The terms of employment of Maastricht University are set out in the Collective Labour Agreement of Dutch Universities (CAO). Furthermore, local UM provisions also apply. For more information look at the website<br/>\n<a href=\"http://www.maastrichtuniversity.nl/\">www.maastrichtuniversity.nl</a> &gt; About UM &gt; <a href=\"https://www.maastrichtuniversity.nl/about-um/working-um\">Working at UM</a>.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Maastricht University</h4>\n<p>Maastricht University is renowned for its unique, innovative, problem-based learning system, which is characterized by a small-scale and student-oriented approach. Research at UM is characterized by a multidisciplinary and thematic approach, and is concentrated in research institutes and schools. Maastricht University has around 20,000 students and 4,700 employees. Reflecting the university's strong international profile, a fair amount of both students and staff are from abroad. The university hosts 6 faculties: Faculty of Health, Medicine and Life Sciences, Faculty of Law, School of Business and Economics, Faculty of Science and Engineering, Faculty of Arts and Social Sciences, Faculty of Psychology and Neuroscience. For more information, visit <a href=\"http://www.maastrichtuniversity.nl\">www.maastrichtuniversity.nl</a></p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>More information about this position can be obtained from:<br/>\nPascal Suppers, Managing Director, e-mail <a href=\"mailto:p.suppers@maastrichtuniversity.nl\">p.suppers@maastrichtuniversity.nl</a></p>\n<p>To apply at this vacancy, press the button ‘apply now’ to see the application procedure.</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.maastrichtuniversity.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/um-en-wide/0c1dd83b22059d7ee90c38e0f0c254be.jpg"}