{"url": "https://academicpositions.com/ad/ca-foscari-university/2022/full-professor-in-the-area-of-greek-history/175171", "title": "Full Professor in the area of Greek History", "publish_date": "2022-02-11", "deadline": "2022-03-14", "location": "Dorsoduro 3246 Venice, Italy", "city": "N/A", "country": "Italy", "position": "Full Professor", "field": "Ancient History, Archaeology, Classical Philology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Caâ\u0080\u0099 Foscari University of Venice", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>Caâ\u0080\u0099 Foscari invites applications for a permanent position of Full Professor in the area of Greek History.</p><p>Caâ\u0080\u0099 Foscari is a research intensive institution committed to competing for international scientific excellence through the recruitment of the best academic talents worldwide. Talented young researchers and experienced senior professors make Caâ\u0080\u0099 Foscari a stimulating environment for <a href=\"https://www.unive.it/pag/28008/\" target=\"_blank\">career development</a> and research freedom. Our university is committed to research excellence, funding promising researchers and developing international partnerships. As a leading research university, Caâ\u0080\u0099 Foscari explores cutting-edge research directions across disciplinary boundaries, setting a new agenda designed around <u>six global challenges</u>.</p><p>Caâ\u0080\u0099 Foscari is looking for a full professor of Greek History capable of inspiring students to become game-changers in their own fields and to make a genuine difference in the world. </p><p>Teaching commitment: No less than 120 hours of frontal teaching in curricular courses and modules for BA, M and PhD programs. In particular:</p><p>- Storia greca I, 30 hours, BA in History;</p><p>- Storia greca (approfondimenti), 30, hours, BA in History;</p><p>- Epigrafia greca sp30 hours, MA in Ancient civilizations: literature, history and archaeology;</p><p>- L-ANT/02 Storiografia greca sp., 30 hours, MA in Sciences of antiquity: literature, history, archaeology.</p><p>Scientific commitment: the candidate must have extensive skills in Greek history, in particular in the exegesis of historiographic sources and in epigraphy, in line with the declaration of the academic discipline L-ANT/02 (Greek history). As well, the candidate must have solid research experience in Greek history from the Archaic to the Hellenistic age, with specific reference to the development of political thought and the institutional, economic and social dynamics developed by Hellenism in the Western Mediterranean areas.</p><p>The position will be hosted at the <a href=\"https://www.unive.it/pag/27720/\" target=\"_blank\">Department of Humanities</a>, a center for the development of innovative and interdisciplinary approaches to history, literature, classics, archeology, art and anthropology. The Department has recently received the â\u0080\u009cDepartment of Excellenceâ\u0080\u009d Award by the Italian Ministry of Education, Universities and Research. The Excellence Award has allowed the department to receive additional state funding to develop innovative projects on Digital Humanities and Public Humanities, with the aim of setting in motion a cross-contamination process between scientific areas and redefining a new teaching standard.<br/>In the Department of Humanities, Marie SkÅ\u0082odowska-Curie fellows and ERC awardees work together with the permanent faculty, creating a vibrant academic environment.</p><p>The Institution</p><p>Since its foundation in 1868, Caâ\u0080\u0099 Foscari University of Venice has been a leader in Economics and Foreign Languages and Cultures. Today, Caâ\u0080\u0099 Foscari is exploring new frontiers in research, focusing on Climate Change, Digital Humanities, Digital and Social Innovation, and Nanosciences. An intellectual powerhouse of international repute in the heart of the city of Venice, Caâ\u0080\u0099 Foscari provides a one-of-a-kind blend of scientific research, cultural heritage and history, offering a life-changing experience to its students and researchers, with a transformative impact on the local community.</p><p>Caâ\u0080\u0099 Foscari University of Venice has also obtained the full Human Resources Strategy for Researchers certificate, a set of initiatives to improve work conditions for researchers and to attract talents worldwide. Caâ\u0080\u0099 Foscari provides applicants with exclusive services and onboarding initiatives. Our <a href=\"https://www.unive.it/pag/19768/\" target=\"_blank\">Housing office</a> will help you search for a suitable and convenient accommodation, matching your needs and preferences with the available options.</p><p>If you are a non-Italian applicant or if you have resided outside of Italy for more than 3 years, you will benefit from a favorable tax treatment for the first years of the contract.</p><p>Read the call here: <a href=\"https://www.unive.it/data/38002/?id=2022-UNVE000-0012946\" target=\"_blank\">https://www.unive.it/data/38002/?id=2022-UNVE000-0012946</a></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI2ZDhcL2NkMVwvNmQ4Y2QxNjU1NDIxOTEwNGU0ZTFjYzc2NDIyZTE4MjYucG5nIiwiZWRpdHMiOltdfQ=="}