{"url": "http://www.academictransfer.com/en/309389/dean-faculty-of-industrial-design-engineering/apply/", "title": "Dean Faculty of Industrial Design Engineering", "publish_date": "2022-02-11", "deadline": "2022-03-06", "location": "Mekelweg 2, 2628 CD, Delft", "city": "Delft", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "â\u0082¬7776â\u0080\u0094â\u0082¬10309 per month", "max_working_hours": "N/A", "employer": "Delft University of Technology (TU Delft)", "job_description": "<p>You are responsible for policymaking, management and administrative direction of the Faculty of Industrial Design Engineering of TU Delft, the largest independent faculty in this scientific domain in the world. In cooperation with virtually all technical sciences imaginable on campus, we realise excellent research results to improve lives and tackle social challenges.</p> <p>The faculty focusses its research on three areas of application, i.e. Health, Mobility and Sustainability. This includes, for example, the facilitation of home care through robotics-driven applications as well as system-level designs that contribute to faster baggage handling at airports. Or, for example, the integration of sustainability in designs, in light of future resource scarcity. Click <a href=\"https://www.tudelft.nl/io/onderzoek\">here</a> for an overview of these fields and examples of research projects:</p> <p>Bearing final responsibility for research, education and operations at the faculty, you will outline the main path and manage the faculty at an operational level. You do so through unifying leadership, an open-minded stance towards cultural differences and a keen eye for diversity and talent. You also contribute to effective cooperation within the faculty, with other faculties of TU Delft and with the (inter)national design domain. Your management team is currently working on the strategic plan for the faculty's research in coming years. You will carry out this plan and ensure its concrete implementation. To the outside world, you act as an ambassador for research and education within our faculty.</p> <p>As dean, you are the chair of the management team, which consists, among others, of three departmental chairpersons, the representatives of the research council, the educational director, the HR, finance and communication managers and the secretary. With them, you enhance the faculty's research vision, mission and strategy and create a stimulating environment for excellent research. You also represent the faculty in the TU Delft group council which you are part of along with the Executive Board and the deans of the other seven faculties. As leader of the faculty, you report to the Executive Board of the university.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You have a leading position in the field of design engineering or a related (technological) field, preferably have a PhD, and you have extensive experience in the areas of academic leadership and administration.</li>\n<li>You are familiar and experienced with Dutch engineering sciences and have access to an extensive international network in the industry and governmental institutions.</li>\n<li>You have strong conceptual capacities, can draft the general framework for plans and find the right balance between the interests of the faculty and those of our employees and students.</li>\n<li>You contribute to the strategy of the faculty with a hands-on attitude, can monitor changes and stimulate constant innovation in the areas of research and education.</li>\n<li>You excellently represent the interests of the faculty both internally and externally.</li>\n<li>With your excellent social skills and clear and transparent communication, you create the foundations for a healthy work and study culture and pleasantly address various parties to get them on the same page.</li>\n<li>You have an excellent command of written and spoken Dutch and English.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>A salary in accordance with the collective labour agreement for Dutch Universities, plus 8% holiday allowance and a year-end bonus of 8.3%.</li>\n<li>An excellent pension scheme via the ABP pension fund.</li>\n<li>The possibility to compile an individual employment package every year.</li>\n<li>Health insurance discounts.</li>\n<li>A flexible working week.</li>\n<li>\n232 hours of annual leave (based on a 38-hour working week). On top of that, you can sell or purchase leave hours through the individual budget.</li>\n<li>An extensive education and training offering.</li>\n<li>Partially paid parental leave.</li>\n<li>Access to our Health Coach Programme stimulating healthy working and vitality.</li>\n</ul>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Delft University of Technology</h4>\n<p>The Delft University of Technology has strong foundations. Builder of the world-renowned Dutch waterworks and a pioneer in biotechnology, TU Delft is an international, top-ranking university that combines science, engineering and design. TU Delft stands for top-level education, research and innovation to tackle challenges in the areas of energy, climate, mobility, health and the digital society.Â  For generations, Delft engineers have proven themselves to be enterprising problem solvers in business and social contexts. At TU Delft, we embrace diversity and strive for the highest level of inclusivity (view our <a href=\"https://www.tudelft.nl/en/about-tu-delft/strategy/integrity-policy/tu-delft-code-of-conduct\">code of conduct</a>). Together, we develop solutions with a positive impact on a global scale.</p>\n<p>Challenge. Change. Impact!Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â </p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.tudelft.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tud-en-wide/4f5fb7eb63ad62ee5a7d5dfdc5376f8f.gif"}