{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/optometry-and-vision-science/175074", "title": "Optometry and Vision Science", "publish_date": "2022-02-09", "deadline": "2022-05-09", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Researcher", "field": "Medical Physics, Optics, Optometry,", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "College of Healthcare TechnologyWhy the American University of Iraq â\u0080\u0093 Baghdad?Opening its doors in January of 2021, the new American University of Iraq â\u0080\u0093 Baghdad (AUIB) began as a dream of influential individuals in Iraqi and the United States business, industry and government who want to see a world-class institution of higher learning established in the city, reminiscent of the days when Baghdad was an educational mecca and flourishing capital of the Muslim world.&nbsp; With a great library, palatial college buildings and student centers, state-of-the-art classrooms, laboratories, and athletic facilities, AUIB will be a beautiful campus attracting students, faculty, and staff from throughout the world.&nbsp; We invite you to join us in this exciting new venture.This position will report directly to Associate Vice President for Academic AffairsJob Description, Duties, And ResponsibilitiesTeach basic and advanced theoretical and laboratory courses for undergraduate and postgraduate Optics and Optometry students.Participate in designing modules and programs in novel optometry and opticianry sciences domains to reflect the latest developments in the field.Develop and lead multidisciplinary research collaborations in optometry, opticianry and ophthalmology leading to publications in reputed journals and establish an extramurally funded research programs that augment the research directions of the college.Contribute to development of pioneer testing and research facilities and laboratories in the College of Healthcare Technologies.Contribute to advancing optometry and vision science and medical imaging in the region through designing and delivering various continuous education (CE) programs.Be involved in assessment and committee work at the College and the UniversityHave strong commitment to continuous professional developmentQualificationsPhD degree from a reputed university with postdoctoral experience in Optometry or a closely related field. Candidates with education and experience in US and US-styled educational institutions will be highly considered.Preference will be also given to candidates with research credentials and interests in any of the areas of optometry, vision science and related fields.Minimum of 2 years of teaching experience in a reputed university.Excellent communication skills in English and familiarity with the American system of higher education.Interpersonal, planning, and organizational skills with ability to effectively manage multiple projects and competing priorities.A good team player with strong ability to work harmoniously with colleagues and students of all cultures and to build positive spirit and always look for a better way.High standard and significant record of institutional, professional, and community service leadership in research, along with successful receipt and management of funded research projects, including the supervision of research staff and students and publications of high impact outputs.Application Procedure:&nbsp;Applications should include:Cover Letter&nbsp;Curriculum VitaPassport First Data PageContact Information For Three (3) Professional ReferencesCopies Of Degrees Or CertificationApplications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately.&nbsp;Please apply through AUIB website OR send your application and supporting documents to the following email address:jobs@auib.edu.iq&nbsp;with&nbsp;Karin.Jesuis@auib.edu.iq&nbsp;in copy.&nbsp;A declaration of a relation at AUIB is obligatoryWe will contact you if you are selected for interview.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "AUIB is a non-profit, private university that is fully accredited in Iraq by the Ministry of Higher Education and Scientific Research, thereby ensuring a high level of academic standards and institutional performance.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}