{"url": "https://www.academictransfer.com/en/309327/super-user-osiris-07-fte/apply/", "title": "Super User Osiris (0,7 fte)", "publish_date": "2022-02-10", "deadline": "2022-02-25", "location": "Warandelaan 2, 5037 AB, Tilburg", "city": "Tilburg", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "28", "employer": "Tilburg University", "job_description": "<p>Binnen de afdeling Student Administration, in het team van Roosteraars en Super Users Osiris, ontstaat per z.s.m. een vacature voor een Super User Osiris (0,7 fte).</p><p>&nbsp;</p><p>Een Super User Osiris heeft een gedegen kennis van het Studenten informatie systeem Osiris en is het aanspreekpunt voor de medewerkers van de faculteit/ afdeling bij vragen over het gebruik van Osiris (eindgebruikersvragen). De Super User is verantwoordelijk voor de eerstelijns Osiris ondersteuning binnen de faculteit/ afdeling en is de contactpersoon naar de Functioneel Consultants Osiris (2e lijn). Daarnaast verricht de Super User ook administratieve taken op het gebied van Inschrijven van studenten.</p><p>De Super User Osiris zal mogelijk werkzaamheden voor meerdere faculteiten/ afdelingen verrichten. Je werkt in teamverband intensief samen met collega-Super users bij de andere faculteiten en werkt nauw samen met de Roosteraar(s). Daarnaast heb je regelmatig overleg met de Functioneel Consultants Osiris. Ook neem je als afgevaardigde deel aan werkgroepen m.b.t. het verbeteren van de inrichting van de onderwijsprocessen in Osiris (op centraal niveau).</p><p>&nbsp;</p><p>De Super User Osiris heeft de volgende taken:</p><ul> <li>Eerstelijns ondersteuning voor gebruikers van Osiris binnen de faculteit/ afdeling</li> <li>Inrichting en onderhoud van de onderwijscatalogus</li> <li>Instructie verzorgen voor nieuwe gebruikers van Osiris</li> <li>Studenten inschrijven op onderwijsactiviteiten</li> <li>Invoer van tentameninformatie</li> <li>Het presentabel maken van examenprogramma&rsquo;s</li> <li>Schakel tussen faculteit/ afdeling en Functioneel Consultants Osiris</li> <li>Deelname aan werkgroepen m.b.t. verbeteren van de inrichting van de onderwijsprocessen in Osiris</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.uvt.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uvt-en-wide/8bbc452c034c71750be03f93fe602eca.png"}