{"url": "http://www.academictransfer.com/en/309165/experimental-phd-position-on-combining-trapped-ions-and-quantum-gases/apply/", "title": "Experimental PhD Position on Combining Trapped Ions and Quantum Gases", "publish_date": "2022-02-07", "deadline": "2022-04-01", "location": "Science Park 904, 1098 XH, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "PhD", "field": "Natural sciences", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "38", "employer": "University of Amsterdam (UvA)", "job_description": "<p>Do you have affinity with physics experiments and are you a<strong>&nbsp;</strong>highly-motivated to obtain your PhD, will contributing to a state-of-the art laboratory working with both ions and atom? Then we are looking for you.</p><p>We, the&nbsp;<a href=\"http://hyqs.nl/\">Hybrid Atom-ion Quantum Systems</a>&nbsp;Lab (HYQS), headed by Dr. Rene Gerritsma, are&nbsp;searching for a new PhD candidate to join our Li-Yb+ team. The group is part of the&nbsp;<a href=\"https://iop.uva.nl/content/research-groups/qgqi/quantum-gases-quantum-information.html\">Quantum Gases and Quantum Information</a>&nbsp;(QGQI) cluster at the University of Amsterdam (UvA). We study trapped ions immersed in ultracold atoms and are especially focusing on quantum effects. These systems are both interesting from the quantum chemistry aspect as well as for emerging quantum applications, such as quantum computing and simulation.&nbsp;</p><p><strong>What are you going to do?</strong></p><p>You will:</p><ul> <li>work in an optical laboratory and advance the experimental setup that studies interactions between a trapped ion impurity and an ultracold gas of atoms. The work will involve setting up optics, lasers and electronics as well as, programming, scientific reporting and data measuring and analysis;</li> <li>prepare a single trapped Yb++ ion as impurity, immersed in a bath of ultracold Li atoms and study the quantum dynamics of the ion in the bath, as well as the chemical reactions that can occur in it. The interactions and statistics of the bath can be controlled via external fields. An impurity interacting with a quantum bath is a nontrivial many-body model system with broad relevance to condensed matter. These systems could shed light on the fuzzy boundary between classical and quantum physics and may prove to be of fundamental importance when considering the practical applicability of quantum technology such as quantum computers;</li> <li>work in a team with another PhD student, a post doc and several Master students. Theory support will be supplied by the group of Dr. Arghavan Safavi-Naini of the<a href=\"https://%28https/www.quantumsc.nl/\">&nbsp;Quantum Software Research Center</a>&nbsp;(QSRC).&nbsp;&nbsp;</li> </ul><p>Relevant references:</p><ul> <li>T. Feldker et al.,<a href=\"https://www.nature.com/articles/s41567-019-0772-5\">&nbsp;Nature Physics 16, 413&ndash;416 (2020)</a></li> <li>H. Hirzler et al.,&nbsp;<a href=\"https://journals.aps.org/pra/abstract/10.1103/PhysRevA.102.033109\">Phys. Rev. A 102, 033109 (2020)</a></li> <li>H. Hirzler et al.<strong>,&nbsp;</strong><a href=\"https://journals.aps.org/prresearch/abstract/10.1103/PhysRevResearch.2.033232\">Phys. Rev. Research 2, 033232 (2020)</a></li> </ul>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>What do we require?</strong></p>\n<ul>\n<li>A MSc. in (theoretical or experimental) physics or physical chemistry.</li>\n<li>Affinity with experimental laboratory work and atomic physics.</li>\n</ul>\n<p>Other skills/experiences/documents that would benefit your application are:</p>\n<ul>\n<li>previous laboratory experience working with optics/lasers/electronics;</li>\n<li>excellent communication skills (English);</li>\n<li>scientific publications.</li>\n</ul>\n<p>To foster diversity in our research group, we will especially appreciate applications from female candidates. </p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 18 months.</p>\n<p>A temporary contract for 38 hours per week for the duration of four years (the initial contract will be for a period of 18 months and after satisfactory evaluation it will be extended for a total duration of four years). This should lead to a dissertation (PhD thesis). We will draft an educational plan that includes attendance of courses and (international) meetings. We also expect you to assist in teaching undergraduates and Master students. </p>\n<p>The salary, depending on relevant experience before the beginning of the employment contract, will be €2,443 to €3,122 (scale P) gross per month, based on a fulltime contract (38 hours a week). This is exclusive 8% holiday allowance and 8.3% end-of-year bonus. A favourable tax agreement, the ‘30% ruling’, may apply to non-Dutch applicants. The <a href=\"https://www.universiteitenvannederland.nl/en_GB/cao-universiteiten.html\">Collective Labour Agreement of Dutch Universities</a> is applicable.</p>\n<p>Are you curious about our extensive package of secondary employment benefits like our excellent opportunities for study and development? Take a look <a href=\"https://www.uva.nl/en/faculty/faculty-of-science/working-at-the-faculty/working-at-the-faculty-of-science.html\">here</a>.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>University of Amsterdam</h4>\n<p>With over 6,000 employees, 30,000 students and a budget of more than 600 million euros, the <a href=\"http://www.uva.nl/en\">University of Amsterdam (UvA)</a> is an intellectual hub within the Netherlands. Teaching and research at the UvA are conducted within seven faculties: Humanities, Social and Behavioural Sciences, Economics and Business, Law, Science, Medicine and Dentistry. Housed on four city campuses in or near the heart of Amsterdam, where disciplines come together and interact, the faculties have close links with thousands of researchers and hundreds of institutions at home and abroad.  </p>\n<p>The UvA’s students and employees are independent thinkers, competent rebels who dare to question dogmas and aren’t satisfied with easy answers and standard solutions. To work at the UvA is to work in an independent, creative, innovative and international climate characterised by an open atmosphere and a genuine engagement with the city of Amsterdam and society.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Do you have questions about this vacancy? Or do you want to know more about our organisation? Please contact:</p>\n<ul>\n<li><a href=\"mailto:r.gerritsma@uva.nl\">Dr. Rene Gerritsma</a></li>\n</ul>\n<p> </p>\n<p> </p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uva.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uva-en-wide/22e1319f66e44f07d56047b996668aa9.png"}