{"url": "http://www.academictransfer.com/en/309362/full-time-phd-research-positions-and-positions-as-junior-lecturerphd-researcher-at-the-faculty-of-law-of-maastricht-university/", "title": "Full-time PhD research positions and positions as junior lecturer/PhD researcher at the Faculty of Law of Maastricht University", "publish_date": "2022-02-11", "deadline": "2022-05-02", "location": "Bouillonstraat 3, 6211 LH, Maastricht", "city": "Maastricht", "country": "Netherlands", "position": "Researcher", "field": "Law", "salary": "N/A", "max_working_hours": "38", "employer": "Maastricht University (UM)", "job_description": "<p>Five 4-year fulltime paid PhD positions are available at the Faculty of Law of Maastricht University. As a PhD researcher, you will carry out independent academic research under the supervision of professors and researchers of the Faculty of Law, resulting in a PhD thesis. At least 80% of the position will be dedicated to research and not more than 20% to teaching activities. To apply, you will prepare a research proposal that fits in the Faculty&rsquo;s research programme. PhD researchers join the department connected to the theme of their research proposal. PhD researchers join the Maastricht University Graduate School of Law.</p><p>In addition to the five 4-year paid PhD positions, four 6-year fulltime positions as junior lecturer/PhD researcher are available. As a junior lecturer/PhD researcher, you share your time evenly between teaching (50%) and research (50%). Next to writing a PhD under the supervision of professors and researchers of the Faculty of Law, you will teach in a variety of courses and will acquire your University Teaching Qualification To apply, you will prepare a research proposal that fits in the Faculty&rsquo;s research programme. You join the department most connected to the theme of your research proposal and your teaching interests. You join the Maastricht University Graduate School of Law.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>We are looking for candidates who</p>\n<ul>\n<li>hold a relevant Master degree, preferably completed with excellent grades</li>\n<li>are highly motivated, and creative</li>\n<li>can demonstrate relevant writing skills, proven, for example, by the quality of their master thesis</li>\n<li>possess first-rate analytical skills</li>\n<li>have an excellent research idea</li>\n<li>have excellent written and oral command of English and/or Dutch (depending on the language of teaching)</li>\n</ul>\n<p>In addition, especially the candidates for the positions as junior lecturer/PhD researchers should be passionate about teaching, and possess good didactic skills. </p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>PhD researchers will be offered a 1.0 fte contract for a period of 4 years, starting preferably in September 2022. Continuation after the first year is dependent upon a positive evaluation. The full-time gross monthly salary amounts to € 2,443 in the first year according to salary scale PhD (‘promovendus’), increasing to € 3,122 in the fourth year; on top of this there will be an 8% holiday and an 8,3% year-end allowance.</p>\n<p>Junior lecturer/PhD researchers will be offered a 1.0 fte contract for 6 years, starting preferably in September 2022. Continuation after the first year is dependent upon a positive evaluation. The full-time gross monthly salary amounts to € 2,846 in the first year according to salary scale ‘junior docent-promovendus’, increasing to € 3,561 in the sixth year; on top of this there will be an 8% holiday and an 8,3% year-end allowance.</p>\n<p>You have to be willing to move to (the vicinity of) Maastricht. If you do not already live in Maastricht (or its direct surroundings), you will be eligible for an allowance for moving costs. If you do not already live in Maastricht (or its direct surroundings), you might be eligible for an allowance for alternative housing. Other secondary conditions include a pension scheme and partially paid parental leave.</p>\n<p>The terms of employment of Maastricht University are set out in the Collective Labour Agreement of Dutch Universities (CAO). Furthermore, local UM provisions also apply. For more information look at the website <a href=\"http://www.maastrichtuniversity.nl/\">www.maastrichtuniversity.nl</a> &gt; About UM &gt; <a href=\"https://www.maastrichtuniversity.nl/about-um/working-um\">Working at UM</a>.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Maastricht University</h4>\n<p>Maastricht University is renowned for its unique, innovative, problem-based learning system, which is characterized by a small-scale and student-oriented approach. Research at UM is characterized by a multidisciplinary and thematic approach, and is concentrated in research institutes and schools. Maastricht University has around 20,000 students and 4,700 employees. Reflecting the university's strong international profile, a fair amount of both students and staff are from abroad. The university hosts 6 faculties: Faculty of Health, Medicine and Life Sciences, Faculty of Law, School of Business and Economics, Faculty of Science and Engineering, Faculty of Arts and Social Sciences, Faculty of Psychology and Neuroscience. For more information, visit <a href=\"http://www.maastrichtuniversity.nl/\">www.maastrichtuniversity.nl</a>.</p>\n<p>The Faculty of Law has a strong and distinct international profile both in education and research. Our faculty is an inspiring and lively place where enthusiastic and inquisitive staff attempt to find answers to the important legal issues of today. Researchers are able to flourish in the faculty’s vibrant academic community. They develop their own research projects, within the contours set by the faculty’s research programme (<a href=\"https://www.maastrichtuniversity.nl/about-um/faculties/law/research/research-programme-faculty-law\">Research programme at the Faculty of Law - About UM - Maastricht University</a>).</p>\n<p>Research is focused on the study of the role of law in an increasingly globalised society. Research involves studying both institutional and substantive developments in the process of Europeanisation and globalisation and the role of the national legal order therein. This takes place by means of comparative research in the main fields of the law and research in the fields of European law, international economic law, human rights and law &amp; technology in a multidisciplinary and interdisciplinary context. To this end, various research methods are applied whereby more traditional methods are combined with empirical research methods.</p>\n<p>The Faculty of Law has six departments (Private Law, Public Law, International and European Law, Criminal Law, Tax Law and Foundation and Methods of Law) and hosts twelve research institutes and groups (<a href=\"https://www.maastrichtuniversity.nl/about-um/faculties/law/research/law-research-institutes\">Law research institutes - About UM - Maastricht University</a>).</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Appointment date</strong></p>\n<p>1 September 2022 (preferably).</p>\n<p><strong>Application</strong></p>\n<p>An application consists of:</p>\n<ul>\n<li>a fully elaborated proposal drafted in English or Dutch (according to the language in which the dissertation will be written), using the application form attached which can be found <a href=\"https://cms.academictransfer.com/documents/97/Application_form_PhD_Round_Faculty_of_Law_2022.docx\">here</a>;</li>\n<li>a detailed CV, including – if applicable – relevant publications;</li>\n<li>academic transcript of bachelor’s and master’s degrees and list of grades;</li>\n<li>a motivation letter;</li>\n<li>a letter of commitment by the envisaged promotor(s),</li>\n<li>the Master’s thesis or, if applicable, another substantial piece of English or Dutch writing.</li>\n</ul>\n<p>The deadline for submitting your application is up to and including <strong>2 May 2022.</strong></p>\n<p><strong>Conditions for submitting an application</strong></p>\n<p>When submitting a proposal the following conditions apply:</p>\n<ul>\n<li>each candidate will contact, preferably in an early stage, a professor or associate professor of the Faculty of Law who will act as the promotor of the proposed PhD research; he or she will formally endorse his or her commitment as a supervisor to the proposed research by means of a formal letter and will ensure that at least one co-promotor from inside or outside our Faculty will join the team of supervisors;</li>\n<li>each professor or associate professor of the Faculty of Law may commit to only one application either as promotor or co-promotor;</li>\n</ul>\n<p>Applications should be addressed to: <a href=\"mailto:pzfdrvacatures@maastrichtuniversity.nl\">pzfdrvacatures@maastrichtuniversity.nl</a>. Only an application with all the above mentioned required documents will be assessed.</p>\n<p><em>Please mention the vacancy number <strong>AT2022.71</strong>.</em></p>\n<p>For further information, please contact Patrick van Eijs, policy adviser for research (tel. 0031-43-3882027, <a href=\"mailto:patrick.vaneijs@maastrichtuniversity.nl\">email</a>).</p>\n<p><strong> Assessment criteria</strong></p>\n<p><strong> </strong>Applications are assessed on the basis of the following criteria:</p>\n<ul>\n<li>originality of the proposal and potential contribution to the existing body of knowledge;</li>\n<li>research design and methods set out in the proposal and the link between setup and methods;</li>\n<li>quality of the PhD candidate;</li>\n<li>track record of the envisaged team of supervisors;</li>\n<li>feasibility (both in terms of research setup and budget);</li>\n<li>match between the proposal and the Maastricht Faculty of Law research programme;</li>\n</ul>\n<p>The positions as junior lecturer/PhD researcher will be distributed between the departments depending on their teaching needs.</p>\n<p>The applications will be assessed by a selection committee appointed for that purpose by the Faculty Board.</p>\n<p><strong>Time schedule</strong></p>\n<p><strong> </strong>2 May 2022, 23.59</p>\n<p>Closing date submission of applications</p>\n<p>21 May 2022</p>\n<p>Applicants are informed whether they are invited for an interview</p>\n<p>Early June 2022</p>\n<p>Interviews</p>\n<p>June 2022</p>\n<p>Final decision by the Faculty Board</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.maastrichtuniversity.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/um-en-wide/0c1dd83b22059d7ee90c38e0f0c254be.jpg"}