{"url": "http://www.academictransfer.com/en/308989/promovendus-neurocognitieve-ontwikkeling-van-kinderen-met-sikkelcelziekte/apply/", "title": "Promovendus: neurocognitieve ontwikkeling van kinderen met sikkelcelziekte", "publish_date": "2022-02-02", "deadline": "2022-02-22", "location": "Meibergdreef 9, 1105 AZ, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "PhD", "field": "Gezondheid; Natuurwetenschappen", "salary": "N/A", "max_working_hours": "36", "employer": "Academic Medical Center (AMC)", "job_description": "<p><strong>Wat&nbsp;ga&nbsp;je onderzoeken?</strong><br> Dagelijks worden wereldwijd 1.000 kinderen met sikkelcelziekte geboren. Sikkelcelziekte is een erfelijke bloedziekte, waarbij de rode bloedcellen makkelijk kunnen veranderen in een sikkelcelvorm. Deze sikkelcellen zorgen voor obstructie in kleine bloedvaten waardoor het zuurstofrijke bloed niet goed aankomt bij organen en weefsels. Dit kan leiden tot allerlei ernstige levenslange complicaties, waaronder schade aan het hersenweefsel. Deze schade kan ernstige gevolgen hebben voor de ontwikkeling en het functioneren van kinderen met sikkelcelziekte waardoor hun kwaliteit van leven, schoolprestaties en carri&egrave;re vooruitzichten beperkt worden. Daar komt bij dat sikkelcelziekte vaker voorkomt binnen reeds maatschappelijk benadeelde families met een migratieachtergrond. Dit onderzoek heeft als doel om vroegtijdig kinderen met sikkelcelziekte met een bedreigde ontwikkeling te identificeren zodat vroege interventies mogelijk worden.</p><p>De promovendus zal onderzoek uitvoeren in twee projecten (ONSET en BRICK):</p><p>Objective Neurocognitive Assessment of Young Children with Sickle Cell Disease by Eye-Tracking (ONSET)<br> Vanwege de bedreigde neurocognitieve ontwikkeling van kinderen met sikkelcelziekte is het van groot belang om deze beperkingen vroeg op te sporen, zodat de zorg voor deze kinderen daarop kan worden afgestemd. ONSET richt zich op het in kaart brengen van de vroege neurocognitieve ontwikkeling van jonge kinderen met sikkelcelziekte. In het onderzoek wordt gebruik gemaakt van een versneld longitudinaal design met eye-tracking bij kinderen van 4 tot 24 maanden. Eye-tracking is een veelbelovende methode om objectieve metingen van neurocognitieve functies te verrichten bij babies en peuters. In deze studie wordt tevens de predictieve waarde onderzocht van klinische karakteristieken (waaronder proteomics) voor de neurocognitieve ontwikkeling.</p><p>Brain Structure and Neurocognitive Development in Sickle Cell Disease (BRICK)</p><p>Vanwege de verstrekkende impact van sikkelcelziekte op de neurocognitieve ontwikkeling van kinderen is het belangrijk om de mechanismen die leiden tot neurocognitieve beperkingen in detail te begrijpen. De BRICK studie maakt gebruik van biomarkers en geavanceerde beeldvorming met MRI om meer inzicht te verkrijgen de onderliggende mechanismen van de neurocognitieve beperkingen. Het onderzoek richt zich op kinderen en jongeren met sikkelcelziekte tussen de 6 en 24 jaar. Dit onderzoek wordt samen met het Sophia Kinderziekenhuis (Erasmus MC) uitgevoerd, waarbij het Emma Kinderziekenhuis verantwoordelijk is voor de neurocognitieve metingen.</p><p><strong>Wat&nbsp;ga&nbsp;je doen?</strong><br> De afdeling Kinderhematologie en de Emma Neuroscience Group van het Emma Kinderziekenhuis (Amsterdam UMC) werken samen aan innovatief onderzoek dat is gericht op de vroege neurocognitieve ontwikkeling van kinderen met sikkelcelziekte. Hierbij wordt gebruik gemaakt van biomedische methoden (proteomics) en neurowetenschappelijke methoden (eye-tracking en computergestuurd neurocognitief onderzoek). De promovendus zal onderzoek uitvoeren in twee projecten (ONSET en BRICK).</p><p><strong>Taakomschrijving</strong><br> De vacante positie omvat onder andere de volgende taken:</p><ul> <li>Rekruteren van kinderen met sikkelcelziekte in het Emma Kinderziekenhuis;</li> <li>Rekruteren van een gezonde controlegroep (4-24 maanden) via het consultatiebureau;</li> <li>Supervisie van dan wel het uitvoeren van neurowetenschappelijke metingen (eye-tracking, neurocognitief testonderzoek);</li> <li>Superviseren van master-studenten in het uitvoeren van metingen en het schrijven van een master-these;</li> <li>Management van de datastromen die voortvloeien uit het beschreven onderzoek (in Castor);</li> <li>Data-analyse middels verschillende softwarepakketten (SPSS, R);</li> <li>Het schrijven van een proefschrift op basis van de resultaten uit de beschreven projecten.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.amc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/amc-en-wide_TAjdij7/88544601f45a8bc71e9cc74b40c8c85d.png"}