{"url": "https://academicpositions.com/ad/university-portsmouth/2022/senior-lecturer-in-procurement/175129", "title": "Senior Lecturer in Procurement", "publish_date": "2022-02-10", "deadline": "2022-03-13", "location": "University House, Winston Churchill Ave Portsmouth, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Lecturer", "field": "Business Administration, Commercial Law, Corporate Governance, Corporate Law, Management,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Portsmouth", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><span style=\"color:black;\"><strong>Faculty of Business &amp; Law</strong></span><br/><span style=\"color:black;\"><strong>Operations &amp; Systems Management </strong></span></p><p><span style=\"color:black;\"><strong>Senior Lecturer in Procurement</strong></span></p><p><span style=\"color:black;\"><strong>Employment type:  Permanent</strong></span><br/><span style=\"color:black;\"><strong>Employment basis:  Full-time</strong></span><br/><span style=\"color:black;\"><strong>Salary:  Â£40,927 - Â£50,296 per annum </strong></span><br/><span style=\"color:black;\"><strong>Post number: ZZ007406</strong></span><br/><span style=\"color:black;\"><strong>Date published: 10 February 2022</strong></span><br/><span style=\"color:black;\"><strong>Closing date:  13 March 2022</strong></span><br/><span style=\"color:black;\"><strong>Interview date: 30 March 2022</strong></span></p><p><span style=\"color:black;\">The University of Portsmouth is an ambitious institution with a track record of success. One of only four universities in the south east of England to achieve a Gold rating in the Teaching Excellence Framework and ranked in the top 150 in the Times Higher Young University World Rankings.</span></p><p><span style=\"color:black;\">The University of Portsmouth achieved the highest â\u0080\u0098Goldâ\u0080\u0099 rating in the Teaching Excellence Framework (TEF) the UK governmentâ\u0080\u0099s first assessment of teaching excellence in higher education. Portsmouth Business School has a track record of sustained excellence in teaching and research as evidenced by the consistently very high student satisfaction scores in the National Student Survey, the excellent employability record of our graduates, and the results of the Research Excellence Framework (REF2014) submission. The breadth and depth of our research was viewed by the REF2014 panel as having an outstanding and very significant impact in economic, social and policy-making terms, placing us in the top 10% for impact; 87.5% of our research environment was rated as internationally excellent; and 62% of our research as world-leading or internationally excellent. We offer a full range of degree programmes across business, management, accounting, finance and economics, including PhD and the Doctor of Business Administration (DBA) programme. We combine excellence in research and scholarship with considerable business and consultancy experience, and provide leadership in the development and dissemination of sustainable business and management practice.</span></p><p><span style=\"color:black;\">Portsmouth Business School has a vibrant environment and is ambitious. We wish to build upon our existing strengths and considerable recent success by investing in excellence. We seek to appoint to Senior Lecturer in Procurement. The successful candidates are likely to hold a doctorate, or be close to completion. Professional qualifications and senior professional experience will also be considered. You will be committed to excellence in teaching at all levels, and support to develop teaching skills is available for less experienced staff. You will be expected to make a significant contribution to the research and innovation profile of the School.  You will have drive and an innovative approach to research, learning and teaching, and enjoy working collaboratively in a dynamic environment. </span></p><p><span style=\"color:black;\">Applications must be made in accordance with the details available from Human Resources at the University of Portsmouth.</span></p><p><span style=\"color:black;\">Informal enquiries may be made to the Head of Operations and Systems Management Subject Group by contacting Professor Mark Xu, </span><a href=\"mailto:mark.xu@port.ac.uk\"><span style=\"color:black;\">mark.xu@port.ac.uk</span></a><span style=\"color:black;\">.</span></p><p><span style=\"color:black;\">The University of Portsmouth believes this role <strong>is</strong> <strong>eligible</strong> for sponsorship with UKVI under the Skilled Worker Route visa, and meets the minimum salary requirements to obtain the minimum points requirement.</span></p><p><span style=\"color:black;\"><strong>Please note this post is also available as ZZ007406 - Senior Teaching Fellow in Procurement. If you would also like to apply for this post, you will need to make a separate application.</strong></span></p><p><span style=\"color:black;\">As an equal opportunities employer, we welcome applications from all suitably qualified persons and all appointments will be made on merit. As we are committed to the principles of the Race Equality Charter Mark, we would particularly welcome applicants from Black, Asian, or from other ethnic groups who are currently under-represented at this level in this area.   </span></p><p>To find out more about the University of Portsmouth and this role, click apply.</p><p>It is the policy of the University to only accept applications submitted using the Universityâ\u0080\u0099s application form.</p><p>All applications for this position will be processed and conducted in compliance with UK legislation relevant at that time.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMGFcLzMwYlwvMjBhMzBiM2JmMTU4MzZkZjUwNmNlYzQ1NGY4YTgyMWEucG5nIiwiZWRpdHMiOltdfQ=="}