{"url": "https://academicpositions.com/ad/imec/2022/senior-mems-designer/174829", "title": "Senior MEMS designer", "publish_date": "2022-02-03", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Electrical Engineering, Electronics, Engineering Physics, Mechanical Engineering, Mechanics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Design of novel MEMS actuators and sensorsWhat you will doWithin imecâ\u0080\u0099s Sensor and Actuator Technology department, our teamâ\u0080\u0099s activities focus on the development of novel applications using transducers, sensors and actuators using MEMS technology. The team is working on the design and characterization of the devices itself as well as the full system analysis until the creation of demos. As R&amp;D engineer you will work on these novel technologies and systems. You will collaborate closely with the biomedical, process technology, and ASIC teams. This interaction will enable the natural evolution of the currently developed MEMS technologies and devices towards their application. Materials selection, technology parameter definition, modeling of novel physical phenomena as well as technological variability will be key for this successful transition.&nbsp;In this job, your main activities will be:You will design novel MEMS actuators and sensors in existing technologies and technologies under development. More specifically, the team is working on new MEMS system composed of actuators and sensors which needs to reach extremely high accuracy in extreme environment. Your job will be to take part of these activities and drive the design to propose a product in several years.You will participate to the characterization of the designed devices to validate and update your models.You will maintain a high standard of literature knowledge system analysis.You will collaborate with specialists from our cross-disciplinary design and technology teams.You will follow up on customer projects.You will be involved in the definition of new industrial projects.You will contribute to the creation of a long-term vision and strategy for the group. You will generate patents and publish in international journals.What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will define the society of tomorrow.We are&nbsp;committed to being an inclusive employer&nbsp;(http://www.imec-int.com/en/careers#diversity) and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. In everything we do, your future colleagues are guided by the imec values of passion, excellence, connectedness and integrity. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a market appropriate salary with many fringe benefits.&nbsp;Who you areYou have a PhD degree in Physics, Mechanics or Electrical Engineering with more than 5 years of relevant experience in ultrasound design for productization.&nbsp;You have proven experience&nbsp;in simulation using FEM tools as ANSYS (MUST)&nbsp;in design transducers for industry applicationin project managementYou are organized and you can structure a complex project. Having experience in project writing is a plus.You have excellent communication skills, that you will use to interface with internal and external customers.&nbsp;You can work according to agreed customer timelines and manage time efficiently according to the project schedules.You take initiative and work on your own, while being part of a team.You are result-driven and flexible to meet stringent deadlines with quality output.The imec environment requires a good team player with customer-oriented communication and reporting skills.&nbsp;Given the international character of imec, a good knowledge of English is mandatory.Apply online at&nbsp;www.imec.be/jobs.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}