{"url": "https://www.academictransfer.com/en/308982/beleidsmedewerker-healthy-university-verzuim/apply/", "title": "Beleidsmedewerker Healthy University & Verzuim", "publish_date": "2022-02-02", "deadline": "2022-02-22", "location": "Rapenburg 70, 2311 EZ, Leiden", "city": "Leiden", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "<p>Als HRM dragen wij bij aan een optimaal werkklimaat voor alle medewerkers van de universiteit. HRM is verantwoordelijk voor het personeelsbeleid, bijdragend aan ontwikkeling van onze medewerkers en een veilig en gezond werkklimaat. Wil je graag betrokken zijn bij de verdere ontwikkeling van het personeelsbeleid van de Universiteit Leiden? Bij de HRM afdeling zoeken wij een</p><p><strong>Beleidsmedewerker Healthy University &amp; Verzuim</strong><strong>&nbsp;</strong><strong>(1.0 fte)</strong></p><p><strong>Vacaturenummer 22-049 10584</strong></p><p>De Universiteit Leiden profileert zich als Healthy University (HU), in haar continue streven om&nbsp;&nbsp;de mentale en fysieke gezondheid en vitaliteit van medewerkers en studenten te versterken. Onze overtuiging en ervaring is dat gezonde en vitale medewerkers en studenten in een stimulerende leer- en werkomgeving doorslaggevend zijn in het succes van de organisatie. Als beleidsmedewerker binnen het team HRM Beleid ben je verantwoordelijk voor de thema&rsquo;s Vitaliteit (Healthy University) en Verzuim. Je volgt en ontwikkelt deze thema&rsquo;s proactief en in samenhang met de ambities van HRM en de universiteit.</p><p>Gezonde medewerkers maken een gezonde organisatie. Healthy University Leiden bundelt kennis op het gebied van een gezonde leefstijl en vitaliteit en zet dit om naar initiatieven die een leeromgeving en organisatiecultuur cre&euml;ren die de gezondheid en het welzijn van medewerkers stimuleert. Als HRM medewerker Healthy University &amp; Verzuim ben je verantwoordelijk voor het ondersteunen van de Healthy University Taskforce en de Healthy University Klankbordgroep. Daar waar verzuim plaatsvindt, probeer je preventief beleid te formuleren en te zorgen dat de Poortwachter activiteiten ondersteuning bieden aan medewerkers en leidinggevenden.</p><p>Je bent de organisatorische spil en het eerste aanspreekpunt. Initiatieven en idee&euml;n rond gezondheidsbevordering en welzijn voor medewerkers komen bij jou terecht en worden door jou geco&ouml;rdineerd. Je ondersteunt bij het verder vormgeven van het landelijk netwerk HU, draagt zorg voor de communicatie en het onderhoud van het verder te ontwikkelen vitaliteitsdashboard. De andere belangrijke taak is het bieden van ondersteuning bij de uitvoering van verzuim- en vitaliteitsprojecten om de inzetbaarheid van onze medewerkers te bevorderen. Je volgt interne en externe ontwikkelingen op het gebied van verzuim preventie, werkt nauw samen met de arbodienst en ondersteunt vanuit HRM bij de implementatie en evaluatie van een nieuw verzuimsysteem. Jij stuurt (preventief) op frequent verzuim om langdurige uitval te voorkomen en duurzame inzetbaarheid te verhogen.</p><p>Kortom een diverse rol met veel uitdagingen en gezichten:&nbsp;</p><ul> <li>Je bent de verbindende factor en organisator op het gebied van mentale en fysieke gezondheid, vitaliteit en verzuim. Gezondheids- en vitaliteit bevorderende initiatieven op de werkvloer gaan je aan het hart;</li> <li>Daar waar er verzuim is weet je de juiste beleidsmatige ondersteuning vorm te geven en uit te dragen via &amp; met het management en HR collega&rsquo;s van de faculteiten;</li> <li>Je werkt in een rol met veel creatieve ruimte en verantwoordelijkheid om taken zelfstandig uit te voeren;&nbsp;Het vertalen van beleid in instrumenten en processen behoort tot het takenpakket;</li> <li>Je bent van meerdere markten thuis en schakelt makkelijk met diverse stakeholders (relevante bestuurders, afdeling VGM, collega&rsquo;s in de faculteiten en eenheden etc.).</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.universiteitleiden.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/lei-en-wide/f66e61a821cf3294ef5ce4fcaacbdedb.png"}