{"url": "https://academicpositions.com/ad/vtt/2022/senior-research-scientist-electron-microscopy/175041", "title": "Senior / Research Scientist, Electron Microscopy", "publish_date": "2022-02-08", "deadline": "2022-02-27", "location": "Vuorimiehentie 3 Helsinki, Finland", "city": "N/A", "country": "Finland", "position": "Researcher", "field": "Artificial Intelligence, Electronics, Engineering Physics, Machine Learning, Materials Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "VTT", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>Are you interested in Electron Microscopy and looking for a new job opportunity in the field? Would you like to develop innovative technology with superb colleagues who are top experts in their field? Do you want to build an excellent science career and work at the interface of academy and industry? VTT might be just the place for you. </strong></p><p><i>VTT is one of the leading applied research organisations in Europe. What unites us are curiosity, a passion for learning and a purpose: to solve the biggest challenges of our time and turn them into sustainable growth and well-being. Our cross-disciplinary community of over 2000 brilliant minds is focused on creating impact through science-based innovation.â\u0080¯Get to know us further by exploring VTTâ\u0080\u0099s research infra atâ\u0080¯</i><a href=\"https://www.vttresearch.com/en/vtt-world/\" target=\"_blank\"><i><strong>VTT World</strong></i></a><i><strong>. </strong></i></p><p><strong>We are now looking for Senior / Research Scientist to join our Materials in Extreme Environments team.</strong></p><p>As a Senior / Research Scientist your key goal is to master, develop, and apply electron microscopy for solving materials challenges and supporting computational materials modelling. In this position, you will have the leading role in microstructural and elemental characterization, development of in-situ testing methods, and defining the future of our electron microscopy approaches and capabilities.</p><p>Our team, Materials in Extreme Environments works with various industries where understanding the materials behaviour is the key to success. Material durability and lifetime, understanding the link between materials property and performance, and support for computational materials design are key topics of our work. As the processes are rapidly changing carbon free, understanding the materials performance is more important than ever.</p><p>Read more about our research: </p><p><a href=\"https://www.vttresearch.com/en/ourservices/computational-material-design-vtt-propertune\" target=\"_blank\">Computational materials science applications - VTT ProperTune (vttresearch.com)</a></p><p><a href=\"https://www.vttresearch.com/en/ourservices/lifetime-analysis-systems-and-components\" target=\"_blank\">Lifetime analysis of systems and components | VTT (vttresearch.com)</a></p><h2><strong>As Senior / Research Scientist, you will:</strong></h2><ul><li>Use your advanced skills in Scanning Electron Microscopy for analyzing the properties of mainly metallic materials. You know what acronyms FIB - FEG - EDS - WDS - EBSD - BSE - TEM - EELSâ\u0080¦ stand for.</li><li>Thrive for development and understand the limitations and possibilities of the state-of-the-art electron microscopy methods.</li><li>Work supporting the existing projects and youâ\u0080\u0099ll also take part in future project development.</li><li>Report, analyze, and disseminate your results in such a way that they best serve their purpose.</li></ul><h2><strong>Who we are looking for:</strong></h2><ul><li>You have several years of experience in electron microscopy, especially in SEM-EBSD of metallic materials. Experience using FIB would be beneficial - in the most optimal case also TEM.</li><li>You have M.Sc. in Materials Science, Engineering Physics or similar related field. You either have completed or would like to complete your PhD.</li><li>You understand the needs of materials modelling and can produce experimental data that works as an input for the models. In the future, we expect that the process can also run reverse. Thus, the experimental work feeding topics to the modelling.</li><li>You are excited about further development of the traditional electron microscopy, in-situ testing methods, and implementing machine learning and AI as a part of the process.</li><li>You have a couple years of experience in SEM operational systems, both hardware and software.</li><li>You can communicate and report your findings fluently in English. Knowing the basics of Finnish would be a plus.</li></ul><h2><strong>As a person, we hope that you are:</strong></h2><ul><li>You are able to manage several assignments simultaneously and flexible adapt to changing situations.</li><li>You are a team player but also capable of performing high-quality work independently.</li><li>You are highly development oriented and enjoy challenges and learning new things. You have a strong passion for science and R&amp;D.</li></ul><h2><strong>With VTT, youâ\u0080\u0099ll enjoy: </strong></h2><ul><li><strong>Visionary work in technology. </strong>We offer positions at the cutting-edge of technology and engineering from next generation microelectronics and quantum technology to automation and robotics, energy systems and more. Our research agenda is dedicated to creating sustainable growth by solving systemic and technological challenges, so your work will go towards creating real, positive impact. Read more about our strategy â\u0080\u0093 <a href=\"https://www.vttresearch.com/en/news-and-ideas/welcome-path-exponential-hope-how-turn-turbulence-2020s-sustainable-growth\" target=\"_blank\">the path of exponential hope</a>.</li><li><strong>Fascinating projects, excellent research environment. </strong>Our researchers get to work on a combination of cutting-edge academic research and applied customer projects, both locally and internationally. At VTT, youâ\u0080\u0099ll have state-of-the-art research facilities at your disposal, such as Micronova, the Finnish research infrastructure for micro-, nano- and quantum technologies.<strong>  </strong></li><li><strong>Great career opportunities, superb colleagues.</strong> At VTT, excellence in research is a strategic priority. We offer long-term positions and stable career paths in top-level research. People tend to stay with us over 10 years since there are always new roles and responsibilities to grow into. Collaborating in a cross-disciplinary community with superb colleagues is a source of learning, inspiration, and fun.</li><li><strong>Support for your well-being. </strong>Our people are our main asset, so we take good care of them. We aim to nurture great team spirit and leadership and offer versatile well-being services to enable a good workâ\u0080\u0093life balance. On top of 6 weeks of paid holidays, we offer exercise and culture benefits, hobby clubs, and voluntary well-being services such as meditation programmes and trainings on cognitive ergonomics.</li></ul><p><strong>Apply now and join our community of brilliant minds!</strong></p><p>Pleaseâ\u0080¯send your CV and application with your salary request via our recruitment system as soon as possibleâ\u0080¯but <strong>at the latest by 27 Feb 2022. </strong>We will process applications as they come in, and fill in the position as soon as we find the right candidate.  </p><h2><strong>Interested and want to hear more?</strong></h2><p>For further information, please contact Research Team Leader Janne Pakarinen, <a href=\"mailto:janne.pakarinen@vtt.fi\">janne.pakarinen@vtt.fi</a>, +358 50 441 2608, on Feb 11, 10-12, Feb 14, 13-15 or Feb 16, 12 - 14.</p><p><strong>We look forward to hearing from you!</strong></p><p><strong>Location:</strong> Kemistintie 3, Espoo, Finland</p><p>Apply between <strong>7 February 2022</strong> and <strong>27 February 2022 23:59 (Europe/Helsinki)</strong></p><p><strong>Employment type:</strong> Full-time, permanent</p><h2>VTT</h2><p><i>VTT is a visionary research, development and innovation partner. We drive sustainable growth and tackle the biggest global challenges of our time and turn them into growth opportunities. We go beyond the obvious to help the society and companies to grow through technological innovations. We have over 75 years of experience of top-level research and science-based results. VTTÂ´s turnover and other operating income is 258 Mâ\u0082¬. VTT is at the sweet spot where innovation and business come together.</i></p><p>VTT â\u0080\u0093 beyond the obvious.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxYjJcLzA2Y1wvMWIyMDZjODQ0MTljY2ZlNWNjODU2MzM0MTZjMWVhMmUucG5nIiwiZWRpdHMiOltdfQ=="}