{"url": "https://academicpositions.com/ad/european-respiratory-society/2022/ers-eu-respire4-marie-sklodowska-curie-postdoctoral-research-fellowships-across-europe-beyond/174882", "title": "ERS/EU RESPIRE4 Marie Sklodowska-Curie Postdoctoral Research Fellowships (across Europe & beyond)", "publish_date": "2022-02-04", "deadline": "2022-05-01", "location": "4, Avenue Ste-LuceCH 1003LausanneSwitzerland Lausanne, Switzerland", "city": "N/A", "country": "Switzerland", "position": "Postdoc", "field": "Applied Mathematics, Biochemistry, Biomedical Engineering, Clinical Sciences, Health Psychology, and 5 moreHealth Science,Information Science,Pharmacy & Pharmacology,Public Health,Respiratory Medicine", "salary": "N/A", "max_working_hours": "N/A", "employer": "European Respiratory Society (ERS)", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<h3>Outline</h3><p>The RESPIRE4 Postdoctoral Research Fellowship programme coordinated by the European Respiratory Society (ERS) receives funding from the European Union's (EU) Horizon 2020 research and innovation programme under the Marie SkÅ\u0082odowska-Curie Actions grant agreement No 847462 (MSCA COFUND scheme).</p><p>RESPIRE4 is an international, intersectoral and interdisciplinary programme providing Marie SkÅ\u0082odowska-Curie post-doctoral research fellowships to early stage scientists with the potential to become the leaders of tomorrow in the respiratory field.</p><p>Candidates can apply for 2-year European or 3-year Global fellowships. The programme provides attractive working conditions (living allowance adapted to each country's coefficient, mobility allowance and - if applicable - family allowance) as well as has a strong focus on career development. Applications are welcome across the spectrum of respiratory research from basic science, translational and clinical research to health system and implementation research. </p><p>Applications under the 3rd call are open until <strong>1 May 2022</strong> <strong>(23:59 Central European Summer Time - CEST)</strong>.  Kindly note that the RESPIRE4 programme falls under the EU <strong>Horizon 2020 (H2020) </strong>programme (not the current Horizon Europe) therefore the specific requirements and definitions of Horizon 2020 apply. Please refer to the ERS website and the Application Guidance for further information.</p><h3>Eligibility</h3><ul><li>Discipline: Applicants from any discipline (e.g. life sciences, engineering, mathematics, information technology, biochemistry, pharmacology, social sciences, health psychology, public health, implementation research) are encouraged to apply, with a research project related to respiratory science/medicine.</li><li>Experienced researcher: At the time of the reference date (1 May 2022 for the 3rd call), applicants must be in possession of a doctoral degree (PhD) or have at least four years of equivalent full-time research experience.</li><li>Transnational mobility rule: Applicants must not have resided nor carried out their main activity in the country of the host centre for more than 12 months in the 3 years immediately prior to the reference date (1 May 2022 for the 3rd call).</li><li>Publications: Applicants must have at least one first-author (or co-author) paper published (or accepted for publication) in an international peer-reviewed journal by the reference date (1 May 2022 for the 3rd call).</li><li>Host centre: The host centre will need to be pre-registered on the RESPIRE4 Web Host Registry (<a href=\"https://www.ersnet.org/respire\" target=\"_blank\">https://www.ersnet.org/respire</a>). Currently, more than 80 host centres worldwide are listed and new ones are added regularly. The location of the fellowship depends on whether a 2-year European Fellowship or a 3-year Global Fellowship is chosen.</li></ul><p>This is a summary only. Please refer to the ERS website and the Application Guidelines for further information.</p><h3>More Information</h3><p><a href=\"https://www.ersnet.org/education-and-professional-development/marie-sklodowska-curie-postdoctoral-research-fellowships-respire/\" target=\"_blank\">https://www.ersnet.org/education-and-professional-development/marie-sklodowsk...</a></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJhMjFcLzM3MFwvYTIxMzcwZTg1MjhjZWY4MjA0MDhkNjliMTM2NTAyZDAucG5nIiwiZWRpdHMiOltdfQ=="}