{"url": "http://www.academictransfer.com/en/309203/postdoctoral-researcher-in-virology/apply/", "title": "Postdoctoral Researcher in Virology", "publish_date": "2022-02-08", "deadline": "2022-02-21", "location": "Meibergdreef 9, 1105 AZ, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "Engineer/Technician", "field": "Natural sciences; Health; Engineering", "salary": "â\u0082¬2986â\u0080\u0094â\u0082¬4707 per month", "max_working_hours": "32—36", "employer": "Academic Medical Center (AMC)", "job_description": "<p>The&nbsp;<strong>project</strong></p><p>The COVID-19 pandemic demonstrates how underprepared the world has been for emerging pandemic respiratory viruses, such as SARS-CoV-2. Although vaccines have been developed, SARS-CoV-2 is still actively spreading and new variants are constantly emerging. The impact of new mutations in the viral proteins responsible for viral replication and transcription is still poorly understood. We recently developed a SARS-CoV-2 mini-genome assay to identify new inhibitors of SARS-CoV-2 replication and test the effect of mutations in the viral replication proteins on viral RNA synthesis and the sensitivity of SARS-CoV-2 to current antivirals, such as remdesivir or favipiravir.</p><p>About&nbsp;<strong>your</strong>&nbsp;role</p><p>We are looking for an enthusiastic postdoc to work a joint project between the Laboratory of Applied Evolutionary Biology of the Amsterdam University Medical Center (location AMC), the National Institute for Public Health and the Environment (RIVM), and the Department of Molecular Biology of Princeton University. The appointed postdoc will work on a ZonMW/NWO funded project to study SARS-CoV-2 replication and the impact of mutations in variants of concern (VoC) on SARS-CoV-2 sensitivity to antivirals and replication kinetics.</p><p>The postdoc will be primarily responsible for the continued development of the SARS-CoV-2 replication activity assay, the screening of inhibitor libraries, and the testing of emerging SARS-CoV-2 mutations using in vitro and virus assays. There will be ample opportunities to develop other skills and contribute to multiple aspects of the project.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><em><strong>We are looking for a highly motivated and enthusiastic Postdoctoral Researcher (Postdoc) with experience in molecular cloning, transfections, and protein expression.</strong></em></p>\n<ul>\n<li>You have a PhD and track record of publishing your results in peer reviewed journals.</li>\n<li>You have outstanding experimental research skills and academic skills, are well organized, goal-oriented and results-driven, and have a strong team spirit, but you can also function independently.</li>\n<li>You have excellent communication skills and are fluent in speaking and writing in English.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 12 months with the possibility for an extension.</p>\n<ul>\n<li>Working on a large-scale research project, with motivated colleagues from all over the world.</li>\n<li>We offer a contract for a year (12 months) with the possibility for an extension.</li>\n<li>Additional benefits include an 8.3% end-of-year bonus and 8.0% holiday pay.</li>\n<li>The base salary does not include holiday pay (8%) and a year-end bonus (8.3%). </li>\n<li>In addition to excellent accessibility by public transport, AMC also has a sufficient number of parking spaces for employees.</li>\n<li>Salary is by experience according to Dutch UMC CAO.</li>\n<li>Pension is accrued at Be Frank. </li>\n</ul>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Amsterdam UMC</h4>\n<p><a href=\"https://www.amc.nl/web/home.htm\">Amsterdam UMC</a> is a leading medical center that combines complex high-quality patient care, innovative scientific research, and education of the next generation health care professionals. We believe that health care practice, research and education belong together, with each shaping and informing the other.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>What to <strong>expect</strong></p>\n<ul>\n<li>A job in our beautiful capital</li>\n<li>Working for the most preferred employer in healthcare (intermediair 2021)</li>\n<li>All colleagues have the same goal: contributing to tomorrow's care</li>\n<li>We care not only for our patients, but also for you</li>\n<li>Cooperation is characterised by mutual trust and interest in one another</li>\n</ul>\n<p> </p>\n<ul>\n<li>We are constantly innovating, so you must be able to deal with change</li>\n<li>Parking is limited at location VUmc, but by public transport you can get to the door</li>\n<li>A full agenda, because our staff association organises many fun activities</li>\n</ul>\n<p>Let’s meet!</p>\n<p><em>To apply, please submit: 1. a full academic CV including peer reviewed publications, presentations at conferences, and other relevant experience; 2. a letter describing your motivation in applying for the position and suitability for the role along with the names, job titles, and email addresses of three references.</em></p>\n<p>Do you have any questions about this positions? Please contact <strong>Prof dr Colin Russell</strong>, <strong><a href=\"mailto:c.a.russell@amsterdamumc.nl\">c.a.russell@amsterdamumc.nl</a>, </strong><strong>Dr Dirk Eggink</strong> via <strong><a href=\"mailto:dirk.eggink@rivm.nl\">dirk.eggink@rivm.nl</a></strong> or<strong> Dr AJ te Velthuis </strong>via <strong><a href=\"mailto:aj.te.velthuis@princeton.edu\">aj.te.velthuis@princeton.edu</a></strong></p>\n<p>For more information about the application procedure, please contact <strong>Tanja Hart</strong>, Recruitment Adviser, via <strong>06-21603178 </strong>or via<strong> <a href=\"mailto:t.hart@amsterdamumc.nl\">t.hart@amsterdamumc.nl</a></strong></p>\n<p>A reference check can be part of the procedure. References will only be contacted after interview.</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.amc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/amc-en-wide_TAjdij7/88544601f45a8bc71e9cc74b40c8c85d.png"}