{"url": "http://www.academictransfer.com/en/309047/postdoc-on-mathematical-modelling-of-neglected-tropical-diseases-to-support-elimination-programmes/apply/", "title": "Postdoc on Mathematical modelling of neglected tropical diseases to support elimination programmes", "publish_date": "2022-02-03", "deadline": "2022-02-16", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Postdoc", "field": "Health", "salary": "â\u0082¬2986â\u0080\u0094â\u0082¬4707 per month", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "The neglected tropical diseases (NTD's) are a group of poverty-related diseases caused by various types of infective agents that affect over a billion people worldwide and have been targeted for control or elimination by 2030. The main intervention strategies for these diseases encompass preventive chemotherapy through targeted or mass drug administration, or innovative and intensified diseases management. However, it is anticipated that with current drugs and strategies, control or elimination may not be achieved everywhere for all NTD's. For on-going efforts to achieve these goals, there is an urgent need to understand where endemic countries stand now in terms of progress towards control and elimination, and what they can expect to achieve in the coming decade with current or alternative intervention strategies.<br><br>The postdoctoral researcher will work on evaluating the current status of NTD control and predicting elimination prospects, as a member of the international NTD Modelling Consortium, and in an ongoing collaboration with endemic countries and stakeholders. The research will involve working with various established individual-based and deterministic models for transmission and control of NTDs, developed at the Department of Public Health. The researcher will quantify these models for relevant scenarios, based on geospatial epidemiological data and programmatic data on interventions, and will predict the impact of various intervention scenarios. The work may also involve further refining of the models, based on field data, literature and expert opinion available through our broad network in NTD research. The research will provide important information on where and for which NTDs additional efforts are necessary to achieve control or elimination, as well as an assessment of the extent to which new types of interventions could support these goals.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    The position is offered to PhD graduates in Health Sciences, Public Health, Epidemiology, Medicine, Mathematics, Econometrics, Biostatistics, or a related field. Key skills that the candidate will be developing and working with are quantitative analysis (including individual-based modelling), setting up computational frameworks and pipelines (e.g., in R), scientific communication (oral and written), and interacting with stakeholders and experts from other disciplines.<br/><br/>We offer the opportunity for candidates to deepen their affinity and acquire further experience with applied Bayesian statistics, uncertainty quantification and propagation, cross-disciplinary communication, and efficiently exploring and adopting new subject matter. The Department further highly supports candidates who want to further develop their skills in acquisition, leadership, goal-oriented working, creativity, initiative, engagement, vision, and visibility.<br/><br/>The candidate should have good command of the English language, both verbally and in writing (i.e. command of the Dutch language is not required).\n  </div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    \n            \n            \n            A fulltime 2 year position. The gross monthly salary amounts a maximum of â\u0082¬ 4.707,- (scale 10), depending on your level of education and relevant experience and based on a full-time working week of 36 hours. The terms of employment are in accordance with the Collective Bargaining Agreement for University Medical Centers (CAO UMC).\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus MC</h4>\n              \n              A healthy population and excellence in healthcare through research and education. This is what Erasmus MC stands for. Conducting groundbreaking work, pushing boundaries and leading the way. In research, education, and healthcare. We are practical people with a high level of expertise, working hard to improve and renew the healthcare of today and the public health of tomorrow.<br/><br/>At the Department of Public Health, we are dedicated to improve population health at local, national, and international level through excellent research and education. Our research is characterised as highly multidisciplinary and is focused on the development and use of innovative methods. Collaboration with and direct impact on practice and policy are at the heart of our work. Within the department, the research unit Infectious Disease Control is an internationally leading group in mathematical modelling of transmission and control of parasite, bacterial, and viral infections, with long-standing expertise in individual-based modelling.<br/><br/>The postdoctoral position is linked to several ongoing research projects, which are carried out in collaboration with various international partners, including modelling groups from Imperial College London and Oxford University, spatial epidemiologists from Lancaster University, parasitologists from Ghent University, and policy makers from the World Health Organization.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about this position, please contact Luc Coffeng, Assistant Professor, e-mail: l.coffeng@erasmusmc.nl. For queries regarding your application, please contact Jerry Chandansingh, Recruiter, by phone number: <a href=\"0031650031006\">+31 (0)6 500 310 06</a>.<br/><br/>If you are excited by the thought of this position and would like to apply, please do so by using the application form on our website.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}