{"url": "https://academicpositions.com/ad/durham-university/2022/professor-in-sustainable-and-resilient-infrastructure/175193", "title": "Professor in Sustainable and Resilient Infrastructure", "publish_date": "2022-02-11", "deadline": "2022-03-06", "location": "Stockton Rd, Durham Durham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Assistant Professor", "field": "Civil Engineering, Environmental Engineering, Industrial Engineering, Urban Design,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Durham University", "job_description": "Ref: ENGI22-3Grade 10: Competitive salary based on our Professorial pay scales which start at Â£65,575 and go considerably higher, based on experienceThe Department of Engineering at Durham University is currently undergoing a period of strategic growth and is looking to fill eight new academic posts across a range of specialisations at various academic levels.This is an exciting opportunity to join an expanding, unified Engineering Department which is recognised as being one of the very best in the UK, with a reputation for excellence in teaching, research, and employability of our students. In the REF2014 exercise, 90% of the Engineering outputs were graded 3* or 4*, and Durham was ranked 4th in the UK for impact in the General Engineering unit of assessment. The Department is committed to an ethos of research-led teaching at all levels of our taught programmes. Durham University was ranked 4th in The Guardian University Guide 2021, 6th in The Times and Sunday Times Good University Guide 2021, and 4th in The Complete University Guide 2022 for General Engineering. We were ranked 2nd in Engineering behind only Cambridge, in a recent Institute for Fiscal Studies report on the difference in graduate earnings by UK university choice. We are a scholarly community that is open, representative, and diverse: our commitment to this is expressed through work of the Departmentâ\u0080\u0099s Equality, Diversity and Inclusion Group, and our Athena Swan Bronze award.The Engineering Department demonstrates significant depth of research excellence across a range of disciplines, with activities that are currently concentrated around three Research Challenge areas (https://www.durham.ac.uk/departments/academic/engineering/research/), namely Sustainable Infrastructure, Future Energy Systems and Advanced Materials, Electronics, and Communications. We are particularly proud of the collaborative interdisciplinary nature of our research, which also includes strong industrial partnerships. This recruitment campaign strives to expand our existing Research Challenges, with Bioengineering being developed strategically to establish a new Research Challenge related to this area. Opportunities exist to make multiple appointments in one or more of the engineering specialisations included in this advert.We are particularly keen to hear from candidates who have already achieved Chartered Engineering status. As a minimum, if not already professionally qualified, candidates will be expected to demonstrate the ability and desire to become Chartered.Closing date: 6 March 2022 at Midnight (UK).", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Durham University is distinctive - a Collegiate University with ancient traditions and modern values. We seek to achieve the highest distinction in research and scholarship which make a real difference. ", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEzXC8wM1wvRHVyaGFtLVVuaXZlcnNpdHkucG5nIiwiZWRpdHMiOltdfQ=="}