{"url": "https://academicpositions.com/ad/imt-school-for-advanced-studies-lucca/2021/phd-programs-at-the-imt-school-for-advanced-studies-lucca/162755", "title": "PhD programs at the IMT School for Advanced Studies Lucca", "publish_date": "2021-08-25", "deadline": "2022-05-04", "location": "Piazza S. Ponziano, 6 Lucca, Italy", "city": "N/A", "country": "Italy", "position": "PhD", "field": "Algorithms, Applied Mathematics, Archaeology, Artificial Intelligence, Behavioural Science, and 27 moreBusiness Economics,Cognitive Psychology,Communication Engineering,Computational Engineering,Computational Mathematics,Control Systems Engineering,Cultural History,Cultural Studies,Cyber Security,Distributed Computing,Experimental Psychology,History of Art,Information Systems,Information Systems (Business Informatics),Logic,Machine Learning,Management,Museology,Neuropsychology,Philosophy of Science,Social Psychology,Socioeconomics,Statistics,Stochastics,Systems Engineering,Tourism,Tourism Economics", "salary": "N/A", "max_working_hours": "N/A", "employer": "IMT School for Advanced Studies Lucca", "job_description": "IMT School for Advanced Studies Lucca (www.imtlucca.it/en) is one of the six Schools of Excellence in Italy and one of the highest rated graduate schools in Europe according to the most recent U-Multirank survey. Highly motivated candidates from all disciplines are invited to apply for one of the fully-funded positions of the annual PhD Call that opens each year in spring. The scholarships are equally divided between the two doctoral Programs that integrate scientific competences of economics, engineering, computer science, neuroscience and behavioral psychology, physics, applied mathematics, statistics, history and sciences of cultural heritage.Each of the two PhD Programs have their own two field-specific Tracks, which partially share a common scientific background and are directly linked to the Schoolâ\u0080\u0099s four scientific and research macro-areas. Candidates can apply for one (or more) of the following Programs and Tracks:Cognitive and Cultural Systems PhD ProgramAnalysis and Management of Cultural Heritage (AMCH) TrackCognitive, Computational and Social Neurosciences (CCSN) TrackSystems Science PhD ProgramComputer Science and Systems Engineering (CSSE) TrackEconomics, Networks and Business Analytics (ENBA) TrackCourses are led by world-renowned researchers and provide students with all the theoretical skills and advanced tools required for rigorously tackling a multitude of analysis, design and management problems within the broad framework of systems analysis in economic, social, scientific, technological and cultural domains. Specialized faculty and staff create a network that provides key guidance and support throughout the PhD Program. Working closely with faculty, both in the classroom and in the development of research, students reach the highest levels of scholarly achievement. IMT School PhD graduates will be able to use the skills they acquired during their studies to recognize and resolve complex problems, to choose the most appropriate method or instrument to utilize when approaching these problems, even in disciplines outside of their primary field of research.&nbsp; During their doctoral studies, students are also encouraged to carry out their research with the Schoolâ\u0080\u0099s Research Units.All students are based in the recently restored San Francesco complex, a fully integrated Campus in the historical center of the beautiful Tuscan city of Lucca. The Campus includes renewed residential facilities, an on-site canteen, study and living rooms, a state-of-the-art library and outdoor recreational spaces, which foster a unique cultural, professional and social environment for our doctoral program. Eligible students, in addition to free room and board, will also receive a research scholarship which amounts to approximately â\u0082¬15,300/year. The scholarships are fully-funded for up to four years, with a possibility of graduating after the third year.The PhD Programs at the IMT School attracts students from around the world, providing a truly international environment. English is the official language of the School. Moreover, all students will have the opportunity to spend periods abroad at research institutes, laboratories or universities, both within the Erasmus+ framework and through ad hoc mobility agreements.Most IMT School PhD Graduates have reached prominent roles in academics, governmental institutions, public and private companies or professions across the globe.To find out more about the School, the admission requirements and how to apply, please visit the following link.Find the IMT School on Facebook, Twitter, LinkedIn and YouTube for the latest news", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "TheÂ IMT School for Advanced Studies LuccaÂ is a Public University School for Higher Education and Research with a special statute that focuses on the analysis of economic, societal, technological and cultural systems.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8wNVwvaW10LmpwZyIsImVkaXRzIjpbXX0="}