{"url": "http://www.academictransfer.com/en/309350/technical-manager-for-the-bffi-greenhouse-facility/apply/", "title": "Technical Manager for the BFFI Greenhouse facility", "publish_date": "2022-02-10", "deadline": "2022-02-20", "location": "Innovalaan 1, 5928 SX, Venlo", "city": "Venlo", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Maastricht University (UM)", "job_description": "<p>In recent years, the Faculty of Science and Engineering of Maastricht University has been growing significantly. The faculty is active in high profile projects such as the Einstein Telescope Pathfinder and topics such as circularity, artificial intelligence, robotics, sensor engineering and future farming. For the latter, Maastricht University is developing a research facility in Venlo. This research facility consists of greenhouses and indoor climate cells. In addition, molecular and engineering laboratories are being developed.</p><p>As a technical manager, you will actively contribute to the building process and you will be responsible for the operational management of the facility. During the building process, you will carry out your work in close contact with the senior project manager(s) involved and the faculty board of FSE. When the facility is operational, you will report to the management of the institute.</p><p>The developments take place on the Brightlands Campus Greenport Venlo. The infrastructure is part of the new Brightlands Future of Farming Institute. The institute focuses on research and education in the areas of healthy vegetables with optimal consumer characteristics and sustainable high tech production, specifically greenhouse technology. The facility will host researchers and students of existing and new educational programmes.</p><p>We are looking for a Technical Manager, who is:</p><ul> <li><em>Responsible for the management (cultivation, technical, organisational) of these high tech facilities. </em></li> <li><em>Responsible for an optimal crop growth management system, phytosanitary protocols, crop protection etc.</em></li> <li><em>Responsible for setting up research according to established guidelines. Who assists in drafting the research protocol together with researchers and colleagues.&nbsp; </em></li> <li><em>Responsible for the practical organisation and execution of various research projects, in close consultation with researchers, colleagues and other stakeholders.</em></li> <li><em>Acting as a point of contact for colleagues, suppliers etc.</em></li> <li><em>Acting as a point of contact and overseeing technical work carried out by (external) partners and contractors.</em></li> <li><em>The location of this full-time job is at the Brightlands Campus Greenport Venlo. Primary responsibility lies at the greenhouse facility; in addition, tasks may be expected to be executed in the adjacent laboratories. </em></li> </ul>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li><em>You have completed a BSc of MSc in a relevant field.</em></li>\n<li><em>You have experience in the operational management of a research facility, technical research environment or industrial facility.</em></li>\n<li><em>You have agricultural or horticultural practical experience.</em></li>\n<li><em>You have experience translating a research question into a concrete, feasible plan.</em></li>\n<li><em>Having research experience is an advantage (preferably plant physiological).</em></li>\n<li><em>You are result-driven, show perseverance and work accurately.</em></li>\n<li><em>You have a strong affinity with technology.</em></li>\n<li><em>You have an affinity with breeding processes and systems.</em></li>\n<li><em>You have experience in maintaining networks. </em></li>\n<li><em>You are proficient in the English and Dutch languages and you have good communication skills.</em></li>\n<li><em>You can work independently. </em></li>\n<li><em>You are flexible in your service provision and in collaboration with others.</em></li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>We offer a rewarding career at a young university in the heart of Europe, with a distinct global perspective and a strong focus on innovative research and education;</li>\n<li>The terms of employment of Maastricht University are set out in the Collective Labour Agreement of Dutch Universities (CAO), supplement with local UM provisions. For more information on terms of employment, please visit our website <a href=\"http://www.maastrichtuniversity.nl/\">www.maastrichtuniversity.nl</a> &gt; About UM &gt; <a href=\"https://www.maastrichtuniversity.nl/about-um/working-um\">Working at UM</a></li>\n<li>The salary will be set in salary scale 10 of the Collective Labour Agreement for Dutch Universities (from € 2846 to € 4490 gross per month depending on experience and qualifications, based on a full-time appointment). On top of this, there is an 8% holiday allowance and an 8.3% year-end allowance;</li>\n<li>We offer an attractive package of fringe benefits such as reduction on collective health insurance, substantial leave arrangements, an optional model for designing a personalised benefits package and an application for attractive fiscal arrangements for employees from abroad.</li>\n</ul>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Maastricht University</h4>\n<p>Located in the heart of Europe, UM is the most international university in the Netherlands with half of our student's staff coming from abroad. In total, UM has around 20.000 students and 4.700 employees and represents 100 different nationalities. The UM culture thrives due to its collaborative approach, with constant interaction between staff, students, and researchers, all working together to take on new challenges and providing an exciting and innovative state-of-the-art workplace. Our focus is to shape the future through our students and research advances. We highly value personal and professional development, and thus invest in your journey within the university through a selection of workshops, courses and development opportunities.</p>\n<p><strong>Faculty of Science and Engineering</strong><br/>\nThe Faculty of Science and Engineering (FSE) is home to several outstanding departments and institutions covering education and research in Science, Technology, Engineering and Mathematics (STEM) as well as the liberal arts and sciences.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Diversity Statement</strong><br/>\nMaastricht University is an international organization, embracing a diverse student and staff population. We strongly believe that diversity is our advantage and creating an inclusive working climate in which students and staff feel a valued member of the UM community is, therefore, a top strategic priority. UM values <a href=\"https://www.maastrichtuniversity.nl/about-um/diversity-inclusivity/your-di-vision-um\">diversity</a> within its community and encourages you to apply.  <a href=\"http://www.maastrichtuniversity.nl/\">http://www.maastrichtuniversity.nl/</a> </p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.maastrichtuniversity.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/um-en-wide/0c1dd83b22059d7ee90c38e0f0c254be.jpg"}