{"url": "http://www.academictransfer.com/en/309161/studieadviseur/", "title": "Studieadviseur", "publish_date": "2022-02-07", "deadline": "2022-02-27", "location": "Roetersstraat 11, 1018 WB, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "Other Category", "field": "Economie", "salary": "N/A", "max_working_hours": "38", "employer": "University of Amsterdam (UvA)", "job_description": "<p>Het onderwijs aan de Faculteit Economie en Bedrijfskunde (FEB) is georganiseerd in twee Schools: De Amsterdam School of Economics (ASE) en de&nbsp;Amsterdam Business School. (ABS). De&nbsp;<a href=\"http://abs.uva.nl/\">Amsterdam Business School</a><a href=\"http://abs.uva.nl/\">&nbsp;</a>biedt plaats aan academisch onderwijs en onderzoek op het gebied van business studies. Naast een aanbod van bachelor- en masterprogramma&rsquo;s heeft de ABS een uitgebreid aanbod aan executive programma&rsquo;s, gericht op mensen met praktijkervaring die zich verder willen ontwikkelen.</p><p>Het&nbsp;<a href=\"https://abs.uva.nl/programmes/executive-programmes/executive-education.html\">Instituut voor Executive Programmes</a>&nbsp;is op zoek naar een Studieadviseur voor 24 uur per week. Dit instituut is onderdeel van de faculteit en biedt deze kortlopende en Executive (master)programma&rsquo;s aan. Het merendeel is in deeltijd zodat de studenten deze opleiding naast hun werk kunnen volgen (bijvoorbeeld de Executive Master in Management Studies/Bedrijfskunde in deeltijd, de Post Master Accountancy en de master Accountancy en Control in deeltijd). Het onderwijs is niet-bekostigd.</p><p>Als studieadviseur ben je onderdeel van het ondersteunend personeel van de Executive Programmes. Je werkt in een team met twee andere studieadviseurs en overlegt met opleidingsdirecteuren, programma managers, docenten, Examencommissie en andere collega&rsquo;s.</p><p><strong>Wat ga je doen</strong></p><p>Als studieadviseur lever je een bijdrage aan een positieve studiecultuur en het bevorderen van studiesucces. Je begeleidt studenten bij de aanpak van studie, studievoortgang, planning, studievaardigheden en welzijn. Je voert &eacute;&eacute;n op &eacute;&eacute;n gesprekken met studenten, je beantwoordt vragen via e-mail en je levert een bijdrage aan introductiedagen, het opzetten en uitvoeren van projecten en workshops.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.uva.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uva-en-wide/22e1319f66e44f07d56047b996668aa9.png"}