{"url": "https://academicpositions.com/ad/european-university-institute-eui/2022/joint-chair-in-international-economic-law/174892", "title": "Joint Chair in International Economic Law", "publish_date": "2022-02-04", "deadline": "2022-03-21", "location": "Via dei Roccettini 9 Florence, Italy", "city": "N/A", "country": "Italy", "position": "Management", "field": "Commercial Law, European Law, Financial Law, International Law,", "salary": "N/A", "max_working_hours": "N/A", "employer": "European University Institute (EUI)", "job_description": "Department of LawRobert Schuman Centre for Advanced StudiesThe European University Institute is looking for candidates with a distinguished record of scholarly publications and experience in postgraduate teaching and doctoral supervision, to fill aJoint Chair in International Economic LawThe chair is a fulltime joint appointment between the Department of Law and the Robert Schuman Centre for Advanced Studies. Candidates are sought in the field of international trade (WTO) law or investment law. Candidates should be prepared to supervise doctoral researchers across a wide range of themes of European and international economic law. They should also be prepared to contribute to the research activities of the Global Governance Programme at the Robert Schuman Centre. The successful candidate is expected to commence in September 2023.The Institute is an equal opportunity employer, and is committed to balanced gender, geographical and minority representation.Interested applicants should consult&nbsp;Open competitions for academic posts â\u0080¢ European University&nbsp;Institute (eui.eu)&nbsp;for further particulars.Deadline for receipt of applications: 21 March 2022.CONTACTAcademic ServiceDr. Mathias Neukirchen, DirectorTel.: +39 055 4685 359E-mail:&nbsp;applypro@eui.euInternet:&nbsp;https://www.eui.euEuropean University InstituteVia dei Roccettini 9I-50014 San Domenico di FiesoleITALYThe aim of the European University Institute shall be to contribute, by its activities in the fields of higher education and research, to the development of the cultural and scientific heritage of Europeâ\u0080¦ This aim shall be pursued through teaching and research at the highest university levelâ\u0080¦, the Institute shall develop interdisciplinary research programmes on the major issues confronting contemporary European society, including matters relating to the construction of Europe.-Art. 2 of the Convention setting up a European University Institute", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The European University Institute (EUI) is a unique international centre for doctorate and post-doctorate studies and research, situated in the Tuscan hills overlooking Florence.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyOWZcL2VjN1wvMjlmZWM3YTM0OTVlYzAzMjZkYzFjMDhmNmFlN2YwZWUucG5nIiwiZWRpdHMiOltdfQ=="}