{"url": "https://academicpositions.com/ad/ecmwf/2022/scientist-uncertainty-quantification-for-destination-earth-using-statistical-post-processing-methods/173856", "title": "Scientist: uncertainty quantification for Destination Earth using statistical post-processing methods", "publish_date": "2022-01-12", "deadline": "2022-02-15", "location": "Robert-Schuman-Platz 3 Bonn, Germany", "city": "N/A", "country": "Germany", "position": "Researcher", "field": "Data Structures, Geoinformatics (GIS), Geostatistics, Information Science, Machine Learning, and 2 moreRemote Sensing,Statistics", "salary": "N/A", "max_working_hours": "N/A", "employer": "ECMWF", "job_description": "Job reference: VN22-02Location: Bonn, GermanyDeadline for applications: 15/02/2022Publication date: 11/01/2022Salary and Grade: Grade A2: EUR 78,035.40 basic salary, net of tax + other benefitsContract type: STF-PSDepartment: ForecastContract Duration: Two yearsAbout ECMWFECMWF is the European Centre for Medium-Range Weather Forecasts. It is an intergovernmental organisation created in 1975 by a group of European nations and is today supported by 34 Member and Co-operating States, mostly in Europe. The Centreâ\u0080\u0099s mission is to serve and support its Member and Co-operating States and the wider community by developing and providing world-leading global numerical weather prediction. ECMWF functions as a 24/7 research and operational centre with a focus on medium and long-range predictions and holds one of the largest meteorological archives in the world. The success of its activities relies primarily on the talent of its scientists, strong partnerships with its Member and Co-operating States and the international community, some of the most powerful supercomputers in the world, and the use of innovative technologies such as machine learning across its operations.&nbsp;Over the years, ECMWF has also developed a strong partnership with the European Union, and for the past seven years has been an entrusted entity for the implementation and operation of the Climate Change and the Atmosphere Monitoring Services of the EU Copernicus Programme, as well as a contributor to the Copernicus Emergency Management Service. The collaboration does not stop there and includes&nbsp;other areas of work, including High Performance Computing and the development of digital tools that enable ECMWF to extend its provision of data and products covering weather, climate, air&nbsp;quality, fire and flood prediction and monitoring.ECMWF has recently become a multi-site organisation, with its headquarters based since its creation in Reading, UK, its new data centre in Bologna, Italy, and new offices in Bonn, Germany.For details, see www.ecmwf.intAbout DestinEECMWF will be a major partner in the implementation of the Destination Earth (DestinE) initiative, together with ESA and EUMETSAT as partners. The objective of the European Commission DestinE initiative is to deploy several highly accurate thematic digital replicas of the Earth, called Digital Twins.&nbsp; The Digital Twins will help monitor and predict environmental change and human impact, in order to develop and test scenarios that would support sustainable development and corresponding European policies for the Green Deal.&nbsp;DestinE will thus contribute to revolutionising the European capability to monitor and predict our changing planet, complementing existing national and European efforts such as those provided by the national meteorological services and the Copernicus Services. It will be run in several phases, of which the first, the implementation phase, covers the period end-2021 â\u0080\u0093 mid-2024. Future phases are foreseen (subject to funding) that will operationalise the digital twins, scale-up system production and add applications and new twin options.&nbsp;DestinE covers several demanding digital technology aspects required to develop, implement and operate the two high-priority digital twins on weather induced and geophysical extremes and on climate change adaptation. ECMWF will be responsible for the delivery of these Digital Twins, which will rely on complex Earth-system simulation models, data assimilation methods for fusing simulations and observations through inverse modelling and the integration of observations and models from sectors such as water and food management, renewable energies and socio-economic risk and disaster management.&nbsp;These science components require advanced digital technology solutions to maximize the efficient computing and data handling on extreme-scale infrastructures, and to adapt and operate these infrastructures across different heterogeneous architectures within a federated framework. This federated framework includes the Core Platform and Data Lake developed, deployed and operated by ESA and EUMETSAT respectively.&nbsp;The DestinE developments take forward the long-term investments of the ECMWF Member States in building a unique European prediction capability and will support the further advancement of member states services and Copernicus Services.For more information on DestinE, see https://ec.europa.eu/digital-single-market/en/destination-earth-destine and https://www.ecmwf.int/en/about/what-we-do/environmental-services/destination-earthSummary of the roleECMWF has an exciting opportunity for a Scientist to help shape and deliver DestinE developments in collaboration with partners throughout Europe, by making use of machine learning techniques and statistical methods. It is expected that machine learning and statistical methods will play an important role in DestinE, supporting efforts to increase computational and data handling efficiency, to augment the quality of the Digital Twins through fusion of data from different sources and to rigorously handle quality and confidence information.The successful candidate will apply powerful data analytics techniques based on machine learning and statistical methods to support the uncertainty quantification for the Digital Twin for weather induced extremes. This Digital Twin will rely on high-resolution (km-scale) medium-range simulations produced with ECMWF Integrated Forecasting System (IFS) to drive much enhanced weather-induced extremes predictions. Uncertainty quantification is essential for assessing the confidence of these simulations. Ensemble predictions provide information on confidence and are key for decision making, because they quantify the probability of possible outcomes given the uncertainty in observations and models. Particularly in cases where (large) ensembles are not affordable, which is the case for the resolutions and data volumes envisaged in DestinE, machine learning and novel statistical methods offer new levels of complex data analysis to enhance the representation of uncertainty and complement ensemble methods. Before the data from the weather-induced extremes Digital Twin becomes available, the successful candidate would test the added value of such an approach by applying machine learning and statistical methods to blend low-resolution ensemble forecasts with a high-resolution forecast and estimate how this can support uncertainty quantification.The candidate will join an existing group at ECMWF working on applying machine learning and statistics techniques to improve various aspects of the ECMWF operational workflows, and will make the link between these efforts and similar efforts in DestinE.The successful candidate will also support the interactions with ECMWFâ\u0080\u0099s DestinE partners ESA and EUMETSAT on the use of machine learning and statistics techniques, interact with external contractors as required and help with communications and outreach activities with dedicated partners of the consortia contributing to the DestinE implementation, stakeholders and the user communities. They will also contribute to regular progress reports to the European Commission.Whilst the position will be based in Bonn, Germany, there will be strong collaboration with staff based at the ECMWF HQ in Reading, in the UK so it is anticipated that visits to the HQ in Reading will be required.Main duties and key responsibilitiesApplying machine learning and statistical ensemble postprocessing techniques to support uncertainty quantification for the weather-induced extremes Digital TwinUsing a low-resolution ensemble as a benchmark, before the data from the weather-induced Digital Twin becomes available, for developing the machine learning and statistics based workflows and tools to blend a high-resolution forecast with low-resolution ensembles in support of uncertainty quantificationSupporting the integration of machine learning tasks within DestinE at ECMWF, and interact with efforts on machine learning and statistical methods at ESA and EUMETSATContributing to the development and testing of complex workflows in advanced digital technology environments on some of the largest computing and data handling infrastructures in EuropeContributing to regular progress reports to the European CommissionPersonal attributesExcellent analytical and problem-solving skills with a proactive continuous improvement approachAbility to effectively and creatively collect, analyse, organize, distil and present information.Initiative and ability to work collaboratively with other ECMWF staff and DestinE partners, but also ability to work independentlyGood interpersonal and communication skillsDedication, passion, and enthusiasm to succeed both individually and across teams of developersHighly organised with the capacity to work on a diverse range of tasks to tight deadlines and in a matrix management environmentEducation, experience, knowledge and skills (including language)An advanced university degree (EQF Level 7 or above) or equivalent experience is requiredDemonstrable experience in the use of machine learning and statistical methods in applications within Earth system scienceExperience with post-processing and the calibration of ensemble forecasts would be an advantageExperience with developing and maintaining large scientific codes in a team would be an advantageCandidates must be able to work effectively in English and interviews will be conducted in EnglishA good knowledge of one of the Centreâ\u0080\u0099s other working languages (French or German) would be an advantageOther informationGrade remunerationThe successful candidate will be recruited at the A2 grade, according to the scales of the Co-ordinated Organisations and the annual basic salary will be EUR 78,035.40 net of tax. ECMWF also offers a generous benefits package, including a flexible teleworking policy. The position is assigned to the employment category STF-PS as defined in the ECMWF Staff Regulations. Full details of salary scales and allowances available on the ECMWF website at www.ecmwf.int/en/about/jobs, including the ECMWF Staff Regulations and the terms and conditions of employment.Starting date: As soon as possibleLength of contract: The contract duration is expected to be two years. The DestinE Contribution Agreement is likely to be divided in phases, the first of which will last approximately two years. There may be the possibility of further contract extensions in the future depending on requirements and funding availability.Location: The position will be located at ECMWFâ\u0080\u0099s duty station in Bonn, Germany.As a multi-site organisation, ECMWF has adopted a hybrid organisation model which allows flexibility to staff to mix office working and teleworking.Interviews by&nbsp;videoconference (via Teams) are expected to take place in early March 2022.Who can applyApplicants are invited to complete the online application form by clicking on the apply button.At ECMWF, we consider an inclusive environment as key for our success. We are dedicated to ensuring a workplace that embraces diversity and provides equal opportunities for all, without distinction as to race, gender, age, marital status, social status, disability, sexual orientation, religion, personality, ethnicity and culture. We value the benefits derived from a diverse workforce and are committed to having staff that reflect the diversity of the countries that are part of our community, in an environment that nurtures equality and inclusion.Applications are invited from nationals from ECMWF Member States and Co-operating States, as well as from all EU Member States:ECMWF Member and Co-operating States are: Austria, Belgium, Bulgaria, Croatia, Czech Republic, Denmark, Estonia, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Ireland, Israel, Italy, Latvia, Lithuania, Luxembourg, Montenegro, Morocco, the Netherlands, Norway, North Macedonia, Portugal, Romania, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey and the United Kingdom.Applications from nationals from other countries may be considered in exceptional cases.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The European Centre for Medium-Range Weather Forecasts (ECMWF) is an independent intergovernmental organisation supported by 34 states.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE0XC8xMFwvRUNNV0YtTG9nby5wbmciLCJlZGl0cyI6W119"}