{"url": "https://academicpositions.com/ad/university-of-gothenburg/2022/phd-student-positions-in-mathematics/174098", "title": "PhD student positions in mathematics", "publish_date": "2022-01-17", "deadline": "2022-02-25", "location": "Vasagatan 33 Gothenburg, Sweden", "city": "N/A", "country": "Sweden", "position": "PhD", "field": "Analysis, Applied Mathematics, Mathematical Physics, Probability Theory,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Gothenburg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>The University of Gothenburg tackles societyâ\u0080\u0099s challenges with diverse knowledge. 53 500 students and 6 500 employees make the university a large and inspiring place to work and study. Strong research and attractive study programmes attract scientists and students from around the world. With new knowledge and new perspectives, the University contributes to a better future.</p><p>The Department of Mathematical Sciences at the Chalmers University of Technology and the University of Gothenburg has about 200 employees and is the largest department of mathematics in Sweden. We are an international environment with frequent exchanges with other universities around the world. We provide a supportive and creative atmosphere with a steady flow of international guests. Equality and diversity are substantial foundations in all our activities. We work actively to be a parent-friendly organization.</p><p><a href=\"http://www.chalmers.se/en/departments/math/\" target=\"_blank\"><u>http://www.chalmers.se/en/departments/math/</u></a></p><h2>Job assignments</h2><p>As a PhD student you will be part of an international research environment while you expand your knowledge of the field and write your thesis. This gives opportunities for many inspiring conversations, a lot of autonomous work and some travel. You are expected to develop your own ideas and communicate scientific results orally as well as in written form. In addition, the position will normally include 20% departmental work, mostly teaching duties.</p><p>The employment is limited to a maximum of four years, with the possibility for one year extension due to departmental duties. </p><h2>Subject area</h2><p>Mathematics</p><h2>Specific subject description</h2><p>Any research field present at the division Analysis and Probability Theory.</p><h2>Eligibility</h2><p>The eligibility for academic positions is given in the Swedish Higher Education Ordinance. To qualify for the position, you must have obtained a master's degree or a 4-year bachelor's degree, or expect to complete that degree by the time the employment starts.</p><h2>Assessment</h2><p>Regulations for the evaluation of qualifications for academic positions are given in the Swedish Higher Education Ordinance.</p><p>Applicants should have a strong background in mathematics, with excellent course grades and undergraduate thesis work. Good verbal and written communication skills in English are essential.</p><p>The applications will be assessed by a local recruitment committee at Mathematical Sciences.</p><h2>Employment</h2><p>Type of employment: Up to three PhD student positions, fixed-term employment, limited to four years with the possibility of one year extension.</p><p>Extent: 100 %</p><p>Location: Analysis and Probability Theory, Department of Mathematical Sciences, University of Gothenburg</p><p>First day of employment: August 15, 2022 or as agreed</p><p>Reference number: PAR 2022/57</p><p>We are looking for up to three PhD students at the division Analysis and Probability Theory. The research project can be in any area represented at the division, including harmonic and functional analysis, mathematical physics, partial differential equations and probability theory.</p><h2>Application procedure</h2><p>Submit the following documents:</p><ul><li>Personal letter, stating your motivation for applying and any specific research interests</li><li>CV</li><li>Theses and other scientific publication (include an English summary if necessary)</li><li>Diplomas, grade transcripts and other certificates</li><li>Contact information for two reference persons (name, phone number, email address, relation).</li></ul><h3>For further information regarding the position</h3><p>Johan Tykesson, director of PhD studies in mathematics, <a href=\"mailto:johant@chalmers.se\"><u>johant@chalmers.se</u></a></p><p>Hjalmar Rosengren, head of unit, <a href=\"mailto:hjalmar@chalmers.se\"><u>hjalmar@chalmers.se</u></a></p><h2>Unions</h2><p>Union representatives at the University of Gothenburg:<br/><a href=\"https://www.gu.se/en/about-the-university/work-at-the-university-of-gothenburg/how-to-apply\" target=\"_blank\"><u>https://www.gu.se/en/about-the-university/work-at-the-university-of-gothenburg/how-to-apply</u></a></p><h2>Information for International Applicants</h2><p>Choosing a career in a foreign country is a big step. Thus, to give you a general idea of what we and Gothenburg have to offer in terms of benefits and life in general for you and your family/spouse/partner please visit:</p><p><a href=\"https://www.gu.se/en/about-the-university/welcome-services\" target=\"_blank\"><u>https://www.gu.se/en/about-the-university/welcome-services</u></a></p><p><a href=\"https://www.movetogothenburg.com/\" target=\"_blank\"><u>https://www.movetogothenburg.com/</u></a></p><h2>How to apply</h2><p>In order to apply for a position at the University of Gothenburg, you have to register an account in our online recruitment system. It is the responsibility of the applicant to ensure that the application is complete in accordance with the instructions in the job advertisement, and that it is submitted before the deadline. The selection of candidates is made on the basis of the qualifications registered in the application.</p><p><strong>Closing date:</strong> February 25, 2022</p><p><i>The University of Gothenburg promotes equal opportunities, equality and diversity.</i></p><p><i>Applications will be destroyed or returned (upon request) two years after the decision of employment has become final. Applications from the employed and from those who appeal the decision will not be returned.</i></p><p>In connection to this recruitment, we have already decided which recruitment channels we should use. We therefore decline further contact with vendors, recruitment and staffing companies.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8wNFwvR290aGVuYnVyZ0xvZ28ucG5nIiwiZWRpdHMiOltdfQ=="}