{"url": "https://academicpositions.com/ad/ku-leuven/2022/phd-research-position-on-education-economics-the-impact-of-covid-19-on-education-outcomes/175178", "title": "PhD Research Position on Education Economics â\u0080\u0093 the Impact of COVID-19 on Education Outcomes", "publish_date": "2022-02-11", "deadline": "2022-03-15", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Behavioural Economics, Econometrics, Health Economics, Public Economics, Statistics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-87)LEER is a research and education center of the Faculty of Economics and Business of the KU Leuven. We aim for independent state-of-the-art academic research on public economics issues with economic tools (see www.feb.kuleuven.be/leer).Website unitProjectSince the spring of 2020, the world experienced the largest disruption of education in history which affected 94% of the worldâ\u0080\u0099s student population. Due to the restrictions owing to COVID-19, schools in more than 190 countries had to close for several months in order to prevent the spread of COVID-19. Although the school lockdown was initially widely accepted as a necessary measure to deal with the rising pandemic, many researchers, teachers, parents and policy-makers voiced concern about the lost progress for students and resulting educational inequality. A common critique is that policy-makers are well-informed about the benefits of school closures, by a vast amount of research modelling the spread of the pandemic, while information about the costs of school closures is lacking. This research proposal fills this void by estimating the short and long run impact of the COVID-19 crisis and its school closures.As the emerging evidence on the short run effects of the COVID-19 school closures suggests a strong and heterogenous impact on studentsâ\u0080\u0099 performance (Maldonado &amp; De Witte, 2021; Gambi &amp; De Witte, 2022), as a PhD researcher you will examine the long run impact of the school closures as well as the impact of governing structures and initiatives that potentially mitigate the learning losses. As such, the overall objective of the PhD research is threefold: (I) It contributes to the wider economics of education literature by exploiting the unique natural experiment of the COVID-19 school closures to measure how schooling and instruction time impacts human capital formation. (II) It informs the policy debate on educational reform by examining the determinants and evolution of the learning losses. (III) It provides evidence on the impact of methods (rooted in behavioural economics) to mitigate learning losses.&nbsp;&nbsp;During the four year PhD study, the PhD researcher writes at least four papers which will be submitted to peer-reviewed journals.&nbsp;ProfileThe Research Center â\u0080\u0098Leuven Economics of Education Researchâ\u0080\u0099 (Faculty of Economics and Business - KU Leuven) is looking for an enthusiastic and motivated junior scholar to conduct a PhD in economics. The candidate should have the following qualifications:&nbsp;You have successfully completed a research master in economics or in a closely related field (e.g. finance, econometrics,â\u0080¦) by September 2022.Having at least â\u0080\u0098cum laudeâ\u0080\u0099 during master years.You have (starter) skills in statistical, econometric and quantitative data analysis and experience with statistical packages; and are keen on developing these skills further.You have a keen interest in scientific research on education economics.Enthusiastic and motivated to do research.Speaking and writing Dutch at C1 level is a strong asset.You are proficient in English, and you have very good scientific writing skills.You are a team player who is able to work independently.Successful candidates are required to enter the PhD program in economics of the Faculty of Economics and Business of KU Leuven (see http://feb.kuleuven.be/phd-economics).OfferOur internationally renowned doctoral program in economics is an individualized PhD training that usually consists of four years of full-time study. It eventually leads to a PhD degree and prepares the student for an academic career or a career as a researcher in a policy institution.The candidate is expected to prepare a PhD at the LEER research group under the supervision of Professor Kristof De Witte. You will join a dynamic and internationally oriented research environment that focusses on education economics and political economics.We offer a competitive full-time PhD scholarship of about â\u0082¬2,050 per month (net of taxes). The position is for 4 years, conditional upon a positive evaluation after 1 year.We offer additional benefits in terms of health insurance, reduced public transport prices, free bicycle use, access to university sports facilities, â\u0080¦KU Leuven offers opportunities to follow academic, skills and career training courses.You are expected to participate in seminars and will occasionally be involved in teaching activities including supervision of exams.Start date â\u0080\u0093 The academic year starts on September 26, 2022, but there is some flexibility to start at a different moment in time.Once the PhD study is completed, you receive a PhD in Economics.Interested?To apply for the position, please prepare the following documents:â\u0080¢&nbsp; &nbsp; A curriculum vitaeâ\u0080¢&nbsp; &nbsp; An overview of your study results (certified copies of diplomas and transcripts).â\u0080¢&nbsp; &nbsp; A letter of motivation (max. 500 words): all applicants must provide a letter of motivation.For more information please contact Prof. Dr. Kristof De Witte - www.feb.kuleuven.be/kristof.dewitte -&nbsp; email: kristof.dewitte@kuleuven.be. Also see www.feb.kuleuven.be/leer.&nbsp;You can apply for this job no later than March 15, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}