{"url": "https://academicpositions.com/ad/imec/2022/senior-analog-rf-mmwave-ic-designer/175170", "title": "Senior analog, RF & mmWave IC Designer", "publish_date": "2022-02-11", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Communication Engineering, Electronics, Engineering Physics, Signal Processing, Solid-state Physics, and 1 moreSystems Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><i>Research and design innovative analog, mixed signal, RF and millimeter wave circuits</i></p><h2>What you will do</h2><p>The Imec ARF group in Leuven enjoys a world-class reputation in advanced communication and radar and millimeter wave sensing systems. In these fields, the group has a vertical system approach: our expertise ranges from antenna, frontend, baseband, analog-to-digital conversion to algorithms and systems. The group also combines innovative communication and sensing technologies that unleash the full potential of future smart cities, smart health and internet of things (IoT). Furthermore, research is also done in the fields of advanced wireline communication, future RF technologies, mmwave sensing for lifesciences, mmwave imaging, â\u0080¦ </p><p>Specifically for IC design, the group is led by Piet Wambacq and Jan Craninckx, and has an established state-of-the-art research reputation that has been confirmed over the years by our extensive presence in top conferences in solid-state circuit design, such as ISSCC, RFIC, ESSCIRC, VLSI and CICC.</p><p>As an independent research center, we collaborate closely with top players in both industry and academia, giving our people a continuous exposure to both the latest evolutions in industrial challenges and approaches, as well as into the newest emerging academic ideas and paradigms.</p><p>In this job, your key responsibilities will be:</p><ul><li>Research and design innovative analog, mixed signal, RF and millimeter wave circuits, both in CMOS and III-V technologies</li><li>Drive the bottom-up evolution of analog, mixed signal, RF and millimeter wave designs taking technology scaling into account.</li><li>Together with the team, bring new ideas, new technical methods based on your solid technical experience.</li><li>Take part in the interaction with external partners and towards new prospect, as part of the technical support.</li><li>Publish your state-of-the-art research results in international conferences or journals.</li></ul><h2>What we do for you</h2><p>We offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will determine the society of tomorrow.</p><p>We are <a href=\"http://www.imec-int.com/en/careers#diversity\" target=\"_blank\">committed to being an inclusive employer</a> and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth. </p><p>We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a market appropriate salary with many fringe benefits. </p><h2>Who you are</h2><p>We are looking for an experienced analog, RF and millimeter wave IC design researcher who can participate actively in the innovation and design of advanced analog and mmwave front-ends.</p><ul><li>You have a PhD degree in the domain of analog, mixed signal, RF or millimeter wave IC design or equivalent through experience.</li><li>You have at least 5 years of design experience and you have designed in CMOS technology (40nm, 28nm, 20nm FDSOI, 16nmFF).</li><li>You have experience with RF or millimeter wave design in III-V technologies (GaAs, GaN, InP)</li><li>You are familiar with the implementation of wireless communication/radar/sensing systems and circuits.</li><li>Experience in integrated millimeter wave design, especially above 100GHz, is a strong plus.</li><li>Experience in an industrial context is a strong plus.</li><li>You have solid understanding from solid-state devices, analog/RF circuits, up to transceiver architectures.</li><li>You can work on your own yet in close collaboration with experts from other technical fields.</li><li>You have excellent reporting skills and are able to present technical results and choices clearly and concisely.</li><li>You can easily integrate in an international team.</li><li>Since you will be working in a highly international environment and will be maintaining a good contact with colleagues and co-workers from all over the world, fluency in English is essential.</li></ul>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}