{"url": "https://academicpositions.com/ad/lut-university/2022/associate-professor-non-tenure-track-in-hydrocarbon-syntheses/173366", "title": "Associate professor (non-tenure track) in hydrocarbon syntheses", "publish_date": "2022-02-07", "deadline": "2022-02-18", "location": "Yliopistonkatu 34 Lappeenranta, Finland", "city": "N/A", "country": "Finland", "position": "Associate Professor", "field": "Analytical Chemistry, Atmospheric Chemistry, Biochemistry, Catalysis, Chemical Biology, and 30 moreChemical Engineering,Chemical Thermodynamics,Chemo-informatics,Computational Chemistry,Electrochemistry,Environmental Chemistry,Immunochemistry,Inorganic Chemistry,Materials Chemistry,Mathematical Chemistry,Medicinal Chemistry,Molecular Chemistry,Nanobiochemistry,Nanochemistry,Nanotechnology,Nuclear Chemistry,Organic Chemistry,Organometallic Chemistry,Petrochemistry,Photochemistry,Physical Chemistry,Phytochemistry,Polymer Chemistry,Radiochemistry,Solid-state Chemistry,Spectroscopy,Surface Chemistry,Synthetic Chemistry,Theoretical Chemistry,Thermochemistry", "salary": "N/A", "max_working_hours": "N/A", "employer": "LUT University", "job_description": "LUT University is looking for an associate professor (non-tenure track) in hydrocarbon syntheses. The position is hosted by the Department of Separation Science of the LUT School of Engineering Science (LENS). The position is located at the universityâ\u0080\u0099s Lappeenranta campus, and staff are expected to be mobile between the universityâ\u0080\u0099s other locations, Lahti and Mikkeli, when necessary.&nbsp;The Department of Separation Science is nationally and internationally recognized for its expertise in separation science and for the largest and most diverse research clusters in water treatment and separation technologies in Finland. Our professors and senior researchers are world-class experts in areas such as membrane separation, solid-liquid separation, ion exchange, separation process design and electrochemistry, covering application areas in mineral processing and urban mining, biorefining and wastewater treatment.Applicants to this position are required to have a doctoral degree in a field relevant to the position, such as D.Sc. or Ph.D. in chemical engineering or chemistry. Applicants are expected to demonstrate a high level of academic competence in hydrocarbon syntheses, especially in synthesis development, reaction modelling, and process simulation related to power-to-x processes.In addition, the regulations of LUT University require that an associate professor (non-tenure track) has the pedagogical competences and teaching skills necessary for the position, proof of high-level research work and publications, and the ability to lead a research group and raise research funding.&nbsp;The work involves conducting independent research and publishing on it in high-quality journals and attracting external competitive funding as a principal investigator. The supervision of Bachelorâ\u0080\u0099s, Masterâ\u0080\u0099s and doctoral theses is a requirement, and thus, a docentship is considered an asset. With external funding, the associate professor (non-tenure track) is expected to develop and supervise an independent research group. The selected candidate is expected to be highly motivated to carry out research in hydrocarbon syntheses supporting power-to-x, to propose new, creative research ideas boldly and to be able to work with experts in multiple fields both nationally and abroad. Fluency in English is needed in the position. Finnish skills are considered an asset.The department collaborates closely with the LUT School of Energy Systems, and this collaboration is key also for the associate professor (non-tenure track). LUT also values industry collaboration, and the associate professor is expected to be open to developing a strong industry network. Experience in and/or knowledge of process scale-up and techno-economics are considered an advantage. The duties also include basic and advanced education in key areas of chemical engineering â\u0080\u0093 the exact educational responsibilities will be agreed on with the head of the Degree Programme in Chemical Engineering. Bachelorâ\u0080\u0099s level education is arranged mainly in Finnish and Masterâ\u0080\u0099s level education in English.The employment relationship is fixed-term for four years with a six-month trial period. If the work progresses as expected, the position can be made permanent through an external review process. The review will be initiated four to six months prior to the end of the fixed-term employment.&nbsp;The salary is determined according to the salary system for university teaching and research personnel. The typical gross starting salary for an associate professor (non-tenure track) is approximately 53700â\u0080\u009361900 euros a year (plus a holiday bonus in accordance with the collective agreement) depending on the qualifications and experience of the candidate.The deadline for applications is 18 February 2022&nbsp; Finnish local time (UTC +2 h). Please send your application through the university's online application system with the following attachments:&nbsp;a motivation lettera curriculum vitaea copy of your doctoral diploma; if the original document is not in English, Finnish or Swedish, it must be accompanied by an official certified translation into English or Finnisha full list of publications, including the total number of publications in the Web of Science and Scopus databases, the total number of citations, the h-index and Scopus ID.For further information, please contact Professor Tuomas Koiranen, e-mail tuomas.koiranen@lut.fi (during the application period) or phone +358 50 435 7414 on 4 or 10 January 2022, 10:00â\u0080\u009311:00 &nbsp;(UTC +2 h).&nbsp;Join our team of trailblazers. Clean energy, water and air are life-giving resources for which we at LUT University seek new solutions with our expertise in technology and business. We help society and businesses in their sustainable renewal. Our international community consists of 6500 members. Our modern campuses are in Lappeenranta and Lahti. Video of our strategy:&nbsp;https://youtu.be/PpFawdT8CDE&nbsp;Technical support for using the recruitment system: recruitment@lut.fi", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "LUT University has been a pioneering scientific university, bringing together the fields of science and business since 1969.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDExXC8xMFwvTFVULUxvZ28xLnBuZyIsImVkaXRzIjpbXX0="}