{"url": "http://www.academictransfer.com/en/309063/research-technician-microfabrication-of-photonic-ics/apply/", "title": "Research Technician: Microfabrication of Photonic ICs", "publish_date": "2022-02-03", "deadline": "2022-03-03", "location": "De Rondom 70, 5612 AP, Eindhoven", "city": "Eindhoven", "country": "Netherlands", "position": "Engineer/Technician", "field": "Engineering", "salary": "N/A", "max_working_hours": "38", "employer": "Eindhoven University of Technology (TU/e)", "job_description": "Photonics is regarded as a key enabling technology by the European Commission and its application in many scientific and industrial fields is accelerated through <a href=\"https://www.youtube.com/watch?v=nZKw4BZC5LI&amp;ab_channel=TUEindhoven\">Photonic Integrated Circuits</a> (PICs). The photonic integration research group (PhI) at TU/e has pioneered the concept of generic photonic integration platforms and continues to engage in research and development activities to extend the capabilities of such platforms, which are based on the InP material system. It coordinates JePPIX, the Joint European Platform for Photonic Integration of Components and Circuits, and works together with Europe's main players in the photonic integration industry to provide access to this technology.<br><br>Within the European H2020 PICaboo project (video <a href=\"https://www.youtube.com/watch?v=H9iSN5e8wlg&amp;ab_channel=PICabooProject\">here</a>, <a href=\"https://ict-picaboo.eu/\">https://ict-picaboo.eu/</a>) we aim to extend the InP platform capabilities with several novel building blocks. The PICaboo project will develop these building blocks to be compatible with the generic foundry model, and use them in application-specific photonic integrated circuits that will transform optical communication networks in terms of key performance parameters like speed, power consumption and cost.<br><br><strong>Your research challenge</strong><br><br>We are looking for a candidate who works together with a team of researchers to devise, test and implement novel microfabrication methods and processes to create the required building blocks for the project. The candidate will integrate these processes into existing integration flows and perform wafer-scale realization of photonic integrated circuits in the university's cleanroom. The focus here lies on improving reliability of processes. The candidate should build up competences for microfabrication and interact with many other ongoing research projects of photonic integration.<br><br><strong>Your responsibilities</strong><br><br>You are expected to:<ul> <li>Carry out processing related work within the PICaboo research project;</li> <li>Contribute to designing new process flows and process modules for research projects;</li> <li>Consolidate novel process modules into existing process flows;</li> <li>Fabricate photonic ICs in a cleanroom environment according to consolidated process flows;</li> <li>work and communicate efficiently in a team environment;</li> <li>proactively contribute with your own ideas and solutions;</li> <li>document and report your work for others.</li> </ul> <br><strong>You are part of a team</strong><br><br>As a research technician you are closely working together with three other young researchers and two scientific staff members in the PICaboo project to tackle the project's challenges. Intense collaboration with European partners in the project is expected as well. In addition, you are stationed within the Photonic Integration (PhI) group which hosts experts and pioneers of PIC technology, so you can interact with the members and continuously learn more about this exciting technology. The research group is made up of many international colleagues who all constitute to a vibrant, young and dynamic research community. Furthermore, you will acquire hands-on know-how in microfabrication from expert technicians of NANOLAB@TU/E, the university's own cleanroom, and be able to build your own expertise.<br><br><strong>Your work environment</strong><br><br>The Eindhoven University of Technology, one of Europe's top technological universities, is in the heart of one of the largest high­tech innovation ecosystems. At the TU/e we have one of the world's best equipped cleanroom laboratories for research and development of photonic integrated circuits. Our activities are characterized by a combination of academic excellence and a strong real­world impact. To maintain this, we have close collaborations within the PhotonDelta ecosystem and with other external high-tech industries. You can benefit from this unique ecosystem, build up a strong academic and industrial network and grow your photonics profile.<br><br>The department of electrical engineering holds multiple capacity groups that relate to photonic integration technology and offers many possibilities for exploration of novel ideas and the initiation of new collaborations. In addition, the newly established <a href=\"https://www.tue.nl/en/research/institutes/eindhoven-hendrik-casimir-institute/\">Eindhoven Hendrik Casimir Institute</a> (EHCI) connects all photonic researchers and actively promotes interdisciplinary thinking, providing an ideal environment for you to foster creativity and explore your novel ideas.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<strong>Job requirements</strong><br/><br/>We are looking for candidates who have a background in either electrical engineering, microelectronics, semiconductors, nanotechnology, photonics, nano- or microfabrication. Regarding the education level, we are flexible to interview candidates with HBO or MSc, as long as the candidate shows an appropriate background and relevant expertise. You should have a strong affinity with hands-on experimental work and a systematic approach to problem solving. Experience with cleanroom work is highly desired but not required and Chemistry knowledge is of advantage. You should also have an inquisitive character and be prepared to expand your knowledge. Good command of the English language is required.\n  </div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<strong>What we offer</strong><ul>\n<li>A challenging job within a dynamic setting, where you can develop further your technical and professional skills. We offer a unique mix between academic and industrial environment due to our close collaboration with research groups and industrial partners. During the job, you will be able to skill up on microfabrication techniques and methods which is highly in demand in the photonics industry both situated in the Eindhoven area but also Europe wide. Industrial partners such as Smart Photonics or the Photonic Integration Technology Centre (PITC) are among many that might be interested in these skills. You will join a team of young and open-minded experts that have the aim of extending photonic integrated circuits technology to solve current problems.</li>\n<li>A fixed-term position to start as soon as possible and lasting until the end of the PICaboo project (Dec 2023). After this, possibilities for extension will be evaluated.</li>\n<li>Salary and benefits are in accordance with the Collective Labour Agreement for Dutch Universities.</li>\n<li>Additionally, 8% holiday and 8.3% end-of-year annual supplements;</li>\n<li>Additional benefits, including excellent technical infrastructure, childcare, holiday savings schemes, and sports facilities;</li>\n<li>Assistance for finding accommodation can be offered for foreigners;</li>\n<li>Support to the employees with diverse courses for professional development.</li>\n</ul>\n</div>\n</div>", "employer_description": "N/A", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about the project please contact dr. Weiming Yao (w.yao[at]tue.nl) or dr. Jos v.d. Tol (j.j.g.m.v.d.tol[at]tue.nl)<br/><br/>For information about terms of employment, click <a href=\"https://www.tue.nl/en/working-at-tue/why-tue/conditions-of-employment/\">here</a> or contact the HR advisor Floortje de Groot (f.r.d.groot[at]tue.nl).<br/><br/>We invite you to submit a complete application by using the 'apply now'-button on this page.<br/>The application should include a:<ul>\n<li>Cover letter in which you describe your motivation and qualifications for the position;</li>\n<li>Curriculum vitae.</li>\n</ul>\n<br/>We look forward to your application and will screen it as soon as we have received it. Screening will continue until the position has been filled.<br/><br/>We do not respond to applications that are sent to us in a different way.<br/><br/>Please keep in mind you can upload only 5 documents up to 2 MB each. If necessary, please combine files.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tue.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tue-en-wide_acOLN2b/6da05d7a14fc4cf4bb403c37bf055371.png"}