{"url": "http://www.academictransfer.com/en/309166/secretaris-examencommissie-06-fte-ieis/apply/", "title": "Secretaris Examencommissie 0,6 Fte IE&IS", "publish_date": "2022-02-07", "deadline": "2022-03-20", "location": "De Rondom 70, 5612 AP, Eindhoven", "city": "Eindhoven", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "22.8", "employer": "Eindhoven University of Technology (TU/e)", "job_description": "<em>Word jij enthousiast van een baan waar je in contact staat met studenten, veel zelfstandigheid krijgt en processen gaat optimaliseren? Ben jij accuraat, zorgvuldig en kun je goed luisteren terwijl je snel essentiële informatie filtert? Dan ben jij onze secretaris die het team Studievoortgang komt versterken. Deze positie is onderdeel van de dienst Education and Student Affairs (ESA) en is het centrale servicepunt voor docenten en (aankomende) studenten van de Technische Universiteit Eindhoven.</em><br><br>Als Secretaris van een examencommissie ga je aan de slag met het inrichten, archiveren en beheren van het secretariaat. Het betreft een brede functie waarbij je ruimte krijgt om jezelf verder te ontwikkelen. We vinden het erg belangrijk dat onze secretaris zelfstandig aan de slag durft te gaan, waarbij je dan ook het mandaat krijgt om deze zelfstandigheid uit te kunnen voeren. Je bent dan ook in staat om besluiten van de examencommissie voor te bereiden, rekening houdend met juridische, uitvoeringstechnische en menselijke aspecten. Ervaring in het geven van juridisch advies gaat je dan ook helpen om deze functie goed uit te oefenen. Als secretaris heb je veelvuldig contact met studenten, jij verwerkt de verzoeken die zij indienen. Daarnaast spreek je regelmatig met ESA-collega's en docenten om informatie in te winnen voor verzoeken of het afstemmen van de werkprocessen. Je vervult een schakelrol tussen de examencommissie en de uitvoerende organisatie, goede communicatievaardigheden in zowel schriftelijke als mondelinge vorm zijn daarom van belang.<br><br>Deze huidige rol zullen we in de toekomst professionaliseren, waardoor je mogelijk meer mandaten krijgt en meer ruimte voor advisering aan de examencommissie. In beginsel ben je verantwoordelijk voor het organiseren van vergaderingen van de examencommissie waarbij je ook secretariële ondersteuning biedt en de verslaglegging daarvan verzorgt. Daarnaast zorg je voor het voorbereiden en afhandelen van bindende studieadviezen en studievoorgangsadviezen.<strong> </strong><br><br>Voor de faculteit Industrial Engineering &amp; Innovation Sciences zoeken wij een secretaris examencommissie voor 0,6 fte. Het betreft hier twee examencommissies.<br><br><strong>Andere verantwoordelijkheden die je krijgt als secretaris:</strong><ul> <li>Voorbereiden en afhandelen van besluiten van de examencommissie over verzoeken en klachten van studenten en derden (incl. vermoedens van fraude);</li> <li>Afhandelen, in geval van gedocumenteerde standaardbesluiten, van verzoeken van studenten namens de examencommissie en overige correspondentie;</li> <li>Toetsen van voorgenomen standpunten en besluiten van de examencommissie aan de relevante besluitvormingskaders, procedures en wettelijke bepalingen (bijvoorbeeld OER, WHW);</li> <li>Adviseren van de examencommissie, en in het bijzonder van de vicevoorzitter, m.b.t. jurisprudentie op basis van eerder genomen besluiten;</li> <li>Afstemmen met de secretarissen van andere examencommissies m.b.t. besluitvorming en inrichting secretariële ondersteuning;</li> <li>Secretariële ondersteuning bij beroepszaken en het organiseren van het uitschrijven van diploma's;</li> <li>Goedkeuren van (aanpassingen aan) examenprogramma's, al dan niet middels de PlanApp.</li> </ul> <br>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.tue.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tue-en-wide_acOLN2b/6da05d7a14fc4cf4bb403c37bf055371.png"}