{"url": "http://www.academictransfer.com/en/309218/lecturer-senior-tutor-computational-social-science/", "title": "Lecturer / Senior Tutor Computational Social Science", "publish_date": "2022-02-08", "deadline": "2022-03-14", "location": "Nieuwe Achtergracht 166, 1018 WV, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "Lecturer", "field": "Behaviour and society", "salary": "â\u0082¬3821â\u0080\u0094â\u0082¬5230 per month", "max_working_hours": "38", "employer": "University of Amsterdam (UvA)", "job_description": "<p>Would you like to help students become future change-makers and pioneers in computational social science? Are you passionate about (project-based) teaching and eager to apply transdisciplinary education to its fullest potential?</p><p>Digitisation poses new questions and challenges for our societies, but it also brings new opportunities to intervene in societal issues such as inequality and climate change.&nbsp; Our unique undergraduate programme in Computational Social Science focuses on digital interventions for complex societal problems and will welcome its first students in September 2022. Preparations are in full swing and therefore, we are looking for lecturers to join our team to make an active contribution to course design and course development. In addition, the lecturers will fulfil the role of Senior Tutor for our students during the course of their projects and degree programme.</p><p>The undergraduate programme Computational Social Science is a joint initiative of three faculties of the University of Amsterdam. Scientifically grounded in social sciences, informatics and humanities expertise, Computational Social Science students develop skills to design, create, apply and appropriate digital technology and data science to benefit society. All teaching activities are centred around projects within intensive, semester-length courses of 30 ECTS and require active involvement from each student.</p><p><strong>What are you going to do</strong></p><p>As a Lecturer/Senior Tutor, you will take the lead in developing innovative teaching materials and activities within our transdisciplinary, project based curriculum. You will do so in close consultation with the examiners of the semester courses, experts across the three faculties, and in alignment with learning trajectory objectives that have already been set.&nbsp;</p><p>Once the programme starts, you will also supervise one or more groups of students at an individual and group level in a small-scale setting. You will coach and guide them throughout their projects for external partners, including their (capstone) graduation projects, and monitor their academic progress.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>What do you have to offer</strong></p>\n<p>You:</p>\n<ul>\n<li>hold a PhD degree or are a PhD candidate in a relevant discipline or related interdisciplinary field;</li>\n<li>have affinity with, and interest in, interdisciplinary teaching and/or research;</li>\n<li>have excellent English language skills (proficiency in Dutch or the willingness to learn Dutch, is a plus);</li>\n<li>have experience in teaching and activating student learning in a university setting;</li>\n<li>have ample experience in course design and course development preferably within a project-based curriculum;</li>\n<li>are familiar with the particular challenges that students may encounter while learning computer programming and computational data analysis (or are willing to learn more about this);</li>\n<li>are highly skilful in both quantitative and qualitative research methods;</li>\n<li>have the willingness to become an academic mentor to students;</li>\n<li>have the willingness to contribute to Computational Social Science as a community.</li>\n</ul>\n<p>Some experience in coaching students at an individual or group level and familiarity with the HILL model (<em>High Impact Learning that Lasts</em>) are a plus.</p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Our offer</strong></p>\n<p>We offer a temporary contract at the Department of Sociology. The start date will be as soon as possible. Employment will initially be for a period of two years and 24 hours per week. An expansion to 38 hours per week is possible from September 2022 onwards. Upon positive evaluation and satisfactory performance, your contract may be extended.</p>\n<p>The gross monthly salary based on a full-time employment (38 hours per week) ranges from €3,821 up to a maximum of €5,230 gross per month. The starting salary will be based on qualifications, expertise and relevant experience. The profile 'Teacher 3' is applicable in accordance with the <a href=\"https://www.vsnu.nl/en_GB/cao-universiteiten.html\">Collective Labour Agreement of Dutch Universities</a>.</p>\n<p>We additionally offer an extensive package of secondary benefits, including 8% holiday allowance and a year-end bonus of 8.3%.</p>\n<p>The UvA offers excellent possibilities for further professional development and education.</p>\n<p><strong><em>What else do we offer</em></strong></p>\n<ul>\n<li>a position that highly values a can-do attitude and fully encourages you to take initiative;</li>\n<li>a dedicated programme team that is enthusiastic about innovative teaching in which student learning and social engagement take centre stage;</li>\n<li>an inspiring academic and international work environment in the city centre of Amsterdam.</li>\n</ul>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>University of Amsterdam</h4>\n<p>The University of Amsterdam is the largest university in the Netherlands, with the broadest spectrum of degree programmes. It is an intellectual hub with 39,000 students, 6,000 employees and 3,000 doctoral students who are all committed to a culture of inquiring minds.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Do you have any questions or do you require additional information? Please contact:</p>\n<ul>\n<li><a href=\"mailto:A.L.vanPappelendam@uva.nl.\">Lisa van Pappelendam</a>, programme manager Computational Social Science</li>\n</ul>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uva.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uva-en-wide/22e1319f66e44f07d56047b996668aa9.png"}