{"url": "https://www.academictransfer.com/en/309197/phd-candidate-in-algebraic-topology/apply/", "title": "PhD Candidate in Algebraic Topology", "publish_date": "2022-02-08", "deadline": "2022-03-20", "location": "Houtlaan 4, 6525 XZ, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "PhD", "field": "Natural sciences", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "N/A", "employer": "Radboud University", "job_description": "<p><em>Are you an aspiring researcher with a background in algebraic topology? Then join the Department of Mathematics as a PhD Candidate. You will carry out research in mathematics at the highest scientific level within a friendly and welcoming atmosphere, with a balanced and international team that helps you discover your potential.<br><br></em>The Department of Mathematics at Radboud University (Nijmegen, Netherlands) is seeking an outstanding and highly motivated PhD candidate to work on a PhD project in homotopy theory. You will work on a PhD project under the supervision of Dr. Steffen Sagave. The position is funded for 4 years and has a light teaching load (10%). You will be encouraged to participate in relevant conferences, workshops and seminars, and to communicate your findings through publications in peer-reviewed journals. Upon successful completion, you will be awarded a PhD degree from Radboud University. We particularly encourage applications from underrepresented groups.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You hold a Master's degree in Mathematics (or an equivalent degree), completed before the start date.</li>\n<li>You have a strong background in algebraic topology or related areas.</li>\n<li>You have excellent writing and communication skills.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: You will be employed for an initial period of 18 months, after which your performance will be evaluated. If the evaluation is positive, the contract will be extended by 2.5 years (4 year contract).</p>\n<ul>\n<li>Employment for 1.0 FTE.</li>\n<li>The gross starting salary amounts to â\u0082¬2,443 per month based on a 38-hour working week, and will increase to â\u0082¬3,122 in the fourth year (<a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/\">salary scale P</a>).</li>\n<li>You will receive 8% holiday allowance and 8.3% end-of-year bonus.</li>\n<li>You will be employed for an initial period of 18 months, after which your performance will be evaluated. If the evaluation is positive, the contract will be extended by 2.5 years (4 year contract).</li>\n<li>You will be able to use our <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/our-way-working-personal-approach/dual-career-family-support-service/\">Dual Career and Family Care Services</a>. Our Dual Career and Family Care Officer can assist you with family-related support, help your partner or spouse prepare for the local labour market, provide customized support in their search for employmentÂ  and help your family settle in Nijmegen.</li>\n<li>Working for us means getting extra days off. In case of full-time employment, you can choose <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/more-info-working/flexible-working-times/\">between 29 or 41</a> days of annual leave instead of the legally allotted 20.</li>\n</ul>\n<em>Additional employment conditions</em>\nWork and science require good employment practices. This is reflected in Radboud University's primary and secondary <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/\">employment conditions</a>. You can make arrangements for the best possible work-life balance with flexible working hours, various leave arrangements and working from home. You are also able to compose part of your employment conditions yourself, for example, exchange income for extra leave days and receive a reimbursement for your sports subscription. And of course, we offer a good pension plan. You are given plenty of room and responsibility to develop your talents and realise your ambitions. Therefore, we provide various training and development schemes.\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Algebraic topology is one of the research areas of the <a href=\"https://www.ru.nl/math\">Department of Mathematics</a> at Radboud University. The field is represented by Dr Magdalena Kedziorek and <a href=\"https://www.math.ru.nl/~sagave/\">Dr Steffen Sagave</a>. The department has a friendly and welcoming atmosphere with researchers in related areas including algebraic and arithmetic geometry, differential geometry, operator algebras, and representation theory. There is a good balance of junior and senior staff, and of Dutch and international researchers. We regularly organise research seminars as well as various informal events throughout the year. Moreover, algebraic topologists at Radboud University are part of a larger network of Dutch algebraic topologists who regularly interact and meet for seminars and other events. There are more than 20 PhD candidates in the Mathematics Department.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For questions about the position, please contact Steffen Sagave, Assistant Professor at +31 24 365 22 96 or <a href=\"mailto:steffen.sagave@ru.nl\">steffen.sagave@ru.nl</a></p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.ru.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/run-en-wide/13abf0bc0a611f32246d62b46488f997.jpg"}