{"url": "https://academicpositions.com/ad/nioz-royal-netherlands-institute-for-sea-research/2022/phd-position-selective-breeding-of-sterile-sporophytes-of-the-brown-seaweed-saccharina-latissima/175043", "title": "PhD position: â\u0080\u0098Selective breeding of sterile sporophytes of the brown seaweed Saccharina latissimaâ\u0080\u009d", "publish_date": "2022-02-08", "deadline": "2022-02-25", "location": "Landsdiep 4 Den Helder, Netherlands", "city": "N/A", "country": "Netherlands", "position": "PhD", "field": "Botany and plant science, Marine Biology, Physiology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "NIOZ Royal Netherlands Institute for Sea Research", "job_description": "The department of Estuarine and Delta Systems (EDS; principal investigator Prof. Dr. Klaas Timmermans) at the Royal Netherlands Institute of Sea Research (NIOZ) is looking for a highly motivated PhD student with a background in (marine) biology / plant physiology to investigate selective breeding of the brown seaweed species Saccharina latissima. The research will be part of a funded project.LOCATION: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;NIOZ&nbsp;YERSEKEVACANCY NR.:&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2022 - 07CLOSING DATE:&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; February 25th, 2022THE DEPARTMENTThe department of Estuarine and Delta Systems (EDS, NIOZ-Yerseke) studies how the interplay between organisms, hydrodynamics, sediment dynamics and biochemistry shapes the estuarine and delta environment in the context of natural and human-induced environmental changes. An important focus of our research is how these abiotic-biotic interactions create value for society, following for examples of the â\u0080\u009cBuilding with Natureâ\u0080\u009d paradigm or investigating sustainable sources of marine biomass for food.&nbsp;THE PROJECTAs part of the NWO-funded project From Sea to Society, smart breeding of the brown seaweed species &nbsp;S. latissima will be performed in close cooperation with Hortimare. Goal of the breeding will be to produce S. latissima with more biomass and higher protein yields. The breeding will be done by selection and sterile sporophytes will be produced that cannot interbreed with natural populations, preventing gene flow into the marine ecosystem. NIOZ/Hortimare will perform a 3-stage breeding trial approach (from lab to sea) to quantitatively assess the added value of the kelp varieties and to extensively validate the sterility of sporophytes. The biomass that is produced will be handed over to partners in the project for biorefinery optimization. The PhD will work in the interdisciplinary research project From Sea to Society &nbsp;together with chemists, modellers and social scientists. The full text of the granted research project From Sea to Society is available on request.THE CANDIDATEAre you a highly motivated researcher with an MSc in (marine) biology /plant physiology. Do you have a keen interest in frontier-based research in an interdisciplinary scientific environment? Do you have experience with experimental work both in the laboratory and at field sites, and/or plant breeding? In this project you will learn and apply state-of-the-art analytical techniques and research concepts to cross scientific boundaries. You will work in an interdisciplinary research environment; a very good command of spoken and written English is essential. We highly encourage applicants from all members of our community and of diverse background, including LGBT+ and BAME communities, to join us.CONDITIONSEmployment of this position at Royal NIOZ is by NWO (The Netherlands Organization of Scientific Research). We offer a position for a period of 1 years (fulltime). At the end of this first year, the employment will be extended for a fixed-term of a maximum of 4 years, if the first year evaluation held with the employee is positive. The salary is compliant to the CAO-OI (Collective Labour Agreement for Dutch Research Institutes), a pension scheme, a holiday allowance of 8% of the gross annual salary, a year-end bonus of 8,3%, flexible work arrangements and arrangements and 42 days of holiday leave (fulltime position).You may expect attractive secondary employment conditions. We offer generous relocation expenses for employees coming from abroad and support with finding accommodation.The position will be based at the NIOZ-Yerseke, which is at commuting distance of cities like Antwerpen, Breda, Middelburg and Vlissingen. The preferred starting date of the project is April 2022.FURTHER INFORMATIONFor additional information about this vacancy, please contact Prof. Dr. Klaas Timmermans (projectleader From Sea to Society, department head).&nbsp; For more information about the department EDS, click here. For additional information about the procedure, please contact Mylene Lormans, sr. HR advisorInterviews will be planned on March 9th and/or March 11th 2022.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "NIOZ Royal Netherlands Institute for Sea Research is the National Oceanographic Institution of the Netherlands.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEyXC8wOFwvTklPWkxvZ28ucG5nIiwiZWRpdHMiOltdfQ=="}