{"url": "https://academicpositions.com/ad/university-portsmouth/2022/lecturer-in-organisational-studies-human-resource-management-os-hrm/174945", "title": "Lecturer in Organisational Studies/Human Resource Management (OS/HRM)", "publish_date": "2022-02-07", "deadline": "2022-03-03", "location": "University House, Winston Churchill Ave Portsmouth, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Management", "field": "Human Resource Management, Labour Economics, Management, Organizational Economics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Portsmouth", "job_description": "Faculty of Business &amp; LawOrganisational Studies &amp; Human Resource ManagementLecturer in Organisational Studies/Human Resource Management (OS/HRM)Employment type:&nbsp; PermanentEmployment basis:&nbsp; Full-timeSalary:&nbsp; Â£36,382 - Â£39,739 per annum&nbsp;Post number: ZZ600851Date published: 07 February 2022Closing date:&nbsp;03 March 2022Interview date:&nbsp; 29 March 2022The University of Portsmouth is an ambitious institution with a track record of success. One of only four universities in the south east of England to achieve a Gold rating in the Teaching Excellence Framework and ranked in the top 150 in the Times Higher Young University World Rankings.The University of Portsmouth achieved the highest â\u0080\u0098Goldâ\u0080\u0099 rating in the Teaching Excellence Framework (TEF) the UK governmentâ\u0080\u0099s first assessment of teaching excellence in higher education. Portsmouth Business School has a track record of sustained excellence in teaching and research as evidenced by the consistently very high student satisfaction scores in the National Student Survey, the excellent employability record of our graduates, and the results of the Research Excellence Framework (REF2014) submission. The breadth and depth of our research was viewed by the REF2014 panel as having an outstanding and very significant impact in economic, social and policy-making terms, placing us in the top 10% for impact; 87.5% of our research environment was rated as internationally excellent; and 62% of our research as world-leading or internationally excellent. We offer a full range of degree programmes across business, management, accounting, finance and economics, including PhD and the Doctor of Business Administration (DBA) programme. We combine excellence in research and scholarship with considerable business and consultancy experience, and provide leadership in the development and dissemination of sustainable business and management practice.Portsmouth Business School has a vibrant environment and is ambitious. We wish to build upon our existing strengths and considerable recent success by investing in excellence. The successful candidates are likely to hold a doctorate, or be close to completion. Professional qualifications and senior professional experience will also be considered. You will be committed to excellence in teaching at all levels, and support to develop teaching skills is available for less experienced staff. You will be expected to make a significant contribution to the research and innovation profile of the School.&nbsp; You will have drive and an innovative approach to research, learning and teaching, and enjoy working collaboratively in a dynamic environment.&nbsp;Informal enquiries may be made to the Head of the Subject Group by contacting Gary Rees,&nbsp;gary.rees@port.ac.uk.Please note this post is also available as ZZ600851 â\u0080\u0093 Teaching Fellow in&nbsp;Organisational Studies/Human Resource Management (OS/HRM). If you would also like to apply for this post, you will need to make a separate application.The University of Portsmouth believes this role&nbsp;may be eligible&nbsp;for sponsorship with UKVI under the Skilled Worker Route visa. Please familiarise yourself with the&nbsp;requirements set out&nbsp;before applying for this role. If you are unable to meet the requirements for sponsorship you will need to confirm details of an alternative visa to work in the UK when applying for this role.As an equal opportunities employer, we welcome applications from all suitably qualified persons and all appointments will be made on merit. As we are committed to the principles of the Race Equality Charter Mark, we would particularly welcome applicants from Black, Asian, or from other ethnic groups who are currently under-represented at this level in this area.&nbsp;&nbsp;&nbsp;For more about us:&nbsp;Working at PortsmouthFor detailed information about the vacancy:&nbsp;ZZ600851 - Lecturer in Organisational Studies/Human Resource Management.docxTo find out more about the University of Portsmouth and this role, apply on-line.&nbsp;&nbsp;It is the policy of the University to only accept applications submitted using the Universityâ\u0080\u0099s application form.All applications for this position will be processed and conducted in compliance with UK legislation relevant at that time.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Portsmouth is a university in the city of Portsmouth, England. It was previously known as Portsmouth Polytechnic until 1992, when it was granted university status.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMGFcLzMwYlwvMjBhMzBiM2JmMTU4MzZkZjUwNmNlYzQ1NGY4YTgyMWEucG5nIiwiZWRpdHMiOltdfQ=="}