{"url": "https://academicpositions.com/ad/university-of-luxembourg/2021/research-and-development-specialist-at-the-ada-chair-in-financial-law-inclusive-finance/173562", "title": "Research and Development Specialist at the ADA Chair in Financial Law (inclusive finance)", "publish_date": "2021-12-24", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Researcher", "field": "Financial Law,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "The Department of Law of the Faculty of Law, Economics and Finance of the University of Luxembourg is looking for a Research and Development specialist to conduct research in law and regulation of Sustainable and Inclusive Finance and/or Financial Technologies (FinTech).Your Role..&nbsp;The Research and Development specialist will be working under the supervision of Professor Zetzsche, the holder of the ADA Chair in Financial Law (inclusive finance). In particular, the R&amp;D Specialist will assist in:Creating and updating international databases on legal developments and research relating to FinTech, RegTech, Sustainable Finance and/or Financial Inclusion.Work in the field of company, securities, investment and other type of financial law, as research support, co-author and/or as own researcher in the fields of research pursued at the ADA Chair.Collect data and prepare scientific and policy reports on research results.If the research and development specialist is interested in pursuing independent research and qualified to do so, Professor Zetzsche will support the admission to the PhD programme in law.Qualifications..&nbsp;We are looking for a candidate with a Master degree in Law. In particular, the following requirements apply:Proven interest in FinTech, RegTech, Sustainable Finance and/or Inclusive FinanceSpecific interest in participating in research projects and first experience in research methodsCuriosity for old and new legal and regulatory challengesWillingness to work in teamsSkills in English, German and French; additional language is welcome.In Short..&nbsp;Contract Type: Fixed Term Contract 12 MonthWork Hours: Part Time 32.0 Hours per WeekStarting date: As soon as possibleLocation:&nbsp;KirchbergJob Reference:&nbsp;UOL04601In particular, we offer:An international environmentOpportunity to work in a very productive research institutionCompetitive remunerationA large and international research network with opportunities to connect to research and policy institutions around the Globe.How to apply..&nbsp;Applications should be submitted online and include:A motivation letterA detailed curriculum vitaeThe name, current position and relationship to the applicant, of one referee.We encourage early application.Please apply formally through the HR system. Applications by email will not be considered.&nbsp;The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.For more information concerning this position, please contact Prof. Zetzsche, email: dirk.zetzsche@uni.luAbout us..&nbsp;The University of Luxembourg is an&nbsp;international research university with a distinctly multilingual and interdisciplinary character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.The&nbsp;Faculty of Law, Economics and Finance offers three Bachelor programmes, four Master programmes of Management and Economics and six Masters of Laws (LL.M.), as well as several continuing education courses. It also includes the Doctoral School in Law and the Doctoral School in Economics and Finance. Around&nbsp;2,500 students&nbsp;from&nbsp;90 different nationalities are enrolled at the Faculty. Academic staff from 18 different nationalities teach at the Faculty, supported by practitioners from the field, visiting scholars and guest professors. Rooted in Luxembourg but with a&nbsp;European and international outlook, the Faculty counts three departments:Department of LawDepartment of Economics and Management (DEM)Department of FinanceTeaching and research benefit from the proximity of the European institutions, Luxembourgâ\u0080\u0099s world-class financial centre ranked second in the world in investment fund asset domicile, and its vibrant business community. Institutional and private sector partnerships, sponsored Chairs, and a growing network of international partner universities make the FDEF a vibrant academic hub within the University at the heart of Europe.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Luxembourg aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international, multilingual and interdisciplinary character.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}