{"url": "https://www.academictransfer.com/en/309211/learning-development-adviseur-08-10fte/", "title": "Learning & Development Adviseur (0,8-1,0fte)", "publish_date": "2022-02-08", "deadline": "2022-02-21", "location": "Burgemeester Oudlaan 50, 3062PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "32—40", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "<p>Als L&amp;D Adviseur werk je nauw samen met de collega&rsquo;s van het LCC, de HR Business Partners, HR-adviseurs en leidinggevenden. Je brengt de ontwikkelbehoeften van de verschillende organisatieonderdelen (faculteiten en diensten) en medewerkers van de EUR in kaart en weet deze om te zetten naar leeroplossingen. Je hebt inhoudelijk overleg, zorgt voor de ontwikkeling en vormgeving van een programma en bent verantwoordelijk voor de uitvoering, kwaliteit en evaluatie. &nbsp;Je hebt een rol met impact waarin je daadwerkelijk het verschil kunt maken. Als L&amp;D Adviseur ben je daarnaast verantwoordelijk voor de volgende taken:</p><ul> <li>Je signaleert de EUR-brede opleidingsbehoefte, en zet deze behoefte om in standaard trainingen en/of maatwerkoplossingen;</li> <li>Je adviseert en informeert de HR Business Partners en Adviseurs en de organisatieonderdelen over leer- en ontwikkelmogelijkheden ten einde bij te dragen aan de organisatiedoelen van de afdeling;</li> <li>Je zorgt voor adequate management- en sturingsinformatie met betrekking tot de leer en ontwikkelactiviteiten en &ndash;resultaten;</li> <li>Je onderhoudt contacten met zowel interne stakeholders (HR advies, leidinggevenden) als de externe stakeholders (bijv. trainingsinstituten);</li> <li>Je bent voor leren &amp; ontwikkelen het gezicht en aanspreekpunt voor de HR-collega&rsquo;s en leidinggevenden.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}