{"url": "https://academicpositions.com/ad/ku-leuven/2022/a-vacancy-is-available-for-an-early-stage-researcher-phd-student-on-restoring-binaural-hearing-in-children-with-single-sided-deafness/175172", "title": "A vacancy is available for an Early Stage Researcher (PhD-student) on Restoring binaural hearing in children with single sided deafness", "publish_date": "2022-02-11", "deadline": "2022-02-28", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Audiology, Biomedical Engineering, Biomedicine, Health Psychology, Image Processing, and 4 moreNeuropsychology,Neuroscience,Physiology,Signal Processing", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "Duration: 4 yearsStarting date: as soon as possibleThe goal of this research project is to investigate the cortical reorganization of children with single sided deafness (SSD) following intervention with a cochlear implant (SSD-CI), compared to a group of children with SSD but not fitted with a CI (SSD-noCI) and a group of children with normal hearing. SSD significantly affects cortical symmetry, as it results in an increased dominant representation of the normal ear compared to the deaf ear. Research shows that early intervention in children with SSD can restore the hemispheric representations of bilateral auditory input in the auditory cortex. Using EEG-based objective measures, we will investigate the binaural restoration at the subcortical and cortical level of the auditory pathway in children who are four years and older. Neural activity captured by the multi-channel EEG will be used to construct functional network models of cortical processes.This position is a part of the H2020 Marie-Curie Innovative Training Network project Comm4CHILD (https://comm4child.ulb.be) that received funding from the European Union's Horizon 2020 research and innovation programme under grant agreement No. 860755.Your profileMaster degree in audiology, biomedical engineering, neuroscience, psychology, or related fieldProfound interest in scienceExperience with electrophysiological data is an assetGood verbal skills Dutch (for the children) is an assetGood verbal and written communication skills in EnglishKeen interest in signal processing (CI, artefacts), statistics (R), matlab,Keen interest to (learn to) work with the neuroimaging toolbox BrainstormInterested to learn within an international network, spend secondments in a partner country, attend network-wide training events and conferencesEligibility criteria:The candidate must have resided or carried out their main activity in a different country from the host organization for at least 12 months prior to their recruitment. This excludes short stays such as holidays. Candidates cannot have completed more than four years of full-time equivalent research experience.We offer:A highly dynamic interdisciplinary research environment in Europeâ\u0080\u0099s most innovative university. The European funding will cover the 2 years of a full-time PhD (3 270 â\u0082¬ monthly gross salary including employer and employee deductions and taxes) in Belgium, plus 600 â\u0082¬ per month as Mobility Allowance and if entitled a Family Allowance. The 3rd or 4th years will be provided to the successful candidate to complete the doctorate.How to apply?Interested candidates should submit (a) a cover letter describing their background, research experiences, interests, and goals, (b) a curriculum vitae, (c) at least one letter of recommendation from previous research supervisors, (d) a copy of the diploma (with the university transcripts), to&nbsp;astrid.vanwieringen@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}