{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/associate-professor-tenure-track-assistant-professor-in-computational-soil-mechanics-and-foundation-engineering/175103", "title": "Associate Professor / Tenure-track Assistant Professor in Computational Soil Mechanics and Foundation Engineering", "publish_date": "2022-02-10", "deadline": "2022-05-01", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Assistant Professor", "field": "Civil Engineering, Computational Engineering, Computational Physics, Environmental Engineering, Geotechnical Engineering, and 1 moreMechanics", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>The Department of Engineering of the Faculty of Science, Technology and Medicine is seeking to hire an outstanding candidate in the area of <i>Computational Soil Mechanics and Foundation Engineering.</i> We seek candidates who are eager to engage as educators among a diverse student community.</p><p><strong>Your role...</strong></p><p>To diversify the existing skills and expertise of the department of engineering in civil and environmental engineering, the candidate is expected to:</p><ul><li>Perform high-level research in computational soil mechanics and foundation engineering</li><li>Contribute to teaching in the bachelor and master programs in engineering</li><li>Apply for third-party funding</li><li>Setup and manage a research group in foundation engineering, including supervision of PhD candidates</li><li>Establish collaborations with national and international partners in industry and academia</li></ul><p>Candidates who can demonstrate innovative engineering approaches to address sustainability challenges associated with the built environment will stand out. Potential focus areas include â\u0080\u0093 but are not limited to â\u0080\u0093 the reduction of carbon emissions and resource consumption; recycling, reuse and revitalisation in foundation engineering; as well as models and methods for the characterisation of porous media and advanced geotechnical situations, for instance in relation to carbon capture.</p><p><strong>Your profile...</strong></p><p>The ideal candidate is an emerging, high-potential researcher with proven track record in research in the area of foundation engineering and/or soil mechanics as well as applied research activities in the broader domain of civil engineering.</p><p>The successful candidates should have:</p><ul><li>A PhD degree in civil engineering or related area</li><li>Recognised and original contributions to research in foundation engineering and computational soil mechanics</li><li>Experience in teaching at the undergraduate and graduate levels</li><li>Good presentation, communication, organisational and management skills</li><li>Interest in interdisciplinary collaborations</li><li>Working knowledge of <i>English</i> and <i>either French or German</i></li></ul><p><strong>We offer...</strong></p><ul><li>An exceptional research environment and skilled support staff</li><li>Extensive laboratories for material and structural testing</li><li>Highly competitive salary and benefits packages</li><li>Very significant package for research funding and very good opportunities for external funding</li></ul><p><strong>In short...</strong></p><ul><li>Contract Type: 5 years (tenure track), with perspective of a permanent position and promotion to Associate Professor upon a positive evaluation. In case of an excellent more senior candidate, a direct appointment at the level of Associate Professor would then be on a permanent position</li><li>Working hours: Full time 40 hours per week</li><li>Location: Campus Kirchberg and/or Campus Esch Belval</li><li>Starting date: September 2022 or later</li><li>Job reference: UOL04164</li></ul><p><strong>How to apply...</strong></p><p>Applications, in English, should contain a motivation letter, a research statement, a teaching statement highlighting areas of interest in education and willingness to contribute to departmental operations, a detailed curriculum vitae, a full list of publications and the names of at least four experts who can, upon request from the Faculty, provide reference letters.</p><p>We encourage early application. To ensure full consideration, candidates should apply by May 1st<strong>, 2022</strong>. All applications should be sent to the Dean of the Faculty, Prof. Dr. Jean-Marc Schlenker, using the email address: <a href=\"mailto:FSTM.recruitment-DOE@uni.lu\">FSTM.recruitment-DOE@uni.lu</a></p><p>The University of Luxembourg is an equal opportunity employer and strives to increase the share of female professors. We explicitly encourage women to apply.</p><p><strong>The University...</strong></p><ul><li><strong>Multilingual and international character</strong>. Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d (UniGR). </li><li><strong>A modern and dynamic university. </strong>High-quality equipment. Close ties to the business world and to the Luxembourg labour market. A unique urban site with excellent infrastructure.</li><li><strong>A partner for societyand industry</strong>. Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic partners such as ministries, local governments, associations, NGOs â\u0080¦</li><li><a href=\"https://wwwen.uni.lu/university/about_the_university\" target=\"_blank\">Find out more about the University</a></li><li><a href=\"https://wwwen.uni.lu/contact\" target=\"_blank\">Addresses, maps &amp; routes to the various sites of the University</a></li></ul><p>The University of Luxembourg is a highly international, young and dynamic university, for instance currently ranked 20th in the Times Higher Education ranking of the best universities under 50 years old.</p><p>The University of Luxembourg is set in a multilingual context. The person hired on this position must be proficient in English and either French or German. The University encourages its staff to learn the other language and provides access to language courses to this end.</p><p><strong>Living and working in Luxembourg...</strong></p><p>Luxembourg has an extensive welfare system. It comprises a social security, health, and pension funds. Among those benefits, there are various types of financial aids directly linked to the schooling and education of children: family allowance, birth allowance &amp; children's future allowance. According to a recent UNESCO report, Luxembourg rank highest on childcare provisions among<a href=\"https://www.unicef-irc.org/publications/pdf/where-do-rich-countries-stand-on-childcare.pdf\" target=\"_blank\"> 41 OECD and EU countries</a>. Further information: <a href=\"https://www.justarrived.lu/en/reference/cae-fund-for-the-future-of-children/\" target=\"_blank\">t.ly/aH3P</a></p><p>The country counts with an extensive public education system that comprises as well International and European Schools. Further information: <a href=\"https://guichet.public.lu/en/citoyens/enseignement-formation.html\" target=\"_blank\">t.ly/1RyJ</a></p><p>For more general information about living and working in Luxembourg including tips for accommodation, entry conditions/visas you can also view the Euraxess Researcher Guide: <a href=\"https://www.euraxess.lu/luxembourg/information-researchers/foreign-researchers-guide-luxembourg\" target=\"_blank\">t.ly/IgJD</a></p><p>For further questions, please contact the dean of the Faculty under <a href=\"mailto:jean-marc.schlenker@uni.lu\">jean-marc.schlenker@uni.lu</a></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}