{"url": "https://academicpositions.com/ad/ku-leuven/2021/deep-brain-stimulation-in-an-animal-model-of-anxiety/173382", "title": "Deep Brain Stimulation in an Animal Model of Anxiety", "publish_date": "2021-12-22", "deadline": "2022-02-15", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Other Category", "field": "Anatomy, Behavioural Science, Experimental Psychology, Neurology, Neuropsychology, and 3 moreNeuroscience,Psychiatry & Psychology,Surgery", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2021-860)The EAGER project unites members from the Learning and Experimental Psychopathology group (CLEP) and the Laboratory of Biological Psychology (LBP) at KU Leuven. Collectively, the consortium offers an internationally oriented, productive, collaborative, and multi-disciplinary environment involving 4 PIs and over 20 other research staff. Research at CLEP and LBP is characterized by a translational perspective (rodents, healthy humans, clinical populations) and aims to unravel behavioral and brain mechanisms underlying normal and abnormal psychological functioning. Of relevance for the current project, the consortium has state-of-the-art facilities for behavioral neuroscience investigations of learning and memory in rodents and humans. Expertise in the consortium provides for a unique combination of conceptual, methodological and clinical skills in the area of affective behavioral (neuro)science. Furthermore, the promotors are embedded in the Leuven Brain Institute (https://www.kuleuven.be/brain-institute), a network that unites all of the Universityâ\u0080\u0099s neuroscience research. The project is based at KU Leuven, a research-oriented institution that is consistently ranked among the top research universities in Europe. It is located in the center of the historic town of Leuven, home to the University since 1425. About 30 km from Brussels and two hours away from Paris, London and Amsterdam, it has a strong international appeal. It also has a rich history and a unique friendly atmosphere, with a great range of museums, concert halls and other cultural hot spots. The cost of living in Leuven is moderate by international standards; the quality of living is excellent. For more information, visit http://www.kuleuven.be/english/.Website unitProject&nbsp;In the past decades, considerable research effort has been devoted to documenting and understanding elementary features of fear learning and how they might be involved in the development of anxiety and anxiety disorders, through research in animals, healthy humans and patients. This work has revealed the critical roles of extinction deficits, excessive generalization and persistent avoidance in anxious psychopathology. In the EAGER project, we chart the interaction of these three phenomena and the factors that cause their dysregulation. Through concerted studies in animals, healthy human volunteers and clinical populations, we hope to achieve a breakthrough in our insight in the development and treatment of anxiety disorders. The EAGER project is supervised by Prof. Dirk Hermans, Prof. Tom Beckers, Dr. Laura Luyten and Prof. Bram Vervliet.&nbsp;This specific PhD project (supervised by Dr. Laura Luyten and Prof. Tom Beckers) combines this experimental psychology approach with an ongoing program that studies the effect of deep brain stimulation (DBS) for the treatment of psychiatric disorders (in collaboration with the research group Experimental Neurosurgery and Neuroanatomy). The aim is to study whether and how DBS can affect anxiety.Profile&nbsp;The student to be hired for the present position will be conducting experimental studies in rats to study different aspects of anxiety (extinction, generalization and avoidance) and the role of certain brain areas therein. As mentioned above, we have a particular interest in deep brain stimulation (DBS), so it is likely that the project will also entail DBS studies in rats.If you tick most of the following boxes, we hope you'll apply:&nbsp;You are an enthusiastic academic who holds a master's degree in neuroscience, psychology, or a related discipline (or will do so by February, 2022).You have at least some initial experience in doing animal research, preferably with rodents.You have a keen interest in the neurobiological and behavioral mechanisms of (fear) learning and memory and/or (an experimental approach to) psychopathology.You have excellent communicative skills in English (both orally and in academic writing).&nbsp;Further indispensable assets are an inquisitive and creative mind, good problem solving skills and a collaborative and collegial attitude.Offer&nbsp;We offer a fully funded, full-time PhD position in a 4-year research project (initial1-year position with 3-year extension upon satisfactory performance), embedded in a world-class research environment. Salary and benefits are in accordance with the university salary scales for PhD students and highly competitive by international standards. When applying, please include a letter of motivation and the names and contact details of two references.Interested?&nbsp;For informal inquiries please contact Dr. Laura Luyten (laura.luyten@kuleuven.be, see also&nbsp;https://ppw.kuleuven.be/clep/People/ll) or Prof. dr. Tom Beckers (tom.beckers@kuleuven.be).Applications will be reviewed from 17 January 2022 onwards and evaluated on a rolling basis until the position is filled. Preferred starting date is between March and June 2022.You can apply for this job no later than February 15, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}