{"url": "https://academicpositions.com/ad/nioz-royal-netherlands-institute-for-sea-research/2022/tenure-track-principle-investigator-position-on-the-dynamics-of-lower-trophic-level-consumers/174805", "title": "Tenure-track Principle Investigator position on the Dynamics of Lower Trophic Level Consumers", "publish_date": "2022-02-02", "deadline": "2022-03-04", "location": "Landsdiep 4 Den Helder, Netherlands", "city": "N/A", "country": "Netherlands", "position": "Assistant Professor", "field": "Ecology, Marine Biology, Marine Geoscience, Molecular Biology, Oceanography, and 1 moreSystematics (Taxonomy)", "salary": "N/A", "max_working_hours": "N/A", "employer": "NIOZ Royal Netherlands Institute for Sea Research", "job_description": "NIOZ is looking for a highly motivated marine researcher to join the team of PIs in its Department of Coastal Systems. The position will be filled at the Tenure-track level. The PI will develop world-leading research on the dynamics of consumers at lower trophic levels within coastal and/or shelf sea habitats (e.g. pelagic zooplankton, gelatinous zooplankton, macrozoobenthos) and their ecological function in the marine ecosystem. The position complements long-standing expertise at COS in advancing fundamental ecological understanding of coastal marine systems.LOCATION:&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;ROYAL NIOZ TEXEL (THE NETHERLANDS)&nbsp;VACANCY ID:&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 2021 - 25CLOSING DATE:&nbsp; &nbsp; &nbsp; &nbsp;March 4, 2022&nbsp; (extended)THE INSTITUTENWO-NIOZ Royal Netherlands Institute for Sea Research is the national oceanographic research institute. The mission of NIOZ is to perform academically excellent multidisciplinary fundamental and frontier-applied marine research addressing important scientific and societal questions pertinent to the functioning of oceans and seas. NIOZ also serves as national marine research facilitator (NMF) for The Netherlands scientific community, and stimulates and supports national and international marine research, marine education programs and marine policy development.THE DEPARTMENTThe Department of COS integrates state-of-the art laboratory, field and modelling studies in frontier explorations of the drivers of the dynamics of marine habitats and food webs. COS examines how physical, chemical and biological processes interact to determine the distribution, composition and productivity of marine species - from primary producers to top predators - in marine habitats from the coast to inter/sub-tidal and pelagic environments. Research is conducted at both the regional and global scales.THE VACANCYOver the course of the tenure-track period, the PI is expected to take concrete steps toward building a world-class research group, advancing fundamental process understanding of primary or secondary consumers and communities in marine food webs. There is considerable flexibility for the selected candidate to shape their own research line in consideration of the NIOZ strategic plan. Examples of coastal / marine research areas may include (but are not limited to):employing field sampling and/or in situ experiments to understand processes that shape the distribution, productivity and ecological function of lower trophic level consumers and ecosystem-level resilience to change;using laboratory ecophysiology to gain a cause-and-effect understanding of how abiotic and biotic factors interact to impact the vital rates (growth, reproduction, survival) of lower trophic level consumers;applying cellular and molecular methods, including genetics, to understand the dynamics of marine lower trophic level consumers and the spatial connectivity of their populations;integrating field and/or laboratory measurements using mathematical, statistical and/or numerical models to advance predictive capability of pressure effects (e.g. climate change, changes in nutrient loading, habitat modification due to coastal or offshore infrastructure) on species, habitats and ecosystems.The successful candidate can and should take advantage of existing, long-term observational programmes and the cross-departmental research facilities available at NIOZ including its research aquarium and laboratories (e.g. from molecular to advanced microscopy and benthic taxonomy) and oceanographic research fleet. Using these resources, research can be conducted within or across a variety of habitats from estuaries, shallow coastal zones to shelf sea and other offshore regions.THE CANDIDATE&nbsp;You have a PhD plus relevant post-doctoral or other professional research experience in ecology, marine science or a closely related discipline and a strong track record of process investigation on lower trophic level consumers and their communities. You have an affinity for addressing marine ecological questions using a collaborative, cross-disciplinary, state-of-the-art approach. You are ready to build an effective research team including the mentoring of early career scientists and active collaboration within and outside NIOZ. You have demonstrated success at building national and international research collaborations and a strong track record of publishing in peer-reviewed journals.We strive to ensure that our staff reflect the diversity of society, including age, gender and cultural background. We therefore very much appreciate candidates who are able to increase the diversity of NIOZ.CONDITIONSEmployment of this position at Royal NIOZ is by&nbsp;NWOI (The Netherlands Organization of Scientific Research). Depending on the qualifications of the successful candidate, we offer either a lifetime (tenured) or tenure-track (review within 5 years) position.&nbsp;In case the position is offered at the tenure-track level, the candidate will be hired for 5 years. At the end of a successful tenure track term, a permanent scientific staff position will be offered up to the level of senior scientist. Criteria for evaluation comprise a track record of publications that is far above average, proven skills in acquiring funding, and an international network.The salary is compliant to the&nbsp;CAO-OI (Collective Labour Agreement for Dutch Research Institutes), a pension scheme, a holiday allowance of 8% of the gross annual salary, a year-end bonus of 8,3% of the gross annual salary, flexible work arrangements and 42 days of holiday leave (fulltime position).You may expect attractive secondary employment conditions. We offer generous relocation expenses for employees coming from abroad and support with finding accommodation.&nbsp;Royal NIOZ COS is located on the beautiful island of Texel in the World Heritage Wadden Sea. Texel offers sun, wind and beach, and a diverse but moderate level of facilities, including a thriving tourist industry, shops, sports facilities, primary schools and a high school. It is connected to the main land by an hourly to half-hourly ferry service, with crossings taking 20 minutes. The Royal NIOZ is situated next to the ferry terminal.MORE INFORMATIONPlease apply online at&nbsp;www.workingatnioz.com &nbsp;For additional information about this vacancy, please contact the Head of the Department of Coastal Systems,&nbsp;Dr. Myron A. Peck. &nbsp;For additional information about the procedure, please contact&nbsp;Sandra Liefhebber&nbsp;(Head of NIOZ HR)Please visit the Department of Coastal Systems&nbsp;here.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "NIOZ Royal Netherlands Institute for Sea Research is the National Oceanographic Institution of the Netherlands.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEyXC8wOFwvTklPWkxvZ28ucG5nIiwiZWRpdHMiOltdfQ=="}