{"url": "http://www.academictransfer.com/en/309222/hoogleraar-publiekrecht-in-het-bijzonder-het-economisch-publiekrecht-05-10-fte/apply/", "title": "Hoogleraar - Publiekrecht, in het bijzonder het economisch publiekrecht (0,5 – 1,0 fte)", "publish_date": "2022-02-08", "deadline": "2022-03-04", "location": "Burgemeester Oudlaan 50, 3062 PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Other Category", "field": "Recht", "salary": "N/A", "max_working_hours": "N/A", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "<p>Als collega binnen het nieuwe departement Law &amp; Markets maakt u deel uit van een internationaal team van junior en senior onderzoekers dat actief is op het gebied van recht en economische governance, breed opgevat. Met zijn focus op de juridische en maatschappelijke uitdagingen met betrekking tot het recht voor economische actoren combineert het departement meerdere benaderingen om nieuwe onderzoeksperspectieven en innovatieve antwoorden te ontwikkelen.</p><p>Als hoogleraar Publiekrecht heeft u een voortrekkersrol bij het ontwikkelen en implementeren van onderzoek en onderwijs ten aanzien van het publiekrecht in het algemeen, met bijzondere aandacht voor het economische publiekrecht en diens rol bij het adresseren van belangrijke maatschappelijke vraagstukken, zoals duurzaamheid, digitalisering en economische ongelijkheid. In samenspraak met de collega-hoogleraren en de overige medewerkers van het departement Law &amp; Markets ontwikkelt u vanuit een eigen visie een onderzoekslijn, passend binnen het onderzoeksprofiel van het departement en de faculteit, waarbij wordt samengewerkt met aanpalende rechtsgebieden en niet-juridische disciplines. U levert binnen het departement een concrete bijdrage aan de doorontwikkeling van de facultaire onderzoekstrategie, die zich laat samenvatten onder de noemer &lsquo;<em>Where law meets business&rsquo;</em>, en de universitaire strategie (<a href=\"https://www.eur.nl/over-de-eur/strategie-2024\">https://www.eur.nl/over-de-eur/strategie-2024</a>). De nieuwe leerstoelhouder draagt onder meer bij aan de onderzoeksthema&rsquo;s in het faculteitsbrede sectorplan-onderzoek Publiek-private belangen (https://www.eur.nl/esl/research/public-and-private-interests) en in een of meer van de partnerschappen van ESL binnen de EUR. Zie voor de Erasmus Initiatives &ldquo;Dynamics of Inclusive Prosperity&rdquo; en &ldquo;AIPact&rdquo; <a href=\"https://www.eur.nl/onderzoek/erasmus-initiatives\">https://www.eur.nl/onderzoek/erasmus-initiatives</a>; voor de samenwerking met Leiden en Delft <a href=\"https://www.leiden-delft-erasmus.nl/nl/home\">https://www.leiden-delft-erasmus.nl/nl/home</a> en de Convergentie met Erasmus MC en TU Delft, <a href=\"https://convergence.nl/nl/\">https://convergence.nl/nl/</a>.</p><p>U neemt het initiatief in het verwerven en uitvoeren van tweede en derde geldstroom onderzoek.</p><p>U geeft inhoudelijk (mede) leiding aan al ontwikkelde onderwijsonderdelen van het onderwijsprogramma, onder meer in de bacheloropleiding en initieert verbeteringen en doorontwikkelingen van het huidige masterprogramma. U staat open voor een actieve rol in de ontwikkeling van een nieuw Engelstalig masterprogramma in de lijn van de innovatieve onderzoekstrategie van het departement.</p><p>Het structuurrapport kan worden ingezien via de volgende link: <a href=\"https://www.eur.nl/esl/over/vacatures\">https://www.eur.nl/esl/over/vacatures</a></p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}