{"url": "https://academicpositions.com/ad/university-of-bath/2022/professor-in-electrified-automotive-propulsion-systems/173682", "title": "Professor in Electrified Automotive Propulsion Systems", "publish_date": "2022-01-05", "deadline": "2022-02-28", "location": "Claverton Down Bath, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Assistant Professor", "field": "Automotive Systems Engineering, Mechanical Engineering, Mechanics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Bath", "job_description": "Dept: Mechanical EngineeringCompetitive PackageRef: CF8534RJoin us in this new role that will strengthen our expertise in cutting-edge electrified automotive propulsion research. You will be instrumental in helping shape our future approaches and developing our relationships with industry. Make an impact through harnessing the opportunities created by our new Â£70m Institute of Advanced Automotive Propulsion Systems (IAAPS), along with government and automotive industry investment. Your work on electric propulsion is expected to contribute significantly to the Universityâ\u0080\u0099s and the UKâ\u0080\u0099s climate targets and commitments.About the role:You will lead high-impact research programmes, provide excellent postgraduate research supervision, and deliver high-quality teaching. Making a major contribution to developing our portfolio of high-quality collaborative research in the electrified propulsion field.One of our key areas of activity has always been the development of new experimental and simulation techniques and these areas come together as the industry moves towards a more digital product development process. It will be important for you to help shape the development of new approaches, combining advanced simulation techniques with novel experimental approaches to design a faster, better product development toolchain. More information about this opportunity and associated vacancies can be found here.About you:You will have a proven track record in electrified propulsion of passenger cars, with a particular focus on system-level considerations. Broader experience of the wider automotive propulsion landscape will be advantageous. You will ideally have expertise in Model Based Systems Engineering approaches leading to formal consideration of system level aspects of design, optimisation and validation.It is essential that you have experience working with industry partners to secure funding for and deliver, large research collaborations. Along with an extensive network of close contacts within the industry and academic communities, both in the UK and internationally.About us:The Department of Mechanical Engineering holds a Silver Award for the Athena SWAN scheme, which promotes gender equality among all disciplines. We particularly encourage applications from under-represented groups.This new position will form part of the new Â£70m Institute of Advanced Automotive Propulsion Systems (IAAPS) which is currently under construction and is intended to be one of the top three sites in the world for advanced propulsion systems research. It builds on 40 years of continuous propulsion research and education at the University including the new EPSRC Centre of Doctoral Training (CDT), which over the next five years will provide at least 86 fully funded studentships for a four-year combined training and research programme leading to an MPhil and PhD.The current automotive propulsion research academic team has an excellent track record in delivering industry-relevant projects and has long-established collaborations with industrial partners. This new appointment is expected to benefit from, and contribute to, this strong industry partnership and will also have the freedom to explore fundamental research interests.This is an exciting opportunity to join an expanding research group that is receiving substantial investment from Government, the Automotive Industries and the University.For more information:&nbsp;Applicants must provide a CV and a four-page summary of their expertise and interests to deliver research and teaching in the areas outlined above.A start-up resource package would be available through negotiation&nbsp;Informal enquiries about the post may be made to either:&nbsp;Professor Andrew Plummer, Head, Department of Mechanical Engineering, Tel: +44 (0)1225 386140 Email: A.R.plummer@bath.ac.ukorProfessor Marcelle McManus, Department of Mechanical Engineering, Tel: +44 (0)1225 386854 Email: M.McManus@bath.ac.uClosing date: 28 February 2022.To apply please click hereFind out from our staff what makes the University of Bath a great place to work. Follow us @UniofBath and @UniofBathJobs on Twitter for more information.What we can offer you:Our campus is surrounded by beautiful countryside, and the City of Bath with its historic charm and social activity only a short distance away creates an excellent environment in which to work. We are:a family friendly workplace39 days (pro rata) holiday (annual leave, discretionary days and bank holidays)open to exploring flexible working opportunities which benefit you and the University.recognising of the talents of our diverse workforce through an excellent reward packageencouraging of your personal and professional developmentWe aim to be an inclusive university, where difference is celebrated, respected and encouraged. We truly believe that diversity of experience, perspectives, and backgrounds leads to a better environment for our employees and students, creating a learning environment and organisational culture that enhances health and wellbeing across our community. We are very proud to have recently received Ambassadors for Autism certification and are an accredited Disability Confident Leader; committed to building disability confidence and supporting disabled staff.The University of Bath is an equal opportunities employer and has an excellent international reputation with staff from over 60 different nations. We have made a positive commitment towards gender equality and intersectionality receiving a Silver Athena SWAN award. We are a family-friendly University, with an increasingly agile workforce, we are open to flexible working arrangements. Weâ\u0080\u0099re also proud to be a disability confident employer and are happy to discuss any reasonable adjustments you may require.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Bath ranks highly in the league tables of UK universities published by a number of national newspapers, including the Times, Independent and Guardian.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEyXC8wOFwvVW5pdmVyc2l0eS1vZi1CYXRoLnBuZyIsImVkaXRzIjpbXX0="}