{"url": "https://academicpositions.com/ad/medical-university-graz/2022/phd-positions-in-the-field-of-molecular-medicine-cancer-research-immunology-microbiome-and-aging/175022", "title": "PhD positions in the field of molecular medicine, cancer research, immunology, microbiome and aging", "publish_date": "2022-02-09", "deadline": "2022-03-28", "location": "Auenbruggerplatz 2 Graz, Austria", "city": "N/A", "country": "Austria", "position": "PhD", "field": "Bioinformatics, Biophysics, Biostatistics, Cancer Research, Cell Biology, and 8 moreGenetics,Human Biology,Immunology,Implantology,Medicinal Chemistry,Molecular Biology,Oncology,Orthopedics", "salary": "N/A", "max_working_hours": "N/A", "employer": "The Medical University of Graz", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>Projects starting October 1, 2022</strong></p><p><strong>Application deadline: March 28, 2022</strong></p><p>Join our cutting-edge PhD program at one of Europe's leading Universities in the field of medical research. The Medical University of Graz offers the unique opportunity to work with state-of-the-art techniques and link basic research with clinically-oriented sciences. The close cooperation with the facilities of the Medical University and the infrastructure of the University Hospital Graz will allow you to push the boundaries of classical medical research. It will give you all the tools to publish in high-ranking journals.</p><p><strong>POSITIONS</strong></p><p>The PhD Programs \" Molecular Medicineâ\u0080\u009d (MolMed), â\u0080\u009cImmune Modulation in Respiratory Diseases (RESPImmun) and Metabolic and Cardiovascular Disease (DK-MCD) offer 13 PhD positions with a special focus on cancer research, aging and cardiovascular diseases. As a PhD student, you will be embedded in an interdisciplinary community of supervisors, fellow students and administrative support. PhD students receive a 3-year contract (1 initial year + 2 years extension) including a competitive salary and social benefits.</p><p><strong>THE UNIVERSITY</strong></p><p>The Medical University of Graz is a vibrant future-oriented University in the heart of Austria. Our researchers are highly motivated, future-oriented and innovative and the University has been repeatedly named one of the top universities in the world (among the top 200 universities worldwide according to THE). The Medical University of Graz is located in the Medical Science City Graz, merging space, content, and strategy of basic research institutions, applied clinical research, and patient care at the University Hospital. As a result, Graz is becoming one of the leading medical centers in Europe where science and research is entangled with practical implementation.</p><p><strong>THE CITY</strong></p><p>Graz is located at the heart of the beautiful region of Styria. It is Austria's second-biggest city and enjoys a rich history yet is at the same time filled with modern life. As a university town (there are 6 universities located in the city), Graz offers a young and international atmosphere with a lively cultural scene.</p><p><strong>APPLICATION</strong></p><p>Applications are exclusively accepted through the online platform <a href=\"https://mug.glowbase.com\" target=\"_blank\"><strong>mug.glowbase.com</strong></a>. You do not need to contact the supervisors and do not send any documents by regular mail or e-mail unless you are explicitly asked to do so by our staff. There is no application fee.</p><p><strong>For further information about the programs, open projects, and the online application procedure, please see: </strong><a href=\"https://www.medunigraz.at/phd/application/\" target=\"_blank\"><strong>https://www.medunigraz.at/phd/application/</strong></a><strong> </strong></p><p><strong>Application deadline: March 28, 2022</strong></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI3OGJcLzY0ZFwvNzhiNjRkMDMxMTIyNTZlYTA5YWUwNmQ2ZGUyY2ZiNjYucG5nIiwiZWRpdHMiOltdfQ=="}