{"url": "https://academicpositions.com/ad/wenzhou-kean-university/2022/lecturer-in-history/173661", "title": "Lecturer in History", "publish_date": "2022-01-05", "deadline": "N/A", "location": "88 Daxue Rd, Ouhai, Zhejiang Province Wenzhou, China", "city": "N/A", "country": "China", "position": "Lecturer", "field": "Ancient History, Cultural History, History of Art, History of Geography, History of History, and 7 moreHistory of Mathematics,History of Philosophy,History of Religion,History of Science,Modern History,Museology,Musicology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Wenzhou-Kean University", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>About Wenzhou-Kean University:</strong></p><p><br/> </p><p>Wenzhou-Kean University (WKU), located in Wenzhou, China, one of three Sino-American universities along with NYU Shanghai and Duke Kunshan University, is approved by the Ministry of Education of China. Launched in 2012, WKU offers a unique model of higher education in partnership with Kean University, a comprehensive, public university in the state of New Jersey that is accredited by the Middle States Commission on Higher Education. WKU sits on approximately 500 beautiful acres and currently enrolls about 3,500 undergraduate students, and it is now in the midst of a rapid growth that will bring enrollment to 7,000 students within the next five years. All instruction is in English and all curriculum is provided by Kean University. In addition to its current 18 undergraduate programs, WKU has been approved by the Ministry of Education for offering 8 Masterâ\u0080\u0099s and 3 doctorate programs. Wenzhou is one of the most vibrant and economically advanced developed cities on Chinaâ\u0080\u0099s East Coast, located one hour by plane and just over three hours by high-speed train from Shanghai.</p><p>Wenzhou-Kean University currently offers the following degree programs: Doctor of Educational Leadership (Ed.D.), Biotechnology Science (M.S.), Computer Information Systems (M.S.), Instruction and Curriculum (M.A.), Global Management (M.B.A.), and Architecture (M.Arch.); Finance (B.S.), Accounting (with emphasis on international standards and practices) (B.S.), Global Business (B.S.), Marketing (B.S.), Management (Business Analytics option/ Supply Chain &amp; Information Management option) (B.S.), Economics (B.S.), Graphic Design (B.F.A.), Interior Design (B.F.A), Industrial Design (B.I.D.), Architectural Studies (B.A.), Computer Science (B.S.), Mathematical Sciences (Data Analytics Option) (B.A.), Biology (Cell and Molecular option) (B.S.), Chemistry (B.S.); Earth Science (Environmental Science option) (B.S.); English (English in Global Settings option) (B.A.); Psychology (General option/ Forensic Psychology option)(B.A.); and Communication (Public Relations option) (B.A.). In addition, WKU has a substantial commitment to the teaching of ESL/EFL.</p><p><strong>About the Job:</strong></p><p>College of Liberal Arts at WKU is seeking vibrant candidates to teach history courses including Worlds of History, U.S. History I and II, as well as upper division courses in American Cultural and Business History. The successful candidate will have experience in non-native language acquisition and demonstrated teaching excellence. In addition to teaching, faculty are expected to contribute to the growth of the programs, including, but not limited to: curriculum development, program assessment, student recruitment, and office hours, </p><p>All faculty positions are full-time assignments.</p><p>A Lecturer is a full-time, 12-month employee teaching 39 credits per year or 10-month employee teaching 30 credits per year and provides student and learning support services during the assigned period. Lecturers will be expected to provide high quality teaching, learning support services, service to the university and/or professional community; and perform related work as required. Lecturer positions are non-tenure track and will be renewed on an annual basis.</p><p>Teaching assignments and related responsibilities may include day, evening, weekend and online courses. Interest or experience in using advanced instructional technologies to improve the teaching/learning process is highly desirable. All faculty may be required to teach General Education courses as needed. Opportunities are also available to teach disciplinary support courses. Candidates with an interest in teaching across disciplines are encouraged to apply.</p><p><strong>Qualifications:</strong></p><p>A Masterâ\u0080\u0099s degree is required, but a Ph.D. is strongly preferred in the relevant or a related field for Lecturer positions. A minimum of one year of teaching experience at the post-secondary level and English fluency are required for all positions.</p><p><strong>Application Information:</strong></p><p>Review of applications will begin immediately and continue until positions are filled. Please send cover letter, resume, statement of teaching philosophy, unofficial transcripts and contact information of three professional references by email to Search Committee Chairperson at wkuhistory@wku.edu.cn. Official transcripts for all degrees and three current letters of recommendation are required before appointment.</p><p><strong>Faculty positions at WKU offer:</strong></p><ul><li>Annual salary is commensurate with qualifications and experience with the range from $55,000-$63,000 for lecturers</li><li>A well-rounded healthcare coverage, academic travel up to $2,000, housing options and subsidy up to $3,000, home traveling up to $6,000 (2 international round-trip airfares), a reimbursement to cover relocation expenses up to $1,000, shuttle bus to campus for work, and up to 8% front-load retirement benefits with in accordance with completion of years of service with the University.</li><li>WKU tuition waiver up to 80% for spouse/dependent children of faculty for undergraduate programs.</li><li>A collegial environment.</li><li>The opportunity to teach high quality students with more than a third of graduates being admitted to the graduate schools at the Worldâ\u0080\u0099s Top 50 Universities, and about 60% of graduates at the Worldâ\u0080\u0099s Top 100 Universities.</li><li> </li></ul><p><strong>Background Screening:</strong></p><p>Wenzhou-Kean University conducts background screenings on all job candidates upon acceptance of a contingent offer and may use a third party administrator to conduct background Screenings.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyODNcLzY0NFwvMjgzNjQ0MTViNjFlMWM1NTViMTU2ZjljNjM5MjZmMTYucG5nIiwiZWRpdHMiOltdfQ=="}