{"url": "https://academicpositions.com/ad/ait-austrian-institute-of-technology/2022/junior-scientist-post-doc-m-f-d-for-carrying-out-development-of-plasmonic-biosensors/175158", "title": "Junior Scientist (Post Doc) (m/f/d) for Carrying out Development of Plasmonic Biosensors", "publish_date": "2022-02-11", "deadline": "N/A", "location": "Giefinggasse 4 Vienna, Austria", "city": "N/A", "country": "Austria", "position": "Researcher", "field": "Biophysics, Biotechnology, Molecular Biology, Molecular Chemistry, Nanotechnology, and 3 moreOptics,Plasma Physics,Spectroscopy", "salary": "N/A", "max_working_hours": "N/A", "employer": "AIT Austrian Institute of Technology", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>We are Austriaâ\u0080\u0099s largest Research and Technology Organisation and an international player in the research areas that we cover. This makes us a leading development partner for industry and a top employer in the scientific community. Our Unit <strong>BioSensor Technolgies</strong> is seeking to hire a new Ingenious Partner for our location in Tulln (in immediate vicinity to Vienna):</p><h2>Junior Scientist (Post Doc) (m/f/d) for Carrying out Development of Plasmonic Biosensors</h2><h4>- Biosensor Technologies -</h4><h3>Imagine</h3><ul><li>As part of our Biosensor Technologies team, you will address the future needs for ultrasensitive and fast analysis of trace amounts of chemical and biological species.</li><li>You will work on the international DIPLAB project, in which you will work closely with physicists, polymer chemists, and molecular biologists from the partner organizations: Institute of Macromolecular Chemistry of Czech Academy of Sciences and the Molecular Diagnostics team at Austrian Institute of Technology.</li><li>The aim of this project FWF-GACR DIPLAB is to develop an optical biosensor platform relying on plasmonically amplified sensor response, novel antifouling polymer biointerfaces, and single molecule detection strategy.</li></ul><h3>Engage</h3><ul><li>You will support us in the development of assays and biointerfaces with the use of a novel polymer toolkit.</li><li>You will be responsible for implementing new methods to novel analytical tools and their experimental validation with realistic samples.</li><li>Together with your team, you will be focusing on the development of optical sensor chips with tailored biointerface architectures combining metallic nanostructures and precisely spatially controlled attachment of biofunctional moieties.</li></ul><h3>Achieve</h3><ul><li>You will develop a novel dual amplification strategy taking advantage of molecular machine principle and plasmonic manipulation with fluorescence.</li><li>You will enable the rapid detection of sub-femtomolar concentrations of analytes present in complex biological fluids and its demonstration for the analysis methylated DNA for liquid biopsy.</li></ul><p>Your qualifications as an <strong>Ingenious Partner</strong>:</p><ul><li>PhD in areas relating to biosensor technologies, bioassays, and biointerfaces</li><li>Experience working with optical sensor techniques such as surface plasmon resonance and fluorescence spectroscopy</li><li>Experience working with multiple project partners from different scientific disciplines</li><li>Analytical thinking</li><li>Very good communication skills in English</li></ul><p><strong>What to expect:</strong><br/>The minimum gross annual salary according to the collective agreement is EUR 55.242,60. The actual salary will be determined individually, based on your qualifications and experience. In addition, we offer company benefits, flexible working conditions, individual training and career opportunities.</p><p>At AIT, the promotion of women is important to us - that's why we are especially looking forward to hearing from female applicants!</p><p>Please submit your application documents including CV, motivational letter and certificates online.</p><p><strong>For further information please contact:</strong><br/>Dr. Jakub DOSTALEK, <a href=\"mailto:jakub.dostalek@ait.ac.at\">jakub.dostalek@ait.ac.at</a></p><h4>TOMORROW TODAY - WITH YOU?</h4>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE0XC8xMlwvQUlULnBuZyIsImVkaXRzIjpbXX0="}