{"url": "https://academicpositions.com/ad/imprs-for-molecular-organ-biology/2022/upcoming-phd-positions-at-the-imprs-for-molecular-organ-biology-in-autumn-2022/166202", "title": "Upcoming PhD positions at the IMPRS for Molecular Organ Biology in Autumn 2022", "publish_date": "2022-02-05", "deadline": "2022-11-16", "location": "Ludwigstrasse 43 Friedberg, Germany", "city": "N/A", "country": "Germany", "position": "PhD", "field": "Biochemistry, Biology, Cancer Research, Cell Biology, Chemistry, and 9 moreDevelopmental Biology,Genetics,Medicine,Molecular Biology,Pharmacy & Pharmacology,Physiology,Regenerative Medicine,Respiratory Medicine,Vascular Medicine", "salary": "N/A", "max_working_hours": "N/A", "employer": "IMPRS for Molecular Organ Biology", "job_description": "Thanks to all the academics who submitted their application!The application deadline has passed and the selection process started. More information for the new call-out will come up during this Autumn 2022. Stay tuned!PhD Studies in the Heart of Europe.The International Max Planck Research School for Molecular Organ Biology (IMPRS-MOB) offers fully funded positions to talented and enthusiastic students holding a relevant Masterâ\u0080\u0098s degree. The IMPRS for Molecular Organ Biology is an excellent graduate program hosted by the MPI for Heart and Lung Research in Bad Nauheim and works in close collaboration with Goethe University (Frankfurt) and Justus Liebig University (GieÃ\u009fen). We are dedicated to train, mentor and educate young and talented doctoral students in life sciences and beyond. The PhD program brings together experts from all over the world and provides a vibrant scientific environment throughout your PhD.You will participate in a three-year professional graduate school program including lectures, dedicated seminars, methods courses and retreats, and you will benefit from the scientific offerings of the Max Planck Institute and the affiliated universities. The international and multi-disciplinary approach of the program covers cellular and molecular aspects that control physiological and pathophysiological processes of organ systems. We promote cross-frontier thinking and scientific networking and provide an optimal environment for young and talented scientists to start an academic career in the field of life sciences.Successful candidates can choose a cutting-edge research project in the field of Development Remodeling and Regeneration Stem Cell Biology Developmental&nbsp; Genetics Translational Research Cancer Metabolism Applicants should hold an MSc&nbsp;with a strong background in biological sciences, biochemistry, medicine, pharmacy or a related discipline.&nbsp;WHAT DO WE OFFER?- An international and structured PhD program taught in English- Friendly and multi-disciplinary environment- Excellent career opportunities- State-of-the-art facilities and cutting-edge research projects- Feedback, guidance and mentorship by an individual Thesis Advisory Committee- Fully funded PhD positionINTERESTED?Send us your application and join our vibrant scientific hub! https://imprs-mob.mpg.de", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Our graduate school was founded in 2008 as IMPRS for Heart and Lung Research. After 12 successful years, continued innovation within our faculty and curriculum drove us to change the name of the school in 2020 to \"IMPRS for Molecular Organ Biology\".", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxMzlcLzgzY1wvMTM5ODNjNmY2ZDdlM2M5Mzc4NzMyZDI5OGYwMmZlN2IuanBlZyIsImVkaXRzIjpbXX0="}