{"url": "http://www.academictransfer.com/en/308823/arts-onderzoeker-vaatchirurgie/", "title": "Arts-onderzoeker Vaatchirurgie", "publish_date": "2022-01-31", "deadline": "2022-02-20", "location": "Meibergdreef 9, 1105 AZ, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "PhD", "field": "Gezondheid; Natuurwetenschappen", "salary": "N/A", "max_working_hours": "36", "employer": "Academic Medical Center (AMC)", "job_description": "<p><strong>Wat&nbsp;ga&nbsp;je onderzoeken?</strong><br> Het betreft een langlopend project dat gefinancierd wordt door de AMC-foundation. De afgelopen jaren zijn meerdere collega&rsquo;s binnen dit project gepromoveerd. Het doel van het project genaamd &ldquo;het aneurysmaprogramma&rdquo; is om op termijn de sterfte aan een aneurysma van de abdominale aorta te kunnen verminderen. Daarvoor is eerder o.a. gekeken naar biomarkers en innovatieve beeldvorming om een aneurysma beter in beeld te krijgen, we hebben gekeken naar prognostische factoren en naar man-vrouw verschillen. De bedoeling is om deze onderzoeken verder uit te breiden en te verbreden. Binnen het project is ook een studentonderzoeker aangesteld als datamanager om samen met de PhD student de biobanken uit te breiden.</p><p>De invulling van het onderzoek zal mede afhankelijk van de wensen en de capaciteiten van de aan te stellen PhD student worden vastgesteld.</p><p><strong>Wat&nbsp;ga&nbsp;je doen?</strong><br> Als PhD student bij de Vaatchirurgie ben je verantwoordelijk voor de co&ouml;rdinatie van de bestaande biobanken waarin gegevens en materialen van pati&euml;nten met een aneurysma van de aorta zijn opgeslagen. Je taak omvat het identificeren van kandidaten (pati&euml;nten) voor deelname aan de biobanken, het benaderen van de pati&euml;nten en het vragen om informed consent. Ook pati&euml;nten die in de biobank zijn opgenomen en die voor controle komen moeten op de polispreekuren worden herkend en benaderd voor het verzamelen van vervolggegevens.</p><p>Je hoofdtaak is het doen van onderzoek op het gebied van de pati&euml;nten met een aneurysma. Dit onderzoek kan gelieerd zijn aan de gegevens die in de biobanken verzameld zijn. Je krijgt ook een rol bij trials die wij nu opzetten en kan hier ook over publiceren. Deelname aan een internationale trial staat in de planning.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.amc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/amc-en-wide_TAjdij7/88544601f45a8bc71e9cc74b40c8c85d.png"}