{"url": "https://academicpositions.com/ad/paul-scherrer-institute/2022/group-leader/174968", "title": "Group Leader", "publish_date": "2022-02-07", "deadline": "2022-03-14", "location": "Forschungsstrasse 111 Villigen, Switzerland", "city": "N/A", "country": "Switzerland", "position": "Management", "field": "Environmental Chemistry, Environmental Science, Geochemistry, Materials Chemistry, Nuclear Chemistry, and 1 moreWaste Management", "salary": "N/A", "max_working_hours": "N/A", "employer": "Paul Scherrer Institute (PSI)", "job_description": "The Paul Scherrer Institute PSI is the largest research institute for natural and engineering sciences within Switzerland. We perform cutting-edge research in the fields of matter and materials, energy and environment and human health. By performing fundamental and applied research, we work on sustainable solutions for major challenges facing society, science and economy. PSI is committed to the training of future generations. Therefore, about one quarter of our staff are post-docs, post-graduates or apprentices. Altogether, PSI employs 2100 people.The Laboratory for Waste Management LES conducts multidisciplinary research in the field of the geological disposal of radioactive waste. LES maintains a unique combination of experimental infrastructure and modelling capabilities for studying radionuclide retention and reactive transport processes in the nearâ\u0080\u0090field of cementitious repository systems. The research aspects of waste degradation, reactivity of the barriers, extended interim storage and decommissioning are topics of high relevance in the Swiss waste disposal program. These studies have strong synergies with the fields of environmental engineering, circular economy including carbon capture and sequestration and long-term performance of construction materials.For the development of expert knowledge in the field of \"repository and material chemistryâ\u0080\u009d we are looking for aGroup LeaderCementitious Repository SystemsYour tasksConduct of an experimental research program on the geochemical evolution of underground cementitious repository systems with special focus on nearâ\u0080\u0090field chemistry, radionuclide speciation, materials chemistry and nuclear waste degradation processesSupervision of scientific research projects incl. initiation of new lines of research in collaboration with national and international partner research institutesCoaching of experienced scientists, technical staff and early carrier researchers (PhD, Postdocs). Supervision of the teamâ\u0080\u0099s scientific performance, personnel management, budgetingScientific consulting work for waste disposal implementersYour profileYou hold a PhD degree in materials science, environmental chemistry or related disciplinesYou are an expert in materials science and are interested to continue and broaden the activities of the cement systems groupExperience in radioactive waste disposal research is beneficialPrevious collaboration with waste management organizations and participation in European research programs, as well as your engagement into international networks are a clear advantageYou possess strong leadership qualities and people management skills, innovative thinking and a high motivation to launch collaborative projects in waste management, environmental science and energy researchExcellent knowledge of English is required and knowledge of German is a great advantageWe offerOur institution is based on an interdisciplinary, innovative and dynamic collaboration. You will profit from a systematic training on the job, in addition to personal development possibilities and our pronounced vocational training culture. If you wish to optimally combine work and family life or other personal interests, we are able to support you with our modern employment conditions and the on-site infrastructure.PSI is an equal opportunity employer that is committed to promote diversity, equity and inclusion and strongly encourages applications of qualified female candidates.While the employment contract is initially limited to three years (Tenure Track), long-term employment is envisaged.For further information, please contact Prof. Dr. Sergey Churakov, phone +41 56 310 41 13.Please submit your application online by 14 March 2022 (including list of publications and addresses of referees) for the position as a Group Leader (index no. 4406-00).Paul Scherrer Institut, Human Resources Management, Elke Baumann, 5232 Villigen PSI, Switzerland", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "PSI is the largest research centre for natural and engineering sciences within Switzerland, with its research activities concentrated on three main areas: Matter and Material, Energy and the Environment, and Health.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8wOVwvUFNJLUxvZ28tc2VwLmpwZyIsImVkaXRzIjpbXX0="}