{"url": "https://academicpositions.com/ad/ku-leuven/2022/digital-and-multilingual-communication/174485", "title": "Digital and Multilingual Communication", "publish_date": "2022-01-26", "deadline": "2022-02-14", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Other Category", "field": "Applied Linguistics, Cultural Studies, Media and Communication Studies, Sociolinguistics, Sociology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. ZAP-2021-134)The Faculty of Arts at KU Leuven offers a fulltime tenure-track position (100% assistant professor) for a linguist with expertise in the domain of digital and multilingual communication for organisations. We are looking for candidates who are internationally oriented, have and excellent research record and relevant teaching competence in applied linguistics. The Department of Linguistics at KU Leuven is an internationally oriented centre for research and training in linguistics. The department is committed to a wide range of approaches to the study of language(s), with a focus on different research methods, theoretical frameworks and phenomena. Candidates have a profile that complements the existing expertise within the department and that will help to set up interdisciplinary collaboration with other departments and centres within and beyond the Faculty of Arts at KU Leuven.DutiesResearchYou conduct research in the field of applied linguistics, with a specific focus on digital tools for the production and analysis of multilingual communication in profit and non-profit organisations. In your research, you pay attention to both the production side (digital text design, multimodal design, ..) and the reception side (measuring digital text quality, user evaluation, ..) of digital communication. In your research, you make use of state-of-the-art quantitative and qualitative techniques for linguistic analysis and/or research into user behaviour in digital environments (digital analytics).&nbsp;Next to having a strong applied linguistic profile, you also develop a cross-disciplinary openness to and collaboration with scientific domains in which the analysis of digital communication plays a central role, such as translation studies, communication science, (digital) sociology and the overarching domain of the Digital Humanities. You join the research group in the Department of Linguistics with which your research has the strongest affinity. At the same time, you support and develop initiatives that bridge the gap between your own research and the other disciplines mentioned above, within and beyond the Faculty of Arts (e.g. through active membership in the Centre for Language, Technology and Application at KU Leuven, the Leuven Institute for Artificial Intelligence, Digisoc or initiatives concerning Digital Humanities). You take initiatives to acquire competitive funding and actively participate in the development of future (interdisciplinary) research projects.EducationYou have a regular teaching assignment of 20-25 credits in the Bachelor of Applied Linguistics (KU Leuven - Antwerp Campus) and in two tracks of the Masterâ\u0080\u0099s programme of Multilingual Communication: Digital Content Management (KU Leuven - Campus Antwerp) and Cross-Cultural Communication Management (KU Leuven - Campus Brussels), with a clear commitment to the quality of the programmes as a whole. Your teaching is expected to meet the requirements of an academic programme in terms of level and orientation. Indicatively, the following course units in the Master's programme belong to the teaching assignment of the sought-after candidate:â\u0080¢ Digital tools in multilingual organisations (3 ECTS)â\u0080¢ Process analysis and evaluation of multilingual digital content (3 ECTS)â\u0080¢ Product analysis of multilingual digital content (6 ECTS)â\u0080¢ Communication policy of multilingual organisations (3 ECTS)â\u0080¢ Digital tools for (multilingual) organisations (3 ECTS)The assignment in the bachelor's programme can be determined after consultation with the programme coordinator(s).You also contribute to the pedagogical project of the Faculty of Arts by supervising master's theses in the above-mentioned programmes and by participating in initiatives for the training of young researchers in your field of expertise (e.g. as part of the compulsory doctoral training).Your teaching assignment is primarily situated at the Antwerp Campus and to a lesser extent at the Brussels Campus of KU Leuven, but when appropriate, you are willing to take on teaching assignments on other campuses of the Faculty of Arts as well, and in education programmes related to the above-mentioned courses.You will develop your teaching approach in accordance with the educational vision of KU Leuven, and make use of the opportunities for educational professionalisation offered by the faculty and the university.ServiceYou are prepared to take on internal administrative and management duties, and to assist in intensifying the relations between the programs and the professional field.&nbsp;ProfileYou hold a PhD in Linguistics (or an equivalent relevant degree) with a specific focus on the analysis of (multillingual) digital communication in organizational settings. Your expertise in the qualitative and quantitative analysis of digital communication is of added value to the research activities of the Department of Linguistics and the Faculty of Arts at KU Leuven.You have outstanding didactic qualities in academic education and you have an excellent research record. The quality of your research should be evidenced by high-level international publications.&nbsp;You possess organizational skills and have a collegial spirit.&nbsp;Your application file should include a research proposal for a 3-year period (maximally two pages) and a profile statement outlining your view on teaching (maximally two pages).The teaching assignment for this position consists largely of Dutch-language course units, and KU Leuven's management language is also Dutch. If your knowledge of Dutch is insufficient upon recruitment, KU Leuven will provide a training programme to enable you to attain the required language level. A good command of English is a requirement as well, for example for the course 'Digital tools for (multilingual) organisations' in in the Master's programme of Cross-Cultural Communication Management. KU Leuven also offers courses in English for academic staff.OfferWe offer a fulltime position in an intellectually inspiring environment. KU Leuven is a research-intensive, internationally oriented university that carries out both fundamental and applied scientific research. It is highly inter- and multidisciplinarily focused and strives for international excellence. In this regard, it actively works together with research partners in Belgium and abroad. It provides its students with an academic education that is based on high-quality scientific research.You will be appointed as assistant professor (tenure-track) for a period of 5 years. After this period and a positive evaluation, you are permanently appointed (or tenured) as an associate professor. KU Leuven is well-equipped to welcome foreign professors and their family. The university provides practical support concerning immigration and administration, housing, child care, Dutch courses, career coaching for partners, etc. In order to facilitate scientific integration and research in the first stage of the appointment, a start-up grant of 100.000 Euros is offered to new professors who do not have other substantial research funding.Interested?For more information please contact the dean of the Faculty of Arts, Prof. Dr. Liesbet Heyvaert (Liesbet.heyvaert@kuleuven.be) or the head of the Linguistics Research Unit prof. Dr. Karen Lahousse (karen.lahousse@kuleuven.be).For problems with online applying, please contact solliciteren@kuleuven.be.You can apply for this job no later than February 14, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}