{"url": "https://academicpositions.com/ad/ku-leuven/2022/postdoctoral-position-in-genetics-and-disease-modelling-for-platelet-disorders/175185", "title": "Postdoctoral Position in Genetics and Disease Modelling for Platelet Disorders", "publish_date": "2022-02-11", "deadline": "2022-07-31", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Bioinformatics, Cardiology, Cell Biology, Computational Biology, Genetics, and 2 moreMolecular Biology,Vascular Medicine", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-105)A postdoc position is available in the platelet genetics group in the Center for Molecular and Vascular Biology at KU Leuven. This lab is located on the Gasthuisberg campus of KULeuven in Leuven, Belgium, a rich biomedical research environment neighboring the University Hospital UZLeuven. Project : Today, high throughput-sequencing multi-gene panel tests comprising these genes can diagnose 48 to 26% of patients with platelet formation and function disorders, respectively. Many patients still remain undiagnosed and even with WGS data available, it remains extremely difficult to pinpoint the causative genetic defect because of the hundreds of rare coding variants present. This project therefore aims to deliver a rapid stem cell-based model to study known (but functionally undefined) and novel genes using CRISPR/Cas technology, quantitative in vivo imaging and genetic studies. Novel genes will be obtained from WGS data obtained for undiagnosed patients with very well-known platelet disorders, supplemented with platelet transcriptomes. This will allow WGS data analysis of differentially expressed genes. Validated novel candidate genes will be used to expand our existing diagnostic multi-gene panel test to increase detection of patients with the same IPD. This project will provide novel insights in platelet biology that is of use for therapeutic discoveries.Website unitResponsibilitiesâ\u0080¢ You will have your own dedicated research project studying platelet genetics and disease modellingâ\u0080¢ You will be responsible for administration and execution of the project.&nbsp;â\u0080¢ You will be expected to present the work at conferences, lab meetings, and departmental meetings.&nbsp;Profile* You are expected to have strong genetics, molecular biology and cell culture skills. Knowledge of bioinformatics is an added value.&nbsp;* The project involves mostly in vitro cell culture work and the bioinformatic analysis of genomes and transcriptomes. &nbsp;â\u0080¢ A good publication record, with at least one paper in a higher-impact journal.* The candidate is expected to apply for a Postdoc grant, for example through the Flemish research&nbsp;funds (Fonds Wetenschappelijk Onderzoek).Offerâ\u0097\u008f&nbsp;A full-time (100%) postdoctoral fellowship for one year (which will be extended after applying for a fellowship).â\u0097\u008f&nbsp;Access to state-of-the-art technologies and a rich training environmentInterested?For more information please contact Prof. dr. Kathleen Freson, tel.: +32 16 32 27 07, mail: kathleen.freson@kuleuven.be.You can apply for this job no later than July 31, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}