{"url": "http://www.academictransfer.com/en/309291/student-life-officer/", "title": "Student Life Officer", "publish_date": "2022-02-09", "deadline": "2022-02-25", "location": "Science Park 904, 1098 XH, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "Other Category", "field": "Natural sciences", "salary": "â\u0082¬2846â\u0080\u0094â\u0082¬4490 per month", "max_working_hours": "27", "employer": "University of Amsterdam (UvA)", "job_description": "<p>Are you a calm self-motivated fast learner who is passionate about student well-being, welfare and safety? Do you get excited by promoting a culture of inclusion in which all of our students are able to thrive and succeed? Then we are excited to hear from you for a temporary position as Student Life Officer (SLO), in order to cover the maternity leave of a colleague.</p><p><strong>What are you going to do</strong></p><p>As our temporary Student Life Officer, you will work closely with our other SLO and our colleagues who are responsible for supporting students&rsquo; welfare and well-being.</p><p>You will be expected to:</p><ul> <li>provide one-on-one sensitive and confidential support for individual students experiencing difficulties in living and/or studying at AUC, and refer them to professional services as required;</li> <li>help coordinate the AUC Well-being Team of Resident Assistants, Peer Supporters, and Graduate Assistants and maximise their potential.</li> </ul>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>What do we require</strong></p>\n<p>You are a service-oriented student adviser/counsellor who loves to promote a culture of inclusion. You are approachable, able to work independently, and are oriented towards continuous improvement and optimisation. You’re also:</p>\n<ul>\n<li>preferably experienced in student advising or counselling. A background in psychology can be an advantage;</li>\n<li>able to act with tact, diplomacy, discretion and respect for confidentiality and data privacy;</li>\n<li>able to use well-developed interpersonal and intercultural communication skills;</li>\n<li>able to communicate fluently in English (at least high B2 CEFR) and preferably also good skills in Dutch.</li>\n</ul>\n<p>Because of the coronavirus measures, you may need to work from home for at least part of the time (AUC will provide a laptop). You will need to be able to access an adequate WiFi/internet connection in order to take part in online meetings and work remotely.</p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 4 months.</p>\n<p><strong>Our offer </strong></p>\n<p>We offer a temporary employment contract for four months with UvA Jobservice, preferably starting before 7 May 2022, in order to cover the maternity leave of a colleague. If you prove to be a good match for the job, then an extension of maximum three months may be possible (total seven months maximum). The employment contract is for 27 hours a week (approx 3.5 days).</p>\n<p>Your salary, depending on your relevant experience on commencement of the employment contract, ranges between €2,846 to €4,490 gross per month on the basis of a full working week of 38 hours. This sum does not include the 8% holiday allowance and the 8.3% year-end allowance. The <a href=\"https://www.universiteitenvannederland.nl/en_GB/cao-universiteiten.html\">Collective Labour Agreement for Dutch Universities </a>(CAO NU) is applicable.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>University of Amsterdam</h4>\n<p>With over 6,000 employees, 30,000 students and a budget of more than 600 million euros, the <a href=\"http://www.uva.nl/en\">University of Amsterdam (UvA)</a> is an intellectual hub within the Netherlands. Teaching and research at the UvA are conducted within seven faculties: Humanities, Social and Behavioural Sciences, Economics and Business, Law, Science, Medicine and Dentistry. Housed on four city campuses in or near the heart of Amsterdam, where disciplines come together and interact, the faculties have close links with thousands of researchers and hundreds of institutions at home and abroad.  </p>\n<p>The UvA’s students and employees are independent thinkers, competent rebels who dare to question dogmas and aren’t satisfied with easy answers and standard solutions. To work at the UvA is to work in an independent, creative, innovative and international climate characterised by an open atmosphere and a genuine engagement with the city of Amsterdam and society.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Questions</strong></p>\n<p>If you have any questions about the position, please contact (during office hours):</p>\n<ul>\n<li><a href=\"mailto:a.k.m.kekkonen@auc.nl\">Aino Kekkonen</a></li>\n<li>T: +31 (0)20 525 7111</li>\n</ul>\n<p> </p>\n<p> </p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uva.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uva-en-wide/22e1319f66e44f07d56047b996668aa9.png"}