{"url": "https://www.academictransfer.com/en/309274/phd-candidate-assessing-childrens-deep-reading-comprehension-processes-and-outcomes/apply/", "title": "PhD Candidate: Assessing Children's Deep Reading Comprehension Processes and Outcomes", "publish_date": "2022-02-09", "deadline": "2022-03-06", "location": "Houtlaan 4, 6525 XZ, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "PhD", "field": "Language and culture", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "N/A", "employer": "Radboud University", "job_description": "<em>How well can primary school children read texts? That is what you aim to find out as a PhD candidate. In this joint study between Radboud University’s BSI lab and Cito, you will use eye tracking and EEG to understand children’s reading processes and reading outcomes to a new level.</em><br>We are looking for a PhD candidate on the joined Stichting Cito/ BSI project ’Assessing Children's Deep Reading Comprehension Processes and Outcomes’.  The aim of the project is to validate a measure of reading comprehension in primary school children in which the outcome of the reading process, the situation model, is assessed. The focus is on comprehension of narrative and expository texts, and on not only the reading outcome, but also on the reading process (such as inattention during reading/mind wandering). <br><br>The project involves three studies, and includes eye-tracking and EEG. This project will be embedded in a larger Vici grant project called ‘Opportunities and Challenges in the Children's Comprehension of Multiple Digital Texts’ conducted by two PhD candidates and two postdoctoral researchers at BSI and Stichting Cito. As part of this position, you will have a teaching load of 10%. ", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You hold a Research Masterâ\u0080\u0099s degree in social sciences (or a related discipline) and have a proven interest in research methodology, statistics and educational measurement.</li>\n<li>You have experience with data collection, psychometric data analysis, computer programming, and conducting research at primary schools.</li>\n<li>Experience with EEG and eye tracking is an advantage.</li>\n<li>You should have excellent oral and writing skills in Dutch and English.</li>\n<li>You have organisational talent, showing independence and perseverance.</li>\n<li>You have an independent, flexible and proactive work style, as well as good collaborative and communication skills.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 5 years.</p>\n<ul>\n<li>Employment for 0.8 FTE.</li>\n<li>The gross starting salary amounts to a minimum of â\u0082¬2,443 per month based on a 38-hour working week, and will increase to â\u0082¬3,122 from the fourth year onwards (<a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/\">salary scale P</a>).</li>\n<li>You will receive 8% holiday allowance and 8.3% end-of-year bonus.</li>\n<li>You will be appointed for an initial period of 18 months, after which your performance will be evaluated. If the evaluation is positive, the contract will be extended by 3.5 years (5 year contract).</li>\n<li>You will be able to use our <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/our-way-working-personal-approach/dual-career-family-support-service/\">Dual Career and Family Care Services</a>. Our Dual Career and Family Care Officer can assist you with family-related support, help your partner or spouse prepare for the local labour market, provide customized support in their search for employmentÂ  and help your family settle in Nijmegen.</li>\n<li>Working for us means getting extra days off. In case of full-time employment, you can choose <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/more-info-working/flexible-working-times/\">between 29 or 41</a> days of annual leave instead of the legally allotted 20.</li>\n</ul>\n<em>Additional employment conditions</em>\nWork and science require good employment practices. This is reflected in Radboud University's primary and secondary <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/\">employment conditions</a>. You can make arrangements for the best possible work-life balance with flexible working hours, various leave arrangements and working from home. You are also able to compose part of your employment conditions yourself, for example, exchange income for extra leave days and receive a reimbursement for your sports subscription. And of course, we offer a good pension plan. You are given plenty of room and responsibility to develop your talents and realise your ambitions. Therefore, we provide various training and development schemes.\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>The project is a collaboration between the Behavioural Science Institute at Radboud University (<a href=\"http://www.ru.nl/bsi/\">BSI</a>) and the Research and Innovation at Stichting Cito (<a href=\"http://www.cito.nl/kennis-en-innovatie/\">OK&amp;I</a>). You will conduct the project partly at Radboud University and partly at Stichting Cito.<br/><br/>The BSI is a multidisciplinary research institute and one of three research institutes in the Faculty of Social Sciences at Radboud University. Our researchers collaborate across the boundaries of psychology, educational science, and communication science. Our mission is to strengthen people through understanding the foundations of human behaviour, by creating synergy between different paradigms and by facilitating craftsmanship, curiosity and connection in academic research.</p>\n<p>BSI has seven research programmes covering three major research themes: 1) development and learning, 2) health and mental health, and 3) social processes and communication. BSI conducts fundamental as well as applied/translational research andÂ  has excellent facilities and support for lab and field research.<br/><br/>You will work in BSI's Learning and Plasticity group, whose research programme focuses on learning and development in typical and atypical populations. Intervention studies on individuals with a variety of disorders as well as on those at risk are also conducted to yield a better understanding of the dynamic factors that can prevent or remediate learning problems. Â <br/><strong><em><br/></em></strong>Stichting Cito is a not-for-profit institution whose measurement and monitoring methods enable its clients to obtain optimal information on the knowledge, skills and competences of examinees and test takers. Founded in 1968 by the Dutch government, Cito was one of the pioneering national institutes for educational measurement. Since 2018, Cito has a specialist department dedicated to R&amp;D: the Research and Innovation Department (in Dutch: OK&amp;I - Onderzoek, Kennis en Innovatie). Through innovative research and innovation projects, OKI continuously works on the development of new assessment and monitoring tools for the classroom.<br/><br/>You will work in the Educational Research sub-unit<em>. </em>This sub-unit conducts applied scientific research in the field of educational measurement. Its research usually starts with a question or problem from practice and aims to develop new knowledge for use in the classroom. Innovative measurement is one of its focal points.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For questions about the position, please contact Eliane Segers, Professor at +31 24 361 28 22 or <a href=\"mailto:eliane.segers@ru.nl\">eliane.segers@ru.nl</a>. Alternatively, you can contact Jos Keuning, Senior Research Scientist / Head of Educational Research at +31 26 352 13 46 or <a href=\"mailto:jos.keuning@cto.nl\">jos.keuning@cto.nl</a>.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.ru.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/run-en-wide/13abf0bc0a611f32246d62b46488f997.jpg"}