{"url": "https://academicpositions.com/ad/leiden-university/2022/assistant-professor-english-sociohistorical-linguistics/174217", "title": "Assistant Professor English Sociohistorical Linguistics", "publish_date": "2022-01-19", "deadline": "2022-02-28", "location": "Rapenburg 70 Leiden, Netherlands", "city": "N/A", "country": "Netherlands", "position": "Assistant Professor", "field": "Applied Linguistics, Historical Linguistics, History of Linguistics, Philology, Sociolinguistics, and 1 moreWest Germanic languages", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "Vacancy number 22-027 10561Function type Academic staffExternal/ internal ExternalPlaced on 18 January 2022Closing date 28 February 2022 40 more days to applyThe&nbsp;Faculty of Humanities, Leiden University Centre for Linguistics (LUCL)&nbsp;is looking for a:Assistant Professor English Sociohistorical Linguistics&nbsp;(0,80&nbsp;FTE)Vacancy number: 22-027 10561&nbsp;Leiden University is looking for an assistant professor to conduct research and teach&nbsp;in the BA-programme English Language and Culture and the MA Linguistics&nbsp;in Leiden as well as in interdisciplinary programs in The Hague.The lecturer will hold a position within the Leiden University Centre for Linguistics and teach courses as needed in the BA-programme English Language and Culture and the MA Linguistics. Depending on the specific expertise and needs, the lecturer will also teach in other programmes in Leiden (BA Linguistics) and The Hague (Leiden University College, BA International Studies). Applications are invited from an English Historical Linguist or Sociolinguist, with particular preference given to scholars who work on topics related to language change on a range of linguistic levels in varieties of Early and Late Modern English. We especially welcome applicants who have experience with palaeography, archive work, digitization of historical manuscripts, and corpus linguistics with a focus on standardization and dialect contact.Key responsibilitiesâ\u0080¢&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Developing, teaching, and co-ordinating courses on the history of the English language, especially courses with a focus on Early and Late Modern English. In our BA- and MA-programmes we would also welcome expertise in philology courses taught from a sociolinguistic perspective (e.g., Dialect Contact, Language and Power, Language and Gender);â\u0080¢&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Participating in the development and implementation of educational innovations, also in digital form, such as introducing digital tools for teachers of English and digitization of manuscript material for the purpose of historical sociolinguistic research;â\u0080¢&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Supervising student internships, excursions, and BA and (Res)MA theses, both in Dutch and in English;â\u0080¢&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Playing an active role in recruiting students by contributing to the online matching module, open days, orientation and information sessions;â\u0080¢&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Conducting research based on an individual research plan within one of the research programmes of LUCL and presenting the results in the form of publications, conference presentations and other means to academic, professional/societal partners and wider audiences;â\u0080¢&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Acquiring project funding at national, European and international level.â\u0080¢&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Fulfilling administrative duties within the programme, the LUCL institute and/or the Faculty of Humanities;â\u0080¢&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Bringing and building up an extensive (inter)national network in the working field.Selection criteriaYou hold a PhD degree in English linguistics, with a focus on the history of English in a social context;* You are aware of current issues, viewpoints and innovative methods within the field of English historical linguistics;* You have a strong academic teaching record, both on BA and MA level, as demonstrated by teaching evaluations and a BKO registration (or willingness to obtain the nationally standardized University Teaching Qualification within two years);* You are a committed and inspiring teacher, with an inclusive approach to education and the ability to engage a diverse community of BA and MA students;* You have a research profile that fits within LUCL and a proven track record of research, as demonstrated by a list of peer-reviewed publications commensurate with career stage;* You have a track record in digital corpus development, use of corpus tools and digitization of historical records for sociolinguistic research;* You are a clear communicator and team player, enthusiastic to collaborate across disciplinary boundaries, in both teaching and research;* You possess (near) native proficiency in the languages of instruction, Dutch and English (or willingness to master the relevant level of fluency in Dutch within two years).Our organisationThe Faculty of Humanities is rich in expertise in fields such as philosophy, religious studies, history, art history, literature, linguistics and area studies covering nearly every region of the world. With its staff of 995, the faculty provides 27 masterâ\u0080\u0099s and 25 bachelorâ\u0080\u0099s programmes for over 7,000 students based at locations in Leiden and in&nbsp;The Hague. For more information:&nbsp;https://www.universiteitleiden.nl/en/humanities.The Faculty has seven Institutes, among which the Leiden University Centre for Linguistics (https://www.lucl.nl/). LUCL has a longstanding tradition in the study of the worldâ\u0080\u0099s languages and features unique linguistic expertise. Current theoretical insights are combined with modern experimental methods in its research profile area â\u0080\u0098Language Diversity in the Worldâ\u0080\u0099.Terms and conditionsWe offer an 0,8 fte temporary appointment of one year. This position may lead to a permanent appointment depending on good performance.&nbsp;Salary range&nbsp;from â\u0082¬3821.- to â\u0082¬5230.- gross per month (pay scale 11) based on fulltime employment&nbsp;in accordance with the Collective Labour Agreement for Dutch Universities and commensurate with qualifications and experience.&nbsp;The lecturer may start at the appropriate step in scale 10 until they fully meet the requirements for scale 11 as specified by the Faculty of Humanities.&nbsp;The intended starting date is 1 August 2022.&nbsp;Leiden University offers an attractive benefits package with additional holiday (8%) and end-of-year bonuses(8.3 %), training and career development and sabbatical leave. Our individual choices model gives you some freedom to assemble your own set of terms and conditions.&nbsp;For international spouses we have set up a dual career programme.&nbsp;Candidates from outside the Netherlands may be eligible for a substantial tax break.&nbsp;More at&nbsp;https://www.universiteitleiden.nl/en/working-at/job-application-procedure-and-employment-conditions.Leiden University requires teaching staff to obtain the University Teaching Qualification (UTQ). If the successful applicant does not already&nbsp;possess this qualification or its equivalent, he/ she must be willing to obtain this Qualification within two years.Diversity and inclusionWe firmly believe that diversity together with inclusion is the key driving force for creativity and innovative ideas. We strive to create a working environment where everyone feels empowered to bring their full, authentic selves to work.&nbsp;InformationEnquiries can be made to Prof. Janet Grijzenhout, e-mail&nbsp;j.grijzenhout@hum.leidenuniv.nl&nbsp;Prof. Janet Grijzenhout holds the chair of English linguistics. For practical questions, please contact the Institute Manager, Maarit van Gammeren, e-mail&nbsp;m.s.k.van.gammeren@hum.leidenuniv.nl.ApplicationsPlease submit your application&nbsp;online&nbsp;no later than&nbsp;28 February 2022&nbsp;via the&nbsp;blue button&nbsp;in&nbsp;our application system. Your application should include:A CV including education and employment history, publications, and courses taught;&nbsp;A letter of motivation outlining a research agenda in the field of English Sociohistorical linguistics &nbsp;(max 2 pages);&nbsp;Two sample course descriptions;Names, positions, and email addresses of three referees (no reference letters at this point).Interviews will be held in end of March/ beginning of April. A teaching presentation will be part of the procedure.You are kindly requested to be available in this period.Enquiries from agencies are not appreciated.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Leiden University was founded in 1575 and is one of Europeâ\u0080\u0099s leading international research universities.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5NWZcLzc3Y1wvOTVmNzdjYjE3YjNmODExNDlkZmNlYmIyYWRmYzc1MWQucG5nIiwiZWRpdHMiOltdfQ=="}