{"url": "https://academicpositions.com/ad/imec/2022/postdoctoral-researcher-high-throughput-chip-based-fluorescence-microscopy/175143", "title": "Postdoctoral Researcher High-throughput chip-based fluorescence microscopy", "publish_date": "2022-02-10", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Applied Physics, Engineering Physics, Image Processing, Optics, Photonics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Integrated photonics enabling a completely new way of doing microscopy.What you will doWithin imecâ\u0080\u0099s Life Science Technologies department, our groupâ\u0080\u0099s R&amp;D activities focus on the development of novel tools for diagnostic health care applications. We are looking for a motivated PhD or postdoc to join us to work on high-resolution imaging using integrated photonics.Fluorescence microscopy is an indispensable tool in biology and medicine and has fuelled many breakthroughs in a wide set of sub-domains. The microscopes, however, are often bulky and expensive systems that require regular maintenance. Additionally, they need to strike a compromise between device size, the size of the field of view, and resolution.The next big push in microscopy with a large societal impact will come from compact, cost-effective, and robust optical systems that will make fluorescence microscopy highly accessible.&nbsp;At imec, within the framework of an ERC starting grant, we are working on facilitating this next breakthrough by introducing a novel high-resolution imaging platform based entirely on an intimate marriage of active on-chip photonics and CMOS image sensors. This concept will eliminate the necessity of standard free-space optical components by integrating specially designed structured optical illumination, illumination modulation, optical filters, and an image sensor in a single chip. The way the sample is illuminated is analogues to total internal reflection fluorescence (TIRF) microscopy, which has excellent surface sensitivity and background suppression. The resulting platform will enable high-resolution, fast, robust, zero-maintenance, and inexpensive microscopy with applications reaching from cellomics to DNA sequencing, proteomics, and highly parallelized optical biosensors.Your primary goal is to further mature the concept and platform. Your work consists of establishing a system model including image reconstruction, the design and characterization of photonic components, and finally, proof of concept demonstrations.The fabrication of the photonic integrated circuits will be carried out in imecâ\u0080\u0099s semiconductor pilot line, and during the entire design/fabrication cycle you will closely interact with process integration engineers. The characterization will be carried out in imecâ\u0080\u0099s life lab, where you will work together with an international, multidisciplinary team of PhDs and senior researchers.What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will determine the society of tomorrow.We are committed to being an inclusive employer and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a competitive salary with many fringe benefits.&nbsp;Who you areA PhD in physics and engineeringTheoretical understanding of, and experience with, integrated photonics, wave optics, structured illumination techniques or image reconstruction algorithms is an assetHands-on experiences with advanced numerical simulation tools (Matlab, Python, Lumerical FDTD, Comsol, â\u0080¦)Self-motivated, innovative, results driven, and a team-playerGood English language skills to work in imecâ\u0080\u0099s international environment.This postdoctoral position is funded by imec through KU Leuven. Because of the specific financing statute which targets international mobility for postdocs, only candidates who did not stay or work/study in Belgium for more than 24 months in the past 3 years can be considered for the position (short stays such as holiday, participation in conferences, etc. are not taken into account).&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}