{"url": "https://academicpositions.com/ad/university-of-antwerp/2022/project-manager-in-5g-6g-programmable-networks/175179", "title": "Project Manager in 5G/6G Programmable networks", "publish_date": "2022-02-11", "deadline": "N/A", "location": "Prinsstraat 13 Antwerp, Belgium", "city": "N/A", "country": "Belgium", "position": "Management", "field": "Communication Engineering, Computational Engineering, Computer Communications (Networks), Computer Engineering, Electronics, and 3 moreProgramming Languages,Software Engineering,Telecommunications Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Antwerp", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><i><strong>IMEC</strong></i></p><p>imec is a world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique. By leveraging our world-class infrastructure and local and global ecosystem of partners across a multitude of industries, we create groundbreaking innovation in application domains such as healthcare, smart cities and mobility, logistics and manufacturing, and energy.</p><p>As a trusted partner for companies, start-ups and universities we bring together close to 3,500 brilliant minds from over 70 nationalities. Imec is headquartered in Leuven, Belgium and also has distributed R&amp;D groups at a number of Flemish universities, in the Netherlands, Taiwan, USA, China, and offices in India and Japan. All of these particular traits make imec a top-class employer.</p><p><i><strong>University of Antwerp â\u0080\u0093 imec IDLab Research group</strong></i></p><p>The Internet &amp; Data Lab (IDLab) is an imec research group at the University of Antwerp and Ghent University. IDLab focuses its research on internet technologies and data science. IDLab is a joint research initiative between Ghent University and the University of Antwerp. Bringing together 300 internet experts, we develop technologies outperforming current solutions for communication subsystems, high speed and low power networking, distributed computing and multimedia processing, machine learning, artificial intelligence and web semantics. Within Antwerp, where you will work, the overall IDLab research areas are machine learning and wireless networking. IDLab has a unique research infrastructure used in numerous national and international collaborations.</p><p>IDLab collaborates with many universities and research centres worldwide and jointly develops advanced technologies with industry (R&amp;D centers from international companies, Flandersâ\u0080\u0099 top innovating large companies and SMEs, as well as numerous ambitious startups).</p><p><i><strong>Context</strong></i></p><p>For further development of the IDLab wireless networking cluster, we are looking for a Senior Project Manager in Network Programmability for 5G / 6G with strong experience in collaborative projects with industry.</p><p>The position is linked to the Flexible Networking Group led by Prof. Johann Marquez-Barja. The group performs research on:</p><ul><li>Flexible end-to-end architectures: focusing on the control and data planes for fast orchestration, control, and monitoring of the different networking components within the complete network/communication chain ranging from end-devices at the wireless RAN segment up to the computing servers at the wired core segment.</li><li>Heterogeneous networking: focusing on the heterogeneous and dense wireless environments â\u0080\u0093ranging from short to long range technologies Bluetooth, Zigbee, Wi-Fi, LTE, 5G-- by relying on self-adaptive and learning-based approaches.</li><li>Programmable functionality: focusing on the functional plane for optimizing the placement of NetApps or VNF-based functions to improve the services and the connectivity along the different network domains such as RAN, MEC, core, Cloud.</li></ul><p><i><strong>The job</strong></i></p><ul><li>You will initiate and support the preparation of new research proposals for regional, national and European projects, both in fundamental and collaborative programs, with a research topic related to 5G/6G technologies, leveraging software-defined techniques.</li><li>You will be responsible for the management of research projects in the context of wireless networks, with a strong focus on the 5G and 6G architectures (RAN+Core).</li><li>You follow up on progress within research projects and are able to communicate the accomplished / in-process work to internal and external stakeholders and adapt where needed. You lead a technical team going forward in implementing research projects.</li><li>You will implement your research ideas within the context of several regional and EU funded research projects, collaborating with world-wide industrial partners</li><li>You interface and collaborate on a technical level with partners from industry and academia.</li><li>You will collaborate with other IDLab colleagues across research expertise in the scope of 5G/B5G technologies and also from the Network Management field.</li></ul><p><i><strong>What we offer</strong></i></p><ul><li>An attractive monthly stipend</li><li>You will join an international &amp; multicultural research team investigating 5G / 6G networks and beyond</li><li>You will have the chance to lead and be actively involved in prestigious regional and European research projects working with leading industrial players, academic teams and SMEs in Flanders and around Europe</li><li>You will have the chance to deploy your research in a real setting (Smart Highway, a V2X testbed on a highway in Antwerp and Citylab/City of Things, a multi-access wireless smart city located in Antwerp)</li><li>You will have resources to attend and publish the outcome of your research in high-impact international conferences in the area of communications network</li></ul><h3><strong>Job requirements</strong></h3><ul><li>You have an MSc or PhD in Computer Engineering, Computer Science, Telecommunications Engineering, Electronics Engineering, or related fields.</li><li>You are able to translate research challenges into opportunities for industrial collaboration.</li><li>You are knowledgeable in the network protocol stack, from physical to application layer.</li><li>You must be knowledgable in 3GPP based networks (Rel. 15+), it is desirable that you also know IEEE 802.11 based networks (Wifi 5 and 6)</li><li>You must be familiar with software-defined concepts and the different planes of softwarized solutions such as SDR, SDN, NFV.</li><li>You are a team player and have strong communication skills.</li><li>You can translate the business requirements of partners into technical challenges, and â\u0080\u0093 together with researchers â\u0080\u0093 define clear methodologies for addressing them across different application domains.</li><li>Having experience in collaborating with industry in Flanders is considered a strong plus</li><li>You can speak English fluently. Speaking Dutch is considered a strong plus.</li></ul>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJlY2FcLzc1NlwvZWNhNzU2NzRiYmMzZGVlNjNmNjk0MWRmZTdmYWRmYTAucG5nIiwiZWRpdHMiOltdfQ=="}