{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/research-fellow-fixed-term-part-time/175114", "title": "Research Fellow (Fixed term, Part time)", "publish_date": "2022-02-10", "deadline": "2022-02-21", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Postdoc", "field": "Modern History, Museology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference ARTS052122Closing Date Monday, 21st February 2022Job Type ResearchDepartment HistorySalary Â£31406 per annum pro-rataApplications are invited for the above post based at The University of Nottingham, University Park, with a base in the School of Humanities, Department of History.The purpose of this role will be to work with the Nottingham City Councilâ\u0080\u0099s Museums and Galleries Service in the renovation of the Nottingham Industrial Museum. The specific focus will be on the cityâ\u0080\u0099s heritage regarding lace manufacture and trade. The successful candidate will work with research already conducted to help bring a more international dimension to the local history of the Lace Market, Nottingham.&nbsp;The successful candidate will meet regularly both remotely and in-person with their line manager and the team in the Museums and Galleries Service in Nottingham. The person appointed will have the opportunity to use their initiative and creativity to identify areas for research, develop research methods, and extend their research portfolio, particularly with regard to public impact.Applications are welcome from those who have completed a PhD in history, with specific interests in international relations, industry, and/or trade from the eighteenth to twentieth centuries. Working in public history would be essential.The person appointed will have the opportunity to use their initiative and creativity to identify areas for research, develop research methods, and extend their research portfolio.We warmly welcome applications from under-represented groups, regardless of gender, race, colour, nationality, ethnic or national origin, age, socio-economic background, disability, religious or political beliefs, trade union membership, family circumstances, sexual orientation or other irrelevant distinction. We are proud to have an Athena Swan Bronze Award recognising good practice towards the advancement of gender equality in our school.Our school uses anonymised recruitment for shortlisting, where we cannot see any personal data in your application, until shortlisting has been completed (you will apply by answering criteria-based questions relating to the person specification, rather than submitting a CV). We welcome applications from everyone, regardless of the categories you put yourself in.This post will be offered on a fixed-term contract from 1st April 2022 until 31st July 2022.Hours of work are part-time at 0.5fte (18.13 hrs per week). Days of work per week can be flexible, but the candidate will be expected to attend scheduled online and in-person meetings with relevant parties in Nottingham. It is anticipated that this work may extend into the summer, rather than end with the academic year.Informal enquiries may be addressed to Dr. David Gehring at david.gehring@nottingham.ac.uk. Please note that applications sent directly to this email address will not be accepted.Our University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileAdditional InformationApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}