{"url": "https://academicpositions.com/ad/university-namur/2022/postdoctoral-position-in-applied-mathematics/174141", "title": "Postdoctoral position in Applied Mathematics", "publish_date": "2022-01-18", "deadline": "N/A", "location": "rue de Bruxelles 61 Namur, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Applied Mathematics, Control Systems Engineering, Systems Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Namur", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>University faculty</strong> : Sciences<br/><strong>Department</strong> : Mathematics - naXys research institute<br/><strong>Grade</strong> : researcher<br/><strong>Contract</strong> : fixed term contract<br/><strong>Category</strong> : scientific personnel<br/><strong>Allocation</strong> : University staff</p><h3>Responsabilities</h3><p><strong>Responsibilities</strong></p><p>This position is funded by the project â\u0080\u009cModular Koopman-operator based representations for nonlinear network identificationâ\u0080\u009d (KORNET), a joint project between the naXys research institute at the University of Namur (PI: Alexandre Mauroy) and the ICTEAM/INMA institute at UCLouvain (PI: Julien Hendrickx). The researcher will be affiliated with the naXys research institute in Namur, but will spend 20% of his/her time at the ICTEAM/INMA institute in Louvain-la-Neuve. The goal of the Kornet project is to leverage Koopman operator theory in the context of nonlinear network identification. In particular, the selected candidate will develop a modular Koopman operator-based representation of interconnected dynamical systems, which preserves and exploits network structure.</p><p><strong>Environment</strong></p><p>The University of Namur (UNamur) is located in the center of Belgium, in the French-speaking part of the country. It offers quality education to more than 7,000 students every year, and hosts more than 900 researchers in all fields of expertise. More info: <a href=\"https://www.unamur.be/en/institution/index\" target=\"_blank\">https://www.unamur.be/en/institution/index</a> The naXys institute brings together 25 professors and more than 50 researchers working on complex systems in a broad sense, including systems theory, network science, graph theory, control theory, statistics, optimization, and applications to celestial mechanics, cosmology, economics, and optical engineering, to list a few. More info: <a href=\"https://www.naxys.be/\" target=\"_blank\">https://www.naxys.be</a></p><h3>Profile</h3><p>The candidate must hold a PhD degree in Mathematics or Control Engineering (or equivalent). He/she is expected to have a solid background in Applied Mathematics, with a keen interest in learning theoretical concepts but also in developing practical methodologies for applications. Specific knowledge of operator theory, networked dynamics, control theory, and/or system identification will be appreciated. Past research work in Koopman operator theory will be considered as a plus.</p><p>To be eligible, the candidate must have a PhD degree for 6 years maximum at the beginning of the postdoctoral fellowship and must not have resided or carried out his/her main activity (job, studies...) in Belgium for more than 24 months during the last 3 years.</p><h3>Additional information</h3><p>â\u0080¢ <strong>Expected start date</strong>: February 1st â\u0080\u0093 July 1st 2022</p><p>â\u0080¢ <strong>Duration</strong>: 1 year (possibly renewable for 1 year)</p><p>â\u0080¢ <strong>Contact persons</strong>: Prof. A. Mauroy (<a href=\"mailto:alexandre.mauroy@unamur.be\">alexandre.mauroy@unamur.be</a>) and Prof. J. Hendrickx (<a href=\"mailto:julien.hendrickx@uclouvain.be\">julien.hendrickx@uclouvain.be</a>)</p><h3>Remarks</h3><p><strong>Contract</strong>: 1 year.</p><p><strong>How to apply?</strong></p><p>Interested candidates should send their CV, application letter, and the name of two referees to Prof. A. Mauroy (<a href=\"mailto:alexandre.mauroy@unamur.be\">alexandre.mauroy@unamur.be</a>).</p><p>A position related to the same project is available in the group of Prof. J. Hendrickx (<a href=\"mailto:julien.hendrickx@uclouvain.be\">julien.hendrickx@uclouvain.be</a>) at UCLouvain.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE1XC8wNFwvbmFtdXIuanBnIiwiZWRpdHMiOltdfQ=="}