{"url": "https://academicpositions.com/ad/ghent-university/2022/assistant-22595-pharmaceutical-analysis/175092", "title": "Assistant (22595) - Pharmaceutical analysis", "publish_date": "2022-02-09", "deadline": "2022-03-01", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Research Assistant", "field": "Bioengineering, Biomedical Engineering, Chemical Engineering, Manufacturing Engineering, Medicinal Chemistry, and 2 moreMicrobiology,Pharmacy & Pharmacology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp;&nbsp;&nbsp;â\u0086\u0092&nbsp;&nbsp; Apply until 01/03/2022&nbsp;(DD/MM/YYYY) 23:59 (Brussels time)&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Faculty of Pharmaceutical Sciences&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Department FW02 - Pharmaceutical analysis&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;&nbsp;AAP temporary appointment - 100%&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Number of openings: 1&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Reference number: 202202/FW02/AS/002&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University is a world of its own. Employing more than 8,000 people, it is actively involved in education and research, management and administration, and technical and social services on a daily basis. It is one of the largest, most exciting employers in the area and offers great career opportunities. With each of its 11 faculties and more than 100 departments offering state-of-the-art study programmes that are grounded in research in a wide range of academic fields, Ghent University is a logical choice for its employees as well as its students.&nbsp;&nbsp;YOUR TASKS&nbsp;At least 50% of your assignment will be spent on academic research in preparation of a doctoral dissertation.You will assist in the teaching activities at the department, specifically the following courses : microbiology, pharmaceutical analysis, and chemistry (practical courses and other forms of active learning); you will also support the integrated bachelor course.You supervise students working on their master thesis.You will assist in the internal and external services of the department.&nbsp;&nbsp;WHAT WE ARE LOOKING FOR&nbsp;You hold a degree of Master in Drug development or Pharmaceutical Engineering or Chemical Engineering or Bioscience engineering.&nbsp;For diplomas awarded outside the European Union, a certificate of equivalence (NARIC) must be submitted. The degree requirements need to be fulfilled at the start of your appointment.You are interested in academic and/or project-based research and services.You are interested in pharmaceutical manufacturing innovation for tomorrowâ\u0080\u0099s drug products using modeling and simulation tools.You have&nbsp; affinity with modeling and pharmaceutical process understanding.You have interest in programming in platforms such as Python / Matlab / C ++.Any teaching experience or participation in extra training, conferences, etc. is recommended.You have excellent teaching and communication skills.You are motivated to obtain a PhD in the domain of pharmaceutical engineering.&nbsp;&nbsp;&nbsp;WHAT WE CAN OFFER YOU&nbsp;We offer you a two-year appointment, which may be renewed twice for two years, on condition that the previous term was given a positive evaluation. Attention: If you have been previously appointed as a junior assistant or doctoral fellow at a university within the Flemish Community, this appointment will be deducted from the maximum term of appointment, which is six years at the most according to the Codex of Higher Education.Your appointment will start on 15 March 2022 at the earliest.Your remuneration will be determined according to salary scale AAP3. More information about our salary scales.All Ghent University staff members enjoy a number of benefits, such as a wide range of training and education opportunities, 36&nbsp;days of paid leave, bicycle commuting reimbursement, ecocheques, etc. A complete overview of all our fringe benefits (in Dutch).&nbsp;&nbsp;INTERESTED?&nbsp;Apply online through the e-recruitment system before the application deadline (see above). We do not accept late applications or applications that are not sent through the online system.&nbsp;Your application must include the following documents:&nbsp;In the field â\u0080\u0098Cvâ\u0080\u0099: your cv and an overview of your study results (merged into one pdf file)In the field â\u0080\u0098Cover letterâ\u0080\u0099: your application letter in pdf formatIn the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of the required degree (if already in your possession). If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field â\u0080\u0098Certificate of equivalenceâ\u0080\u0099: only for diplomas awarded outside the European Union a certificate of equivalence (NARIC) must be submitted. (This can be requested via www.naricvlaanderen.be/en). For diplomas awarded in the UK before January 31st of 2020, a certificate of equivalence is not required.&nbsp;Note that the maximum file size for each field is 10 MB.&nbsp;As Ghent University maintains an equal opportunities and diversity policy, everyone is encouraged to apply for this position.&nbsp;MORE INFORMATION&nbsp;For more information about this vacancy, please contact Prof. Ashish Kumar (Ashish.Kumar@UGent.be, +32 9 264 80 91).Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}