{"url": "https://academicpositions.com/ad/university-of-bath/2022/lecturer-assistant-professor-in-electrified-automotive-propulsion-systems-x-2/175183", "title": "Lecturer (Assistant Professor) in Electrified Automotive Propulsion Systems x 2", "publish_date": "2022-02-11", "deadline": "2022-05-02", "location": "Claverton Down Bath, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Assistant Professor", "field": "Automotive Engineering, Automotive Systems Engineering, Electrical Engineering, Electronics, Systems Engineering, and 1 moreTransportation Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Bath", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>Dept: Electronic &amp; Electrical Engineering</strong></p><p><strong>Starting from Â£42,149, rising to Â£50,296 per annum</strong></p><p><strong>Ref: CF9097</strong></p><p>Join us in this new role that will continue our success and expertise in developing experimental and simulation techniques. You will be instrumental in helping shape our future approaches and developing our relationships with industry. Make an impact through harnessing the opportunities created by our new Â£70m <a href=\"https://iaaps.co.uk/\" target=\"_blank\">Institute of Advanced Automotive Propulsion Systems (IAAPS)</a>, along with government and automotive industry investment.  Your work on electric propulsion is expected to contribute significantly to the Universityâ\u0080\u0099s and the UKâ\u0080\u0099s climate targets and commitments.</p><p><strong>About the role:</strong></p><p>You will participate in high-impact research programmes, provide excellent postgraduate research supervision, and deliver high-quality teaching. Making a major contribution to developing our portfolio of high-quality collaborative research in the electrified propulsion field.</p><p>One of our key areas of activity has always been the development of new experimental and simulation techniques and these areas come together as the industry moves towards a more digital product development process. It will be important for you to contribute to the development of new approaches, combining advanced simulation techniques with novel experimental approaches to design a faster, better product development toolchain.  More information about this opportunity and associated vacancies can be found here.</p><p><strong>About you:</strong></p><p>You will have an established or developing track record in electrified propulsion of passenger cars, with a particular focus on system-level considerations. Broader experience of the wider automotive propulsion landscape will be advantageous. You will ideally have expertise in Model Based Systems Engineering approaches leading to formal consideration of system level aspects of design, optimisation and validation.</p><p>You will be committed to developing you teaching at undergraduate and postgraduate level, from fundamental electronic and electrical engineering material to advanced modules at Masterâ\u0080\u0099s level, such as electric vehicle design. A willingness to participate in the Departmentâ\u0080\u0099s student design and research projects is also expected. Preference will be given to applicants with a background in the use of artificial intelligence and machine learning techniques within their area of electrified automotive propulsion systems.</p><p><strong>About us:</strong></p><p>The <a href=\"https://www.bath.ac.uk/departments/department-of-electronic-electrical-engineering/\" target=\"_blank\">Department of Electronical and Electrical Engineering</a> holds a Bronze Award for the Athena SWAN scheme, which promotes gender equality among all disciplines. We particularly encourage applications from under-represented groups.</p><p>This new position will form part of the new Â£70m Institute of Advanced Automotive Propulsion Systems (IAAPS) which is currently under construction and is intended to be one of the top three sites in the world for advanced propulsion systems research. It builds on 40 years of continuous propulsion research and education at the University including the new EPSRC Centre of Doctoral Training (CDT), which over the next five years will provide at least 86 fully funded studentships for a four-year combined training and research programme leading to an MPhil and PhD.</p><p>The current automotive propulsion research academic team has an excellent track record in delivering industry-relevant projects and has long-established collaborations with industrial partners. These new appointments are expected to benefit from, and contribute to, this strong industry partnership and will also have the freedom to explore fundamental research interests.</p><p>This is an exciting opportunity to join an expanding research group that is receiving substantial investment from Government, the Automotive Industries and the University.</p><p><strong>For more information: </strong></p><p>Informal enquiries about the post may be made to either:</p><p>Professor Adrian Evans, Head, Department of Electronic and Electrical Engineering, Tel: +44 (0)1225 386303 Email: <a href=\"mailto:a.n.evans@bath.ac.uk\">a.n.evans@bath.ac.uk</a> </p><p>or</p><p>Professor Furong Li, Department of Electronic and Electrical Engineering, Tel: +44 (0)1225 386416 Email: <a href=\"mailto:f.li@bath.ac.uk\">f.li@bath.ac.uk</a> </p><p><strong>Closing date: Monday 2 May 2022.</strong></p><p>Interview date: Tuesday 31 May 2022.</p><p>To apply please click <a href=\"https://urldefense.com/v3/__https:/www.bath.ac.uk/jobs/CF9097__;!!B5G2v5lgyw!Y_vOHDWFd6gZu5YFyEKrMVlI3g99MGsjZrozS9B_CyoKL9G_sc4wFp-0XvFnH1i2Q2XugtdkZ5QhkB0$\" target=\"_blank\">here</a></p><p>Find out from our staff what makes the University of Bath a great place to work. Follow us @UniofBath and @UniofBathJobs on Twitter for more information.</p><p><strong>What we can offer you:</strong></p><p>Our campus is surrounded by beautiful countryside, and the City of Bath with its historic charm and social activity only a short distance away creates an excellent environment in which to work. </p><p>We are:</p><ul><li>a family friendly workplace </li><li>39 days (pro rata) holiday (annual leave, discretionary days and bank holidays)</li><li>open to exploring flexible working opportunities which benefit you and the University. </li><li>recognising of the talents of our diverse workforce through an excellent reward package </li><li>encouraging of your personal and professional development</li></ul><p>We aim to be an inclusive university, where <strong>difference is celebrated</strong>, respected and encouraged. We truly believe that diversity of experience, perspectives, and backgrounds leads to a better environment for our employees and students, creating a learning environment and organisational <strong>culture that enhances health and wellbeing</strong> across our community. We are very proud to have recently received Ambassadors for Autism certification and are an accredited Disability Confident eader; committed to building disability confidence and supporting disabled staff.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEyXC8wOFwvVW5pdmVyc2l0eS1vZi1CYXRoLnBuZyIsImVkaXRzIjpbXX0="}