{"url": "http://www.academictransfer.com/en/308827/postdoc-cat-2-quantum-protocols/apply/", "title": "Postdoc CAT-2 quantum protocols", "publish_date": "2022-01-31", "deadline": "2022-03-10", "location": "De Rondom 70, 5612 AP, Eindhoven", "city": "Eindhoven", "country": "Netherlands", "position": "Postdoc", "field": "Natural sciences", "salary": "N/A", "max_working_hours": "38", "employer": "Eindhoven University of Technology (TU/e)", "job_description": "Quantum Delta NL has started a large national project in support of quantum technologies.<br><br>The Catalyst-2 (CAT2) subproject concentrates on the development of quantum key distribution and \"Quantum Internet\" applications.<br><br>The department of Mathematics and Computer Science at TU Eindhoven has one PhD vacancy and one postdoc vacancy for theoretical work in CAT2. The research will concentrate on<ul> <li>theory related to the QKD testbed under development in Eindhoven.</li> <li>quantum cryptography beyond QKD, e.g. key recycling, unclonable encryption, unclonable credentials, quantum PUFs etc.</li> </ul> <br>The project has good opportunities for collaboration with other departments at TU Eindhoven and with other Dutch universities.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    We are looking for candidates withÂ Â <ul>\n<li>A PhD inÂ cryptography, theoretical physics, or mathematics, and preferably a background in quantum cryptography or post-quantum cryptography.</li>\n<li>Ability to conduct high quality academic research, demonstrated for instance by a relevant PhD thesis and/or publication(s).</li>\n<li>Ability to teach, shown by experience or assistance in teaching and positive evaluations of these teaching efforts.</li>\n<li>Excellent mastering of the English language, good communication and leadership skills. Note that there is no Dutch language requirement.</li>\n<li>Be a team player and able to work in a dynamic, interdisciplinary context.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>A meaningful job in a dynamic and ambitious university with the possibility to present your work at international conferences.</li>\n<li>A full-time employment for 3 years.</li>\n<li>You will have free access to high-quality <a href=\"https://www.tue.nl/en/working-at-tue/scientific-staff/professional-development/\">training programs</a> on general skills, didactics and topics related to research and valorization.</li>\n<li>A gross monthly salary and benefits in accordance with the Collective Labor Agreement for Dutch Universities.</li>\n<li>Additionally, an annual holiday allowance of 8% of the yearly salary, plus a year-end allowance of 8.3% of the annual salary.</li>\n<li>A broad package of fringe benefits (including an excellent technical infrastructure, moving expenses, and savings schemes).</li>\n<li>Should you come from abroad and comply with certain conditions, you can make use of the so-called '30% facility', which permits you not to pay tax on 30% of your salary.</li>\n<li>\n<a href=\"https://www.tue.nl/en/working-at-tue/why-tue/support-for-internationals/\">Family-friendly initiatives</a> are in place, such as an international spouse program, and excellent on-campus children day care and sports facilities.</li>\n</ul>\n</div>\n</div>", "employer_description": "N/A", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    Do you recognize yourself in this profile and would you like to know more?<br/>Please contact dr. Boris Skoric, email: b.skoric[at]tue.nl.<br/><br/>For information about terms of employment, click <a href=\"https://www.tue.nl/en/working-at-tue/why-tue/conditions-of-employment/\">here</a> or contact HR Services, email: HRServices.MCS[at]tue.nl.<br/><br/>Please visit <a href=\"http://www.tue.nl/jobs\">www.tue.nl/jobs</a> to find out more about working at TU/e!<br/><br/><strong>Application</strong><br/><br/>We invite you to submit a complete application by using the 'apply now'-button on this page.<br/>The application should include a:<ul>\n<li>Cover letter in which you describe your motivation and qualifications for the position.</li>\n<li>Curriculum vitae, including a list of your publications and the contact information of three references.</li>\n<li>List of five self-selected 'best publications'.</li>\n</ul>\n<br/>We do not respond to applications that are sent to us in a different way.<br/><br/>Please keep in mind you can upload only 5 documents up to 2 MB each. If necessary, please combine files.<br/><br/>We look forward to your application and will screen it as soon as we have received it. Screening will continue until the position has been filled.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tue.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tue-en-wide_acOLN2b/6da05d7a14fc4cf4bb403c37bf055371.png"}