{"url": "https://academicpositions.com/ad/ghent-university/2022/a-fully-funded-erc-phd-studentship-in-medieval-greek-philology-byzantine-studies-4-years-22355-linguistics/174463", "title": "A fully-funded ERC PhD studentship in Medieval Greek Philology/ Byzantine Studies (4 years) (22355) - Linguistics", "publish_date": "2022-01-26", "deadline": "2022-04-23", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Applied Linguistics, Classical Philology, Hellenic languages, Historical Linguistics, Philology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp; &nbsp;â\u0086\u0092&nbsp;&nbsp;Apply before 23/04/2022&nbsp;(DD/MM/YYYY) 23:59 (Brussels Time)&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Faculty of Arts and Philosophy&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Department:&nbsp;LW06 - Taalkunde&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Occupancy rate: 100%&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Number of positions: 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Type of employment:&nbsp;Contract of unlimited duration with a 4 year clause&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Term of&nbsp;assignment:&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Wage scale:&nbsp;&nbsp;WM1 to WM4 (master degree)&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Required diploma:&nbsp;Master&nbsp;&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University (Belgium) is a world of its own. Employing more than 8,000 people, it is actively involved in education and research, management and administration, as well as technical and social service provision on a daily basis. It is one of the largest, most exciting employers in the area and offers great career opportunities. With its 11 faculties and more than 80 departments offering state-of-the-art study programmes grounded in research in a wide range of academic fields, Ghent University is a logical choice for its staff and students.&nbsp;Ghent is an attractive medieval town, with a strong economic base and lively cultural scene. Just 30 minutes by train from Brussels, two hours from Paris and Amsterdam, and two and a half hours from London, it is ideally situated at the heart of European intellectual life.&nbsp;&nbsp;The Department of Linguistics at Ghent University (Belgium) is seeking well-qualified applicants for a fully-funded and full-time doctoral research fellowship attached to the European Research Council Consolidator Grant project&nbsp;MELA. The meaning of language. A digital grammar of the Greek taught at schools in Late Constantinople&nbsp;(https://research.flw.ugent.be/nl/projects/mela-meaning-language-digital-grammar-greek-taught-schools-late-constantinople). Prof. Dr. Andrea Cuomo, with his interest in the history of Medieval Greek and the reception of classical literature in Byzantium, is the principal investigator.&nbsp;&nbsp;YOUR TASKS&nbsp;Area of research of MELA&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MELA primarily aims to create the first digital grammar of the Greek taught at schools in late Byzantium on the basis of textbooks for the teaching of Greek and their manuscript copies composed by (or within the networks of pupils, scribes, etc. of) scholars ranging from Planoudes (â\u0080 1305) to Gregoras (â\u0080 c. 1360). Overall, textbooks considered by MELA may be divided into the following categories: (1) works defined by author and genre (e.g. Planoudesâ\u0080\u0099 Dialogue on Grammar); (2) lemmata on grammar that flowed into dictionaries (e.g. Moschopoulosâ\u0080\u0099 Collection of Attic Words), provided with stylistic examples from model authors; 2a Comments on model authors; (3) scholarsâ\u0080\u0099 notes on grammatical topics; 3a anonymous treatises, sketches, reworked excerpts of larger works.&nbsp;Area of research of your dissertationYou will write a doctoral dissertation on the philological accuracy of the Greek text of the sources that constitute MELAâ\u0080\u0099s digital grammar.MELA is an open-access searchable textual corpus database, created on the basis of textbooks for the teaching of Greek. The text we put into the database depends on the currently available critical editions. This implies many problems because the editions are often based on â\u0080\u0098badâ\u0080\u0099 manuscripts, which, in turn, sometimes transmit abridged versions of our sources.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Your work consists of writing a doctoral dissertation on the tradition of the text of all, or some, of the sources of MELA with a focus (1) on the various redactions of textbooks, as shown in the manuscripts, (2) on the emendations to the Greek text, (3) on the method of composition of these textbooks, (4) on the relationships between the textbooks and other works.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The outcome of your research will also flow into the digital grammar.&nbsp;We expect you to be an enthusiastic researcher, interested in promoting your research outcome in various venues, from informal MELA team meetings to international conferences.&nbsp;&nbsp;WHAT WE ARE LOOKING FOR&nbsp;The successful candidate will have1. an MA degree in disciplines relevant to MELA: Classics; Greek philology/ Greek linguistics/ Byzantine Studies;2. outstanding knowledge of Ancient and/or Medieval Greek;3. a demonstrable interest in Byzantine studies and training in the digital humanities;4. a strong knowledge of the literary and cultural history of post-classical Greek as evidenced by their study trajectory (optional courses, subject of papers and dissertations, letters of recommendation, etc.);5. excellent command of English and of&nbsp;at least one&nbsp;of the following languages: Dutch, German, French, Spanish, Italian, Greek, or Russian.&nbsp;&nbsp;We expect&nbsp;that the successful applicant will:1. write and successfully defend a PhD dissertation within the funding period;2. contribute to the strong research tradition of the department and the university by pursuing excellence in his/her research and by publishing his/her results in journals and with publishers that are internationally accepted as being of the highest quality;3. reside in Belgium, work together with the other members of the team and of MELAâ\u0080\u0099s international advisory board, and contribute to a pleasant and stimulating atmosphere;4. contribute to the scholarly activities of the research group (e.g. by organizing events in collaboration with the principal investigator and/or other members of the team, etc.).&nbsp;WHAT WE CAN OFFER YOU&nbsp;1.&nbsp;a contract for four years of full-time employment as a PhD student, subject to positive evaluation after one year. The expected start date of the PhD scholarship is&nbsp;July 1, 2022.&nbsp;In order to be eligible, candidates must have obtained their MA degree at the time of application or demonstrate that they will have that degree in hand by the start of their doctoral fellowship.Your remuneration will be determined by salary scale WM1 to WM4.&nbsp;Click here for more information about our salary scales;2.&nbsp;an internationally competitive salary that corresponds to the salary scales for PhD students as established by the Flemish government;3.&nbsp;a substantial allowance for travel and other research purposes in addition to the salary;&nbsp;4.&nbsp;office space at Ghent University, an enviable research infrastructure, and a solid and engaging academic working environment with a strong international profile (website of the research group:&nbsp;http://www.mela.ugent.be). The ERC project resonates with the interests of a number of other scholars at Ghent University, and the successful candidates will be able to interact with scholars and students affiliated with various departments and research institutes, such as, besides the Department of Linguistics&nbsp;https://www.ugent.be/lw/taalkunde/en,&nbsp;&nbsp;the Department of Literary Studies (https://www.letterkunde.ugent.be),the Department of History (http://www.ugent.be/lw/geschiedenis/en),the Department of Oriental Studies (http://www.neareast.ugent.be/),the&nbsp;Ghent Institute for Classical Studies&nbsp;(http://www.giks.ugent.be),the&nbsp;Henri Pirenne Institute for Medieval Studies&nbsp;(http://www.pirenne.ugent.be),the&nbsp;Ghent Centre for the Study of Christian Traditions&nbsp;(http://www.csct.ugent.be),the Î\u0094iaLing research group (https://www.dialing.ugent.be/)and the&nbsp;Group of Early Modern Studies&nbsp;(https://gemsugent.wordpress.com);5.&nbsp;the possibility to acquire transferable skills as part of a Doctoral School programme.6.&nbsp;professional support for those applying to the many funding schemes at local, national, and European levels.7.&nbsp;All Ghent University staff members enjoy a number of benefits, such as a wide range of training and education opportunities, 36 days of holiday leave (on an annual basis for a full-time job) supplemented by annual fixed bridge days, a bicycle allowance and eco vouchers.&nbsp;Click here for a complete overview of all the staff benefits&nbsp;(in Dutch)&nbsp;INTERESTED?&nbsp;Apply&nbsp;online through the e-recruitment system&nbsp;before the application deadline&nbsp;(April 23, 2022). We do not accept late applications or applications that are not submitted through the online system.Your application must include the following documents:In the field&nbsp;â\u0080\u0098CVâ\u0080\u0099: your CV and an overview of your study results (merged into one pdf file)In the field&nbsp;â\u0080\u0098Cover letterâ\u0080\u0099: your application letter in pdf format, in which you give an account of your scholarly background and interests.In the field&nbsp;â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of the required degree (if already in your possession). If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field&nbsp;â\u0080\u009cother documentsâ\u0080\u009d:two (2) reference letters;an&nbsp;autobiographical statement&nbsp;highlighting why you are interested in this project, how it resonates with your own expertise, what relevant experience/knowledge you have; what added value you expect to bring to the project; what you expect from MELA and your doctorate;your&nbsp;MA dissertation&nbsp;(and possibly other relevant writing samples such as papers or a BA dissertation).&nbsp;Note that the maximum file size for each field is 10 MB.&nbsp;As Ghent University maintains an equal opportunities and diversity policy, everyone is encouraged to apply for this position.MORE INFORMATION&nbsp;Shortlisted candidates will be notified by May 16, 2022.Interviews will take place between the end of May and the beginning of June 2022.For more information about this vacancy, please contact Prof. Andrea Cuomo at:&nbsp;Andrea.Cuomo@ugent.be&nbsp;Universiteit GentFaculty of Arts and PhilosophyDepartment of LinguisticsBlandijnberg 2 9000 GentImportant: do NOT send your application by email, but apply onlineDo you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}