{"url": "https://academicpositions.com/ad/istituto-italiano-di-tecnologia-iit/2022/researcher-in-nanocomposite-design-for-material-preservation/173858", "title": "Researcher in nanocomposite design for material preservation", "publish_date": "2022-01-12", "deadline": "2022-04-12", "location": "Via Torino 155 Venice, Italy", "city": "N/A", "country": "Italy", "position": "Researcher", "field": "Chemical Engineering, Materials Chemistry, Materials Engineering, Nanochemistry, Nanotechnology, and 3 morePolymer Chemistry,Spectroscopy,Thermochemistry", "salary": "N/A", "max_working_hours": "N/A", "employer": "Istituto Italiano di Tecnologia - IIT", "job_description": "Commitment &amp; contract: Researcher (collaborator)Location: VeniceWHO WE AREAt IIT we work enthusiastically to develop human-centered Science and Technology to tackle some of the most pressing societal challenges of our times and transfer these technologies to the production system and society. Our Genoa headquarter is strictly inter-connected with our 11 centres around Italy and two outer-stations based in the US for a truly interdisciplinary experience.YOUR TEAMYouâ\u0080\u0099d be working in a multicultural and multi-disciplinary group, where materials engineers, chemists, physicists, computational scientists, conservators, art historians and archaeologists collaborate, each with their own expertise, to carry out common research.The Center for Cultural Heritage Technology (CCHT) is coordinated by Arianna Traviglia, who has extensive experience in mediating the inclusion of technology within the study and management of cultural artefacts.Research at CCHT focuses on promoting new technologies and approaches for analysis and preservation of tangible Cultural Heritage. This includes characterization of Cultural Heritage assets and development of protective treatments.Within the team, your main responsibilities will be:Supervise the development of nanostructured materials to be applied for the protection and consolidation of heritage objects (including glass, frescoes, metal items, manuscripts and paintings).Oversee the characterization of CH assets and support developing sensing technologies to be integrated in the protective layers in order to monitor the state of the degradation of heritage items.Oversee PD researchers and PhDs.WHAT WOULD MAKE YOU SHINEA PhD in Chemistry, Chemical Engineering, Materials Science, or similar disciplinesAt least 5 years of postdoctoral experienceDocumented experience on nanomaterials and polymer nanocompositesâ\u0080\u0099 synthesis and processingAbility to perform characterization of materials (including the use of microscopy, spectroscopy, surface and thermomechanical techniques)A strong publication recordExperience in grant proposal preparation at European and National levelThe ability to properly report, organize and publish research dataDocumented experience in coaching junior scientistsGood command in spoken and written EnglishEXTRA AWESOMEBackground or experience in Cultural Heritage diagnostic and characterisationDemonstrated interest in the domain of Cultural HeritageExperience in supervising or co-supervising Ph.D. students or postdocsBroad range of contacts within international research communityGood communication skillsSpirit of innovation and creativityAbility to work in a challenging and international environmentAbility to work independently and collaboratively in a highly interdisciplinary environmentCOMPENSATION &amp; BENEFITSCompetitive salary package for international standardsPrivate health care coverageWide range of staff discounts&nbsp;WHATâ\u0080\u0099S IN FOR YOU?An&nbsp;equal,&nbsp;inclusive and&nbsp;multicultural&nbsp;environment&nbsp;ready to welcome you with open arms. Discrimination is a big NO for us!We&nbsp;like contamination and&nbsp;encourage you to mingle and discover what other people are up to in our labs!&nbsp;If paperwork is not your piece of cake, we got you! Thereâ\u0080\u0099s a specialized team working to help you with that, especially during your relocation!&nbsp;If you are a startupper or a business-minded person, you will find some exceptionally gifted professionals ready to nurture and guide your attitude and aspirations.If you want your work to have a real impact, in IIT you will find an innovative and stimulating culture that drives our mission to contribute to the improvement and well-being of society!We stick to our values! Integrity, courage, societal responsibility and inclusivity are the values we believe in! They define us and our actions in our everyday life. They guide us to accomplish IIT mission!If you feel this tickles your appetite for change, do not hesitate and apply!Please submit your application using the online form and includinga detailed CVcover letter (outlining motivation, experience and qualifications)brief research statement, expanding on current and past research3 reference letterslink to 7 representative publicationsApplicationâ\u0080\u0099s deadline: the call will remain open until the position is filled but a first deadline for evaluation of candidates will be February, 15 2022.We inform you that the information you provide will be used solely for the purposes of evaluating and selecting professional profiles in order to meet the requirements of Istituto Italiano di Tecnologia.Your data will be processed by Istituto Italiano di Tecnologia, based in Genoa, Via Morego 30, acting as Data Controller, in compliance with the rules on protection of personal data, including those related to data security.Please also note that, pursuant to articles 15 et. seq. of European Regulation no. 679/2016 (General Data Protection Regulation), you may exercise your rights at any time by contacting the Data Protection Officer (phone Tel: +39 010 28961 - email: dpo@iit.it ).", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "IIT aims to promoteÂ excellenceÂ inÂ basic and applied researchÂ and to promote theÂ development of the national economy.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJhZmFcL2NjNVwvYWZhY2M1ZDUzM2EyODBiY2NkODRmOWZmMjg1MWNiNWMucG5nIiwiZWRpdHMiOltdfQ=="}