{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/dean-of-college-of-law/174542", "title": "Dean of College of Law", "publish_date": "2022-01-27", "deadline": "N/A", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Management", "field": "Administrative Law, Civil Law, Commercial Law, Constitutional Law, Contract Law, and 23 moreCorporate Governance,Corporate Law,Criminal Law,Digital Law,Educational Leadership,Educational Management,Environmental Law,European Law,Financial Law,Gender and Law,Higher Education,International Law,Jurisprudence,Labour Law,Legal History,Management,Media Law,Nordic Law,Procedural Law,Property Law,Public Law,Strategic Management,Tax Law", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>This position will report directly to the <strong>Vice President for Academic Affairs</strong></p><p><i><strong>Job Summary</strong></i><strong>:</strong></p><p>AUIB seeks an exceptional individual to become the dean of the college of Law.</p><p>The dean should be an innovative thinker and approachable leader who welcomes the opportunity to articulate a vision for the growth of the law college that builds on its long history of excellence.</p><p><i><strong>This position will be responsible for:</strong></i></p><ul><li>Developing a comprehensive and proactive strategic plan for the college of Law that meets the</li><li>challenges of a highly competitive market and aligns with the broader objectives of the</li><li>Universityâ\u0080\u0099s strategic plan;</li><li>Nurturing and expanding interdisciplinary relationships between AUIB and other universities</li><li>programs;</li><li>Garnering additional private and public resources that will enable the college of Law to make</li><li>continued advances in its programs and facilities, as well as the caliber of its faculty and students;</li><li>Taking aggressive steps to better anticipate the needs of the external legal community in order to</li><li>cultivate stronger relationships and forge collaborative partnerships in a city that is experiencing</li><li>growth and transformation;</li><li>Maintaining and enhancing AUIBâ\u0080\u0099s strong sense of community among its principal constituents,</li><li>including faculty, staff, students, alumni, other colleges, and university administrators;</li><li>Continuously improving student outcomesâ\u0080\u0094including bar passage, job placement, and other</li><li>quantitative and qualitative measuresâ\u0080\u0094and maintaining and enhancing the collegeâ\u0080\u0099s student-centered environment; and</li><li>Advancing the law collegeâ\u0080\u0099s commitment to social justice, access to justice, and equality before the</li><li>law</li></ul><p><i><strong>Required Skills/Abilities: </strong></i></p><p>Candidates for this position must have:</p><ul><li>An earned Doctorate in Law or a related discipline from an accredited institution.</li><li>The ability to speak and write fluently in English.</li><li>A record of outstanding achievement in higher education and scholarship.</li><li>University teaching experience complemented by an appropriate scholarly record.</li><li>Demonstrated management experience with increasing levels of responsibility, either in a professional or academic setting, including experience in administering an organization through scheduling, supervision, and evaluation.</li><li>Experience in the supervision and management of budgets and expenditures.</li><li>Experience in strategic planning, academic program development, fiscal and academic planning, resource management, program development and problem solving in similar organizations.</li><li>Outstanding interpersonal and communication skills and the ability to articulate and advocate for the needs of the College.</li><li>Administrative experience that includes academic planning, program review, strategic planning, program development, budgeting, and fiscal/personnel management.</li></ul><p><strong>Application Procedure:</strong></p><p>Applications should include:</p><ul><li><strong>Cover Letter</strong></li><li><strong>Curriculum Vitae</strong></li><li><strong>Passport First Data Page</strong></li><li><strong>Contact Information For Three (3) Professional References</strong></li><li><strong>Copies Of Degrees Or Certification</strong></li></ul><p>Applications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately.</p><p>Please apply through AUIB website OR send your application and supporting documents to the following email address:</p><p><a href=\"mailto:jobs@auib.edu.iq\">jobs@auib.edu.iq</a> with <a href=\"mailto:Karin.Jesuis@auib.edu.iq\">Karin.Jesuis@auib.edu.iq</a> in copy.</p><p><strong>A declaration of a relation at AUIB is obligatory</strong></p><p><strong>We will contact you if you are selected for interview.</strong></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}