{"url": "http://www.academictransfer.com/en/309244/phd-researcher-in-health-communication-10-fte/", "title": "PhD researcher in Health Communication (1.0 fte)", "publish_date": "2022-02-09", "deadline": "2022-03-14", "location": "Warandelaan 2, 5037 AB, Tilburg", "city": "Tilburg", "country": "Netherlands", "position": "PhD", "field": "Language and culture", "salary": "N/A", "max_working_hours": "40", "employer": "Tilburg University", "job_description": "<p>The PhD position is part of the&nbsp;<a href=\"https://beamerproject.eu/\">BEAMER</a>&nbsp;project, a five-year European research project on adherence to treatment in six thematic areas: cardiovascular disease, oncology, immunology, neurology, endocrinology, and rare disease.</p><p>&nbsp;</p><p><strong>About this position</strong></p><p>In this PhD project, the main focus will be on therapy adherence in the oncology domain. After a cancer diagnosis, typically a range of therapies is started, including, for example, chemo- or radiation therapy, combined with therapy for positive lifestyle changes, such as more healthy eating or stopping with smoking. While the core medical treatments are typically strictly adhered to in the oncology domain, the lifestyle changes are generally harder to achieve, partly also because the medical treatment is often intense and puts a strong burden on the patient. In this project, we will systematically explore, based on both predictors from the scientific literature as well as from new data sets, which groups of people have an increased risk of not fully adhering to therapy. Special attention will be given to groups that are particularly at risk, such as those with a low SES or low health literacy. In this project, a range of approaches will be combined, including literature review, surveys, experiments, focus groups, and/or interviews.</p><p>&nbsp;</p><p><strong>About the project</strong></p><p>BEAMER (short for &ldquo;BEhavioral and Adherence Model for improving quality, health outcomes and cost-Effectiveness of healthcaRe&rdquo;) is a five-year project, funded by IMI H2020, which brings together 28 European partners (from 13 countries), from academia, civil society and industry. The project tackles an important health challenge: patient non-adherence to prescribed treatment. It affects patient health outcomes significantly, contributing to 200,000 premature deaths in the EU annually, and places a heavy economic burden on the healthcare system, leading to an estimated 125B euros in avoidable hospitalizations, emergency care, and adult outpatient visits each year. Despite existing research on disease-specific medication adherence, there are few broad insights regarding how to improve adherence across healthcare. To address this, BEAMER aims to acquire a comprehensive understanding of the factors that influence patient adherence, irrespective of the therapeutic area, and enable stakeholders to design effective solutions that could promote broad and consistent impact within a real-world context.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Candidates for this position should have a (research) master’s degree in (health) communication, communication science, linguistics, cognitive science, behavioural science, or a related field. In addition, the successful candidate:</p>\n<ul>\n<li>has solid methodological and statistical skills;</li>\n<li>has affinity with health communication;</li>\n<li>has excellent organizational and social skills;</li>\n<li>is willing to learn and think across disciplines;</li>\n<li>had good communication skills and is well able to communicate with fellow peers, the research population, stakeholders, and societal partners;</li>\n<li>is a team player and likes collaborating in (large) teams;  </li>\n<li>has excellent English writing and presentation skills.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 4 years.</p>\n<p>Tilburg University is rated among the top of Dutch employers and has excellent terms of employment, such as a holiday allowance of 8% and an end-of-year bonus of 8.3% (annually), an options model and reimbursement of moving expenses. Candidates from outside the Netherlands may qualify for a tax-free allowance equal to 30% of their taxable salary. The university will apply for such an allowance on their behalf. The Tilburg School of Humanities and Digital Sciences will provide assistance in finding suitable accommodation. The collective labor agreement of the Dutch Universities applies. </p>\n<p> </p>\n<p>The PhD candidate will be ranked in the Dutch university job ranking system (UFO) as a PhD-student (“promovendus”) with a starting salary of €2.443,- gross per month in the first year, up to €3.122,- in the fourth year (amounts fulltime). The selected candidate will start with a contract for one year, concluded by an evaluation. Upon a positive outcome of the first-year evaluation, the candidate will be offered an employment contract for the remaining three years. It is also possible to work 80% instead of fulltime. The selected candidate is expected to have written a PhD thesis by the end of the contract (which may be based on articles).</p>\n</div>\n</div>", "employer_description": "N/A", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For further information about this position, please contact dr. Nadine Bol (Nadine.Bol@tilburguniversity.edu) or prof. dr. Emiel Krahmer (E.J.Krahmer@tilburguniversity.edu).</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uvt.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uvt-en-wide/8bbc452c034c71750be03f93fe602eca.png"}