{"url": "https://academicpositions.com/ad/nioz-royal-netherlands-institute-for-sea-research/2022/phd-position-activity-of-methanotrophs-in-the-north-sea/174304", "title": "PhD or Postdoc position: â\u0080\u0098Activity of methanotrophs in the North Seaâ\u0080\u0099", "publish_date": "2022-01-21", "deadline": "2022-02-20", "location": "Landsdiep 4 Den Helder, Netherlands", "city": "N/A", "country": "Netherlands", "position": "Postdoc", "field": "Biochemistry, Geochemistry, Geomicrobiology, Marine Geoscience, Microbiology, and 2 moreMolecular Biology,Oceanography", "salary": "N/A", "max_working_hours": "N/A", "employer": "NIOZ Royal Netherlands Institute for Sea Research", "job_description": "The department of Marine Microbiology and Biogeochemistry (MMB; principal investigator&nbsp;prof. dr. Helge Niemann) at the Royal Netherlands Institute of Sea Research (NIOZ) is looking for a highly motivated PhD student OR a Postdoctoral researcher with a background in biogeochemistry and microbial/molecular ecology or microbiology to investigate methane dynamics in the North Sea. Your research will be part of a funded project.LOCATION: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; NIOZ&nbsp;TEXELVACANCY&nbsp;NR.: &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;2022 - 3CLOSING DATE: &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; February 20th 2022THE DEPARTMENTThe MMB Department studies microbial communities in all types of marine environments, from estuaries to the deep ocean, from the deep past to the present. Using field and experimental approaches and a variety of analytical, (bio)chemical and genomic techniques, we study the diversity, evolution, physiology and activity of eukaryotes, prokaryotes and viruses in diverse marine environmental settings. We do so by a variety of analytical chemical, biochemical and modern genomic techniques.THE PROJECTLarge reservoirs of methane are stored in shelf sea sediments from where is extracted as a fossil fuel. After exploitation, the wells are sealed but may still leak a considerable amounts of methane into the water column and finally into the atmosphere where it contributes to global warming. Yet, methanotrophic microorganisms consume at least some of the methane in sediments and the water column. Understanding the dynamics of methane oxidation is thus paramount to estimate the importance of methane leakage from old wells.&nbsp;This project aims to determine microbially mediated methane oxidation in sediments and the water column, to identify key microbes as well as parameters that are promoting or hampering methanotrophic activity.&nbsp;The successful PhD or PostDoc researcher will work in an interdisciplinary research project together with geologists and atmospheric physicists. The candidate will participate in oceangoing research expeditions to recover samples for onboard measurements of microbial kinetics and for subsequent laboratory analysis (e.g. DNA sequencing, microscopy, lipid biomarker analysis) and/or further microcosm experiments. Sojourns at partner institutions are anticipated.THE CANDIDATEAre you a highly motivated young researcher with an MSc or PhD degree in biogeochemistry with experience in microbial/molecular ecology and/or microbiology (or vice versa)? Do you have a keen interest in frontier-based research in an interdisciplinary scientific environment? Do you have experience with experimental work? Are you interested in applying biogeochemical and molecular tools in the laboratory and in the field? In this project you will learn and apply state-of-the-art analytical techniques and research concepts to cross scientific boundaries. You will work in an international and interdisciplinary research environment; a very good command of spoken and written English is essentialWe highly encourage applicants from all members of our community and of diverse background, including LGBT+ and BAME communities, to join us.&nbsp;CONDITIONS OF EMPLOYMENTEmployment of this position at Royal NIOZ is by&nbsp;NWO (The Netherlands Organization of Scientific Research). We are offering a 4-year (PhD) or 3-year (PostDoc) full-time position. &nbsp;For a PhD position we offer a position for a period of 1 year (fulltime). At the end of this first year, the employment will be extended for a fixed-term of a maximum of 4 years, if the first year evaluation held with the employee is positive. The salary is compliant to the&nbsp;CAO-OI (Collective Labour Agreement for Dutch Research Institutes), a pension scheme, a holiday allowance of 8% of the gross annual salary, a year-end bonus of 8,3%, and flexible work arrangements.&nbsp;You may expect attractive secondary employment conditions. We offer generous relocation expenses for employees coming from abroad and support with finding accommodation.&nbsp;The position will be located on Texel, field work and sojourns at the laboratories of scientific partners are planned. The starting date of the project is April/May 2022.Further informationFor more information about the project or position contact&nbsp;Prof. Dr. Helge Niemann (research leader at NIOZ).&nbsp; Find more information about the MMB department&nbsp;here.&nbsp;For additional information about the procedure, please contact&nbsp;Sigrid Moerbeek (senior HR advisor at NIOZ). If you are interested in this position, please visit our website&nbsp;www.workingatnioz.com&nbsp; and apply for this job by submitting a motivation letter with your CV and the names of three references.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "NIOZ Royal Netherlands Institute for Sea Research is the National Oceanographic Institution of the Netherlands.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEyXC8wOFwvTklPWkxvZ28ucG5nIiwiZWRpdHMiOltdfQ=="}