{"url": "https://academicpositions.com/ad/ghent-university/2022/phd-position-on-rf-analog-electronics-photonics-circuit-co-design/175023", "title": "PhD position on RF/analog electronics-photonics circuit co-design", "publish_date": "2022-02-08", "deadline": "2022-08-31", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Communication Engineering, Electrical Engineering, Electromagnetism, Electronics, Optics, and 3 morePhotonics,Signal Processing,Systems Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "Last application date Aug 31, 2022 00:00Department TW05 - Department of Information TechnologyContract Limited durationDegree Master of Science in Electrical Engineering or Electronics EngineeringOccupancy rate 100%Vacancy type Research staffJob descriptionPhD position on RF/analog electronics-photonics circuit co-designPlace: Ghent, BelgiumAbout the employerGhent University is one of the most important education and research institutions in the Low Countries, ranked 71 in the Academic Ranking of World Universities (http://www.shanghairanking.com/). On a daily basis, over 15,000 staff members and 49,000 students implement its motto \"Dare to Think\". Ghent University's mission statement is characterized by qualitative education, internationally renowned research and a pluralistic social responsibility.The IDLab research group is also a core group of imec. Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. Imec is headquartered in Leuven, Belgium and also has distributed R&amp;D groups at a number of Flemish universities, in the Netherlands, Taiwan, USA, China, and offices in India and Japan.All of these particular traits make IDLab a top-class research employer.Description of post: The Design group of the Ghent University-imec IDLab research group is currently looking for several new PhD and post-doc researchers. The Design team is internationally recognized as a leading research group on high-speed and high-frequency integrated circuits for next-generation communications systems. At this moment, the Design group is for example active in nine European projects, one ESA project and in direct research contracts with world-leading industry partners. These collaborations form the perfect basis for high-level and industry-relevant research in an environment with expert peers and top-notch test and measurement equipment. The main research lines focus on wired (fiber-optic, radio-over-fiber), wireless (5G, mmWave) and instrumentation for which custom CMOS or SiGe BiCMOS chips are developed and integrated in system demonstrators.To strengthen our design team, this vacancy is looking for a strong research profile on RF/analog and photonics circuit co-design for next generation high-speed transmitters and receivers. https://www.ugent.be/ea/idlab/en/research/electromagnetics-rf-and-high-speed-circuits-and-systems/fiber-optic-transceivers.htm The integration of photonics and electronics is gaining considerable traction in industry. The GOA large-scale multidisciplinary project â\u0080\u009cIntegration of novel thin films with circuits for telecom, quantum optics and neuromorphic computingâ\u0080\u009d brings together five professors and their teams at Ghent University with a unique complementarity of expertise ranging from material science, fundamental physics, photonic integration, neural networks to electronic design. Together they have access to a very extended research infrastructure, including state-of-the-art tools for the deposition of new materials, the most advanced tools for micro- and nanofabrication of photonic and electronic devices, optical testing equipment for fundamental material properties characterization as well as ultra-high speed device characterization and a very broad range of simulation tools.Our offerWe offer a fully funded PhD position for full-time research in a highly international, renowned and friendly working environment, with a competitive salary at Ghent University. As a researcher you will publish and present your research results at major international conferences and in scientific journals in order to pursue your PhD degree and you will receive the possibility to follow various advanced training courses in Belgium or abroad.Typical research projects in the Design group involve multiple researchers with different specialties working as a team. Hence, a good team spirit, a good knowledge of English and effective communication skills (such as presenting and reporting) are of major importance for a successful collaboration.Job profileYour profileYou need to hold a relevant masterâ\u0080\u0099s degree e.g., Master of Science in Electrical Engineering or Electronics EngineeringStrong background in the design and realization of custom integrated circuits using advanced SiGe BiCMOS or CMOS processes; Knowledge of photonics is a plus.Proficiency with design tools such as Cadence, Mentor Graphics, electromagnetic simulators, parasitic extraction and verification toolsAdditional experience considered as a plus:Work experience (academic or industrial) or publicationsExperimental characterization of high-speed, high-frequency components and (sub-) systemsPrinciples of optical Communications, signal processing, optical devices and photonics circuitsYour English is fluent, both speaking and writingYou are a team player with good networking and reporting skillsHow to applyInterested?Send your application or any questions concerning this vacancy to Prof. Xin (Scott) Yin xin.yin@ugent.beApplications should include a CV, a personal motivation letter, and contact information of three reference persons. After screening, selected candidates will be invited for an online interview as a first contact in a multi-stage selection process. Applications remain welcome until the position is filled.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}