{"url": "https://academicpositions.com/ad/university-namur/2022/full-time-phd-student-in-testing-for-cybersecurity-cyberexcellence-project/175050", "title": "Full-time PhD student in testing for cybersecurity (CyberExcellence project)", "publish_date": "2022-02-09", "deadline": "2022-05-01", "location": "rue de Bruxelles 61 Namur, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Algorithms, Artificial Intelligence, Cyber Security, Information Science, Machine Learning,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Namur", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>University faculty</strong> : Computer science<br/><strong>Grade</strong> : researcher<br/><strong>Contract</strong> : renewable fixed term contract<br/><strong>Category</strong> : scientific personnel<br/><strong>Allocation</strong> : External funds<br/><strong>Reference</strong> : External funds (CyberExcellence project).</p><h3>Responsibilities</h3><p><strong>About the employer</strong></p><p>The University of Namur (UNamur) is located in the centre of Belgium, in the French-speaking part of the country. It offers quality education to more than 7,000 students every year and hosts more than 900 researchers in all fields of expertise. The Faculty of Computer Science provides cutting-edge teaching and research, intending to put computers at the service of society, taking account of their impact on the environment and respecting the values of solidarity and sustainable development. The Faculty is a founding member of the Namur Digital Institute (NADI), which groups together over 150 researchers in digital technology. It has a multi-disciplinary approach and addresses, in particular, the issues and challenges of computer science in organisations and society. The Faculty of Computer Science has over 400 students, 80 members of staff, including 18 professors and around 50 researchers. Founded in 1968, the Faculty has trained over 1,800 high-level computer science graduates since then.</p><p><strong>Context</strong></p><p>The CyberExcellence project started in January 2022. It aims to position Wallonia as a major player in cybersecurity on the national and international map by developing a core framework allowing the implementation of solutions based on practical and thoughtful cybersecurity with a competitive advantage.</p><p>Among the different axes addressed by the project, Axis 1 aims to secure the system before its deployment through testing approaches. These approaches will be based on techniques derived from artificial intelligence in order, on the one hand, to predict the interesting test cases based on knowledge of the system, its history and the external components used and, on the other hand, to efficiently explore the space of possible states to find interesting new test cases. For example, machine learning algorithms to detect potential flaws and vulnerabilities from the source code, its evolution and the APIs used, and evolutionary algorithms to generate tests and test data (search-based testing algorithms, fuzzing, etc.). These actions can be carried out in collaboration with the ARIAC Artificial Intelligence project funded by the Walloon region. Results will be produced for the two broad classes of cybersecurity testing, (1) cybersecurity functional testing and (2) penetration testing.</p><p>More information: <a href=\"https://www.digitalwallonia.be/fr/publications/cyberexcellence-projet-recherche-cybersecurite\" target=\"_blank\">https://www.digitalwallonia.be/fr/publications/cyberexcellence-projet-recherche-cybersecurite</a> (in French).</p><p><strong>Job description</strong></p><p>The position is a 2-years (renewable) contract, funded by the CyberExcellence project. The person hired will join the SNAIL team (<a href=\"https://snail.info.unamur.be/\" target=\"_blank\">https://snail.info.unamur.be</a>) and be actively involved in research leading to a doctoral thesis within the Namur Digital Institute (<a href=\"https://nadi.unamur.be/\" target=\"_blank\">https://nadi.unamur.be</a>). This thesis will aim at the definition, implementation, and evaluation of test approaches for cybersecurity within the CyberExcellence project, in collaboration with the project's various academic and industrial partners.</p><p>The objectives of the thesis are the following:</p><ul><li>Defining and assessing predictive approaches to identify potential vulnerabilities in given source code.</li><li>Understanding the link between detecting a potential vulnerability and the behaviour leading to its (specific) exposure. This objective aims at a better prediction of potentially problematic behaviours, while allowing automation (partial or not) of the definition of oracles allowing to detect these behaviours.</li><li>Defining and evaluating automatic test generation approach to verify the non-exposure of (potential) detected vulnerabilities.</li></ul><h3>Profile</h3><p><strong>Job requirement</strong></p><p>Those who apply will carry:</p><ul><li>a Master's degree (120 ECTS credits) in Computer Science, or equivalent,</li><li>or a Civil Engineering degree with good computer skills, or equivalent.</li></ul><p>The person hired will demonstrate:</p><ul><li>interest for software testing or cybersecurity;</li><li>ability to integrate and work in a research team;</li><li>good communication and presentation skills in English (read, written, spoken), knowledge of French is considered as a plus,</li><li>sense of initiative and responsibility, autonomy, and organization.</li></ul><p>Note: soon to be graduating master students are welcome to apply provided that they will have graduated before the start of the position. Candidates that already hold a PhD degree are not eligible.</p><h3>Additional information</h3><p>For additional information please do not hesitate to contact:</p><ul><li>X. DEVROEY - <a href=\"https://xdevroey.be/\" target=\"_blank\">https://xdevroey.be</a> - contact: <a href=\"mailto:xavier.devroey@unamur.be\">xavier.devroey@unamur.be</a></li><li>J.-N. COLIN - <a href=\"https://infosec.unamur.be/members/jnc.html\" target=\"_blank\">https://infosec.unamur.be/members/jnc.html</a> - contact: <a href=\"mailto:jean-noel.colin@unamur.be\">jean-noel.colin@unamur.be</a></li></ul><h3>Remarks</h3><p><strong>Contract</strong>: fixed term contract, two-years (renewable).</p><p><strong>Expected starting date</strong>: July 1st, 2022 (negotiable, depending on COVID or candidate constraints).</p><p><strong>How to apply</strong></p><p>Applications should be sent by e-mail to <a href=\"mailto:xavier.devroey@unamur.be\">xavier.devroey@unamur.be</a> and <a href=\"mailto:jean-noel.colin@unamur.be\">jean-noel.colin@unamur.be</a> and contain the following:</p><ul><li>a motivation letter describing the interest in the research topic;</li><li>a recent CV;</li><li>a copy of diplomas (Bachelor and Master, if available);</li><li>the name and e-mail address of one reference person to be contacted upon request.</li></ul><p>A dedicated selection committee will examine applications.</p><p><strong>Submission deadline</strong>: May, 1st, 2022 (11h59 pm AoE).</p><p><i>The human resources management policy of the University of Namur is based on respect for equal rights and equal treatment for all. This diversity is articulated around different axes, including gender, disability, origin, beliefs, age, sexual orientation, etc. The University of Namur is also a signatory of the charter of diversity</i>.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE1XC8wNFwvbmFtdXIuanBnIiwiZWRpdHMiOltdfQ=="}