{"url": "https://academicpositions.com/ad/southern-university-of-science-and-technology-sustech/2021/professors-associate-professors-assistant-professors/164510", "title": "Professors / Associate professors / Assistant Professors", "publish_date": "2021-10-11", "deadline": "N/A", "location": "No. 1088 Xueyuan Avenue, Nanshan District Shenzhen, China", "city": "N/A", "country": "China", "position": "Research Assistant", "field": "Aesthetics, Architecture and Design, Arts and Culture, Big Data, Cognitive Psychology, and 33 moreCommunication Design,Computer Graphics,Computer Science,Computer and Society,Computing in Social science, Arts and Humanities,Cultural Studies,Design History,Distributed Computing,Education,Engineering,Fashion Design,Film Studies,Game Design,Graphic Design,Human-computer Interaction,Industrial Design,Industrial Engineering,Interior Design,Landscape Architecture,Mechatronics,Media Education,Media Psychology,Philosophy,Product Design,Psychology,Robotics,Social Psychology,Social Science,Sociocybernetics,Software Design,Spatial Planning,Urban Design,Visual Arts", "salary": "N/A", "max_working_hours": "N/A", "employer": "Southern University of Science and Technology SUSTECH", "job_description": "The School of Design, SUSTechThe School of Design at the Southern University of Science and Technology (SUSTech) in Shenzhen is recruiting academic staff for multiple full-time tenure-track positions at all ranks, including Professor/Associate Professor/Assistant Professor in the following areas of design practice, with a preference for those able to work across two or more of the fields: Object Design: working at all scales of designed functional objects; the structural optimization of products; service provision; enhancing the competitiveness and effectiveness of products and processes; and improving the quality and efficiency of supply systems. Interaction Design: enabling and enriching interactions including service design, gaming and IoT; engaging with artificial intelligence (AI); big data; interactions of devices and sentient beings; augmented reality (AR); and virtual reality (VR). Experience Design: developing and extending the range of experiences including gaming and animation; enriching scriptwriting and narration; extending the range of interaction to enhance experience including AR and VR; advancing the applications of AI in design and uses. Wearables Design: engaging in the full range of wearables, including fashion, jewelry, as well as but not limited to those augmenting capabilities and functionalities, working with advances in materials and cultures. Environment Design: working in both tangible and intangible environments, analogue and digital, from interiors to urban contexts, with a particular engagement in data-driven design and in the coupled urban and natural systems. The School is particularly interested in experienced researchers and teachers of design as the context for translation of advances in science and technology to societal advantage, particularly through high quality studio teaching. Additionally, particular expertise in: History and theory of design or a particular relevant area in design Engineering, manufacturing and parts design Advanced manufacturing and digital / robotic fabrication Design management and branding Applicants should demonstrate their strengths in one or more of these areas, with documented capabilities of collaborative practice to bridge science and technology to design delivery.Appointments in one area of focus may be required to teach cognate subjects in other programs.The education offered at the School of Design integrates research with learning with a strong interdisciplinary and industry focus and draws upon the strengths of SUSTech in advanced manufacturing, new materials and artificial intelligence. Teaching at SUSTech is bilingual, either English or Putonghua. It is perfectly acceptable to use English in all lectures, assignments, and assessments.Roles and ResponsibilitiesFull time (teaching and research):Positions available: Professor / Associate / Assistant ProfessorPrimary roles and responsibilities full time appointments: Assist in developing an undergraduate curriculum and course content as directed; Teach a design studio and a seminar course each semester; Develop a research program and/or design project that draws on connections to capacities in Shenzhen; Provide students with appropriate learning materials and expertise in assigned subjects; Evaluate studentsâ\u0080\u0099 performance and provide effective feedback to guide student learning and success; Responsible for contributing to and maintaining an inclusive and collaborative environment; Actively participate in a residential college of the university to provide student mentoring. Qualifications Hold a terminal degree in a relevant field, preferably an earned doctorate and / or demonstrated exemplary success in industry and practice; A track record of high quality, peer recognized, design and research outcomes such as design awards, publications, exhibition and commissions;&nbsp; A track record in teaching and research commensurate with the level of appointment; Demonstrated ability to work collaboratively across disciplines and cultures. Terms &amp; ApplicationsApplications should specify the position sought and address the roles and responsibilities described. Applicants should have an earned Ph.D. degree and demonstrated achievements in both research (including in practice) and teaching. SUSTech has identified entrepreneurship as one of the main directions of the university. Strong support will be provided to possible new initiatives and candidates with experience in entrepreneurship and the translation of research through design are invited to apply.SUSTech is committed to increase the diversity of its faculty and has a range of family-friendly policies in place. The university offers competitive salaries and fringe benefits including medical insurance, retirement and housing subsidy, which are among the best in China. Salary is internationally competitive and rank will be commensurate with qualifications and experience. More information can be found at http://talent.sustech.edu.cn/enWe provide some of the best start-up packages in the sector to our faculty members, including doctoral studentship, postdoctoral fellowships, and start-up funding.Application ProcedureTo apply, please provide a cover letter identifying your primary area of academic focus, a curriculum vitae, a selective portfolio of up to 10 A4 pages and research and teaching statements, and forward them to designschool@sustech.edu.cn.The City and The University&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Established in 2012, the Southern University of Science and Technology (SUSTech) is a public institution funded by the municipal of Shenzhen, a special economic zone city in China. Shenzhen is a major city located in Southern China, situated immediately north to Hong Kong Special Administrative Region.As one of China's major gateways to the world, Shenzhen is the country's fastest-growing city in the past two decades and has been designated a UNESCO City of Design. As a State-level innovative city, the city is the high-tech and manufacturing hub of southern China, home to the world's third-busiest container port, and the fourth-busiest airport on the Chinese mainland. The city is home to more than 6,000 design firms accounting for 100,000 employees and is an important center for the development of intellectual property rights. About 40,000 patents are granted to Shenzhen enterprises annually, half of which are concerned with innovative designs.As a picturesque coastal city, Shenzhen is also a popular tourist destination and was named one of the top 10 travel destinations in the world by Lonely Planet 2019.SUSTech is a pioneer in higher education reform in China. The mission of the University is to become a globally recognized research university which emphasizes academic excellence and promotes innovation, creativity and entrepreneurship. Set on five hundred acres of wooded landscape in the picturesque Nanshan (South Mountain) area, the campus offers an ideal environment for learning and research.The School of Design The School of Design has been established in 2020 as the first step toward establishment the Shenzhen Institute of Design and Innovation, an independent tertiary institution for research and learning in design. The School of Design, later the Institute, will contribute to the development of Shenzhen as a world-leading center for innovation and creative industries. The Institute is expected to grow over to comprise 800 students by 2024 towards a target of 5000 students, maintaining a student:staff ratio of 8:1.The school articulates the position of design as a responsible agency and practice in society and the global environment. The curriculum will offer research-engaged design undergraduate education in the fields of design in objects, wearables, experiences, interactions and environments, and postgraduate study in design strategy and management, as well as doctoral studies, all closely connected to industry. A well-equipped campus is being built for the Institute in Baoâ\u0080\u0099an in the western section of Shenzhen and should be ready for use in 2025.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Welcome to SUSTech, a public university with the vision to excel in interdisciplinary research, to nurture innovative talents and to deliver new knowledge to the world.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJmY2JcLzZkN1wvZmNiNmQ3MmFkZGExYjU5OTM0Nzk3MWFjMWE2OTM2ODEucG5nIiwiZWRpdHMiOltdfQ=="}