{"url": "https://academicpositions.com/ad/cemm/2022/cemm-international-postdoc-program-vienna-austria-pre-erc-postdoc-program-in-cellular-molecular-and-digital-medicine-m-f-d/174985", "title": "CeMM International Postdoc Program (Vienna, Austria) Pre-ERC Postdoc Program in Cellular, Molecular and Digital Medicine (m/f/d)", "publish_date": "2022-02-08", "deadline": "2022-03-12", "location": "Lazarettgasse 14, AKH BT 25.3 Vienna, Austria", "city": "N/A", "country": "Austria", "position": "Postdoc", "field": "Biochemistry, Bioengineering, Bioinformatics, Biomedical Engineering, Biomedicine, and 9 moreCancer Research,Cell Biology,Computational Biology,Genetics,Immunology,Infectious Diseases,Medical Imaging,Molecular Biology,Molecular Medicine", "salary": "N/A", "max_working_hours": "N/A", "employer": "CeMM", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>We are recruiting a group of <strong>postdocs</strong> who are eager to pursue groundbreaking biomedical research, and we will help them to establish themselves as <strong>future scientific leaders</strong>. This postdoc program is designed to prepare postdoctoral researchers for a successful ERC Starting Grant application and for an independent research career in top research organizations in Europe and around the world.</p><p>The postdoc program is based at the <strong>CeMM Research Center for Molecular Medicine of the Austrian Academy of Sciences in Vienna</strong>, one of Europeâ\u0080\u0099s leading centers for basic biomedical research â\u0080\u0093 with clinical translation in mind. Selected candidates will join one of CeMMâ\u0080\u0099s research groups for 3 to 6 years, addressing ambitious research questions in areas such as cancer, immunology, chemical biology, epigenetics, metabolism, and genomic medicine. Research projects will focus on medically relevant problems, including disease mechanisms, modern therapeutics and diagnostic strategies. On top of this, postdocs will receive extensive career development and leadership training from the entire CeMM Faculty and additional experts in a highly collaborative and supportive environment.</p><p><strong>What we offer:</strong></p><ul><li>An international group of highly collaborative colleagues that will help you achieve your scientific and career goals</li><li>Top-notch environment with the ideas, projects, resources, infrastructure, collaborations, and mindset for groundbreaking research</li><li>Excellent track record of past postdocs who have become internationally successful principal investigators, professors, entrepreneurs</li><li>Strong focus on disease biology and translational research: cancer, metabolic disorders, inflammation/infection, drug discovery</li><li>Interdisciplinary projects connecting biology with medicine, experiments with computation, and discovery with translation</li><li>Unique opportunity to engage close interactions with physicians and clinical researchers at the Medical University of Vienna on one of Europeâ\u0080\u0099s largest medical campuses</li><li>Opportunities to collaborate with industry (biotech/pharma) and to get involved in academic start-up/spin-off companies</li><li>Training program in project management, scientific writing, visual communication, entrepreneurship, leadership and data science</li><li>Special training for writing successful ERC Starting Grants as a â\u0080\u0098ticketâ\u0080\u0099 to an outstanding academic career</li><li>Mentoring Program within EU-LIFE (https://www.eu-life.eu), an alliance of 15 top research centers in life sciences to support and strengthen European research excellence</li><li>Being part of a thriving academic and social community in Vienna, one the cities with the best quality-of-life in the world</li><li>A competitive postdoc salary according to the Austrian Science Fund (https://www.fwf.ac.at), which amounts to an annual gross salary slightly above EUR 55,000. The CeMM employment contract includes full insurance (health, accident, pension) and a one-off payment for moving</li><li>CeMMâ\u0080\u0099s HR department and administrative team offers support with relocation, visa applications, onboarding, family support, etc.</li></ul><p><strong>Whom we are looking for:</strong></p><ul><li>Candidates who want to pursue innovative biomedical research and substantially advance their scientific career</li><li>Candidates with international professional experience and enhanced potential to receive an ERC Starting Grant in the future</li><li>Open to both PhD (natural sciences) and MD (medical sciences) holders</li><li>From a variety of academic backgrounds: molecular biology, biomedical research, bioinformatics, biochemistry, bioengineering, etc.</li><li>With the motivation, skills, experiences, and initial achievements (subject to academic age) to qualify for a competitive postdoc program</li><li>Required are scientific quality and originality, as well as a collaborative and interdisciplinary mindset</li></ul><p><strong>Potential projects:</strong></p><ul><li>Cancer immunology and organoids (<a href=\"https://cemm.at/research/groups/christoph-bock-group/\" target=\"_blank\">Bock Lab</a>). Development of immune-enriched organoids for precision medicine. Single-cell sequencing, spatial multi-omics and/or 3D imaging of the tumor immune microenvironment</li><li>Bioinformatics for precision medicine (<a href=\"https://cemm.at/research/groups/christoph-bock-group/\" target=\"_blank\">Bock Lab</a>). Integrative analysis of single-cell sequencing, multi-omics and spatial imaging in rare genetic diseases and/or cancer. Optional focus on computational reconstruction of epigenetic landscapes.</li><li>Immunometabolism (<a href=\"https://cemm.at/research/adjunct-pis/andreas-bergthaler-cemm\" target=\"_blank\">Bergthaler Lab</a>). Mechanisms of systemic immunometabolism in infection.</li><li>Chemical Biology (<a href=\"https://cemm.at/research/groups/stefan-kubicek-group\" target=\"_blank\">Kubicek Lab</a>). Targeting metabolic activities in the cellâ\u0080\u0099s nucleus.</li><li>DNA damage response (<a href=\"https://cemm.at/research/adjunct-pis/joanna-i-loizou-group-cemm\" target=\"_blank\">Loizou Lab</a>). 'New discoveries in the DNA damage response through genetic, physical and chemical approaches.</li><li>Spatial Biology (<a href=\"https://cemm.at/research/groups/andre-rendeiro-group\" target=\"_blank\">Rendeiro Lab</a>). Understanding the relationships between tissue integrity, aging, and disease onset.</li><li>Membrane transporters (<a href=\"https://cemm.at/research/groups/giulio-superti-furga-group\" target=\"_blank\">Superti-Furga Lab</a>). Danger at the metal gates: investigate how metals enter cells and bring life or death.</li><li>Targeted Protein Degradation (<a href=\"https://cemm.at/research/groups/georg-winter-group\" target=\"_blank\">Winter Lab</a>). Advancing the discovery of molecular glues and proximity-inducing pharmacology beyond targeted protein degradation.</li><li>We are open to other ideas that fit into the broader scope and mission of the CeMM Research Center for Molecular Medicine</li></ul><p><strong>The Institute </strong>(<a href=\"http://www.cemm.at/\" target=\"_blank\">http://www.cemm.at/</a>)</p><p>CeMM is an international research institute of the Austrian Academy of Sciences and a founding member of EU-LIFE. The mission of CeMM is to achieve maximum scientific innovation in molecular medicine to improve healthcare. It has an outstanding track record of top-notch science (last few years: &gt;10 papers in Nature/Cell/Science/NEJM, &gt;25 papers in Nature/Cell sister journals) and medical translation. At CeMM, an international and creative team of scientists and medical doctors pursues free-minded basic life science research in a large and vibrant hospital environment of outstanding medical tradition and practice. CeMMâ\u0080\u0099s research is based on post-genomic technologies and focuses on societally important diseases, such as immune disorders and infections, cancer and metabolic disorders. We operate in a unique mode of super-cooperation, connecting biology with medicine, experiments with computation, discovery with translation, and science with society and the arts. The goal of CeMM is to pioneer the science that nurtures the precise, personalized, predictive and preventive medicine of the future, and to train a modern blend of biomedical scientists to make great contributions.</p><p>Vienna is frequently ranked the worldâ\u0080\u0099s best city to live. It is a United Nations city with a large English-speaking community. The official language at CeMM is English, and more than 49 different nationalities are represented at the institute. CeMM promotes equal opportunity and harbors a mix of different talents, backgrounds, competences, and interests.</p><p><strong>Eligibility Criteria:</strong></p><ul><li>You must hold a PhD (or will have been awarded your PhD by the time of starting the Pre-ERC Postdoc Program in March 2022) and your PhD defense date must be no earlier than 2019</li><li>You must have at least one first-author publication published by the time of starting the Postdoc</li></ul><p><strong>Please apply online</strong> <a href=\"https://cemm.jobbase.io/job/d61f2xlg\" target=\"_blank\">https://cemm.jobbase.io/job/d61f2xlg</a> with 1) a cover letter including a short summary of research interests and mentioning which research group(s) at CeMM you would be potentially interested in joining, 2) curriculum vitae (CV), 3) academic transcripts, and 4) contact details of three referees. Applications received by <strong>12 March 2022, 23:59 CET</strong> will be considered. The preferred starting date is October 2022 or earlier.</p><p><strong>Selection Process:</strong></p><p>All submitted applications are reviewed by the CeMM Faculty and selected candidates are invited to submit a recorded short presentation and research proposal. Shortlisted candidates are then invited to participate in online panel interviews with CeMM Faculty members which will take place at the end of September. At the end of the selection process, candidates will be asked to submit their preference regarding which research groups they would like to work with, which may be identical or different from the original choice indicated in the cover letter.</p><h4>Additional information</h4><p>City <strong>Vienna</strong></p><p>Position type <strong>Full-time employee</strong></p><p>Start of work <strong>01.10.2022</strong></p><h4>Responsible</h4><p>Matthew Spencer</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEzXC8wMlwvQ2VNTUxvZ28ucG5nIiwiZWRpdHMiOltdfQ=="}