{"url": "https://www.academictransfer.com/en/309210/projectleider-leren-ontwikkelen-08-10fte/", "title": "Projectleider Leren & Ontwikkelen (0,8-1,0fte)", "publish_date": "2022-02-08", "deadline": "2022-02-21", "location": "Burgemeester Oudlaan 50, 3062 PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "32—40", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "<p>Leren &amp; ontwikkelen vormt een belangrijk onderdeel van de EUR Strategie (<a href=\"https://www.eur.nl/over-de-eur/strategie-2024\">EUR Strategie-2024Opent extern</a>). In 2020 heeft het TOP-team een nieuwe visie en missie ontwikkeld op leren &amp; ontwikkelen:&nbsp;<strong>A Great Place to Grow</strong>. Belangrijke doelstellingen van de nieuwe visie en missie zijn het versterken van een lerende cultuur en het professionaliseren van de processen omtrent learning &amp; development.</p><p>In deze functie ben je verantwoordelijk voor het bouwen aan een toekomstbestendige inbedding van de visie op leren en ontwikkelen in de hele organisatie. Dit doe je in nauwe samenwerking met LCC-collega&rsquo;s, HR advies collega&rsquo;s en leidinggevenden. Je onderhoudt zelfstandig contact met betrokken interne en externe stakeholders op zowel strategisch als tactisch niveau. Daarnaast onderzoek je als Projectleider de mogelijkheden om een centraal digitaal platform op te zetten voor het LCC (Learning Management System).</p><p>Ook ben je verantwoordelijk voor:</p><ul> <li>Het managen van een groot aantal deelprojecten voortkomend uit het visie/missie projectplan</li> <li>Het inhoudelijk aansturen van EUR-brede activiteiten op het terrein van leren en ontwikkelen.</li> <li>De regie op het inrichten van uniforme processen op het gebied van leren en ontwikkelen.</li> <li>Het cre&euml;ren van bewustwording en het betrekken van de organisatie &nbsp;tav leren en ontwikkelen.</li> <li>De communicatie met en naar alle stakeholders.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}