{"url": "https://academicpositions.com/ad/york-university/2021/professor-in-planning/164946", "title": "Professor In Planning", "publish_date": "2021-10-21", "deadline": "N/A", "location": "4700 Keele St Concord, Canada", "city": "N/A", "country": "Canada", "position": "Assistant Professor", "field": "Architecture and Design, Social Science, Spatial Planning, Urban Studies,", "salary": "N/A", "max_working_hours": "N/A", "employer": "York University", "job_description": "The Faculty of Environmental and Urban Change (EUC), York University, invites highly qualified candidates across career stages to apply for a professorial stream tenured or tenure-track appointment in Planning at an Assistant or Associate Professor level, to commence July 1, 2022. Salary will be commensurate with qualifications and experience. All York University positions are subject to budgetary approval.This position is open to qualified individuals who self-identify as Black peoples of African Descent (for example Africans and African heritage people from the Caribbean, Americas, Europe). The position is part of a cohort of Designated Black Faculty Hiring program across York University, which recognizes the underrepresentation of Black faculty, supports the Universityâ\u0080\u0099s Affirmative Action program and is based on the special program provisions of the Ontario Human Rights Code. The successful candidate will be joining a vibrant scholarly community at York, where we aspire to achieve equity and diversity in all areas, including race equity.Candidates will hold a PhD (or a PhD completed by the start of the appointment) in Planning or a related field. We are seeking candidates who work at the intersection of either: Land and economic development (for example, political economies of land rent, Indigenous land rights, real estate, public finance, alternative forms of economic development, regional or local economic development planning, community development finance, community land trusts); or Mobilities and critical urban infrastructure (for example, critical research on transportation, active mobilities, digital technology networks, big data and â\u0080\u0098smart cityâ\u0080\u0099 analytics). Demonstrated research or teaching interests that consider the relationships between race, ethnicity, class, disability, gender, sexuality, and planning (from a local or global perspective) would be an asset. To support planning education in our Faculty, candidates who hold an accredited professional degree are preferred, or they must seek accreditation within a mutually agreed reasonable amount of time after the acceptance of the job offer.The successful candidate will be expected to engage in outstanding, innovative, and, as appropriate, externally funded research at the highest level. Candidates must provide evidence of research excellence or promise of research excellence of a recognized international calibre as demonstrated in: the research statement; a record of publications (or forthcoming publications) with significant journals in the field; knowledge mobilization and community engagement; presentations at major conferences; awards and accolades; and strong recommendations from referees of high standing. The successful candidate will exhibit strong capacity and potential for outstanding teaching contributions at the graduate level. The successful candidate will also contribute to undergraduate teaching within the EUC, emphasizing a planning informed curriculum, focusing on cities, regions and sustainable development, among others. The successful candidate will commit to academic and pedagogical excellence, including attention to equity and diversity.The position will involve graduate teaching and supervision and the successful candidate must be suitable for prompt appointment to the Faculty of Graduate Studies. Evidence of excellence or promise of excellence in teaching will be provided through: the teaching statement; teaching accomplishments and pedagogical innovations including in high priority areas such as experiential education and technology enhanced learning; teaching evaluations; and strong letters of reference. Experience with experiential education (which may include community-based inquiry, production and dissemination), and the ability to teach and contribute to build planning skills in both the Facultyâ\u0080\u0099s graduate and undergraduate programs is expected. Finally, the successful candidate will be required to make substantive contributions through service to the Faculty.The Faculty of Environmental and Urban Change at York University explicitly addresses the distinct, yet interconnected, challenges of environmental change and urbanization, with a focus on innovating diverse transitions to a sustainable and just future. EUC champions interdisciplinarity through curricular programs and scholarship; emphasizes field-based and experiential learning to enhance understanding of biophysical processes and social potentials; embraces global perspectives so that this understanding is derived from a broad range of places; and pursues community-engaged endeavours to generate meaningful scholarship and to train active citizens, innovators and leaders. As a community, we believe that making positive change requires bold and diverse thinking, ambitious action, and community engagement. We are inclusive and devoted to making the world a better place for all. EUC is currently home to five undergraduate programs leading to BES, BA, and BSc degrees, Masterâ\u0080\u0099s programs in Environmental Studies (MES and MES/JD), Geography (MA and MSc) and Planning (MES); and PhD programs in Environmental Studies and Geography; as well as a number of programs with certificates and diplomas. See&nbsp;https://euc.yorku.ca/programs/.York is a leading international teaching and research university, and a driving force for positive change. Empowered by a welcoming and diverse community with a uniquely global perspective, we are preparing our students for their long-term careers and personal success. Together, we can make things right for our communities, our planet and our future.York University is located in Toronto, in the heart of a rapidly growing and profoundly diverse city-region. The city, which has historically been a place of planning and governance innovation, remains a site of contestation over planning policy and experimentation at the forefront of both technological advance and progressive planning debates and action.York University has a policy on Accommodation in Employment for Persons with Disabilities and is committed to working towards a barrier-free workplace and to expanding the accessibility of the workplace to persons with disabilities. Candidates who require accommodation during the selection process are invited to contact the Search Committee at:&nbsp;euchires@yorku.ca.This position is open to qualified individuals who self-identify as Black peoples of African Descent (for example Africans and African heritage people from the Caribbean, Americas, Europe). York University is an Affirmative Action (AA) employer and strongly values diversity, including gender and sexual diversity, within its community. York University encourages Black peoples to self-identify as a member of one or more of the four designated groups: women, members of visible minorities (racialized groups), Aboriginal (Indigenous) people and persons with disabilities. The Affirmative Action program can be found at&nbsp;www.yorku.ca/acadjobs&nbsp;&nbsp;or by calling the AA line at 416-736-5713. Applicants wishing to self-identify as part of York Universityâ\u0080\u0099s Affirmative Action program can do so by downloading, completing and submitting the form found at:&nbsp;http://acadjobs.info.yorku.ca/affirmative-action/self-identification-form. All qualified candidates are encouraged to apply; however, Canadian citizens, permanent residents and Indigenous peoples in Canada will be given priority. No application will be considered without a completed mandatory Work Status Declaration form which can be found at&nbsp;http://acadjobs.info.yorku.ca/affirmative-action/work-authorization-form.We invite suitable candidates to submit the following: a cover letter outlining their qualifications (including statements of research and teaching interests) for the position as described above. a curriculum vitae; York Universityâ\u0080\u0099s self-identification form, which can be found at&nbsp;https://acadjobs.info.yorku.ca/affirmative-action/self-identification-form/ a sample of publications (a maximum of two); letters from three referees with knowledge of their work and/or recognized expertise (at least two of the references must be academic) must be sent to&nbsp;EUCHires@YorkU.ca&nbsp;by November 22, 2021. Applications will be accepted until the position is filled.&nbsp;The review of applications will begin on November 15, 2021.&nbsp;Materials should be sent electronically to the email address below.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Canada's third largest interdisciplinary research and teaching institution.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI4YjZcLzA5MFwvOGI2MDkwNDY1OTQzMzRlNTI2NjU3NzhmMzBmNjM2YjUucG5nIiwiZWRpdHMiOltdfQ=="}