{"url": "https://academicpositions.com/ad/ca-foscari-university/2022/assistant-professor-in-the-area-of-informatics/174119", "title": "Assistant Professor in the area of Informatics", "publish_date": "2022-01-18", "deadline": "2022-02-17", "location": "Dorsoduro 3246 Venice, Italy", "city": "N/A", "country": "Italy", "position": "Assistant Professor", "field": "Computational Sciences, Data Structures, Databases, Informatics, Information Systems (Business Informatics), and 1 moreProgramming Languages", "salary": "N/A", "max_working_hours": "N/A", "employer": "Caâ\u0080\u0099 Foscari University of Venice", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>Caâ\u0080\u0099 Foscari invites applications for a tenure-track position for an Assistant Professor in the area of </strong><i><strong>Informatics</strong></i></p><p>Caâ\u0080\u0099 Foscari is engaged in achieving a world-class scientific environment, recruiting the best talents worldwide. Our talented young researchers and experienced senior professors collaborate to make Caâ\u0080\u0099 Foscari a stimulating environment for career development and freedom of research. Our University is committed to achieving excellence in research, funding promising researchers and developing international partnerships. As a leading research university, Caâ\u0080\u0099 Foscari has set a new agenda designed around six global challenges, exploring cutting-edge research directions that cross disciplinary boundaries.</p><p>Caâ\u0080\u0099 Foscari is looking for a researcher of Informatics capable of inspiring students to become game-changers in their own fields and to make a genuine difference in the world. </p><p>Teaching: the assistant professor will be involved in both basic and advanced computer science courses, at graduate and undergraduate levels:</p><p>PROGRAMMAZIONE E LABORATORIO </p><p>DATA MANAGEMENT </p><p>INFORMATICA </p><p>The assigned courses may be changed by the Department according to the didactic activities approved each year.</p><p>Research: Her/his scientific activity should contribute to the enhancement of the scientific production in computer science at the Department, while promoting international and national research projects, included interdisciplinary projects, and technological transfer activities</p><p>The position is at the <a href=\"https://www.unive.it/pag/28183\" target=\"_blank\">Department of Environmental Sciences, Informatics and Statistics</a>. </p><p>The Department is engaged in multidisciplinary research, carried out by brilliant researchers in the fields of environmental systems analysis, management and modelization of environmental and informatic systems, climate studies, complexity, preservation of cultural heritage and sustainability.</p><p>The Institution</p><p>Since its foundation in 1868, Caâ\u0080\u0099 Foscari University of Venice has been a leader in Economics and Foreign Languages and Cultures. Today, Caâ\u0080\u0099 Foscari is exploring new frontiers in research, focusing on Climate Change, Digital Humanities, Digital and Social Innovation, and Nanosciences. An intellectual powerhouse of international repute in the heart of the city of Venice, Caâ\u0080\u0099 Foscari provides a one-of-a-kind blend of scientific research, cultural heritage and history, offering a life-changing experience to its students and researchers, with a transformative impact on the local community.</p><p>Caâ\u0080\u0099 Foscari University of Venice has also obtained the full Human Resources Strategy for Researchers certificate, a set of initiatives to improve work conditions for researchers and to attract talents worldwide. Caâ\u0080\u0099 Foscari provides applicants with exclusive services and onboarding initiatives. Our <a href=\"https://www.unive.it/pag/19768/\" target=\"_blank\">Housing office</a> will help you search for a suitable and convenient accommodation, matching your needs and preferences with the available options.</p><p>If you are a non-Italian applicant or if you have resided outside of Italy for more than 3 years, you will benefit from a favorable tax treatment for the first 4 years of the contract.</p><p>Read the call here: <a href=\"https://www.unive.it/data/38002/?id=2022-UNVE000-0001818\" target=\"_blank\">https://www.unive.it/data/38002/?id=2022-UNVE000-0001818</a> </p><p>Application deadline: 17th February at 1pm. </p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI2ZDhcL2NkMVwvNmQ4Y2QxNjU1NDIxOTEwNGU0ZTFjYzc2NDIyZTE4MjYucG5nIiwiZWRpdHMiOltdfQ=="}