{"url": "https://academicpositions.com/ad/xamk-south-eastern-finland-university-of-applied-sciences/2022/language-specialist/174627", "title": "Language Specialist", "publish_date": "2022-01-28", "deadline": "2022-02-27", "location": "Patteristonkatu 3 Mikkeli, Finland", "city": "N/A", "country": "Finland", "position": "Engineer/Technician", "field": "Applied Linguistics, Germanic languages, Scandinavian languages, West Germanic languages,", "salary": "N/A", "max_working_hours": "N/A", "employer": "XAMK (South-Eastern Finland University of Applied Sciences)", "job_description": "The best way to know tomorrow is to create it yourself, and thatâ\u0080\u0099s why we want to bring together the makers of tomorrow at Xamk. Working with us, you can have an impact on the work of the future and on society at large. Together, we can make our mark where itâ\u0080\u0099s needed the most. How do you want to make yours?We have a full time opening for the permanent position ofLANGUAGE SPECIALIST, starting on 1.4.2022.The position is located in the new publication and production unit.Key responsibilities include, Finnish-English translations, coordination of translation work, translation of Xamkâ\u0080\u0099s internal and external communication into English, translation memory maintenance, editing and proofreading in both English and Finnish, ensuring consistent high-quality language in professional and scientific articles, and other materials published by Xamk.Additional duties include, maintaining close collaboration with authors, content creators, language and publication specialists, and other team members, and contributing to the development of the Publication and Production Services unit.Required skills and qualifications are a relevant Masterâ\u0080\u0099s degree, fluent oral and excellent written English and Finnish, at least 3 years of experience in translating and/or proofreading, ICT skills and experience in using translation software.A successful candidate should also meet the following criteria: ability to work under pressure and meet tight deadlines, and work independently, while possessing outstanding organizational and coordination skills, the ability to synthesize information with clarity, and adapt materials to suit the situation and context.Other desirable skills include, versatile professional language skills, high level of cultural intelligence, and substantial knowledge of some of Xamkâ\u0080\u0099s research areas.Why work with us?At Xamk, you can make a difference and have an impact on society at large.We promote a good team spirit that is shared by staff and students alike. We strive for new knowledge and research together and are always ready and able to help each other out.At Xamk, you have the opportunity to plan your own work and working hours. We want you to be able to give the best of yourself both at work and in your free time.Your pay is determined in accordance with the Collective Agreement for the Private Teaching Sector. We take care of your wellbeing by offering extensive occupational health care services. We also support your recreation activities by providing sports, massage, and cultural benefits.At Xamk, we love to learn new things. We encourage each other to learn more and develop our own skills through our work. We want to support you to continuously update your skills and so we offer the opportunity to complete studies at Xamkâ\u0080\u0099s Open University of Applied Sciences, free of charge.What are the steps in the application process?&nbsp;You can apply for the position by clicking the Apply button at the bottom of this page. Please also attach your CV to the application. If you are selected for the position, you will need to present your original education and employment certificates.The first round of interview is planned for weeks 8-10.After this, we will invite some of the candidates to the next round / aptitude assessment.Once the successful candidate has been selected, we will contact all applicants.If you have any questions or would like to discuss the position in more detail, please contact the person below.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Xamk is the 5thÂ largest university of applied sciences in Finland.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI5NmRcLzYwZVwvOTZkNjBlM2QwMDUyMDgyNTkyMjdjMTI2ZTFkMzRjMjMucG5nIiwiZWRpdHMiOltdfQ=="}