{"url": "https://academicpositions.com/ad/ku-leuven/2022/developing-the-alignment-control-for-the-et-pathfinder-mirrors/175061", "title": "Developing the Alignment Control for the ET(-pathfinder) Mirrors", "publish_date": "2022-02-09", "deadline": "2022-03-14", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Other Category", "field": "Astronomy, Astrophysics, Control Systems Engineering, Engineering Physics, Optics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-85)The Institute of Astronomy (IoA) of KU Leuven is a young and vibrant research group of about 90 scientists, engineers, and administrative staff, including 6 full-time and 3 part-time professors. The institute is an expertise centre in stellar physics and astrophysical instrumentation, and is active in several international consortia and collaborations, involving telescopes at observatories worldwide and in space. Members of IoA have access to parallel computing facilities at the Flemish Supercomputer Centre. The IoA is responsible for the organisation of the Master of Astronomy &amp; Astrophysics and the Advanced Master of Space Studies of the Faculty of Science, and operates the 1.2m Mercator telescope at Roque de los Muchachos, La Palma Observatory, Canary Islands. The institute has a long tradition in instrumental, observational, and theoretical studies of stellar evolution. The Department of Gravitational Waves and Fundamental Physics (GWPF) at the University of Maastricht was established as a new research center in 2019. It consists of 9 tenured professors, of which 6 work on Gravitational waves. GWFP is also a full member of NIKHEF, the Dutch national laboratory for sub-atomic particles. Together, Maastricht University and NIKHEF are leading the construction of ETpathfinder, a low-noise testbed for ET in Maastricht. Funded with about 15 million Euros of capital investment, a consortium of nearly 20 research institutions and universities from the Netherlands, Belgium, Germany and France are collaborating on ETpathfinder, employing cutting edge technology on optics, seismic isolation, vacuum, controls and cryogenic technology.Website unitResponsibilitiesThe goal of this project is to define the optimal control strategy for aligning the mirrors of the ETpathfinder interferometer and, later on, of ET. Specifically, we intend to determine the most efficient and accurate way to sense the interferometer beams, and to develop the required tools for this (e.g. optical lever technology). Furthermore, we will identify the optimal control scheme for the automatic alignment of the interferometer mirrors with minimal impact on strain sensitivity. The activities in this project are a combination of design, analysis, simulations and laboratory experiments, both in the field of optics as well as control systems. It will be carried out partly at the Institute of Astronomy of KU Leuven (Belgium), and partly at ETpathfinder in Maastricht (Netherlands).ProfileA PhD degree in physics, astrophysics, engineering or a related field;Experience with gravitational wave instrumentation, preferably closely related with the project;Strong affinity with hands-on experimental (optical) lab work;A cooperative attitude and the ability to work independently;Committed to intense collaboration between both institutes and prepared to regular trips to the ETpathfinder facility in Maastricht (1h15 by train from Leuven).OfferA&nbsp;2-year contractA cutting-edge project in an emerging science field with a bright futureA&nbsp;stimulating, multidisciplinary and international environmentSalary commensurate to the standard scale for post-doctoral researchers at KU LeuvenSocial and medical insurance, pension rights, and various extra extra-legal benefitsStarting date is negotiable but we prefer as soon as possible.Interested?To apply for this position, please follow the online application tool and enclose:1) Full CV with publication list2)&nbsp;A motivation letter(max.1 page)&nbsp;3)&nbsp;A research statement (max. 2 pages)4)&nbsp;contact details of two referees prepared to provide a reference letter when requestedFor more information please contact Dr. Gert Raskin, tel.: +32 16 32 33 46, mail: gert.raskin@kuleuven.be or Dr. Clio Gielen, tel.: +32 16 37 46 28, mail: clio.gielen@kuleuven.be.You can apply for this job no later than March 14, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}