{"url": "https://www.academictransfer.com/en/309276/phd-position-in-creating-a-quantum-gate-with-trapped-ions-and-optical-tweezers/", "title": "PhD Position in Creating a Quantum Gate with Trapped Ions and Optical Tweezers", "publish_date": "2022-02-09", "deadline": "2022-04-15", "location": "Science Park 904, 1098 XH, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "PhD", "field": "Natural sciences", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "38", "employer": "University of Amsterdam (UvA)", "job_description": "<p>Are you a highly-motivated student seeking to perform state-of-the-art atomic physics experiments in a diverse, supportive and friendly group? Then we are looking for you!</p><p>The hybrid atom-ion quantum systems lab, headed by Dr. Rene Gerritsma, is part of the Quantum Gases and Quantum Information (QGQI) cluster at the University of Amsterdam. The main focus of the group is to study the quantum dynamics in trapped ions while at the same time developing technology for emerging quantum applications, such as quantum computing and simulation.</p><p>More information on our research can be found <a href=\"http://www.hyqs.nl\">on our&nbsp;webpage</a>.</p><p><strong>What are you going to do</strong><strong>?</strong></p><p>You will develop a new two-qubit gate using optical tweezers acting on trapped ions, based on the &#39;optical Magnus effect&#39;&nbsp;[1,2]. Your project is integral to our programmable trapped-ion platform for quantum simulation. You will:</p><ul> <li>measure the optical Magnus effect;</li> <li>design and build an objective with acousto-optic deflectors driven with multi-tone RF to produce multiple tweezer;</li> <li>simulate the gate mechanism to find the optimal parameters;</li> <li>optimize the gate fidelity for a two-ion crystal;</li> <li>investigate the scalability theoretically and apply results to longer ion crystals.</li> </ul><p>You will work in a team with two other PhD students, a post doc and several master students. Theory support will be supplied by the group of Dr. Arghavan Safavi-Naini.</p><p><strong>Relevant references</strong></p><p>[1] R.J.C. Spreeuw, <a href=\"https://link.aps.org/doi/10.1103/PhysRevLett.125.233201\">Phys. Rev. Lett. 125, 233201 (2020)</a><br> [2] M. Mazzanti et al., <a href=\"https://link.aps.org/doi/10.1103/PhysRevLett.127.260502\">Phys. Rev. Lett. 127, 260502 (2021)</a></p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>What do we require?</strong></p>\n<p>You should have or finish soon a MSc. in (theoretical or experimental) physics, physical chemistry or related fields. For your application, please attach a CV and a letter stating why you would like to join our group.</p>\n<p>Other skills/experiences/documents that would benefit your application, but are not required:</p>\n<ul>\n<li>previous laboratory experience in an atomic physics lab;</li>\n<li>excellent communication skills (English);</li>\n<li>scientific publications.</li>\n</ul>\n<p>To foster diversity in our research group, we will especially appreciate applications from female candidates.</p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 18 months.</p>\n<p><strong>Our offer</strong></p>\n<p>A temporary contract for 38 hours per week for the duration of four years (the initial contract will be for a period of 18 months and after satisfactory evaluation it will be extended for a total duration of four years). This should lead to a dissertation (PhD thesis). We will draft an educational plan that includes attendance of courses and (international) meetings. We also expect you to assist in teaching undergraduates and Master students. </p>\n<p>The salary, depending on relevant experience before the beginning of the employment contract, will be €2,443 to €3,122 (scale P) gross per month, based on a fulltime contract (38 hours a week). This is exclusive 8% holiday allowance and 8.3% end-of-year bonus. A favourable tax agreement, the ‘30% ruling’, may apply to non-Dutch applicants. The Collective Labour Agreement of <a href=\"https://www.universiteitenvannederland.nl/en_GB/cao-universiteiten.html\">Dutch Universities </a>is applicable.</p>\n<p>Are you curious about our extensive package of secondary employment benefits like our excellent opportunities for study and development? Take a look <a href=\"https://www.uva.nl/en/faculty/faculty-of-science/working-at-the-faculty/working-at-the-faculty-of-science.html\">here</a>.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>University of Amsterdam</h4>\n<p>With over 6,000 employees, 30,000 students and a budget of more than 600 million euros, the <a href=\"http://www.uva.nl/en\">University of Amsterdam (UvA)</a> is an intellectual hub within the Netherlands. Teaching and research at the UvA are conducted within seven faculties: Humanities, Social and Behavioural Sciences, Economics and Business, Law, Science, Medicine and Dentistry. Housed on four city campuses in or near the heart of Amsterdam, where disciplines come together and interact, the faculties have close links with thousands of researchers and hundreds of institutions at home and abroad.  </p>\n<p>The UvA’s students and employees are independent thinkers, competent rebels who dare to question dogmas and aren’t satisfied with easy answers and standard solutions. To work at the UvA is to work in an independent, creative, innovative and international climate characterised by an open atmosphere and a genuine engagement with the city of Amsterdam and society.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Do you have questions about this vacancy? Or do you want to know more about our organisation? Please contact:</p>\n<ul>\n<li><a href=\"mailto:r.j.c.spreeuw@uva.nl\">Dr. Robert Spreeuw</a>, tel. + 31 (0)20 525 5162</li>\n</ul>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uva.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uva-en-wide/22e1319f66e44f07d56047b996668aa9.png"}