{"url": "https://academicpositions.com/ad/ghent-university/2022/phd-student-department-of-biology/175140", "title": "PhD Student - Department of Biology", "publish_date": "2022-02-10", "deadline": "2022-03-15", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Bioengineering, Bioinformatics, Computational Biology, Ecology, Microbiology, and 1 moreOceanography", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "Last application date Mar 15, 2022 00:00Department WE11 - Department of BiologyContract Limited durationDegree Masterâ\u0080\u0099s degree in Sciences: Biology, Bio-informatics, Bioscience Engineering, Oceanography or equivalent diploma.Occupancy rate 100%Vacancy type Research staffJob descriptionThe Laboratory of Protistology and Aquatic Ecology (Ghent University) and Comparative Network Biology group (VIB) invite applications for a fully-funded PhD studentship for 1 year and extended with another 3 years (after positive evaluation) to study diatom speciation and adaptation.The PhD project forms part of an FWO funded research project to identify and characterise reproductive barriers reducing gene flow in benthic diatom metapopulations and to reconstruct the impact of past and ongoing gene flow on the evolution of their pan-genome. We offer an intellectually stimulating and international research environment, high-quality training to develop hard and soft skills, opportunities to participate in sampling campaigns and international scientific conferences, and a competitive salary including a bicycle commuting reimbursement. Ghent University is among the top global universities according to several international rankings.The PhD project includes:Establishing a global collection of isolates of the benthic diatom species complex Seminavis robusta,Quantifying the levels of introgression and pan-genomic differentiation based on genome resequencing of global isolates,Developing and applying assays to quantify the strength of intrinsic reproductive barriers,Characterizing divergence in the pheromone signaling cascade,Writing scientific publications and presenting research at international conferences,Supervising bachelor and MSc students during projects and practical courses,What we offer you?Tentative start date: 1 May 2022. The position is initially for one year but it will be extended with another 3 years after positive evaluation.You will receive a PhD scholarship according to the general conditions at Ghent University. The tax free scholarship includes full social security coverage.You will work in a dynamic, international research group. All Ghent University staff members enjoy a number of benefits, such as 36 days of paid leave, a wide range of training and education opportunities, bicycle commuting reimbursement, etc.More information about PhD studies at Ghent University can be found here: https://www.ugent.be/en/research/doctoralresearch.Job profileYou hold a Masterâ\u0080\u0099s degree in Sciences: Biology, Bio-informatics, Bioscience Engineering, Oceanography or equivalent diploma. Holders of a PhD degree cannot apply.You obtained excellent grades in your bachelor and MSc degree (i.e., you belong to the top 10% of your cohort).You have a keen interest in both wetlab experiments as well as population genomics.Practical expertise in aquatic microbial ecology and/or NGS data analysis/bio-informatics is strongly recommended.You have excellent programming skills in Python or another scripting language, and hands-on experience with R.You have good communication and writing skills and have an excellent knowledge of written and spoken English.You are self-critical, you work with rigor and attention for detail, and you work accurately.You combine being a team player with a strong sense of autonomy and responsibility.You are willing to participate in sampling campaigns and apply for additional funding when eligible.How to applyAll applications must be received no later than March 15th 2022 at biology-applications@ugent.be with the following documents attached as one file:application lettercurriculum vitaea transcript of the required degreenames and contact details of at least two reference personsAttention: Late applications are not accepted. As Ghent University maintains an equal opportunities and diversity policy, everyone is encouraged to apply for this position.All applications will be assessed after the deadline and shortlisted candidates will be contacted for a remote interview.For more information about this vacancy please contact Prof. Wim Vyverman (Wim.Vyverman@UGent.be, +32 (0) 9 264 85 01) or Prof. Klaas Vandepoele (klaas.vandepoele@psb.vib-ugent.be, +32 (0)9 3313822) .", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}