{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/post-doctoral-researcher-in-law/174552", "title": "Post-doctoral researcher in Law", "publish_date": "2022-01-28", "deadline": "2022-02-15", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Postdoc", "field": "Administrative Law, Civil Law, Commercial Law, Constitutional Law, Contract Law, and 18 moreCorporate Governance,Corporate Law,Criminal Law,Digital Law,Environmental Law,European Law,Financial Law,Gender and Law,International Law,Jurisprudence,Labour Law,Legal History,Media Law,Nordic Law,Procedural Law,Property Law,Public Law,Tax Law", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>The Department of Law of the Faculty of Law, Economics and Finance of the University of Luxembourg is looking for a Postdoctoral researcher to conduct research in Law.</p><p><strong>Your Role...</strong></p><p>In particular, the Postdoctoral researcher will be in charge of:</p><ul><li>Research, publish and disseminate knowledge on the highest academic levels.</li><li>Contribute to the projects and activities conducted in the Department of Law by working together with colleagues and research teams of the Department in the chosen field of specialisation.</li><li>Assist and mentor PhD candidates.</li><li>Conduct other teaching activities.</li></ul><p><strong>Qualifications...</strong></p><ul><li>Outstanding PhD in law displaying the capability to autonomously develop and conduct research at a post-doctoral level at the highest level.</li><li>Aptitude working, research and writing in a multi-lingual environment. English or French and a good understanding of the second language and possibly a third language (particularly German) will be considered an advantage.</li><li>Aptitude to work in the context of a Department that specialises in research from a transnational, European and comparative point of view.</li><li>Proof of knowledge and application of research design and research methods.</li><li>Willingness to develop an internationally recognised body of research and to seek competitive research funding for projects.</li></ul><p><strong>In Short...</strong></p><ul><li>Contract Type: Fixed-term contract 24 months - renewable for a maximum of 36 months</li><li>Work Hours: Full Time 40.0 Hours per Week</li><li>Location: Kirchberg</li><li>Job Reference: UOL04728</li></ul><p>In particular, we offer:</p><ul><li>Integration into one of Europeâ\u0080\u0099s most international universities and most diverse law departments</li><li>Excellent facilities including personal work-space at the University</li><li>Attractive remuneration package</li></ul><p>The yearly gross salary for every Postdoctoral Researcher at the UL is EUR 75.285 (full time)</p><p><strong>How to apply...</strong></p><p>Please apply online formally through the HR system. Applications can be submitted in French or in English and must include the following:</p><ul><li>An application letter.</li><li>A research agenda concerning the scientific work the applicant is interested in pursuing during the time as Postdoc explaining the relevance for the research conducted at the Law Department.</li><li>The name, current position, and relation to the applicant of the two persons cited as reference.</li><li>A copy of the PhD diploma (including the defense report, if available).</li><li>A detailed curriculum vitae with a complete bibliography of the applicantâ\u0080\u0099s published works.</li><li>A copy of the publications that the applicant deems most relevant to his/her research work.</li></ul><p>We ensure a full consideration for applications received by 15 February 2022.</p><p>For further information, please contact Professor Herwig Hofmann, Head of the Department of Law: <a href=\"mailto:herwig.hofmann@uni.lu\">herwig.hofmann@uni.lu</a></p><p>The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.</p><p><strong>About us...</strong></p><p>The<strong> University of Luxembourg</strong> is an <strong>international research</strong> university with a distinctly <strong>multilingual</strong> and <strong>interdisciplinary</strong> character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.</p><p>The <strong>Faculty of Law, Economics and Finance </strong>offers three Bachelor programmes, four Master programmes of Management and Economics and six Masters of Laws (LL.M.), as well as several continuing education courses. It also includes the Doctoral School in Law and the Doctoral School in Economics and Finance. Around <strong>2,500 students </strong>from <strong>90 different nationalities</strong> are enrolled at the Faculty. Academic staff from 18 different nationalities teach at the Faculty, supported by practitioners from the field, visiting scholars and guest professors. Rooted in Luxembourg but with a <strong>European and international outlook</strong>, the Faculty counts three departments:</p><ul><li>Department of Law</li><li>Department of Economics and Management (DEM)</li><li>Department of Finance</li></ul><p>Teaching and research benefit from the proximity of the European institutions, Luxembourgâ\u0080\u0099s world-class financial centre ranked second in the world in investment fund asset domicile, and its vibrant business community. Institutional and private sector partnerships, sponsored Chairs, and a growing network of international partner universities make the FDEF a <strong>vibrant academic hub within the University at the heart of Europe</strong>.</p><ul><li><a href=\"https://wwwfr.uni.lu/fdef\" target=\"_blank\">Find out more about the FDEF</a></li><li><a href=\"https://wwwen.uni.lu/university/about_%3Cspan%20class=\" target=\"_blank\">Find out more about the University</a></li><li><a href=\"https://wwwen.uni.lu/contact\" target=\"_blank\">Addresses, maps &amp; routes to the various sites of the University</a></li></ul>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}