{"url": "https://www.academictransfer.com/en/309020/adviseur-internationalisering/apply/", "title": "Adviseur Internationalisering", "publish_date": "2022-02-02", "deadline": "2022-02-21", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Management", "field": "Gezondheid", "salary": "N/A", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "Als adviseur Internationalisering ga je dit thema stevig verankeren in de medische faculteit van het Erasmus MC. Je ontwikkelt internationaliseringsbeleid en vertaalt dit in werkprocessen naar de onderwijspraktijk van zowel Geneeskunde als de vijf research masters. Dit raakt zowel het opdoen van internationale ervaring van onze studenten in het buitenland en internationalisation at home, maar ook het zorgdragen voor de instroom van getalenteerde internationale studenten in het toponderwijs van het Erasmus MC.<br><br>Je schakelt met interne betrokkenen, zoals opleidingsdirecties, studenten(vertegenwoordiging), docenten en collega adviseurs en coördineert projecten en samenwerkingen op het gebied van internationalisering en draagt zorg voor goede informatievoorziening en voorlichting aan studenten. Je ontwikkelt een marketing- en wervingsstrategie voor de research masters en het binnenhalen van beurzen. Je verstevigt het externe netwerk met (potentiele) buitenlandse partnerinstellingen en sluit overeenkomsten met deze partijen. Het is een uitdagende, zelfstandige baan met veel verantwoordelijkheid en de ruimte om iets bijzonders neer te zetten.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}