{"url": "http://www.academictransfer.com/en/309337/phd-candidate-for-fate-modelling-of-microplastics/", "title": "PhD Candidate for Fate Modelling of Microplastics", "publish_date": "2022-02-10", "deadline": "2022-03-06", "location": "Houtlaan 4, 6525 XZ, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "PhD", "field": "Natural sciences", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "40", "employer": "Radboud University", "job_description": "<p><em>Plastic is pouring from our land into our waters at a rate of nearly 10 million tonnes a year. The smaller the size, the higher the risk posed to organisms and human health. Do you want to contribute to new insights into this topic by using cutting-edge research? Then you have a part to play as a PhD candidate. You will use fate modelling to predict pharmaceutical concentrations in European river basins, and afterwards put the model into practice in the actual river basins.<br><br></em>The EU LABPLAS project is a project in which 16 European research organisations cooperate to develop new techniques and models for the quantification of microplastics. The project aims to develop practical computational tools to facilitate the mapping of plastic-impacted hotspots and promote scientifically sound plastic governance. One of such tools is a source-to-ocean model that will provide the basis for a European PLastic informAtion System (ePLAS).</p> <p>As a PhD candidate, you will work on the adaptation of an existing fate model that is used to predict pharmaceutical concentrations in European river basins. You will expand this model with: (1) spatially-explicit approaches to estimate the source strength of different categories of microplastics, and (2) model equations to model source-to-ocean transport of microplastics at the river basin scale. The updated model will initially be developed and tested on the basis of a case study focusing on the Elbe river basin (Central Europe), and then validated and further refined based on case studies focusing on the Thames (UK) and Mero-Barcés (Spain) river basins. The case studies will provide insight into the processes and parameters relevant to model the emission and source-to-sea transport of microplastics at the European scale. In your work, you will collaborate with researchers from various European research organisations (e.g. from the University of Ghent, Belgium, and the University of Vigo, Spain). You will be supervised by researchers from Radboud University in Nijmegen (Netherlands) and the Open University in Heerlen (Netherlands). You will participate actively in several BSc courses on environmental modelling and risk assessment, and be involved in the supervision of BSc and MSc students. You will have a teaching load of up to 10%.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You should hold an MSc in one of the environmental, natural or engineering sciences, in which you preferably acquired knowledge of environmental chemistry or physics.</li>\n<li>You have computer modelling skills, preferably in R.</li>\n<li>You have experience with gathering and extracting data from public sources.</li>\n<li>YouÂ have affinity with data analysis, data interpretation and spatial data modelling (e.g. GIS).</li>\n<li>You should have analytical skills, ambition, and communication and collaborative skills (particularly a good command of oral and written English).</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: You will be employed for an initial period of 18 months, after which your performance will be evaluated. If the evaluation is positive, the contract will be extended by 2.5 years (4 year contract).</p>\n<ul>\n<li>Employment for 1.0 FTE.</li>\n<li>The gross starting salary amounts to â\u0082¬2,443 per month based on a 38-hour working week, and will increase to â\u0082¬3,122 in the fourth year (<a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/\">salary scale P</a>).</li>\n<li>You will receive 8% holiday allowance and 8.3% end-of-year bonus.</li>\n<li>You will be employed for an initial period of 18 months, after which your performance will be evaluated. If the evaluation is positive, the contract will be extended by 2.5 years (4 year contract).</li>\n<li>You will be able to use our <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/our-way-working-personal-approach/dual-career-family-support-service/\">Dual Career and Family Care Services</a>. Our Dual Career and Family Care Officer can assist you with family-related support, help your partner or spouse prepare for the local labour market, provide customized support in their search for employmentÂ  and help your family settle in Nijmegen.</li>\n<li>Working for us means getting extra days off. In case of full-time employment, you can choose <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/more-info-working/flexible-working-times/\">between 29 or 41</a> days of annual leave instead of the legally allotted 20.</li>\n</ul>\n<em>Additional employment conditions</em>\nWork and science require good employment practices. This is reflected in Radboud University's primary and secondary <a href=\"https://www.ru.nl/english/working-at/working-at-radboud-university/employment-conditions/\">employment conditions</a>. You can make arrangements for the best possible work-life balance with flexible working hours, various leave arrangements and working from home. You are also able to compose part of your employment conditions yourself, for example, exchange income for extra leave days and receive a reimbursement for your sports subscription. And of course, we offer a good pension plan. You are given plenty of room and responsibility to develop your talents and realise your ambitions. Therefore, we provide various training and development schemes.\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>The <a href=\"https://www.ru.nl/environmentalscience/\">Environmental Science Cluster</a> is a dynamic research group that is part of the <a href=\"https://www.ru.nl/ribes/\">Radboud Institute for Biological and Environmental Sciences</a> (RIBES) of the <a href=\"https://www.ru.nl/science/\">Faculty of Science</a> of Radboud University in Nijmegen (Netherlands). Our main focus is on quantifying, understanding and predicting human impacts on the environment through the development and application of computer models. We typically collect and analyse large data sets and integrate the results with existing knowledge to develop a holistic understanding of how environmental systems respond to human impacts. In our research we cover multiple pressures, species and spatial scales, searching for overarching principles that can ultimately be applied to better underpin environmental management and biodiversity conservation.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For questions about the position, please contact Ad Ragas, Associate Professor at +31 24 365 32 84 or <a href=\"mailto:ad.ragas@ru.nl\">ad.ragas@ru.nl</a>.</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.ru.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/run-en-wide/13abf0bc0a611f32246d62b46488f997.jpg"}