{"url": "https://academicpositions.com/ad/university-ottawa-uottawa/2021/tenure-track-position-cold-region-roads/173431", "title": "Tenure-track position - Cold Region Roads", "publish_date": "2021-12-23", "deadline": "2022-03-31", "location": "75 Laurier Avenue East Ottawa Ottawa, Canada", "city": "N/A", "country": "Canada", "position": "Assistant Professor", "field": "Civil Engineering, Geotechnical Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Ottawa (uOttawa)", "job_description": "UNIVERSITY OF OTTAWA - The Department of Civil Engineering in the Faculty of Engineering&nbsp;is seeking a creative, dynamic, and energetic individual for a tenure-track faculty position in the area of cold region roads. There is a vital need to ensure that our road infrastructure assets and networks are sustainable and resilient to climate variability and change.&nbsp;A major problem throughout Canada, but particularly in northern communities, is maintenance and building of sustainable road infrastructure, as freeze-thaw cycles and/or climate change quickly degrade road structures. There is an urgent need for research in sustainable and resilient roads throughout Canada. The stability of road foundation systems in many Canadian northern communities relies on the strength of the underlying permafrost. The permafrost degradation due to global warming has been severely affecting the performance of many roads constructed in northern Canada, increasing their maintenance costs, decreasing their useful life span, and jeopardizing the economic activities in the North. Candidates in all related fields of geotechnical engineering are encouraged to apply, but&nbsp;preference will be given to&nbsp;applicants with research strength in cold region roads. &nbsp;&nbsp;Title of the position:&nbsp;Assistant or Associate Professor, the rank of Full Professor will be considered under exceptional circumstances.Duties:&nbsp;The functions of a member of the academic staff include, in varying proportions: a) teaching activities; b) scholarly activities revealed by research or professional work; c) supervision of graduate students; d) academic and professional service activities. The candidate will be expected to develop and lead an active nationally and internationally recognized research program, attract external research funding, supervise graduate students, collaborate with other faculty members, and participate in educational and professional activities including administrative duties.Rank and Salary:&nbsp;Regular tenure-track academic appointment in the Faculty of Engineering with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa.Benefits package:&nbsp;The University of Ottawa provides a complete compensation package, which includes long term disability, basic group life insurance, supplementary health insurance, University of Ottawa Pension Plan and optional life insurance.Location of work:&nbsp;Department of Civil Engineering, University of Ottawa. The University of Ottawa is located on the unceded ancestral land of the Algonquin people, in the heart of Canadaâ\u0080\u0099s capital, which provides world-class cultural and recreational opportunities.&nbsp; The University of Ottawa is one of Canadaâ\u0080\u0099s top-ten research intensive universities, and the worldâ\u0080\u0099s largest English/French bilingual university. The Faculty of Engineering provides a learning environment that promotes excellence and innovation, with a strong emphasis on entrepreneurial design. Excellence and diversity in research are built on strong collaboration with industry and government research institutions, many of which are located in the nationâ\u0080\u0099s capital. The Department of Civil Engineering at the&nbsp;University of Ottawa maintains active research programs in Geotechnical Engineering, Structural Engineering, Water Resources Engineering, Environmental Engineering, Civil Engineering Materials, and Construction Management. The Department has a fully equipped state-of-the-art research and teaching Geotechnical Engineering Laboratory.&nbsp;With this position the Department of Civil Engineering will have 24 full-time faculty members, 3 teaching professors, and 7 support staff members. The present enrolment is more than 500 undergraduate and nearly 300 graduate students. Further information relating to the Department can be viewed on its web site.&nbsp;https://engineering.uottawa.ca/civil-dept.Contact information:&nbsp;Dr. Mamadou Fall, Chair, Department of Civil Engineering, University of Ottawa, 161 Louis Pasteur, Ottawa, ON K1N 6N5,&nbsp;mfall@uottawa.caSkills Requirements:Education:&nbsp;Ph.D. or equivalent in geotechnical engineering, civil engineering, or related discipline.Work experience:&nbsp;Candidates must demonstrate an excellent research track record with output in high quality academic journals and a strong teaching track record. A research and teaching&nbsp;focus in geotechnical and road engineering, with particular emphasis on northern road design and materials is desired. A strong and substantiated track record of ongoing research and collaboration with Indigenous communities, and associated interest to contribute to the uOttawa Centre for Indigenous Community Infrastructure, will be considered an asset.Other:&nbsp;Because the University of Ottawa is Canadaâ\u0080\u0099s premier bilingual university, preference will be given to candidates who are bilingual (French/English) and who are able to teach in both languages.&nbsp;&nbsp;Passive knowledge of the other official language in Canada is a requirement for tenure.&nbsp; Registration as a Professional Engineer in Canada needs to be satisfied at the time of tenure and thereafter. Candidates must demonstrate a commitment to contributing to a culture that supports diversity and inclusion.Application deadline:&nbsp;March 31, 2022.&nbsp;The application material consists of a CV, a detailed teaching and research statement along with the contact information for three referees.Applications should be submitted electronically through the University of Ottawa Academic Careers website job number&nbsp;J1221-1354â\u0080\u008bâ\u0080\u008bâ\u0080\u008bâ\u0080\u008bâ\u0080\u008bâ\u0080\u008bâ\u0080\u008bThe University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous persons, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the&nbsp;confidential&nbsp;Self-Identification Questionnaire, to be completed at the time of application.&nbsp;According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadian citizens and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada.The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations at 613-562-5958. Any information you send us will be handled respectfully and in complete confidence.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Ottawa is the largest bilingual (English-French) university in the world. Located at the heart of Canadaâ\u0080\u0099s capital, we have ready access to the great institutions of our country.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE1XC8wMlwvdU90dGF3YS1sb2dvLmpwZyIsImVkaXRzIjpbXX0="}