{"url": "http://www.academictransfer.com/en/309407/arts-onderzoeker-kinderhematologie/", "title": "Arts-onderzoeker Kinderhematologie", "publish_date": "2022-02-13", "deadline": "2022-03-07", "location": "Meibergdreef 9, 1105 AZ, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "Management", "field": "Gezondheid; Natuurwetenschappen; Techniek", "salary": "N/A", "max_working_hours": "36", "employer": "Academic Medical Center (AMC)", "job_description": "<p>Wat&nbsp;<strong>ga</strong>&nbsp;je onderzoeken?</p><p>De afdeling Kinderhematologie van het AMC biedt een positie aan voor een enthousiaste arts-onderzoeker voor een onderzoeksproject op het gebied van hemofilie A. Sinds kort kunnen bloedingen bij pati&euml;nten met een ernstige vorm van hemofilie worden voorkomen met een innovatieve behandeling, emicizumab. De kennis over het gebruik van emicizumab in jonge kinderen is beperkt. Het doel van dit project is om te onderzoeken welke effecten emicizumab heeft op bloedingen, gewrichtsschade en de immunologische reactie op stollingsfactor VIII van jonge kinderen met hemofilie A. Er worden verschillende metingen verricht: de behandeling met emicizumab en stollingsfactor VIII, bloedingen, bijwerkingen en verschillende laboratorium tests.&nbsp;Het project zal in een multicenter verband worden uitgevoerd binnen Nederland en mogelijk ook andere Europese landen.</p><p>Wat&nbsp;<strong>ga</strong>&nbsp;je doen?</p><p>Binnen het project omvat de positie van Arts-onderzoeker onder meer de volgende taken:&nbsp;</p><ul> <li>Rekruteren van kinderen met hemofilie in het Emma Kinderziekenhuis.&nbsp;</li> <li>Co&ouml;rdineren van de multicenter studie &nbsp;</li> <li>Gegevens verzamelen in de deelnemende centra&nbsp;</li> <li>Laboratorium analyses van verzamelde bloedsamples&nbsp;</li> <li>Data analyse middels verschillende softwarepakketten (SPSS, R) &nbsp;</li> <li>Presenteren van resultaten op binnenlandse en buitenlandse congressen&nbsp;</li> <li>Superviseren van master-studenten in het uitvoeren van metingen en het schrijven van een master-these&nbsp;</li> <li>Schrijven van wetenschappelijke publicaties en uiteindelijk in een proefschrift.&nbsp;</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.amc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/amc-en-wide_TAjdij7/88544601f45a8bc71e9cc74b40c8c85d.png"}