{"url": "https://academicpositions.com/ad/ghent-university/2022/postdoctoral-researcher-100-for-the-erc-project-disconnect-22438-communication-sciences/175093", "title": "Postdoctoral researcher (100%) for the ERC project DISCONNECT (22438) - Communication Sciences", "publish_date": "2022-02-09", "deadline": "2022-02-28", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Computing in Social science, Arts and Humanities, Informatics, Media and Communication Studies,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Apply before [[28/02/2022]]&nbsp;23:59 (Brussels Time)&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;[[Research Group: imec-mict-UGent]]&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Department:&nbsp;[[PS01 - Department of Communication Sciences, Ghent University ]]&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Occupancy rate: [[100% (negotiable) ]]&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Number of positions: [[1]]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Term of&nbsp;assignment:&nbsp;[[Duration of minimum 2 years, maximum 3 years (depending on seniority)]]&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Wage scale:&nbsp;&nbsp;[[PD1]]&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;Required diploma:&nbsp;[[PhD degree in Social Sciences or Computational Sciences ]]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ABOUT GHENT UNIVERSITYGhent University is a world of its own. Employing more than 8,000 people, it is actively involved in education and research, management and administration, as well as technical and social service provision on a daily basis. It is one of the largest, most exciting employers in the area and offers great career opportunities. With its 11 faculties and more than 80 departments offering state-of-the-art study programmes grounded in research in a wide range of academic fields, Ghent University is a logical choice for its staff and students.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp; ABOUT THE PROJECT&nbsp;The DISCONNECT project&nbsp;is&nbsp;a&nbsp;large-scale&nbsp;research project funded by the European Research Council supervised by Prof. dr.&nbsp; Mariek&nbsp;Vanden Abeele. In the project, we examine whether we can model peopleâ\u0080\u0099s experiences of digital wellbeing as a dynamic system in which the advantages and drawbacks of digital connectivity form a delicate balance. To build this model, we collect and analyze intensive longitudinal data.&nbsp; We are looking for a postdoctoral researcher who has&nbsp;expertise&nbsp;and experience in&nbsp;working with intensive longitudinal data&nbsp;to complement our multi-disciplinary team.&nbsp;Ideally, you have advanced time series analysis skills, and you are willing to school yourself&nbsp;further&nbsp;in&nbsp;state-of-the-art&nbsp;statistical and computer scientific analysis techniques, including network analysis and machine learning,&nbsp;to&nbsp;subsequently&nbsp;apply these techniques to the project data.&nbsp;More information about the project can be found here:&nbsp;https://www.ugent.be/en/research/research-ugent/eu-trackrecord/h2020/erc-h2020/disconnect.htm.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; YOUR TASKS&nbsp;You will be a member of&nbsp;a&nbsp;multi-disciplinary team,&nbsp;consisting of communication scientists, psychologists,&nbsp;sociologists, engineers and cultural studies researchers. Your task will be to&nbsp;work&nbsp;together with the team on&nbsp;the&nbsp;project. You bring your own ideas about the project to the table&nbsp;and help with shaping the research. Also, you will work on the&nbsp;collected intensive longitudinal data&nbsp;with the team&nbsp;to gain further insights into digital wellbeing.&nbsp;On the one&nbsp; hand,&nbsp;we&nbsp;expect you to&nbsp;actively contribute to the&nbsp;data collection,&nbsp;co-supervise PhD students,&nbsp;(co-)author&nbsp;scientific articles, and&nbsp;participate&nbsp;in&nbsp;dissemination activities of the project, such as presenting results in&nbsp;(inter-)national scientific conferences.&nbsp;You, on the other hand, get the chance to shape your own research agenda and further develop your research skills, while&nbsp;also&nbsp;benefiting&nbsp;from working with a large team&nbsp;on a prestigious European project.&nbsp;This also&nbsp;entails being&nbsp;involved in other activities that interest you in&nbsp;the research group&nbsp;imec-mict-UGent, and the department of Communication Sciences at Ghent University.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; WHAT WE ARE LOOKING FOR&nbsp;You hold a thesis-based doctorate obtained max. 6 years ago. This term of 6 years is&nbsp;determined&nbsp;by the date written on the above-mentioned required diploma.You have a&nbsp;PhD&nbsp;degree in&nbsp;either&nbsp;social&nbsp;or computational&nbsp;sciences and&nbsp;can&nbsp;demonstrate&nbsp;expertise in statistical and computer scientific analysis techniques&nbsp;for analyzing intensive longitudinal data. Candidates with degrees from other programs (e.g.,&nbsp;Humanities,&nbsp;Informatics) may also apply when they can show sufficient knowledge of the research domain and can&nbsp;demonstrate&nbsp;relevant&nbsp;expertise. PhD students who are&nbsp; currently&nbsp;finalizing&nbsp;their&nbsp;PhD&nbsp;degree are welcome to apply.&nbsp;&nbsp;You are an excellent and motivated researcher with an analytic mind.&nbsp;&nbsp;You can work with intensive longitudinal&nbsp;data, and&nbsp;are proficient in R and/or Python.&nbsp;Your profile becomes more competitive if&nbsp; you&nbsp;can&nbsp;demonstrate&nbsp;experience or&nbsp;can motivate your interest&nbsp;in working with&nbsp;intensive longitudinal data&nbsp;in the broader field of social sciences and humanities.&nbsp;You are fluent in English, including&nbsp;academic writing in English.&nbsp;&nbsp;You are&nbsp;proactive, and capable of independently developing your own research line within the confines of the project.&nbsp;You are communicative, work well in a team and are capable of both giving and receiving feedback, as well as transforming feedback&nbsp;adequately in&nbsp;your activities.&nbsp;&nbsp;You enjoy being involved in the work of colleagues and&nbsp;are willing to take on a supervising role.&nbsp;You are not afraid to roll up your sleeves. At times when the project&nbsp;asks&nbsp;a lot of energy, you can motivate both yourself and others&nbsp;to go that extra mile.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;WHAT WE CAN OFFER YOU&nbsp;We offer you a contract with a term of minimum 2, maximum 3 years.Your contract will start on&nbsp;a mutually agreed upon date (earliest start date: 1 April).&nbsp;&nbsp;Your&nbsp;remuneration&nbsp;will be&nbsp;determined&nbsp;by salary scale PD1.&nbsp;Click here for more information about our salary scales.&nbsp;All Ghent University staff members enjoy&nbsp;several&nbsp;benefits, such as a wide range of training and education opportunities, 36 days of holiday leave (on an annual basis for a full-time job) supplemented by annual fixed bridge days, a bicycle allowance and eco vouchers.&nbsp;Click here for a complete overview of all the staff&nbsp;benefits (in Dutch&nbsp;only).&nbsp;You&nbsp;will&nbsp;work&nbsp;in a&nbsp;dynamic&nbsp;and&nbsp;stimulating&nbsp;research environment.&nbsp;You&nbsp;will&nbsp;work&nbsp;in&nbsp;the&nbsp;â\u0080\u0098De Krookâ\u0080\u0099&nbsp;building&nbsp;in&nbsp;Ghent, a place&nbsp;where&nbsp;knowledge,&nbsp;creativity&nbsp;and&nbsp;entrepreneurship&nbsp;are&nbsp;central.It is&nbsp;possible&nbsp;to&nbsp;make&nbsp;arrangements&nbsp;for&nbsp;remote&nbsp;work&nbsp;and&nbsp;flexible&nbsp;office&nbsp;hours. We&nbsp;strive&nbsp;to&nbsp;achieve&nbsp;a&nbsp;healthy&nbsp;work-life&nbsp;balance&nbsp;and&nbsp;nurture&nbsp;a&nbsp;healthy&nbsp;and&nbsp;rewarding work&nbsp;environment in&nbsp;which&nbsp;individual&nbsp;differences&nbsp;are&nbsp;welcomed&nbsp;and&nbsp;valued.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp; INTERESTED?&nbsp;Please send in your application&nbsp;no later than&nbsp;Feb&nbsp;28,&nbsp;2022,&nbsp;at 23:59 (CET) via the e-recruitment system of Ghent University.&nbsp;We cannot accept late applications or applications that are not&nbsp;submitted&nbsp;through the online system!&nbsp;&nbsp;Your application must include the following documents:&nbsp;In the field&nbsp;â\u0080\u0098CVâ\u0080\u0099:&nbsp;your CV containing an overview of your study&nbsp;and work career, and&nbsp;in which you include the names and contact information of 2&nbsp;persons&nbsp;who we may contact as referents&nbsp;(merged into one pdf file)&nbsp;In the field â\u0080\u0098Cover letterâ\u0080\u0099:&nbsp;a&nbsp;letter&nbsp;in which you motivate why we should consider your candidacy,&nbsp;in pdf format&nbsp;In the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of the required degree (if already in your possession). If you have a foreign&nbsp;degree&nbsp;in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.&nbsp;In the field â\u0080\u009cother documentsâ\u0080\u009d:&nbsp;Please add a manuscript,&nbsp;paper or article that&nbsp;demonstrates&nbsp;your writing skills,&nbsp;and a short (max. 50 words) motivation for why you chose this piece&nbsp;(can be co-authored, a link to this article in your cover letter&nbsp;is also OK)&nbsp;&nbsp;Note that the&nbsp;maximum&nbsp;file size for each field is 10 MB.&nbsp;&nbsp;As Ghent University&nbsp;maintains&nbsp;an equal opportunities and diversity policy, everyone is encouraged to apply for this position.&nbsp;The&nbsp;submitted&nbsp;documents will be used to shortlist candidates. Shortlisted applicants will be invited for an in-person or video conference interview.&nbsp;Any candidate who may&nbsp;require&nbsp;special facilities should&nbsp;indicate&nbsp;this in their application, and we will try to accommodate their request.&nbsp;We aim to notify all candidates of the results of the selection process no later than the end of March.&nbsp;&nbsp;MORE INFORMATION&nbsp;Please contact the principal investigator of the project, Prof. dr.&nbsp;Mariek&nbsp;Vanden Abeele, if you have further questions about this position and the vacancy:&nbsp;mariek.vandenabeele@ugent.be.&nbsp;&nbsp;More information about the&nbsp;imec&nbsp;research group&nbsp;mict&nbsp;can be found here:&nbsp;www.mict.be&nbsp;&nbsp;&nbsp;Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}