{"url": "http://www.academictransfer.com/en/309318/coordinator-studenteninzet-en-voorlichtingsactiviteiten-10-fte/apply/", "title": "Coördinator Studenteninzet en Voorlichtingsactiviteiten (1.0 FTE)", "publish_date": "2022-02-10", "deadline": "2022-02-27", "location": "Warandelaan 2, 5037 AB, Tilburg", "city": "Tilburg", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "40", "employer": "Tilburg University", "job_description": "<p>Kom jij werken bij het Events team van het Marketing &amp; Recruitment Service Center van Tilburg University? Dan kies je voor een dynamische omgeving met volop afwisseling! De ene dag verwelkom je studiekiezers op een evenement dat je georganiseerd hebt, de andere dag train je de studenten die deze evenementen tot een succes maken en daarna ben je weer druk bezig met het plannen en organiseren van een volgend evenement. Dit alles in een internationale werkomgeving met een vleugje Brabantse gezelligheid.&nbsp;</p><p>&nbsp;</p><p><strong>Jouw functie</strong><br> Tilburg University is op zoek naar een Co&ouml;rdinator Studenteninzet en Voorlichtingsactiviteiten (1.0 FTE) ter versterking van het Events team. Het Events team is onderdeel van het Marketing &amp; Recruitment Service Center van de divisie Marketing &amp; Communicatie. Het Events team is verantwoordelijk voor de organisatie van de nationale en internationale voorlichtingsevenementen voor de bachelor- en masteropleidingen van Tilburg University.</p><p>&nbsp;</p><p>Als Co&ouml;rdinator Studenteninzet en Voorlichtingsactiviteiten co&ouml;rdineer je de studenteninzet voor alle voorlichtingsevenementen die team Events organiseert. In totaal vormen zo&rsquo;n 100 studenten samen onze Student Crew. Door jouw enthousiasme en begeleiding voelen deze studenten zich een ambassadeur van Tilburg University en dragen zij dit proactief uit.&nbsp;</p><p>&nbsp;</p><p>Daarnaast ben je verantwoordelijk voor de organisatie van de&nbsp;<a href=\"https://www.tilburguniversity.edu/nl/onderwijs/bacheloropleidingen/studiekeuze-webinars\">Start-je-Studiekeuze webinars</a>&nbsp;en ondersteun je je Event collega&rsquo;s in de organisatie van evenementen zoals de Bachelor en Master Open dagen. Door de COVID-19 crisis is het voorlichtingsaanbod aan wijzigingen onderhevig (geweest). Het Events team heeft creatieve, veelal online, manieren gevonden om haar evenementen vorm te geven zodat studiekiezers ook tijdens de crisis voorlichting over onze universiteit en opleidingen konden bijwonen. We zoeken een collega die graag in deze dynamiek meebeweegt, en (mede)co&ouml;rdinerend hierin kan vormgeven en ondersteunen.&nbsp;</p><p>&nbsp;</p><p><strong>Taken en verantwoordelijkheden</strong></p><ul> <li>Verantwoordelijk voor een goed functionerende Student Crew: werving- en selectieprocedure, contractbeheer, administratie van vergoedingen, training, roostering en voeren van voortgangsgesprekken.</li> <li>Verantwoordelijk voor de roostering en briefing van de Student Crew voor alle voorlichtingsevenementen van het Events team. Hierbij werk je nauw samen met je collega Co&ouml;rdinator International Student Crew en de eventverantwoordelijke collega.</li> <li>Verantwoordelijk voor de organisatie en realisatie van de Start-Je-Studiekeuze webinars in nauw overleg met je directe collega&rsquo;s als ook met de accountmanagers middelbare scholen.</li> <li>Tot slot, ondersteun je binnen het Events team je collega&rsquo;s in de organisatie van diverse (online) evenementen zoals open dagen, Campus Experience days, decanendagen en campusbezoeken van decanenkringen. Je collega&rsquo;s ondersteunen op hun beurt weer bij de organisatie van jouw evenementen.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.uvt.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uvt-en-wide/8bbc452c034c71750be03f93fe602eca.png"}