{"url": "https://academicpositions.com/ad/ghent-university/2022/professor-in-high-tech-horticulture-22080-faculty-of-bioscience-engineering/174233", "title": "Professor in High-tech horticulture (22080) - Faculty of Bioscience Engineering", "publish_date": "2022-01-19", "deadline": "2022-02-22", "location": "Sint-Pietersnieuwstraat 33 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Assistant Professor", "field": "Agricultural Engineering, Agronomy, Bioengineering, Crop Science, Horticulture,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Ghent University", "job_description": "&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Apply until 22/02/2022&nbsp;23:59 (Brussels time)&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Discipline: High-tech horticulture&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp;&nbsp;100% Assistant professor tenure track&nbsp;&nbsp;&nbsp; â\u0086\u0092&nbsp;&nbsp; Reference number: 202112/BW/ZAP/001&nbsp;&nbsp;ABOUT GHENT UNIVERSITY&nbsp;Ghent University is one of the most important education and research institutions in the Low Countries. On a daily basis, over 9,000 staff members and 41,000 students implement its motto \"Dare to Think\". Ghent University's mission statement is characterised by qualitative education, internationally renowned research and a pluralistic social responsibility.&nbsp;&nbsp;ASSIGNMENT&nbsp;The faculty of Bioscience Engineering has a vacancy for a full-time professorship in the rank of Assistant Professor (docent, Tenure Track) in the department of Plants and Crops in the field of high-tech horticulture.&nbsp;The core activities are academic education, academic research and academic services within the field of high-tech horticulture. This is a multidisciplinary field at the interface of technology and crop physiology, including the interaction with (a)biotic factors. This is translated into for example innovations and sustainable transition systems in greenhouse cultivation, vertical farming including hydroponics and/or more autonomous horticultural production systems.&nbsp;Academic educationYou lecture various course units in the discipline of horticultural sciences, with an emphasis on the physiology of horticultural crops and the control of input factors for protected cultivation (climate, water, nutrients), both for students Master of Science in Bioscience Engineering and Master of Science in Bioengineering Technology in Dutch and in English.&nbsp;Academic ResearchYou conduct innovative research in the discipline of High-tech Horticulture. Your research will be at whole-plant and crop level. We expect you to develop the research area and obtain funding for the further development of the research group. The research is carried out in cooperation with researchers both within the department and in a national and international context.&nbsp;Academic servicesYou take part in the internal and external service provision of the department of Plants and Crops of the Faculty of Bioscience Engineering.&nbsp;PROFILE&nbsp;ExperienceYou have already conducted eminent academic research in the given discipline, which is clearly reflected in publications in high-quality academic journals and peer-reviewed books;You are capable of initiating, supervising and acquiring the necessary funding for academic research;You are didactically skilled to teach university students to develop academic competences; you can demonstrate that you can supervise students;You have organizational skills;You can demonstrate that you have successfully collaborated with fellow researchers;You have an (international) network of research contacts and collaborations useful for the development of the research field.Are recommended:International mobility, e.g. through research stays in research institutions external to the institution where the highest academic degree was obtained;Positively evaluated experience with provided and/or organized academic lecturing;Experience in educational professionalization.- &nbsp;&nbsp;&nbsp;&nbsp; In the case that you will need to lecture in another language than your mother tongue, you will need to be able to present an CEFR C1-attestation of that language. If you are a non-Dutch speaking person, article II.270 of the Codex of Higher Education stipulates that: (i) you must master the Dutch language at least at CEFR-level A2 within two years after the start of the appointment. (ii) you must be able to master the Dutch language at least at CEFR-level of B2 within five years after the start of the appointment.&nbsp;&nbsp;Skills / AttitudeYou are quality-oriented;You take initiative;You write and speak Dutch and English fluentlyAre recommended:Active knowledge of languages other than English and Dutch, which may promote international cooperation.&nbsp;Admission requirementsYou hold a thesis-based doctorate or a diploma or certificate that is recognised as equivalent (article V.20 Codex Higher Education).&nbsp;Upon evaluation of a foreign (non-EU) diploma, a certificate of equivalence may still have to be requested at NARIC. If this is the case, we advise you to initiate this recognition procedure as soon as possible. You are required to have the recognition no later than on the date of your appointment.&nbsp;You have at least two years of postdoctoral experience on 1 september 2022. This term of two years is determined by the date written on the above-mentioned required diploma.&nbsp;&nbsp;APPOINTMENT INFORMATION&nbsp;We offer you a temporary appointment in a tenure track system for a term of five years. If positively evaluated by the University Board, the term of office will be transferred into a permanent appointment as an associate professor.Should you already be a member of the professorial staff or hold an equal post at another university or research institution, you can immediately be appointed as an assistant professor, without prejudice to the possibility of a temporary appointment offered in article V.28 of the Codex of Higher Education.&nbsp;The recruitment is possible no sooner than 1 september 2022.&nbsp;&nbsp;OUR OFFER&nbsp;The career and evaluation policy for Professorial Staff is based on talent development and growth, prioritizing vision development and strategy - at the personal as well as the group level. At UGent we focus on career support and coaching of the Professorial Staff in the different phases of the career. More information can be found on www.ugent.be/en/work/mobility-career/career-aspects/professorial-staff.&nbsp;Ghent University is committed to properly welcoming new professorial staff members and offering them appropriate guidance. The basic teacher training and courses of 'Dutch' and 'English' for foreign-speaking lecturers are only a few examples of our wide range of training and education opportunities. Furthermore, each Ghent University staff member can count on a number of benefits such as a bike allowance, reimbursement of public transport commuting costs, daycare, a wide range of sports facilities and EcoCheques. A complete overview of all our employee benefits (in Dutch).&nbsp;Ghent University also invests in welcoming international professorial staff. It offers various housing options, a relocation bonus, the International School for school-aged children (with a discount on the tuition fee), support when registering at the City of Ghent, support with the procedure of family reunification and other administrative matters in connection with moving to Ghent. More information can be found on www.ugent.be/en/work/talent.&nbsp;Candidates who are newly appointed at Ghent University with an appointment as autonomous academic staff of at least 50% or candidates whose appointment as autonomous academic staff at Ghent University is increased to a minimum of 50% receive a Starting Grant of â\u0082¬ 210.000 to contribute towards the personnel, operating and/or equipment costs of establishing a research team.&nbsp;&nbsp;GENDER AND DIVERSITY&nbsp;Ghent University conducts an equal opportunities policy and encourages everyone to apply. Ghent University also strives for a gender balance. Female applications are thus especially welcomed.&nbsp;&nbsp;SELECTION PROCEDURE&nbsp;After the final application date, all received applications will be sent to the faculty assessment committee assembled for this vacancy. This committee will first evaluate the application files. Therefore it will match all elements of the file against the required expertise for the position in terms of education, research and scientific service. Based on this deliberation, relevant candidates will be shortlisted to be invited for further selection (interview, possible presentation or test lecture â\u0080¦). Afterwards, the committee will rank the suitable candidates and present this ranking to the Faculty Board. The advice of the Faculty Board will then be presented to the University Board for approval.&nbsp;Candidates are asked to further discuss their top 5 most important publications or other academic achievements with the highest impact. Next to academic publications, the candidate is thus also able to show merit of knowledge transfer by academic dissemination, social valorisation, public awareness, seminars or conference presentations. These competences are also taken into account when evaluating the candidates.&nbsp;The evaluation of the required international mobility is broad and partly takes the gender perspective into account, thus not only considering longer stays abroad by also other forms of internationalisation.&nbsp;Pregnancy leave, prolonged sick leave, parental leave, filial leave or other forms of absence are taken into account when evaluating the available time for the realisation of academic output.&nbsp;&nbsp;HOW TO APPLY&nbsp;Apply online through the e-recruitment system before the application deadline (see above). We do not accept late applications or applications that are not sent through the online system.&nbsp;Your application must include the following documents:&nbsp;In the field â\u0080\u0098Application formâ\u0080\u0099: the professorial staff application form (+ all annexes mentioned in the form), merged into one pdf file.In the field â\u0080\u0098Cover letterâ\u0080\u0099: your application letter in pdf formatIn the field â\u0080\u0098Diplomaâ\u0080\u0099: a transcript of your doctoral degree. If you have a foreign diploma in a language other than our national languages (Dutch, French or German) or English, please add a translation in one of the mentioned languages.In the field â\u0080\u0098Certificate of equivalenceâ\u0080\u0099: only for diplomas awarded outside the European Union: certificate of equivalence (NARIC) (if already in you possession). For diplomas awarded in the UK before January 31st of 2020, a certificate of equivalence is not required.&nbsp;Note that the maximum file size for each field is 10 MB.&nbsp;&nbsp;MORE INFORMATION&nbsp;For further information regarding this vacancy, please contact Professor Marie-Christine Van Labeke (mariechristine.vanlabeke@ugent.be &nbsp;+32 (0)9&nbsp;264 60 71) at the faculty Bioscience Engineering, department Plants and Crops.Do you have a question regarding the online application process? Please read our FAQ.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Ghent University is one of the top 100 universities in the Dutch language area, with more than 44,000 students and 15,000 staff members.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8xMVwvZ2hlbnQtbG9nby1lbmcuanBnIiwiZWRpdHMiOltdfQ=="}