{"url": "https://academicpositions.com/ad/tampere-university/2022/laboratory-assistant-fhaive/174978", "title": "Laboratory assistant (FHAIVE)", "publish_date": "2022-02-07", "deadline": "2022-02-20", "location": "Kalevantie 4 Tampere, Finland", "city": "N/A", "country": "Finland", "position": "Research Assistant", "field": "Biochemistry, Bioengineering, Biomedical Engineering, Biomedicine, Biotechnology, and 3 moreCell Biology,Health Science,Medical Technology", "salary": "N/A", "max_working_hours": "N/A", "employer": "Tampere University", "job_description": "Tampere University and Tampere University of Applied Sciences create a unique environment for multidisciplinary, inspirational and high-impact research and education. Our universities community has its competitive edges in technology, health and society. www.tuni.fi/enFHAIVE (Finnish hub for development and validation of integrated approaches) is a research institute devoted to the development and validation of integrated approaches (IATA) for toxicological risk assessment. FHAIVEâ\u0080\u0099s mission is to develop IATA by integrating advanced in vitro models with toxicogenomics and artificial intelligence (AI)-enabled advanced data modelling. FHAIVE contributes to the next generation risk assessment with its multidisciplinary expertise including in vitro test systems at multiple degrees of complexity, omics-technologies, and in silico data modelling based on advanced AI algorithms. FHAIVE is an official GLP laboratory and EU NETVAL reference laboratory in inter-laboratory test method validations.Position will be located at FHAIVE at the Faculty of Medicine and Health Technology (MET). MET is dedicated to pursuing world-class research and delivering high-quality education in the fields of biomedical engineering, biotechnology, medicine and health technology.Job description &nbsp;We are seeking a highly motivated candidate to join us as a laboratory assistant to support our in vitro research work and to take care of GLP duties and responsibilities.&nbsp;The laboratory assistant is responsible for versatile laboratory work in the FHAIVE GLP quality system. It includes e.g. general laboratory work in GLP, performing practical work on test methods and validations, cell culture work, imaging, biochemical assays, maintenance of laboratory equipment and cell banks, and preparation of standard operating procedures (SOPs).The main task is to take part as a technician in EURL ECVAM coordinated international validation of vasculogenesis/angiogenesis test method.&nbsp;RequirementsA degree in a relevant area (laboratory technician, laboratory analyst, bioanalyst, laboratory engineer, biotechnology engineer or equivalent).GLP training and practical experience in working in GLP quality systemExperience of test model validation procedures, practical participation in in vitro GLP studies and validationsMastery of advanced cell culturing and co-culturing techniques.Strong expertise in in vitro test methodologies with experience in vascularisation in vitro model and organoidsAbility to work independently and ability to cooperate.Ability to work both in English and in FinnishTampere University is a unique, multidisciplinary and boldly forward-looking, evolving community. Our values are openness, diversity, responsibility, courage, critical thinking, erudition/ Bildung, and learner-centredness. We hope that you can embrace these values and promote them in your work.We offerWe offer a diverse and interesting field of work in a modern work environment. Join the top team of our skilled employees!This is a periodic 2-year position with a starting date April 1st, 2022 or as mutually agreed.&nbsp;Salaries are based on a combination of job requirements and employeesâ\u0080\u0099 personal performance, in accordance with the Finnish University Salary System. The position of a Laboratory Assistant is placed on the job demands levels 5-7 (other staff).For further information, please follow the link to find out about working at Tampere University.How to applyPlease submit your application through our online recruitment system. The closing date for applications is February 20th 2022 (at 23.59 EET)Please write your application and accompanying documents in English or in Finnish. In addition to the online form, please send in the form of a SINGLE PDF file:cover letterCVlist of contacts for recommendations.Candidates may be invited for a video interview during the recruitment process and may also be invited for an in-person visit.&nbsp;For more information about the positions, please contact:Dario Greco, tel. + 358503182106, dario.greco (a) tuni.fi", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Tampere University and Tampere University of Applied Sciences constitute the Tampere university community. Together we are building a new model for higher education and research in Finland.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI3NThcLzk0YlwvNzU4OTRiNGY4NTYwMDI5MGZmZDUxNmZmYjZjZTI4YmYucG5nIiwiZWRpdHMiOltdfQ=="}