{"url": "https://academicpositions.com/ad/university-of-gothenburg/2022/2-phd-students-in-structural-biology-biophysics-with-special-focus-on-protein-structural-dynamics/174624", "title": "2 PhD students in Structural Biology/Biophysics with special focus on protein structural dynamics", "publish_date": "2022-01-28", "deadline": "2022-02-18", "location": "Vasagatan 33 Gothenburg, Sweden", "city": "N/A", "country": "Sweden", "position": "PhD", "field": "Biochemistry, Biophysics, Laser Physics, Particle Physics, Structural Biology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Gothenburg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>The University of Gothenburg tackles societyâ\u0080\u0099s challenges with diverse knowledge. 53 500 students and 6 500 employees make the university a large and inspiring place to work and study. Strong research and attractive study programmes attract scientists and students from around the world. With new knowledge and new perspectives, the University contributes to a better future.</p><p>Research and graduate education at the department of chemistry and molecular biology comprises a wide scientific field from the atomic and molecular levels all the way through cells to intact organisms. Much of the phenomena studied here impact on our natural environment and living systems. We participate in undergraduate programs in chemistry, molecular biology, medicinal chemistry, biology, marine sciences, and pharmacy.</p><p>A third cycle education at our department will lead to a Ph.D. in Natural sciences, or Natural sciences with a specialisation in Chemistry. Ph.D. studies comprises four years at the post graduate level. The time period can be extended to 5 years in total through teaching and/or other departmental duties.</p><p>Westenhoffâ\u0080\u0099s research group, where this position is placed, has the goal to uncover structural dynamics of proteins and chemical reactions. The research is placed at the interface of biology, chemistry and physics. We develop new methods based on infrared spectroscopy and time-resolved X-ray scattering to achieve this goal.</p><h2>Job assignments</h2><p>We are looking for one doctoral student within WestenhoffÂ¨s ERC projekt â\u0080\u009dMolStrucDynâ\u0080\u009d.</p><p>The objectives of the projects are to determine structural changes in photosensor proteins. We plan use ultrashort X-ray pulses from free electron laser sources and single-particle cryo electron microscopy to reach these goals.</p><p>You are expected to be involved in all steps of the project, i.e. to prepare and to perform experiments and to analyze and to publish the data. The choice of sub-project will be adjusted to the successful candidateâ\u0080\u0099s interest and experiences.  </p><p>Working duties may include:</p><ul><li>Planning, preparation, and implementation of time-resolved X-ray diffraction experiments at free electron laser sources.</li><li>Protein production and crystal optimization</li><li>Structure determination</li><li>Identification and publication of the results</li><li>Scientific collaboration within and outside the group</li><li>Communication of the results</li></ul><p><strong>The position is placed at the University of Gothenburg until May 2023. The candidate is thereafter expected to move to the University of Uppsala together with Westenhoffs research team. </strong></p><h2>Eligibility</h2><p>To be eligible for third-cycle studies, the applicant must meet both the general and specific entry requirements: A person meets the general entry requirements for third-cycle courses and study programs if he or she:</p><ol><li>Has been awarded a second-cycle qualification, or</li><li>Has satisfied the requirements for courses comprising at least 240 credits of which at least 60 credits were awarded in the second-cycle, or</li><li>Has acquired substantially equivalent knowledge in some other way in Sweden or abroad.</li></ol><p>To meet the specific entry requirements for third-cycle studies, applicants must: (i) have a second-cycle (advanced-level) degree in a relevant* subject area in the natural sciences, or (ii) have completed studies for at least 60 higher education credits at a second-cycle level in relevant subject areas in the natural sciences, or (iii) have completed a corresponding program of relevance to the planned third-cycle program, in Sweden or in another country, or have equivalent qualifications.</p><p>*Relevant for the planned third-cycle education</p><p>The specific entry requirements also include an acceptable command of spoken and written English. Guidelines for assessing English proficiency may include a minimum score of 550 on the TOEFL test (or 213 on the TOEFL-CBT, or 79 on the TOEFL-iBT).</p><h2>Assessment</h2><p>As a competitive candidate you:</p><ul><li>Hold a degree (Masters/ or equivalent, see above for more details)</li><li>Have documented research experience in biochemistry, structural biology, or an area related to the project.</li><li>Have the proven ability to work independently and result-driven in a research project.</li><li>Are a dynamic team player.</li></ul><p>In return, you will be given extensive creative space to develop the project, significant resources to produce cutting edge results, and you will profit from being part of our highly collaborative team.</p><p>Regulations for the evaluation of qualifications for education on a doctoral level are given in SFS 1998:80.</p><p>* We will give preference to candidates, which are likely to succeed exceptionally well within the project.</p><p>* Documented experience in biochemistry, structural biology, or biophysics are necessary. Experience in scientific programming, molecular modelling or crystallography are a merit.</p><p>* The ability to work independently on a research project is a merit.</p><p>* The ability to work effectively in a team is also a merit.</p><h2>Employment</h2><p>Type of employment: Fixed-term employment, Four years full time</p><p>Extent: 100 %</p><p>Location: Department of Chemistry and Molecular Biology, Gothenburg</p><p>First day of employment: As agreed</p><p>Regulations for the evaluation of qualifications for education on a doctoral level are given in SFS 1998:80.</p><p>A new employment as a PhD student applies for a maximum of one year. The Appointment may be prolonged for up to two years at a time. The total employment period may not be longer than the equivalent of four years of full time doctoral studies.</p><p>University applies local agreement on salaries of graduate students.</p><p><strong>Please observe that the position is placed at the University of Gothenburg until May 2023. The candidate is thereafter expected to move to the University of Uppsala together with Westenhoffs research team. </strong></p><h3>For further information regarding the position</h3><p>Please contact Prof. Sebastian Westenhoff, <a href=\"mailto:westenho@chem.gu.se\"><u>westenho@chem.gu.se</u></a>, 0766183936 for specific questions regarding the position.</p><h2>Unions</h2><p>Union representatives at the University of Gothenburg:<br/><a href=\"https://www.gu.se/en/about-the-university/work-at-the-university-of-gothenburg/how-to-apply\" target=\"_blank\"><u>https://www.gu.se/en/about-the-university/work-at-the-university-of-gothenburg/how-to-apply</u></a></p><h2>Information for International Applicants</h2><p>Choosing a career in a foreign country is a big step. Thus, to give you a general idea of what we and Gothenburg have to offer in terms of benefits and life in general for you and your family/spouse/partner please visit:</p><p><a href=\"https://www.gu.se/en/about-the-university/welcome-services\" target=\"_blank\"><u>https://www.gu.se/en/about-the-university/welcome-services</u></a></p><p><a href=\"https://www.movetogothenburg.com/\" target=\"_blank\"><u>https://www.movetogothenburg.com/</u></a></p><h2>How to apply</h2><p>In order to apply for a position at the University of Gothenburg, you have to register an account in our online recruitment system. It is the responsibility of the applicant to ensure that the application is complete in accordance with the instructions in the job advertisement, and that it is submitted before the deadline. The selection of candidates is made on the basis of the qualifications registered in the application.</p><p>The application should include:</p><p>*Cover letter with an explanation of why you apply for the position.</p><p>*CV including scientific publications.</p><p>*Copy of exam certificate.</p><p>*Two referees (name, telephone no, relation).</p><p><strong>Closing date:</strong> 2022-02-18</p><p><i>The University of Gothenburg promotes equal opportunities, equality and diversity.</i></p><p><i>Applications will be destroyed or returned (upon request) two years after the decision of employment has become final. Applications from the employed and from those who appeal the decision will not be returned.</i></p><p>In connection to this recruitment, we have already decided which recruitment channels we should use. We therefore decline further contact with vendors, recruitment and staffing companies.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE2XC8wNFwvR290aGVuYnVyZ0xvZ28ucG5nIiwiZWRpdHMiOltdfQ=="}