{"url": "https://www.academictransfer.com/en/309329/research-position-including-additive-manufacturing-costs-in-topology-optimization/apply/", "title": "Research position Including Additive Manufacturing Costs in Topology Optimization", "publish_date": "2022-02-10", "deadline": "2022-02-28", "location": "Mekelweg 2, 2628 CD, Delft", "city": "Delft", "country": "Netherlands", "position": "Postdoc", "field": "Engineering", "salary": "â\u0082¬2846â\u0080\u0094â\u0082¬4490 per month", "max_working_hours": "N/A", "employer": "Delft University of Technology (TU Delft)", "job_description": "<p>Topology optimization (TO) offers designers a methodology to fully exploit the full potential of additive manufacturing (AM), while maximizing the performance of components. In this project, focus is on metal AM, for instance by powder bed fusion. For commercially viable products, not only performance and manufacturability but particularly cost is a decisive factor. We consider a setting where many identical components are to be printed. Build time and build chamber utilization are key aspects determining the printing cost, and these depend on component design, orientation, and nesting/stacking. This research aims to develop a TO approach capable of including AM cost estimates, considering the aforementioned aspects. Opportunities exist to fabricate generated use-case designs using metal AM. </p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>A completed PhD or Postdoc involving development of TO methods is required, and familiarity with AM is desired. Furthermore, experience with PETSc programming or comparable parallel computing programming competence is highly desired. This position is part of a research project involving various industrial partners, and a willingness to proactively communicate and collaborate with all project partners is expected.Â </p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Salary and benefits are in accordance with the Collective Labour Agreement for Dutch Universities (salary indication: â\u0082¬ 3.561 - â\u0082¬ 4.490 per month). The TU Delft offers a customisable compensation package, a discount on health insurance and sport memberships, and a monthly work costs contribution. Flexible work schedules can be arranged.</p>\n<p>For international applicants we offer the Coming to Delft Service and Partner Career Advice to assist you with your relocation. An International Children's Centre offers childcare and there is an international primary school.</p>\n<p>This postdoc position has a fixed-term contract for 2 years.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Delft University of Technology</h4>\n<p>Delft University of Technology is built on strong foundations. As creators of the world-famous Dutch waterworks and pioneers in biotech, TU Delft is a top international university combining science, engineering and design. It delivers world class results in education, research and innovation to address challenges in the areas of energy, climate, mobility, health and digital society. For generations, our engineers have proven to be entrepreneurial problem-solvers, both in business and in a social context. At TU Delft we embrace diversity and aim to be as inclusive as possible (see our <a href=\"https://www.tudelft.nl/en/about-tu-delft/strategy/integrity-policy/tu-delft-code-of-conduct/\">Code of Conduct</a>). Together, we imagine, invent and create solutions using technology to have a positive impact on a global scale.</p>\n<p>Challenge. Change. Impact!Â </p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For more information about this vacancy, please contact Dr. ir. Matthijs Langelaar, <a href=\"mailto:m.langelaar@tudelft.nl\">m.langelaar@tudelft.nlâ\u0080\u0082</a> â\u0080\u0082â\u0080\u0082</p>\n<p>For information about the application procedure, please contact Irina Bruckner, HR advisor, <a href=\"mailto:application-3me@tudelft.nl\">application-3me@tudelft.nl</a></p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tudelft.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tud-en-wide/4f5fb7eb63ad62ee5a7d5dfdc5376f8f.gif"}