{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/core-micro-lab-manager/175072", "title": "CORE-MICRO Lab Manager", "publish_date": "2022-02-09", "deadline": "N/A", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Management", "field": "Biotechnology, Food Science, Microbiology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>College of Healthcare Technology</strong></p><p><span style=\"color:#A50021;\"><strong>Why the American University of Iraq â\u0080\u0093 Baghdad?</strong></span></p><p>Opening its doors in January of 2021, the new American University of Iraq â\u0080\u0093 Baghdad (AUIB) began as a dream of influential individuals in Iraqi and the United States business, industry and government who want to see a world-class institution of higher learning established in the city, reminiscent of the days when Baghdad was an educational mecca and flourishing capital of the Muslim world.  With a great library, palatial college buildings and student centers, state-of-the-art classrooms, laboratories, and athletic facilities, AUIB will be a beautiful campus attracting students, faculty, and staff from throughout the world.  We invite you to join us in this exciting new venture.</p><p>This position will report directly to <strong>Associate Vice President for Academic Affairs</strong></p><p><span style=\"color:#A50021;\"><strong>JOB DESCRIPTION</strong></span></p><p><span style=\"color:#212529;\">Under the overall guidance and supervision of the Dean of the College of Healthcare Technologies (CHT), the Manager of CORE â\u0080\u0093 MICRO duties and responsibilities include, but will not necessarily be limited to, the following:</span></p><ul><li>Performance of food microbiology diagnostics testing including food pathogen diagnosis and food quality control among others</li><li>Management of the daily laboratory operation including staff, supplies and expenses</li><li>Working with the Quality Assurance Manager to achieve and maintain laboratory accreditation under ISO17025-2017, ISO15189 and relevant certifications.</li><li>Planning, budgeting, and staffing and resources for current and future operations</li><li>Negotiate contracts relating to maintenance of instruments, safety and waste disposal and other related activities contracts</li><li>Implement, verify, and validate new food microbiology, food safety, food technology and other testing as needed</li><li>Ensure evolving practices in the various applications of the facility</li><li>Be involved in academic and continuous education and research including patent and/or manuscript drafting and submission</li><li>Develop professional relationships ensuring smooth cooperation with manufacturers, suppliers, academia, and other partners and maintain continuous improvement of facility staff</li><li>Problem solving of all issues that occur in high throughput molecular diagnosis testing laboratories</li><li>Assist the CHT dean with the coordination of work between CORE â\u0080\u0093 MICRO, other colleges and departments and programs and external partners</li><li>Other related duties as assigned.</li></ul><p><span style=\"color:#AB073D;\"><strong>REQUIREMENTS</strong></span></p><ul><li>Masterâ\u0080\u0099s degree Microbiology, Food Science, Food Technology, or related field</li><li>Technical procedures, or governmental regulations are preferred or pursuing or equivalent work experience</li><li>A minimum of 5 to 10 years of relevant full-time professional experience in food microbiology, food safety and food technology</li><li>Proven leadership and management experience</li><li>Excellent written and spoken English language skills at a level consistent with high profile publications and professional communication</li><li>Ability to coordinate closely and effectively with AUIB healthcare-related colleges, as well as subordinate staff in a complex and dynamic institutional mission</li><li>Excellent organization and multi-tasking skills, and the ability to maintain production levels while driving innovation</li><li>Exceptional positive and compelling attitude and demonstration of professionalism, teamwork, flexibility, and working under pressure</li><li>Proven ability to interact positively with colleagues from various backgrounds regardless of nationality, religion, or gender</li><li>Professional mastering of Microsoft 365 applications including Word, Excel, and PowerPoint among others. Substantial Knowledge of computer literacy including software and hardware</li><li>Willingness to work flexible hours including late evenings and weekends</li></ul><p><span style=\"color:#A50021;\"><strong>Application Procedure: </strong></span></p><p>Applications should include:</p><ul><li><strong>Cover Letter</strong> </li><li><strong>Curriculum Vita</strong></li><li><strong>Passport First Data Page</strong></li><li><strong>Contact Information For Three (3) Professional References</strong></li><li><strong>Copies Of Degrees Or Certification</strong></li></ul><p>Applications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately. </p><p><span style=\"color:black;\">Please apply through AUIB website OR send your application and supporting documents to the following email address:</span></p><p><a href=\"mailto:jobs@auib.edu.iq\">jobs@auib.edu.iq</a><span style=\"color:#212529;\"> with </span><a href=\"mailto:Karin.Jesuis@auib.edu.iq\">Karin.Jesuis@auib.edu.iq</a><span style=\"color:#212529;\"> in copy.</span><span style=\"color:black;\"><strong> </strong></span></p><p><span style=\"color:#A50021;\"><strong>A declaration of a relation at AUIB is obligatory</strong></span></p><p><span style=\"color:black;\"><strong>We will contact you if you are selected for interview.</strong></span></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}