{"url": "https://academicpositions.com/ad/western-university/2022/director-of-ian-o-ihnatowycz-institute-for-leadership/174840", "title": "Director of Ian O. Ihnatowycz Institute for Leadership", "publish_date": "2022-02-03", "deadline": "2022-05-03", "location": "1151 Richmond St London, Canada", "city": "N/A", "country": "Canada", "position": "Management", "field": "Behavioural Economics, Business Administration, Economic Psychology, Educational Leadership, Educational Management, and 3 moreManagement,Organizational Economics,Strategic Management", "salary": "N/A", "max_working_hours": "N/A", "employer": "Western University", "job_description": "The Ivey Business School at Western University seeks candidates for the role of Director of the Ian O. Ihnatowycz Institute for Leadership.&nbsp;Applicants will be considered for a Tenured appointment at the rank of Associate or Full Professor.&nbsp;The position is available to begin in July 2022, although alternate start dates may be arranged. The initial appointment for the role of Director will be a five-year term with the potential for renewal. &nbsp;&nbsp;The Instituteâ\u0080\u0099s mission is to influence individuals, organizations, and societies through the creation and application of new knowledge on leader character.&nbsp; It aims to:&nbsp;be a globally leading Institute for research, teaching and outreach for awareness, assessment and development of leader character;&nbsp;elevate the importance of character alongside competence in the practice of leadership; and&nbsp;develop global citizens who have strength of character, strive to make a difference and contribute to the flourishing of their teams, organizations, communities, and societies.&nbsp;The Institute is integral to the Ivey Business Schoolâ\u0080\u0099s mission â\u0080\u009cto develop business leaders who think globally, act strategically, and contribute to the societies within which they operate.â\u0080\u009d It plays a pivotal role in bringing together an array of leadership-related activities within the School as well as engaging external contributors from industry and academia.&nbsp;The successful candidate will have a background that balances academic research and innovation in programming with a successful track record in stakeholder outreach and engagement. As an ambassador and advocate promoting the values of leadership character and leadership across the Ivey Business School, the Director will support thought leadership and research funding, leadership curriculum and partnerships to enhance leader character programming and play a central role in supporting the Schoolâ\u0080\u0099s and Universityâ\u0080\u0099s commitment to develop future leaders for the public, private, and not for profit sectors. In addition to advancing leader character, the Director should consider other complementary areas of research that will broaden the Instituteâ\u0080\u0099s portfolio of research. The Director will bring excellence and innovation to the position and be a respected mentor, builder and collaborative team member, comfortable with being a champion for the mission of the Institute in a complex environment. Along with in-depth knowledge of the leading research in leader character and leadership, the Director will be a visionary leader with outstanding communication and relationship-building skills who will share their knowledge with faculty in all program areas and across Western University.&nbsp;&nbsp;Tenured Appointment: Applicants for a tenured appointment at the rank of Associate or Full Professor will hold a PhD or other earned Doctorate in organizational behavior, psychology, strategy, or related fields. The successful candidate will be an internationally recognized scholar in their field of research, as demonstrated by publications in the highest quality academic journals, an active continuing research program, external research funding, scholarly awards, and invited presentations at seminars and major conferences. Candidates should provide evidence of strong teaching at the undergraduate and graduate levels. Experience with the case teaching method is preferred.&nbsp;&nbsp;Application Procedure: The Recruitment Committee is being assisted in its search by Katherine Frank and Mark Gillis from Knightsbridge Robertson Surrette (KBRS). Applicants are encouraged to submit the following materials to&nbsp;www.kbrs.ca/Career/14898:&nbsp;Completed application form (http://www.uwo.ca/facultyrelations/faculty/Application-FullTime-Faculty-Position-Form.pdf)Cover letterCurriculum vitaeCopies of research papersa diversity statement that speaks to how the candidateâ\u0080\u0099s leadership/research/teaching program will further equity, diversity, inclusion and decolonization within the School and Institution.&nbsp;Names and email addresses of three referees (who will not be approached without permission). Letters of reference will be required for shortlisted candidates.&nbsp;&nbsp;Please ensure that the application form is completed and included in your application submission.&nbsp;All materials will be provided to the Recruitment Committee. Review of applicants will commence on March 30, 2022.&nbsp;Applications will be considered until the position is filled.&nbsp;To learn more about this opportunity, contact Katherine Frank (kfrank@kbrs.ca) or Mark Gillis (mgillis@kbrs.ca).&nbsp;The Ivey Business Schoolâ\u0080\u0099s mission is to develop leaders who think globally, act strategically and contribute to the societies within which they operate. Ivey is committed to values and practices of equity, diversity and inclusion. It is Canadaâ\u0080\u0099s premier business school and is recognized globally for the quality of its research and management education. The School is internationally oriented in terms of research, curricula, faculty, and student exchanges, with campuses in London (Canada), Toronto and Hong Kong. Ivey is the worldâ\u0080\u0099s second largest producer of case studies.&nbsp;Effective September 7, 2021, all employees and visitors to campus are required to comply with Western's&nbsp;COVID-19 Vaccination Policy.&nbsp;&nbsp;&nbsp;The University seeks applications from all qualified individuals. Western is committed to employment equity and diversity in the workplace and welcomes applications from women, members of racialized groups, Indigenous peoples, persons with disabilities, persons of any sexual orientation, and persons of any gender identity or gender expression.&nbsp;&nbsp;Western University has recently committed $6 million in funding for EDI initiatives (https://news.westernu.ca/2021/06/western-invests-6-million-to-support-new-edi-initiatives/). Ivey has established an EDI Advisory Council and launched a series of initiatives to ensure that our faculty, staff and students are a diverse community, committed to long-term career development.&nbsp;We especially encourage applicants from under-represented populations to apply. Spousal and family relocation assistance programs are in place.&nbsp;&nbsp;Positions are subject to budget approval. Applicants should have fluent written and oral communication skills in English. In accordance with Canadian Immigration requirements, priority will be given to Canadian citizens and permanent residents.&nbsp;&nbsp;Accommodations are available for applicants with disabilities throughout the recruitment process. If you require accommodations for interviews or other meetings, please contact&nbsp;accommodate@kbrs.ca.&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Founded on March 7, 1878 by Bishop Isaac Hellmuth (1817â\u0080\u00931901) of the Anglican Diocese of Huron, â\u0080\u0098The Western University of London Ontarioâ\u0080\u0099 opened its doors to students for the first time in 1881 with four faculties â\u0080\u0093 Arts, Divinity, Law and Medicine.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJmNDFcLzQzOFwvZjQxNDM4OGIxYjJjMmU1NGEwMWNhZDgxOGVmYmNiOWIuZ2lmIiwiZWRpdHMiOltdfQ=="}