{"url": "https://www.academictransfer.com/en/309178/front-end-developer/apply/", "title": "Front-end developer", "publish_date": "2022-02-08", "deadline": "2022-02-18", "location": "Burgemeester Oudlaan 50, 3062 PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "N/A", "max_working_hours": "40", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "<p>Als front-end developer werk je mee aan het ontwikkelen van onze (web)applicaties en websites, zoals onze demand forecasting en inventory management software FCastTM. Je slaat een brug tussen de analytische en machine learning modellen achter de software en de (eind)gebruikers. Je bouwt niet direct aan AI/ML modellen, maar je bent wel degene die zorgt dat eindgebruikers er wat mee kunnen. Je kiest wat je wel en niet laat zien (en hoe) en je maakt technische informatie inzichtelijk. Je hebt inzicht in processen en eindgebruikers zodat je bedrijfsprocessen kunt faciliteren met behulp van de juiste workflow in de applicatie.</p><p>Daarnaast draag je ook bij aan ons post-academisch onderwijs waarin we onze kennis overdragen aan anderen, bijvoorbeeld in de vorm van het verzorgen van een college (bijvoorbeeld op het gebied van Power BI), of het ondersteunen van een docent.</p><p>Wat kun je verwachten</p><ul> <li>Werken in een unieke en inspirerende werkomgeving op het snijvlak van het bedrijfsleven en de wetenschap</li> <li>Veel vrijheid bij het vormgeven van je werkzaamheden</li> <li>Toegang tot state-of-the-art kennis en technieken en deze direct toepassen</li> <li>Ontwikkelen en onderhouden van onze advanced analytics software</li> <li>Je werkt in een hecht en professioneel team dat elkaar ondersteunt om de beste oplossing voor de klant te cre&euml;ren.</li> <li>Brainstormen met collega&rsquo;s, klanten en onderzoekers van het Econometrisch Instituut</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}