{"url": "http://www.academictransfer.com/en/309236/datamanager-08-10-fte/", "title": "Datamanager (0.8 - 1.0 fte)", "publish_date": "2022-02-08", "deadline": "2022-02-28", "location": "Rapenburg 70, 2311 EZ, Leiden", "city": "Leiden", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "<p>Datamanagement en ondersteuning van onderzoek op het gebied van opslag, beheer en hergebruik van data is van toenemend belang in wetenschappelijk onderzoek. Ook bij de Faculteit der Sociale Wetenschappen (FSW) van de Universiteit Leiden hebben onderzoekers hulp nodig bij het managen van hun data. Hierbij kan het gaan om de veilige opslag van (grote) databestanden, het regelen van veilige toegang tot data, het anonimiseren van persoonsgegevens, het veilig archiveren en het herbruikbaar maken en publiceren van onderzoeksdata.</p><p>De faculteit wil in een stroomversnelling een facultair netwerk van Research Data Management (RDM) ondersteuners opzetten, en werft nu zowel een facultaire datamanager als een datasteward voor de instituten Psychologie en Pedagogische Wetenschappen. Binnenkort start ook de werving voor een datasteward binnen het domein Maatschappijwetenschappen voor de&nbsp;drie instituten Politieke Wetenschap en Culturele Antropologie en Ontwikkelingssociologie en het Centrum voor Wetenschaps- en Technologiestudies.</p><p>Wij zoeken iemand met enthousiasme voor Research Data Management en het bredere veld van Open Science, die graag wil bijdragen aan het veld door onze wetenschappelijke medewerkers te ondersteunen.&nbsp;Je maakt deel uit van een multidisciplinair team samen met de facultaire informatiemanager, privacy officer en security officer. Je zoekt aansluiting bij collega&rsquo;s van het Centre for Digital Scholarship van de Universiteitsbibliotheek en het ICT Shared Services Centre (ISSC). Je hebt een belangrijke spilfunctie en fungeert als schakel tussen de centrale/facultaire experts en de data stewards en beleidsmedewerkers onderzoek op instituutsniveau. Omdat het om een nieuwe functie gaat, stel je je proactief op en leg je zelf actief contact met collega&rsquo;s binnen en buiten de faculteit. Voor deze functie zoeken wij iemand die beschikt over een helikopterview en tegelijkertijd resultaat- en doelgericht is. Je zult veel werkzaamheden gezamenlijk oppakken en in overleg uitvoeren.</p><p>De werkzaamheden bestaan onder andere uit:</p><ul> <li>Opstellen van een plan om datamanagement ondersteuning structureel vorm te geven binnen de faculteit;</li> <li>Co&ouml;rdineren van het netwerk van medewerkers binnen de faculteit die zich bezig houden met ondersteuning van datamanagement;</li> <li>Aanspreekpunt voor data stewards en andere ondersteuners (vraagbaak) voor wat betreft het afstemmen over (oplossingen voor) datamanagement vraagstukken;</li> <li>Aanjaagfunctie vervullen voor (de te ontwikkelen) systemen en software tools die het opslaan en delen van onderzoeksdata mogelijk maken, en het inventariseren van de behoeften bij onderzoekers op dit vlak;</li> <li>Faciliteren in het bevorderen van kennis over datamanagement en het borgen daarvan;</li> <li>Uitwerken van beleid en protocollen met betrekking tot data opslag, onderzoeksmonitoring en vernietiging van data;</li> <li>Steekproefsgewijs (laten) monitoren op de naleving van datamanagementplannen, autorisatiebeheer, publicatiepackages en vernietiging van data;</li> <li>Co&ouml;rdineren van datamanagement trainingen binnen de faculteit;</li> <li>Adviseren van het Faculteitsbestuur over de ontwikkeling,verbetering, implementatie en handhaving van strategie en beleid met betrekking tot datamanagement;</li> <li>Afstemmen van het te ontwikkelen datamanagementbeleid binnen de faculteit op universitair beleid en universitaire adviezen en richtlijnen, en op de gangbare normen binnen de disciplines;</li> <li>Deelnemen in universiteits- en faculteitsbrede projecten en overlegstructuren op het gebied van (ondersteuning van) datamanagement, met name het Leiden Research Support programma en het in oprichting zijnde Leiden Digital Competence Centre;</li> <li>Aanleveren van facultaire voortgangsrapportages.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.universiteitleiden.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/lei-en-wide/f66e61a821cf3294ef5ce4fcaacbdedb.png"}