{"url": "https://www.academictransfer.com/en/308445/postdoctoral-researcher-in-protein-structural-biology/apply/", "title": "Postdoctoral Researcher in Protein Structural Biology", "publish_date": "2022-01-19", "deadline": "2022-02-14", "location": "Meibergdreef 9, 1105 AZ, Amsterdam", "city": "Amsterdam", "country": "Netherlands", "position": "Engineer/Technician", "field": "Natural sciences; Health", "salary": "â\u0082¬2986â\u0080\u0094â\u0082¬4707 per month", "max_working_hours": "36", "employer": "Academic Medical Center (AMC)", "job_description": "<p>The&nbsp;<strong>project</strong><br> This research project is funded by a 5 year NWO/ZonMw Vici grant to Prof dr Colin Russell focused on characterizing how our antibody-mediated immune response changes upon infection/re-infection and how these changes drive virus evolution. This portion of the project will be pursued in collaboration with Prof dr Rogier Sanders, Dr Marit van Gils, and Dr Dirk Eggink. You will be based in an active research group of ~20 people with a wide range of wet lab and computational expertise at Amsterdam UMC, location AMC in the Department of Medical Microbiology.</p><p>About&nbsp;<strong>your</strong>&nbsp;role<br> Influenza viruses infect ~700,000,000 people worldwide each year. Much of this disease burden derives from the evolution of influenza viruses to escape immunity induced by prior infections and vaccinations. Simultaneously, our immune responses evolve with each infection to attack the new virus variants. The result is a continuous evolutionary arms race between virus and host. In this project, you will develop a new protein microarray for characterizing serological antibody responses to seasonal influenza viruses to study the accumulation and waning of immunity based on longitudinally collected serum samples from hundreds of people for &gt;30 years. You will lead the work on protein expression for constructing the microarray. This is a new project that has the potential to reshape the understanding of accumulation of respiratory virus immunity, influence future vaccine design, and lead to substantial follow-on funding.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>We are looking for a highly motivated and enthusiastic Postdoctoral Researcher (Postdoc) with experience in protein structural biology and protein expression.</li>\n<li>You have a PhD and track record of publishing your results in peer reviewed journals.</li>\n<li>You have outstanding experimental research skills and academic skills, are well organized, goal-oriented and results-driven, and have a strong team spirit, but you can also function independently.</li>\n<li>You have excellent communication skills and are fluent in speaking and writing in English.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: at least 3 years.</p>\n<ul>\n<li>Play a leading role in a large-scale research project, with motivated colleagues from all over the world.</li>\n<li>Stable support for at least 3 years so that you can pursue ambitious projects.</li>\n<li>Additional benefits include an 8.3% end-of-year bonus and 8.0% holiday pay (these percentages are of your total 12 month salary). </li>\n<li>In addition to excellent accessibility by public transport, AMC also has a sufficient number of parking spaces for employees.</li>\n<li>Pension is accrued at Be Frank. </li>\n</ul>\n<p><a href=\"https://werkenbij.amsterdamumc.org/arbeidsvoorwaarden-amr\">Bekijk alle arbeidsvoorwaarden bij AMR</a></p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Amsterdam UMC</h4>\n<p>Working at  <a href=\"https://www.amsterdamumc.org/en/research/organization/about-amsterdam-umc.htm\">Amsterdam UMC</a> takes place in an inspiring and professional environment where development in every form is encouraged. </p>\n<p>You will work in an enthusiastic team of researchers who share their interest for the cerebrovascular system. We study stroke, micro-infarcts, hypertension, and perivascular spaces using cutting edge technology such as 2-photon imaging, MRI, ultrasound, and an in house developed imaging cryomicrotome setup.</p>\n<p>The project is part of a collaborative effort with Leiden University Medical Center, where a human counterpart of the current project is carried out. This provides a true translational framework that is expected to increase the impact of the project.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>What to <strong>expect</strong></p>\n<p>+ A job in our beautiful capital<br/>\n+ Working for the most preferred employer in healthcare (intermediair 2021)<br/>\n+ All colleagues have the same goal: contributing to tomorrow's care<br/>\n+ We care not only for our patients, but also for you<br/>\n+ Cooperation is characterised by mutual trust and interest in one another<br/>\n<br/>\n- We are constantly innovating, so you must be able to deal with change<br/>\n- Parking is limited at location VUmc, but by public transport you can get to the door<br/>\n- A full agenda, because our staff association organises many fun activities</p>\n<p><strong>Let’s meet!</strong><br/>\n<em>To apply, please submit: </em></p>\n<ol>\n<li><em>a full academic CV including peer reviewed publications, presentations at conferences, and other relevant experience; </em></li>\n<li><em>a letter describing your motivation in applying for the position and suitability for the role along with the names, job titles, and email addresses of three references.</em></li>\n</ol>\n<p>To apply please clik on the 'apply now' button on this webpage. You will then be referred to the application form of Amsterdam UMC. Do you have any questions about this positions? Please contact <strong>Prof dr Colin Russell</strong>, <strong><a href=\"mailto:c.a.russell@amsterdamumc.nl\">c.a.russell@amsterdamumc.nl</a></strong></p>\n<p>For more information about the application procedure, please contact <strong>Tanja Hart</strong>, Recruitment Adviser, via <strong>06-21603178 </strong>or via<strong> <a href=\"mailto:t.hart@amsterdamumc.nl\">t.hart@amsterdamumc.nl</a></strong></p>\n<p>A reference check can be part of the procedure. References will only be contacted after interview.</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.amc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/amc-en-wide_TAjdij7/88544601f45a8bc71e9cc74b40c8c85d.png"}