{"url": "http://www.academictransfer.com/en/309387/phd-position-in-computational-modelling-of-masonry/apply/", "title": "PhD Position in Computational Modelling of Masonry", "publish_date": "2022-02-11", "deadline": "2022-03-20", "location": "Mekelweg 2, 2628 CD, Delft", "city": "Delft", "country": "Netherlands", "position": "PhD", "field": "Engineering", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "N/A", "employer": "Delft University of Technology (TU Delft)", "job_description": "<p>Masonry structures, such as heritage and residential buildings, bridges and quay walls, are widely present in the Netherlands and worldwide. Considering the quasi-brittle nature of the masonry material and its deterioration due to aging and environmental effects, the prediction of its nonlinear response is crucial with respect to the structural assessment. This is especially the case for multi-wythe structures, in which the bonding pattern of masonry across the thickness has a strong influence on the mechanical response. In this respect, a model to predict the interaction between the different masonry's constituents, i.e. units, joints, and unit-joint interfaces, until failure and its impact on the mechanical performances of the material is required. For this purpose, various modelling approaches can be used among witch detailed brick-to-brick or analytical-based homogenisation models. The former provides a very accurate prediction, but requires high computational costs and often relays on a large amount of input parameters that are difficult to be determined via in-situ investigation with limited invasiveness. The latter results often in fast calculation and use limited input parameters, but relays on a simplified description of the behaviour and interaction of masonry's constituents.</p> <p>In this project, you will develop, validate and compare detailed brick-to-brick model and analytical-based homogenisation techniques to describe the nonlinear response of masonry. A large set of experimental data is available for validation. However, the possibility to carry out additional experimental tests is foreseen either as direct work or via cooperation with other team members.</p> <p>The candidate will work in the group of Structural Mechanics under the supervision of Dr Rita Esposito and Prof Jan Rots. More information on the group can be found <a href=\"https://www.tudelft.nl/citg/over-faculteit/afdelingen/materials-mechanics-management-design-3md/sections-labs/applied-mechanics/chairs/structural-mechanics\">here</a>.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>We are seeking a candidate with the following characteristics:</p>\n<ul>\n<li>A Msc degree in civil, mechanical engineering, mathematics or other related areas. Peference will be given to candidates with education and/or research experience in engineering.</li>\n<li>Good programming skills (C++/python/fortran/Matlab)</li>\n<li>Enthusiastic and highly motivated candidate with good interpersonal skills.</li>\n<li>Experience with research activities with the area of computational modelling and/or experimental study of quasi-brittle materials and structures will be a plus.</li>\n</ul>\n<p>Doing a PhD at TU Delft requires English proficiency at a certain level to ensure that the candidate is able to communicate and interact well, participate in English-taught Doctoral Education courses, and write scientific articles and a final thesis. For more details please check theÂ <a href=\"https://www.tudelft.nl/onderwijs/opleidingen/phd/admission\">Graduate Schools Admission Requirements</a>.</p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Doctoral candidates will be offered a 4-year period of employment in principle, but in the form of 2 employment contracts. An initial 1,5 year contract with an official go/no go progress assessment within 15 months. Followed by an additional contract for the remaining 2,5 years assuming everything goes well and performance requirements are met.</p>\n<p>Salary and benefits are in accordance with the Collective Labour Agreement for Dutch Universities, increasing from â\u0082¬ 2443 per month in the first year to â\u0082¬ 3122 in the fourth year. As a PhD candidate you will be enrolled in the TU Delft Graduate School. The TU Delft Graduate School provides an inspiring research environment with an excellent team of supervisors, academic staff and a mentor. The Doctoral Education Programme is aimed at developing your transferable, discipline-related and research skills.</p>\n<p>The TU Delft offers a customisable compensation package, discounts on health insurance and sport memberships, and a monthly work costs contribution. Flexible work schedules can be arranged. For international applicants we offer the Coming to Delft Service and Partner Career Advice to assist you with your relocation.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Delft University of Technology</h4>\n<p>Delft University of Technology is built on strong foundations. As creators of the world-famous Dutch waterworks and pioneers in biotech, TU Delft is a top international university combining science, engineering and design. It delivers world class results in education, research and innovation to address challenges in the areas of energy, climate, mobility, health and digital society. For generations, our engineers have proven to be entrepreneurial problem-solvers, both in business and in a social context. At TU Delft we embrace diversity and aim to be as inclusive as possible (see our <a href=\"https://www.tudelft.nl/en/about-tu-delft/strategy/integrity-policy/tu-delft-code-of-conduct/\">Code of Conduct</a>). Together, we imagine, invent and create solutions using technology to have a positive impact on a global scale.</p>\n<p>Challenge. Change. Impact!Â </p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For more information about this vacancy, please contact Rita Esposito (<a href=\"mailto:r.esposito@tudelft.nl\">r.esposito@tudelft.nl</a>).</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tudelft.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tud-en-wide/4f5fb7eb63ad62ee5a7d5dfdc5376f8f.gif"}