{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/research-associate-fellow-in-chemistry-fixed-term/174742", "title": "Research Associate/Fellow in Chemistry (Fixed term)", "publish_date": "2022-02-01", "deadline": "2022-02-14", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Research Assistant", "field": "Organic Chemistry, Synthetic Chemistry,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference: SCI020922Closing Date: Monday, 14th February 2022Job Type: ResearchDepartment: ChemistrySalary: Â£27924 to Â£40927 per annum (pro rata if applicable) depending on skills and experience (minimum Â£31406 with relevant PhD). Salary progression beyond this scale is subject to performanceWe are seeking to recruit a highly motivated and enthusiastic organic chemist for a Postdoctoral Research Associate/Fellow post within the EPSRC Photo-Electro Programme Grant team based in the Chemistry Building at UNUK. The project focuses on developing novel strategies for making complex molecules via multi-step processes involving light, heat and electrons. . This is a highly multidisciplinary task requiring the skills of several postdocs; specifically we are seeking a person with excellence in contemporary practical organic chemistry skills; these skills should preferably be demonstrated by your previous publication record.&nbsp;&nbsp;The successful candidates will carry out the following duties:Undertake the development of new flow chemistry methodologies as directed by Professor Mike George.Prepare high quality supporting information for publications resulting from the project.Candidates must:Hold a PhD (or be close to completion) in synthetic organic chemistry.Be available to take up the post as soon as possible after the start of 2022.Have a proven track record of excellence in synthetic organic chemistry.Have excellent organisational, communication, and team working skills.This role is available on a fixed term basis until 31/01/2023. Hours of work are full time (36.25 hours). Job share arrangements may be considered.Informal enquiries may be addressed to Professor Mike George, email: mike.george@nottingham.ac.ukPlease note that applications sent directly to this email address will not be acceptedOur University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileAdditional InformationApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}