{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/vice-president-for-public-relations-communications/174546", "title": "Vice-President for Public Relations & Communications", "publish_date": "2022-01-27", "deadline": "N/A", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Other Category", "field": "Educational Leadership, Educational Management, Higher Education, Management, Marketing, and 3 moreMedia and Communication Studies,Project Management,Strategic Management", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>This position will report directly to the <strong>President of AUIB</strong>.</p><p><strong>JOB DESCRIPTION:</strong></p><p>This position provides strategic direction, oversight, and resource development to define and enhance AUIBâ\u0080\u0099s brand position, raise awareness of its unique attributes to both domestic and international audiences, and effectively engage the broad community of stakeholders in support of key strategic and financial goals. The Vice President provides consultation to the president, vice presidents, and other senior academic and administrative leaders to identify marketing priorities and achieve key goals. Strong analytical and research skills â\u0080\u0093 a past history of defining competitive landscape and developing detailed plans to measure target market performance are a must.</p><p>Leading a growing team of 5 professionals and outside contractors, the Vice President supervises brand development and implementation, web strategy and communications, interactive marketing and social media, the strategic implementation of print and online publications, media relations, and emergency communications. The incumbent is responsible for design and effective implementation of communications plans to increase enrollment, charitable giving, and visibility of the College as well as ensure brand standards are executed consistently across the College.</p><p><strong>Strategic Objectives that Candidate Needs to Meet</strong></p><p>Ensuring that AUIBâ\u0080\u0099s values, mission, and unique attributes are communicated to potential students, parents, donors, and the larger business and social community to grow enrollment and build support for Iraqâ\u0080\u0099s newest private university.</p><p><strong>Core Skills the Successful Candidate Will Have:</strong></p><p>The incumbent must be able to produce and/or guide others in generating a wide array of written products quickly and accurately, including press releases and social media posts. S/he must also be able draft media analyses, strategic plans, and communications strategies to guide the work of the university communications team, marketing contractors, and companies providing branded products to the university. Occasional speech writing may also be required of the incumbent for high-level university officials. Experience in public diplomacy or university communications and marketing is preferred to product advertising and corporate communications.</p><p>Public speaking and presentation skills are required for this position. Whether speaking to groups of prospective students and parents, visiting dignitaries, or potential corporate and major gift donors, the incumbent must be able to speak persuasively and convincingly in communicating the universityâ\u0080\u0099s unique attributes.</p><p>A high professional level of written and spoken English is required and good written and spoken Arabic is desired, but not mandatory. The bilingual candidate will be especially competitive, as will the candidate with deep knowledge of Iraqi culture and its constituent communities. </p><p><strong>Responsibilities:</strong></p><p><i><strong>Branding and Communications</strong></i></p><ul><li>Works proactively with the President and senior leadership to position the University and its constituent colleges by developing and disseminating through multiple means the Presidentâ\u0080\u0099s key messages about the Collegeâ\u0080\u0099s strengths, people, and priorities.</li><li>Partners with the President and senior leaders in all colleges and divisions to define and advance the Universityâ\u0080\u0099s strategic communications objectives and strategies.</li><li>Seeks out opportunities to promote AUIB and its brand in both local and regional media outlets, as well as U.S. and other global media. Cultivate relationships and pitch stories to higher education and business editors and reporters. Manage emergent issues to protect AUIBâ\u0080\u0099s reputation and enhance its brand.</li><li>Works with academic departments and College offices to enhance online and print pieces in accordance with brand guidelines, including both the universityâ\u0080\u0099s website and all social media channels.</li><li>Collaborates with the AUIB Foundation and all areas of Institutional Advancement to develop and execute communication strategies that enhance the experience of AUIB students, alumnae, family, and friends through engaging, impactful, and persuasive messaging. Develop and execute integrated communications strategies for current and future fundraising campaigns.</li><li>Maintains a strong awareness and familiarity with public opinion in Iraq, the larger MENA region, and the U.S. and Europe, on issues relating to the University and its social-political milieu, and craft communications and media placements to ensure public good will towards the University and work collaboratively with leadership to set and implement an overall strategy for the Universityâ\u0080\u0099s web presence.</li><li>Works across University colleges and departments and use all appropriate media to create innovative campaigns and strategies that inspire engagement among key constituents with the University.</li><li>Monitors, updates, and establishes the creative and editorial guidelines that define the visual and voice direction for the University, while ensuring creative consistency in communications.</li><li>Develops and leads effective structures for cross-college marketing integration including managing councils and committees comprised of faculty, staff, students, and potentially external volunteers.</li><li>Demonstrated experience in managing a successful website redesign.</li></ul><p><i><strong>Media &amp; Public Relations</strong></i></p><ul><li>Develops, fosters, and advances effective and collaborative relationships with local, national, and international media, government and community leaders, key stakeholders, and business leaders to drive the Universityâ\u0080\u0099s brand and positively, influence perceptions, and the decisions of external partners. Builds relationships with international media representatives based in Baghdad and foreign Embassy press officers.</li><li>Leads media relations outreach and provide direct oversight for the Universityâ\u0080\u0099s media relations strategy. Organizes and hosts press conferences and other related events as needed.</li><li>Ensures compelling, relevant, and timely content on social media that features AUIB faculty, students, staff, and student/faculty achievements and that showcases the University in new and interesting ways through various communications platforms.</li><li>Collaborates with the Universityâ\u0080\u0099s faculty and administrative leadership to develop and execute comprehensive and integrated communications plans and measure success against key quantitative and qualitative goals.</li><li>Utilizes market and internal data to set strategies and goals for assigned programs, and to monitor progress against them. Research, analyze and prepare reports and performance metrics.</li></ul><p><i><strong>Management and Leadership</strong></i></p><ul><li>Manages the MarComms team and provides counsel to senior management regarding effective marketing and communications strategies.</li><li>Maintains highly collaborative and effective activity with executives and peers in enrollment management, student affairs, faculty senate, and all other areas of the universityâ\u0080\u0099s administration as needed to develop and activate the communications team in support of key goals.</li><li>Oversees development and deployment of internal communications strategies.</li><li>Manages related communications budget(s) and project budgets funded by other departments.</li><li>Knowledge of social media landscape and experience of building a brand on social media on a variety of platforms. Experience in dealing with multiple languages on social media is a plus, but not required.</li></ul><p><i><strong>Crisis Management</strong></i></p><ul><li>Lead Crisis Management Response teams as needed. Must be able to work closely and effectively with campus security and understand the complex security environment of Iraq and Baghdad.</li><li>Regularly develop and update crisis management templates and communication strategies.</li><li>Proactively develop an integrated crisis response plan including talking points, media statement, FAQs, internal updates, social media response plans, etc.</li></ul><p><strong>Experience, Skills and Educational Requirements: </strong></p><p>At minimum, a masterâ\u0080\u0099s degree is required. A minimum of ten years of editorial and/or project management experience, as well as overseeing a productive and successful metrics-based marketing engine for a higher educational institution. Experience in communications, journalism, public diplomacy, public relations, or a related field is required. Supervisory experience preferred.</p><p>This position requires consulting leadership at all organizational levels, and exceptional interpersonal, organizational and customer service skills. Strong project management experience, with the ability to multi-task, and manage projects from inception to fulfillment.</p><p>The duties of this position require exceptional written and verbal communication skills, with superior editing experience and the ability to develop articles for publications, routine reports, and business correspondence. Must be able to speak effectively in one-on-one and group settings.</p><p><strong>Application Procedure:</strong></p><p>Applications should include:</p><ul><li><strong>Cover Letter</strong></li><li><strong>Curriculum Vitae</strong></li><li><strong>Passport First Data Page</strong></li><li><strong>Contact Information For Three (3) Professional References</strong></li><li><strong>Copies Of Degrees Or Certification</strong></li></ul><p>Applications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately.</p><p>Please apply through AUIB website OR send your application and supporting documents to the following email address:</p><p><a href=\"mailto:jobs@auib.edu.iq\">jobs@auib.edu.iq</a> with <a href=\"mailto:Karin.Jesuis@auib.edu.iq\">Karin.Jesuis@auib.edu.iq</a> in copy.</p><p><strong>A declaration of a relation at AUIB is obligatory</strong></p><p><strong>We will contact you if you are selected for interview.</strong></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}