{"url": "https://academicpositions.com/ad/vtt/2022/research-team-leader-connectivity-services-and-solutions/175186", "title": "Research Team Leader, Connectivity Services and Solutions", "publish_date": "2022-02-11", "deadline": "2022-02-27", "location": "Vuorimiehentie 3 Helsinki, Finland", "city": "N/A", "country": "Finland", "position": "Management", "field": "Artificial Intelligence, Communication Engineering, Computer Communications (Networks), Telecommunications Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "VTT", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>Are you interested in new technologies and research in the field of connectivity? Would you like to develop innovative technology with superb colleagues who are top experts in their field? Do you want to build an excellent science career and work at the interface of academy and industry? Are you enthusiastic about working with fascinating projects in the state-of-the-art research facilities? VTT might be just the place for you.</strong></p><p><i>VTT is one of the leading applied research organisations in Europe. What unites us are curiosity, a passion for learning and a purpose: to solve the biggest challenges of our time and turn them into sustainable growth and well-being. Our cross-disciplinary community of over 2000 brilliant minds is focused on creating impact through science-based innovation.â\u0080¯Get to know us further by exploring VTTâ\u0080\u0099s research infra atâ\u0080¯</i><a href=\"https://www.vttresearch.com/en/vtt-world/\" target=\"_blank\"><i><strong>VTT World</strong></i></a><i><strong>. </strong></i></p><p><strong>We are now looking for a visionary Research Team Leader for our Connectivity Services and Solutions team.</strong></p><p>The team operates in VTTâ\u0080\u0099s Safe and Connected Society research area, and it works in close collaboration with the other research teams. The team is focusing on cutting-edge networking technologies to develop smart and critical connectivity solutions for different domains. As a Research Team Leader, you are responsible for building the team excellence through coaching leadership. You will also be the spokesperson for the research topic and take an active role in enhancing interdisciplinary collaboration inside VTT as well as with external partners and customers.   </p><p>The Connectivity Services and Solutions research at VTT includes following topics: advanced AI/ML algorithms for telecommunication networks, network planning and performance evaluation, open RAN, edge computing, non-terrestrial to terrestrial network integration, hybrid positioning, joint communication and radar solutions, and smart network solutions for vertical industries. Our focus is on safety critical domains. Read more about our interesting research on <a href=\"https://www.vttresearch.com/en/ourservices/beyond-5g-and-6g-networks\" target=\"_blank\">5G and 6G networks</a>. As a reference of our research projects you can find the <a href=\"https://www.luxturrim5g.com/\" target=\"_blank\">LuxTurrim project</a> and <a href=\"https://ai4green.celfinet.com/\" target=\"_blank\">AI4Green project</a>.</p><p>The work of the team builds partly on collaborative projects with companies, the public sector, and the academia. Many projects are accomplished within Business Finland, European Space Agency and Horizon Europe programmes.  The other part of the teamâ\u0080\u0099s work consists of contract projects to transfer research results to the industry and help companies to develop new innovative services and products.</p><p>In this position, you have a chance to lead a highly topical research agenda and play a key role in relevant national and international networks. You will represent an excellent team with great expertise, and you have the possibility to develop and lead the research activities. You will also be a part of the research area Leadership Team with other Research Team Leaders and Managers. The position is located in Espoo or Oulu.</p><h2><strong>With us, you will be responsible for:</strong></h2><p>Visionary leadership of the team. You will be the spokesperson for the research topic and take an active role in promoting its visibility.</p><p>Relevance and ambition of the teamâ\u0080\u0099s project portfolio and impactful collaboration with companies, policy makers and other stakeholders.</p><p>Working as one of the key contributors of the area and participating in relevant research projects.</p><p>As member of the research areaâ\u0080\u0099s leadership team, you find ways to combine competences and foster internal-/external collaboration to ensure wider impact.</p><p>This is a line manager role, so you are responsible for coaching the team and team membersâ\u0080\u0099 performance as an inspirational leader. Employee wellbeing, recruitment and teamâ\u0080\u0099s competence development are your key priority.</p><h2><strong>We expect you to have:</strong></h2><p>Strong background of working 5+ years in research and/or development role in the field of telecommunication network technologies, especially in 5G/6G domains. </p><p>Proven research skills and a track record in driving excellence and impact in telecommunication networkâ\u0080\u0099s (e.g., 5G and 6G) research. You have a doctoral degree or Master of Science degree with equivalent science experience in a relevant field.</p><p>Understanding of applying artificial intelligence in telecommunication is considered a significant advantage.</p><p>You have the ability and willingness to prepare and lead large international projects, which include travelling (pre-pandemic typically 15-25 days per year).</p><p>As a leader, you want to create positive drive and get people excited by coaching and setting ambitious targets together with the team. Strong interpersonal skills are mandatory in the position.</p><p>Good communication skills and the ability to build high value research collaboration in the area.</p><p>You should have fluent professional Finnish and English language skills.</p><h2><strong>As a person, we hope that you are:</strong></h2><p>Motivating people leader with the ability to coach and develop your team</p><p>Proactive person with a self-driven mind-set</p><p>Eager to learn and an ambitious to achieve high goals</p><p>Team player and easy to work with.</p><h2><strong>With VTT, youâ\u0080\u0099ll enjoy:</strong></h2><ul><li><strong>Visionary work in technology. </strong>We offer positions at the cutting-edge of technology and engineering. Our research agenda is dedicated to creating sustainable growth by solving systemic and technological challenges, so your work will go towards creating real, positive impact. Read more about our strategy â\u0080\u0093 <a href=\"https://www.vttresearch.com/en/news-and-ideas/welcome-path-exponential-hope-how-turn-turbulence-2020s-sustainable-growth\" target=\"_blank\">the path of exponential hope</a>.</li><li><strong>Fascinating projects, excellent research environment. </strong>Our researchers get to work on a combination of cutting-edge academic research and applied customer projects, both locally and internationally. At VTT, youâ\u0080\u0099ll have state-of-the-art research facilities at your disposal, such as 5G/6G test network and cyber security testing facility (war room).<strong> </strong></li><li><strong>Great career opportunities, superb colleagues.</strong> At VTT, excellence in research is a strategic priority. We offer long-term positions and stable career paths in top-level research. People tend to stay with us over 10 years since there are always new roles and responsibilities to grow into. Collaborating in a cross-disciplinary community with superb colleagues is a source of learning, inspiration, and fun.</li><li><strong>Support for your well-being. </strong>Our people are our main asset, so we take good care of them. We aim to nurture great team spirit and leadership and offer versatile well-being services to enable a good workâ\u0080\u0093life balance. On top of 6 weeks of paid holidays, we offer exercise and culture benefits, hobby clubs, and voluntary well-being services such as meditation programmes and trainings on cognitive ergonomics.</li></ul><p><strong>Apply now and join our community of brilliant minds!</strong></p><p>Please send your CV and application with your salary request via our recruitment system as soon as possible but <strong>at the latest by 27th of February 2022. </strong>We will process applications as they come in and fill in the position as soon as we find the right candidate. </p><h2><strong>Interested and want to know more?</strong></h2><p>For further information please contact VTTâ\u0080\u0099s Connectivity Lead Pertti Raatikainen, +358 40 7224476, preferably on 10th of February between 14 and 16 p.m. or 14th of February between 14 and 16 p.m.</p><p><strong>We look forward to hearing from you!</strong></p><p>Apply between <strong>9 February 2022</strong> and <strong>27 February 2022 23:59 (Europe/Helsinki)</strong></p><p><strong>Employment type:</strong> Full-time, Permanent (hybrid work)</p><h2>VTT</h2><p><i>VTT is a visionary research, development and innovation partner. We drive sustainable growth and tackle the biggest global challenges of our time and turn them into growth opportunities. We go beyond the obvious to help the society and companies to grow through technological innovations. We have over 75 years of experience of top-level research and science-based results. VTTÂ´s turnover and other operating income is 258 Mâ\u0082¬. VTT is at the sweet spot where innovation and business come together.</i></p><p>VTT â\u0080\u0093 beyond the obvious.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxYjJcLzA2Y1wvMWIyMDZjODQ0MTljY2ZlNWNjODU2MzM0MTZjMWVhMmUucG5nIiwiZWRpdHMiOltdfQ=="}