{"url": "https://academicpositions.com/ad/silicon-austria-labs-sal/2021/senior-scientist-heterogeneous-integration-expert-f-m-d/165402", "title": "Senior Scientist - Heterogeneous Integration Expert (f/m/d)", "publish_date": "2021-11-03", "deadline": "N/A", "location": "VILLACH Villach, Austria", "city": "N/A", "country": "Austria", "position": "Researcher", "field": "Electrical Engineering, Electronics, Engineering, Manufacturing Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Silicon Austria Labs (SAL)", "job_description": "YOUR FUTURE RESPONSIBILITIES Development of Advanced Packaging Approaches for Sensors, Power Electronics and RF devices. Waferlevel Packaging, Wafer to Wafer bonding, Chip to Wafer bonding. Research on 3D Stacked Devices, TSV, Cu Pillar Bond, Redistribution Layer. Characterisation and test of manufactured samples. Scientific dissemination. Lead of application oriented research projects. YOUR PROFILE Scientific background in cleanroom process development and back-end processing. PhD or relevant industrial experience in R&amp;D. Demonstrated cleanroom Experience in Microfabrication and Advanced Packaging Technologies especially on:Optimizing wafer CMP and post-CMP cleaning processes&nbsp; Electroplating for wafer level packaging Lithography processes Thin film deposition (PVD and CVD) Wafer thinning and dicing Track record in microfabrication or advanced backend processes. Experience in writing and submission of funding proposals. IMPORTANT FACTS ABOUT SAL Start of your employment: 1st of August (negotiable) This position is endowed with a gross annual salary of&nbsp;â\u0082¬ 53.382.-&nbsp;based on the collective agreement for research (â\u0080\u009eForschungs-Kollektivvertragâ\u0080\u009c) excluding bonus and depending on your experience and skills. Home Office possible. â\u0082¬ 4.- /day food allowance in restaurants / â\u0082¬ 2.- /day in supermarkets. Family- &amp; Kids friendly. Free Coffee/Milk/Tee. BECOME PART OF SILICON AUSTRIA LABSThe top research center for electronic based systems (EBS). Unfold the future, unfold yourself.&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "In the network of science and industry, we carry out reÂ­search at the highest global reÂ­search level.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI3YjZcLzM0NlwvN2I2MzQ2ODRlNjQ2YThlYmM4ODM3ZmI2NDQ4OGM1NTcuc3ZnIiwiZWRpdHMiOltdfQ=="}