{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/research-development-specialist-in-finance-and-advanced-technologies-fintech/174830", "title": "Research & Development Specialist in finance and advanced technologies (FinTech)", "publish_date": "2022-02-03", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Researcher", "field": "Accounting, Finance, Financial Economics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>SnT</strong> is a leading <strong>international research and innovation centre</strong> in secure, reliable and trustworthy ICT systems and services. We play an instrumental role in Luxembourg by fueling innovation through research partnerships with industry, boosting R&amp;D investments leading to economic growth, and attracting highly qualified talent.</p><p>Weâ\u0080\u0099re looking for people driven by excellence, excited about innovation, and looking to make a difference. If this sounds like you, youâ\u0080\u0099ve come to the right place!</p><p><strong>Your Role...</strong></p><p>The successful candidate will join SnTâ\u0080\u0099s new Finnovation Hub, which is an entity in relation with SnTâ\u0080\u0099s research groups and the financial actors in Luxembourg and helping the formers to develop the technologies needed by the latters.</p><p>The successful candidate will perform the following tasks:</p><ul><li>Undertake independent analysis of finance literature related to technical and regulatory innovation relevant for the financial service sector</li><li>Assist in FinTech research projects and document activities, and results</li><li>Prepare and draft internal and external specialized reports and provide hypotheses/advice/conclusions</li><li>Gain expertise in specific research fields and/or projects related to disruptive innovation and business model changes</li><li>Search and analyse market trends in banking, insurance and fund industry</li><li>Contribute to papers, books, articles, blogs, and other research-related documents</li><li>Contribute in building up a network of finance industry partners</li><li>Support research teams with the collection, assessment of relevant knowledge  </li></ul><p><strong>Your Profile...</strong></p><ul><li>Master qualification with specialization in finance and economics </li><li>First experience in the Luxembourg financial service industry is appreciated</li><li>Excellent analytical and conceptual skills with proven ability to adapt to new situations and develop creative solutions</li><li>Very good oral and written competence in English and Full working proficiency and understanding of French - Luxembourgish or German is welcome</li><li>Ability to work as an integral part of a team in a multidisciplinary, multicultural environment</li></ul><p><strong>Hereâ\u0080\u0099s what awaits you at SnT...</strong></p><ul><li><strong>Exciting infrastructures and unique labs.</strong> At SnTâ\u0080\u0099s two campuses, our researchers can take a walk on the moon at the LunaLab, build a nanosatellite, or help make autonomous vehicles even better</li><li><strong>The right place for IMPACT. </strong>SnT researchers engage in demand-driven projects. Through our Partnership Programme, we work on projects with more than 45 industry partners</li><li><strong>Be part of a multicultural family</strong>. At SnT we have more than 60 nationalities. Throughout the year, we organise team-building events, networking activities and more</li></ul><p><a href=\"https://wwwfr.uni.lu/snt/about_us\" target=\"_blank\">Find out more about us!</a></p><p><strong>In Short...</strong></p><ul><li>Contract Type: Fixed Term Contract 24 Month - extension possible</li><li>Work Hours: Full Time 40.0 Hours per Week</li><li>Earliest starting date: April 2022</li><li>Location: Kirchberg</li><li>Job Reference: UOL04752</li></ul><p><strong>How to apply...</strong></p><p>Applications should include:</p><ul><li>Curriculum Vitae</li><li>Cover letter</li></ul><p>All qualified individuals are encouraged to apply.</p><p>Early application is highly encouraged, as the applications will be processed upon reception. Please apply ONLINE formally through the HR system. Applications by Email will not be considered.</p><p>The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.</p><p><strong>About the University of Luxembourg...</strong></p><p><strong>University of Luxembourg</strong> is an <strong>international research</strong> university with a distinctly <strong>multilingual</strong> and <strong>interdisciplinary</strong> character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide.<br/> </p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}