{"url": "https://academicpositions.com/ad/vlerick-business-school/2022/researcher-operations-supply-chain-management/174907", "title": "Researcher Operations & Supply Chain Management", "publish_date": "2022-02-04", "deadline": "2022-05-04", "location": "Reep 1 Ghent, Belgium", "city": "N/A", "country": "Belgium", "position": "Management", "field": "Logistics, Management, Supply Chain Management,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Vlerick Business School", "job_description": "Do you have a passion for applied research? And are you ready to explore the world of Operations &amp; Supply Chain Management? Would you like to have impact as part of a dynamic, open &amp; international team? Letâ\u0080\u0099s meet! &nbsp;Researcher Operations &amp; Supply Chain Management &nbsp;Vlerick Business School is a triple-accredited, international business school at the heart of Europe â\u0080\u0093 ranked number one in the Benelux for executive education and 19 in Europe. We strive to make a difference, offering high quality, interactive and impactful learning journeys and in doing so, helping form positive change-makers with a vision that is rooted in a dream.&nbsp;Vlerick is a school, but it is run as a company, aligned with the high standards we foster in our different programmes. We are looking for an enthusiastic and driven Researcher&nbsp;to join our Operations &amp; Supply Chain team.&nbsp;The jobConduct research on â\u0080\u0098business case applications of a federated data space to stimulate a modal shift in logisticsâ\u0080\u0099 in collaboration with faculty and other researchers. This includes more specifically:&nbsp;Plan and perform research projects,Perform Desk research: e.g., finding and synthesising relevant publicationsCollect data/field research (survey, secondary data, contacting research partners,â\u0080¦)&nbsp;Analyse data&nbsp;Disseminate knowledge by writing papers, reports and articles, social media and present research findings to both business and academic audiences.&nbsp;Provide support for our operations &amp; supply chain teaching activities.YouHave a Masterâ\u0080\u0099s degree (preferably with an economic, data sciences or engineering background) and a research mindset; with above-average academic performance (i.e. yearly exam results must be with honours or more, at least twice, of which minimum once in the masterâ\u0080\u0099s degree).Have an affinity with management.Have good analytic skills.Want to conduct research which is relevant for both the academic and the business worlds.Are very fluent in English, both written and spoken.Have a proactive and customer-oriented attitude.&nbsp;Will be based on our campus in Ghent, Brussels or Leuven in combination with your home office.&nbsp;#ProudtobeVlerickAutonomy and responsibility in a challenging work environment.&nbsp;A dynamic, open, and international company culture.&nbsp;Opportunities for professional and personal growth.A team of enthusiastic, driven colleagues, passionate about learning.&nbsp;Flexibility: 30+ holiday days, working from home, flexible benefits based on your individual needs, etc.&nbsp;The chance to have a real impact and to inspire people to live, learn and leap.At Vlerick, openness to the world is part of our DNA. We are continuously working towards being a truly diverse, equitable and inclusive place to work and learn at. So, no matter who you are, where you come from, or what your dreams are, we are looking forward to receiving your application.Take the leap and join usIf you think you meet these criteria, please apply with your resume and motivation letter on&nbsp;our website. We look forward to hearing from you! Happy to give you more information on the job content:&nbsp;filip.goeman@vlerick.com.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Vlerick is a leading international business school.. with a difference. Yes, we offer fully-accredited, world-class education programmes combining a healthy mix of theoretical knowledge and practical insight.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEzXC8xMVwvdmxlcmlja2xvZ28ucG5nIiwiZWRpdHMiOltdfQ=="}