{"url": "https://academicpositions.com/ad/university-of-oklahoma/2022/associate-or-full-professor-of-marketing/174475", "title": "Associate or Full Professor of Marketing", "publish_date": "2022-01-26", "deadline": "2022-04-26", "location": "660 Parrington Oval Norman, United States", "city": "N/A", "country": "United States", "position": "Full Professor", "field": "Behavioural Economics, Business Administration, Marketing, Strategic Management, Supply Chain Management,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Oklahoma", "job_description": "The Marketing &amp; Supply Chain Management Division (MSCM) of the Price College of Business, University of Oklahoma, continues to be in an ambitious, multi-year period of growth and renewal. As part of this expansion, applications are invited for a tenured position as Associate or Full Professor of Marketing beginning August 2022. An Endowed chair is tied to this position for qualified candidates with the achievement of national/international reputation.The Price College of Business at OU continues to flourish in a period of growth and expansion. The Price College of Business is AACSB-accredited with approximately 5,000 undergraduate, 700 masterâ\u0080\u0099s, and 35 doctoral students.&nbsp; Several Price undergraduate and masterâ\u0080\u0099s programs have been ranked among the top programs of their sizes in the nation.The University of Oklahoma (OU) is a Carnegie-R1 comprehensive public research university known for excellence in teaching, research, and community engagement, serving the educational, cultural, economic, and healthcare needs of the state, region, and nation from three campuses: Norman, Health Sciences Center in Oklahoma City and the Schusterman Center in Tulsa. OU enrolls over 30,000 students and has more than 2700 full-time faculty members in 21 colleges. In Fall 2019, approximately 23% of OUâ\u0080\u0099s freshmen were first-generation students, 33% of all students belonged to a minority race/ethnicity and 6% were international. Norman is a culturally rich and vibrant city located just outside of Oklahoma City and less than three hours from Dallas/Ft. Worth. With outstanding schools, nearby amenities, and a low cost of living, Norman is a perennial contender on â\u0080\u009cBest Places to Liveâ\u0080\u009d rankings.The University of Oklahoma is committed to achieving a diverse, equitable, and inclusive university community by embracing each personâ\u0080\u0099s unique contributions, background, and perspectives. The University of Oklahoma recognizes that fostering an inclusive environment for all, with particular attention to the needs of historically marginalized populations, is vital to the pursuit of excellence in all aspects of our institutional mission. This enhances the OU experience for all students, faculty, and staff and for the communities we engage.For more information, please refer to these websites:http://www.ou.edu/pricehttps://www.census.gov/quickfacts/fact/table/normancityoklahoma/PST045216http://www.ou.edu/flipbookQualifications&nbsp;Candidates must possess a doctoral degree in marketing or a closely related field.&nbsp; Successful candidates must have served a minimum of five years in a tenure-track or tenured position at an AACSB-accredited business school prior to the expected appointment date. &nbsp;A strong track record of publications in top-tier marketing journals, a solid pipeline of research projects, and the ability to work with doctoral students and junior and mid-career faculty are essential. Candidates will be expected to teach at the undergraduate and graduate levels (depending on rank) and must have evidence of high-quality teaching. In terms of research, the ideal candidate would be a recognized leader of the field with an established record of research in one or more of these areas: marketing strategy, marketing analytics, business-to-business marketing, advanced research methods, innovation, digital marketing, or social media marketing.&nbsp; Furthermore, the ideal candidate should be an outstanding mentor to our doctoral students. The ability to work with our diverse faculty and students in the division in the areas of supply chain management, healthcare, and those with experience/expertise in aerospace and defense is desirable.Application Instructions&nbsp;Qualified individuals may apply at&nbsp;http://apply.interfolio.com/16123. Application materials should include a current vita, a working paper to be presented to faculty and doctoral students, evidence of effective teaching, and the names and contact information for three references.Questions regarding the Interfolio application process may be submitted to Ms. Suzanne Peters (speters@ou.edu).&nbsp; Questions specific to this search may be directed to search committee co-chairs Qiong Wang (qiongwang@ou.edu) and Jeffrey Schmidt (jbs@ou.edu). Screening of applications will begin November 15, 2021, but applications will continue to be accepted until the position is filled.****", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Founded in 1890, the University of Oklahoma is a public research university located in Norman, Oklahoma just 20 mins. south of Oklahoma City. OUâ\u0080\u0099s Norman undergraduate population is slightly more than 20,000, giving students a major university experience in a private college atmosphere.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJmZTlcLzRhNlwvZmU5NGE2OWQwMjg2YjJlM2I0OTZiOWMwOTJkZjJmNDAucG5nIiwiZWRpdHMiOltdfQ=="}