{"url": "https://www.academictransfer.com/en/309298/full-professorassociate-professor-management-of-engineering-projects/apply/", "title": "Full Professor/Associate Professor Management of Engineering Projects", "publish_date": "2022-02-09", "deadline": "2022-03-27", "location": "Mekelweg 2, 2628 CD, Delft", "city": "Delft", "country": "Netherlands", "position": "Assistant Professor", "field": "Engineering", "salary": "â\u0082¬6533â\u0080\u0094â\u0082¬8539 per month", "max_working_hours": "N/A", "employer": "Delft University of Technology (TU Delft)", "job_description": "<p>The research group Integral Design &amp; Management has a vacancy (0,6-1,0 fte) for a Full or Associate Professor Management of Engineering Projects.</p> <p>Engineering activities are usually carried out as projects. Better insight in how to optimize and/or control project performance is essential both from an efficiency and an effectivity viewpoint. This requires state of the art management systems which make it possible to improve managerial decisions within different phases of civil engineering projects (design, construct, procurement, planning, etc.).</p> <p>Possible research themes are:</p> <ul> <li>Researching project management complexity with a fit-for-purpose approach (topics: agile/flexible/adaptive/fit for purpose project management systems, risk management, modular and/or lean construction concepts as a way to improve circularity and/or productivity in the construction industry, learning from projects);</li> <li>Studying collaborative (contract) relations for an integral design approach (topics: project management systems where human behavior is properly reflected, supply chain decision tools);</li> <li>Integrated (multi-actor) design/project decision-making based upon project data streams (topic: integrated multi-stakeholder design optimization tools).</li> </ul> <p>For these topics to be further researched, both fundamental and theoretical knowledge and reflective practical experience with project management in the industry (civil, mechanical as well as process engineering and construction) are necessary and integrative attributes. The overarching focus is placed on the central role of the people in the projects for the successful realization of those projects</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>We seek a colleague with extensive project management experience in preferably the civil engineering or process engineering domain. We expect you to operate agenda-setting in the field of MEP, responding to the societal needs with respect to improvement of project performance and to demands from industry. You should be able to translate novel topics into state-of-the art education.</p>\n<p>Your project management experience is based on an industrial and international portfolio that will enrich, inspire and strengthen the MEP research and educational activities. Moreover, you have fundamental knowledge in the field of multi-objective optimization, utility theory, probabilistic design and management systems science.</p>\n<p>Further strengthening the group to become an internationally recognized, excellent and visible research group is one of the goals. To achieve this, acquisition of external funding is necessary, being a prerequisite of establishing a strong research group. Results are being published in peer-reviewed scientific publications (e.g. International Journal of Project Management, Automation in Construction, ASCE Journal of Construction Management and Engineering etc.), but can also translate into books and book chapters. Next to your research, you will develop and deliver BSc and MSc-programmes courses and guide MSc-students during their graduation.</p>\n<p>We are looking for a team player who enjoys connecting with others, since close interaction with the other departments within CEG and with the construction industry is a requirement. You will supervise the group, and have a stimulating coaching style of supervision, helping staff and students to develop, grow and excel. On the basis of common interests you will participate in the board of the department 3MD.</p>\n<p><em>Please understand that the above mentioned overview is for our ideal candidate. We strongly encourage applications if you meet most of the criteria and want to work on further developing your track record starting as an Associate Professor at our university.</em></p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Salary and benefits are in accordance with the Collective Labour Agreement for Dutch Universities. The TU Delft offers a customizable compensation package, a discount on health insurance and sport memberships, and a monthly work costs contribution. Flexible work schedules can be arranged.</p>\n<p>For international applicants we offer the Coming to Delft Service and Partner Career Advice to assist you with your relocation. An International Children's Centre offers childcare and there is an international primary school. <br/>Inspiring, excellent education is our central aim. We expect you to obtain a University Teaching Qualification (UTQ) within three years if you have less than five years of teaching experience. This is provided by the TU Delft UTQ programme.</p>\n<p>TU Delft sets high standards for the English competency of the teaching staff. The TU Delft offers training to improve English competency. If you do not speak Dutch, we offer courses to learn the Dutch language.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Delft University of Technology</h4>\n<p>Delft University of Technology is built on strong foundations. As creators of the world-famous Dutch waterworks and pioneers in biotech, TU Delft is a top international university combining science, engineering and design. It delivers world class results in education, research and innovation to address challenges in the areas of energy, climate, mobility, health and digital society. For generations, our engineers have proven to be entrepreneurial problem-solvers, both in business and in a social context. At TU Delft we embrace diversity and aim to be as inclusive as possible (see our <a href=\"https://www.tudelft.nl/en/about-tu-delft/strategy/integrity-policy/tu-delft-code-of-conduct/\">Code of Conduct</a>). Together, we imagine, invent and create solutions using technology to have a positive impact on a global scale.</p>\n<p>Challenge. Change. Impact!Â </p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For more information about this vacancy, you can contact Prof.dr.ir. Bert Sluys viaÂ  e-mail <a href=\"mailto:L.J.Sluys@tudelft.nl\">L.J.Sluys@tudelft.nl</a> or telephone: +31 15 27 82728.</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tudelft.nl/", "job_type": "N/A", "logo": "https://www.academictransfer.com/media/derivatives/logos/tud-en-wide/4f5fb7eb63ad62ee5a7d5dfdc5376f8f.gif"}