{"url": "https://www.academictransfer.com/en/309320/postdoc-to-study-sex-differences-in-adipose-tissue-function/apply/", "title": "Postdoc to study sex differences in adipose tissue function", "publish_date": "2022-02-10", "deadline": "2022-02-27", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Postdoc", "field": "Health", "salary": "â\u0082¬2986â\u0080\u0094â\u0082¬4707 per month", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "We are seeking a highly motivated postdoc with experience in working with induced pluripotent stem (iPS) cells to join our research group. The project is aimed at unraveling how chromosomal sex and hormonal influences regulate sex differences in adipose tissue function. Sex-specific cell lines for white and brown adipocytes are currently a limiting factor. In this project, you will develop novel adipocyte models using patient-derived iPS cells to study sex differences in adipose tissue function. You will use your knowledge and experience in stem cell biology, cell model development, and gene editing technology to generate models for several human diseases of metabolic disorders, including genetic obesity, polycystic ovary syndrome, and disorders of sex differentiation.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For this position we are seeking a highly motivated PhD candidate with a PhD degree in Biology, Molecular Biology, Molecular Biomedicine, Medicine or other related fields, and with less than five year experience as post-doctoral fellow. Proven research experience in stem cell culture techniques, molecular and cellular biology is a requirement. You must have a strong background and track record in metabolic biology. Knowledge of reproductive biology is an asset.<br/><br/>Other requirements/preferences include:<ul>\n<li>Demonstrated track record in basic/translational research, with evidence of ability to publish in peer-reviewed journals as first author.</li>\n<li>Excellent oral and written communication skills in Dutch and/or (academic) English</li>\n<li>Self-motivated, good communication skills and ability to interact effectively and work productively in a team. Emphasis will be placed on personal suitability.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You will receive a temporary position for 3 years.</li>\n<li>The gross monthly salary amounts a maximum of â\u0082¬ 4.707,- (scale 10), depending on your level of education and relevant experience and based on a full-time working week of 36 hours.</li>\n<li>Excellent fringe benefits, such as a 13th month that is already paid out in November and a induvidual travel expense package.</li>\n<li>Pension insurance with ABP. We take care of approximately 2/3 of the monthly contribution.</li>\n<li>Special benefits, such as a incompany physiotherapist and bicycle repairer. And there is also a gym where you can work on your fitness after work.</li>\n</ul> The terms of employment are in accordance with the Collective Bargaining Agreement for University Medical Centers (CAO UMC).\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus MC</h4>\n              \n              The Department of Internal Medicine is a large department with nine research laboratories. Our main mission is to pioneer innovation in research, education and care by bringing science to the patient. To achieve this objective, we aim to continually develop new technologies and innovations within the department in research, education and care.<br/><br/>Within the section Endocrinology, the research group \"Metabolism and Reproduction\" focuses on aspects of sex differences in metabolism in health and disease. We approach our research questions using genetic, physiological and cellular techniques, both in animal models and in humans. An important principle that guides our efforts is the possibility to apply our findings to the clinic and, vice versa, paying attention to questions that arise in the clinic when treating patients. You will be working in a multi-disciplinary dynamic environment, interact with several disciplines of our department, and with our international collaborators.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about this position, please contact Dr. ir. Jenny Visser, Associate Professor, Head Lab Metabolism and Reproduction, phone number: <a href=\"tel:00107030533\">+31 010 703 05 33</a>. For queries regarding your application, please contact Jeanette dos Santos Gomes, Recruiter, by phone number: +31 (0)6 500 310 07.<br/><br/>If you are excited by the thought of this position and would like to apply, please do so by using the application form on our website. Please send your Curriculum Vitae, motivation letter and contact information of at least two references\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}