{"url": "http://www.academictransfer.com/en/309395/datamanager-researchcoordinator-rve-brein-en-zintuigen/apply/", "title": "Datamanager & Researchcoördinator RVE Brein en Zintuigen", "publish_date": "2022-02-11", "deadline": "2022-02-27", "location": "Els Borst-Eilersplein 275, 2545 CH, Den Haag", "city": "Den Haag", "country": "Netherlands", "position": "Management", "field": "Gezondheid", "salary": "N/A", "max_working_hours": "32—36", "employer": "HagaZiekenhuis", "job_description": "<p>Gaat jouw hart sneller kloppen van het verbeteren van zorg? Krijg je energie van het optimaal beheren en analyseren van diverse indicatoren en het doen van onderzoek? Heb jij een onderzoekende en kritische houding en zie jij kansen om te optimaliseren? Ben jij een teamspeler die effectief communiceert met verschillende disciplines binnen het ziekenhuis? Dan heten wij jou graag welkom binnen de RVE Brein en zintuigen.</p><p><strong>Jouw nieuwe baan</strong><br> De Resultaat Verantwoordelijke Eenheid (RVE) Brein en zintuigen van het HagaZiekenhuis verzamelt en analyseert data voor interne en externe verantwoording en ter verbetering van de kwaliteit van de geleverde zorg. Wij zijn op zoek naar een datamanager die zorgdraagt voor de registratie, aanlevering en analyse van deze data met betrekking tot de pati&euml;ntenzorg.</p><p>Als datamanager ben jij verantwoordelijk voor het beheren en analyseren van data en kwaliteitsbewaking van de pati&euml;ntgegevens. Een van jouw kerntaken is om te komen tot een kwalitatief sterk en volledig bijgehouden database, waaruit je rapportages en analyses maakt. Jouw werkzaamheden bestaan dan ook uit het controleren en interpreteren van medische statusvoeringen en het verzamelen en verwerken van medische gegevens voor kwaliteitsregistraties. Aan de hand van deze registraties, de rapportages en de productiecijfers leg je verbanden die van waarde zijn voor het verbeteren van onze zorg. Je voert hierover actief overleggen met de medisch manager, de business controller en de RVE-manager. Dankzij jouw ervaring als datamanager draai jij je hand niet om voor snel en secuur werken waarbij jij de geldende deadlines en richtlijnen niet uit het oog verliest.</p><p>Als researchco&ouml;rdinator ben je &lsquo;de spin in het web&rsquo; van onze wetenschappelijke werkzaamheden: je co&ouml;rdineert de gehele procedure voor indiening en goedkeuring van nieuwe onderzoeken en monitort de voortgang en bewaakt de kwaliteit van het onderzoek gedurende de looptijd, ook ondersteun je bij het includeren van pati&euml;nten, geef je voorlichting aan arts-assistenten en verpleegkundigen, begeleid je proefpersonen, onderhoudt contacten met externe partijen en verzorgt het data-management en de analyses.</p><p><strong>Het team en jouw rol in het team</strong><br> De RVE manager Brein en zintuigen is samen met de Medisch manager verantwoordelijk voor diverse afdelingen en poliklinieken, onder andere Bijzondere tandheelkunde, Dermatologie, Kaakchirurgie, KNO, Neurologie, Neurochirurgie en Oogheelkunde. In de RVE werken ongeveer 300 medewerkers onder zeven unithoofden en daarnaast werken er medisch specialisten en arts-assistenten. De verschillende afdelingen en poliklinieken hebben allemaal hun eigen sfeer en dynamiek en zijn gesitueerd op verschillende plekken in het ziekenhuis.<br> Als datamanager en researchco&ouml;rdinator kom je te werken in de RVE Brein en zintuigen. Je werkt nauw samen met de medisch specialisten, arts assistenten, leidinggevenden en verpleegkundigen op verpleegafdelingen. Je zoekt tevens buiten de RVE Brein en zintuigen de samenwerking op, waaronder met de stafafdelingen</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "https://www.werkenbijhaga.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/hagaziekenhuis-en-wide/6e79d4c53bd4e7bb151ebeeb1404939b.jpg"}