{"url": "http://www.academictransfer.com/en/309342/software-developer/", "title": "Software developer", "publish_date": "2022-02-10", "deadline": "2022-03-14", "location": "Houtlaan 4, 6525 XZ, Nijmegen", "city": "Nijmegen", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Radboud University", "job_description": "<p><em>Door experimenten en prototypes te maken verzorgt het lab van iHub de technische basis van het onderzoek naar de invloed van digitalisering op de maatschappij. We verankeren daarbij publieke waarden zoals privacy, inclusie en duurzaamheid. Wil jij hieraan bijdragen en daarbij werken met open source technieken? Dan ben jij nodig als software developer. </em></p> <p>iHub zoekt twee software developers die graag aan interdisciplinaire wetenschappelijke projecten werken. Het team heeft een brede blik op de invloed van digitalisering op de maatschappij. Als software developer bij iHub ontwerp en ontwikkel jij, samen met onderzoekers van meerdere faculteiten, prototypes. Je maakt hierbij gebruik van een interactieve aanpak samen met de interaction designer van iHub. <br><br>Als een van de twee software developers werk je voornamelijk aan PubHubs, een sociaal netwerk gebaseerd op waardes. PubHubs vloeit voort uit de Stevinspremie toegekend door NWO aan professor Bart Jacobs. PubHubs combineert pseudonimisatie voor deelnemers met gedragscodes in communities (hubs). Door gebruik te maken van IRMA kan fraude met accounts tegengaan worden en kunnen er extra eisen aan deelname worden gesteld (bijvoorbeeld onderdeel van een school, lid van een omroep, etc). <br><br>Als developer in de andere positie werk je mee aan verschillende wisselende projecten zoals stemmen met IRMA, een proof-of-concept voor pseudonimisatie in de zorg, een inventarisatie van de privacy impact van mental health apps (onderdeel van een ERC project), of prototypes voor onderzoekers.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.ru.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/run-en-wide/13abf0bc0a611f32246d62b46488f997.jpg"}