{"url": "https://academicpositions.com/ad/imec/2022/postdoc-pathfinding-new-transistors-for-future-energy-efficient-wireless-applications/175169", "title": "Postdoc: Pathfinding new transistors for future energy efficient wireless applications", "publish_date": "2022-02-11", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Postdoc", "field": "Communication Engineering, Electrical Engineering, Electronics, Engineering Physics, Instrumentation Engineering, and 1 moreSystems Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Explore how technology innovation impacts wireless circuit designWhat you will doThe deployment of millimeter-wave 5G and 6G radio systems pushes the requirements on device performance further than ever. Indeed, achieving very high-power efficiency at mmWave frequencies is critical for such application. While compound semiconductors technologies promise to meet these goals, their low-cost fabrication on a CMOS compatible platform remains challenging. Innovation is needed to design high-performant III-V/N transistors compatible with Si fabrication line. Furthermore, it is important to study the impact of new device elements at circuit level in order to optimize the technology platform.In this postdoc, you will design new III-V/N transistors and carefully model them to operate at mmWaves in large-signal. You will perform advanced nonlinear RF characterization to feed the models and to validate them experimentally. You will use the models to simulate mmWave circuits (eg power amplifiers) and co-optimize the technology and circuit.Type of work: 50% device characterization and modelling, 25% circuit design, 25% device designWhat we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will determine the society of tomorrow.We are committed to being an inclusive employer and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of an excellent 2-year scholarship.Who you areYou have a PhD in electrical engineering or equivalentYou have a strong expertise and interest in the field of microwave engineering, advanced RF characterization, semiconductor device physics, analog circuit designYou speak and write English fluentlyYou have good communication skillsThis postdoctoral position is funded by imec through KU Leuven. Because of the specific financing statute which targets international mobility for postdocs, only candidates who did not stay or work/study in Belgium for more than 24 months in the past 3 years can be considered for the position (short stays such as holiday, participation in conferences, etc. are not taken into account).", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}