{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/qa-qc-coordinator/175076", "title": "QA/QC Coordinator", "publish_date": "2022-02-09", "deadline": "N/A", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Other Category", "field": "Analytical Chemistry, Medical Technology, Microbiology, Molecular Chemistry, Toxicology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>College of Healthcare Technology</strong></p><p><strong>Why the American University of Iraq â\u0080\u0093 Baghdad?</strong></p><p>Opening its doors in January of 2021, the new American University of Iraq â\u0080\u0093 Baghdad (AUIB) began as a dream of influential individuals in Iraqi and the United States business, industry and government who want to see a world-class institution of higher learning established in the city, reminiscent of the days when Baghdad was an educational mecca and flourishing capital of the Muslim world.  With a great library, palatial college buildings and student centers, state-of-the-art classrooms, laboratories, and athletic facilities, AUIB will be a beautiful campus attracting students, faculty, and staff from throughout the world.  We invite you to join us in this exciting new venture.</p><p>This position will report directly to the <strong>Associate Vice President for Academic Affairs</strong></p><p><strong>Job Description, Duties, And Responsibilities:</strong></p><p>The College of Healthcare Technologies CORE QA/QC Coordinator will be a Proficient medical technologist or equivalent with track expertise in laboratory procedures with an understanding of laboratory information systems. This individual will coordinate all reference testing and investigation activities in the CORE facilities. This role works independently and manages complex projects including obtaining and maintaining accreditation, licensing, certification, and other quality assurances. The ideal candidates will:</p><ul><li>Use experience of current accrediting and regulatory requirements to make sure CORE testing methods are accredited by ISO 17025 and ISO 15189 standards and GLP certification in addition to other accreditation standards such as CAP for clinical diagnosis.</li><li>Review and monitor the technical quality of all CORE-related test results. </li><li>Monitor proficiency test results and help maintain the proficiency testing database.</li><li>Implement and monitor appropriate QA/QC pre-analytical functions (e.g., specimen labeling, processing) analytical functions (testing), and post analytical functions (test reporting, specimen storage/shipping) to assure validity of results and appropriate protocol related to chain of custody of specimens.</li><li>Review site inventory periodically.</li><li>Assist with laboratory data management.</li><li>Assist with training of technologists in QA/QC procedures.</li><li>Compile data into statistical summary reports and provide status reports to the CORE and relevant government bodies.</li><li>Develop and review SOPs, reports, quality manuals, scientific protocols, and other papers; and provide status updates and/or recommendations and update laboratory SOPs as appropriate.</li><li>Be involved in preparation of abstracts, meeting presentations and manuscripts. </li></ul><p><strong>Requirements</strong></p><ul><li>Bachelorâ\u0080\u0099s Degree in Medical Technology or related field and a minimum of 4 years of related laboratory experience. A Masterâ\u0080\u0099s degree in Quality Assurance is required.</li><li>Must have proven expertise with ISO 17025 and ISO 15189 accreditation standards. Professional knowledge of CAP and other regulations and procedures in a reference laboratory is preferred.</li><li>Advanced knowledge of good laboratory practices required.</li><li>Experience in molecular diagnosis, analytical chemistry and toxicology and microbiology is preferred.</li><li>Strong working knowledge of computers, skilled in Microsoft Office including Word and Excel, file organization, and internet research.</li><li>Strong background in statistics including measurement uncertainty and use of relevant software such as SPSS or others.</li><li>Individual must work independently, under minimal supervision with strong decision-making skills and good judgment.</li><li>Strong written and verbal communication in English and Arabic, interpersonal, and training skills.</li></ul><p><strong>Application Procedure: </strong></p><p>Applications should include:</p><ul><li><strong>Cover Letter</strong> </li><li><strong>Curriculum Vita</strong></li><li><strong>Passport First Data Page</strong></li><li><strong>Contact Information For Three (3) Professional References</strong></li><li><strong>Copies Of Degrees Or Certification</strong></li></ul><p>Applications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately. </p><p>Please apply through AUIB website OR send your application and supporting documents to the following email address:</p><p><a href=\"mailto:jobs@auib.edu.iq\">jobs@auib.edu.iq</a> with <a href=\"mailto:Karin.Jesuis@auib.edu.iq\">Karin.Jesuis@auib.edu.iq</a> in copy.<strong> </strong></p><p><strong>A declaration of a relation at AUIB is obligatory</strong></p><p><strong>We will contact you if you are selected for interview.</strong></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}