{"url": "http://www.academictransfer.com/en/309340/research-cloud-engineer/", "title": "Research Cloud Engineer", "publish_date": "2022-02-10", "deadline": "2022-03-27", "location": "Mekelweg 2, 2628 CD, Delft", "city": "Delft", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "â\u0082¬3821â\u0080\u0094â\u0082¬5230 per month", "max_working_hours": "N/A", "employer": "Delft University of Technology (TU Delft)", "job_description": "<p>Within the IT Innovation department, we support researchers, teachers and students in understanding and applying IT in the best possible way.</p> <p>We work closely with partners inside and outside of TU Delft to convert promising technologies into campus-wide services. Inside TU Delft, we mainly work closely with the Data Stewards, the Digital Competence Center (DCC) support team, TU Delft Library and the Faculty IT Managers to identify new opportunities for supporting our researchers through IT.</p> <p>As a member of the Cloud Centre of Expertise, you will work in the Cloud team to deliver and develop Cloud services for researchers within TU Delft. For this, you will participate in day-to-day activities running and administering TU Delft’s cloud environments and engage with research groups and individual researchers gathering requirements and implementing these. You have a good overview of the field of scientific and academic (open source) software and are able to apply this knowledge and cloud-native techniques and technologies in supporting our researchers.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>PhD degree or Masterâ\u0080\u0099s degree preferably in an academic discipline relevant to those studied at TU Delft</li>\n<li>Demonstrable knowledge of, and experience in applying cloud provisioning technology</li>\n<li>A good understanding of the role of software, data and computing in contemporary research</li>\n</ul>\n<p>Competences</p>\n<ul>\n<li>You have excellent collaboration skills in an academic setting</li>\n<li>You are able to develop modular, flexible and robust software/Infrastructure as Code (IaC) solutions</li>\n<li>You have a structured, curious and innovative attitude</li>\n<li>You enjoy working in groups as well as individually</li>\n<li>You are able to define your own work tasks taking into account the balance between quality and efficiency (understand what is â\u0080\u0098good enoughâ\u0080\u0099)</li>\n<li>You have a proactive disposition and are willing to challenge our current working methods</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>\nDuration of contract is 1 years with prospect of permanent.\n</li>\n<li>A job of 38-40 hours per week.</li>\n<li>\nA salary based on scale 11 of the CAO for Dutch Universities with a minimum of â\u0082¬ 3.821,- and a maximum of â\u0082¬ 5.230,- gross per month, plus 8% holiday allowance and an end-of-year bonus of 8.3%.\n</li>\n<li>An excellent pension scheme via the ABP.</li>\n<li>The possibility to compile an individual employment package every year.</li>\n<li>Discount with health insurers.</li>\n<li>Flexible working week.</li>\n<li>Every year, 232 leave hours (at 38 hours). You can also sell or buy additional leave hours via the individual choice budget.</li>\n<li>Plenty of opportunities for education, training and courses.</li>\n<li>Partially paid parental leave</li>\n<li>Attention for working healthy and energetically with the vitality program.</li>\n</ul>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Delft University of Technology</h4>\n<p>Delft University of Technology is built on strong foundations. As creators of the world-famous Dutch waterworks and pioneers in biotech, TU Delft is a top international university combining science, engineering and design. It delivers world class results in education, research and innovation to address challenges in the areas of energy, climate, mobility, health and digital society. For generations, our engineers have proven to be entrepreneurial problem-solvers, both in business and in a social context. At TU Delft we embrace diversity and aim to be as inclusive as possible (see our <a href=\"https://www.tudelft.nl/en/about-tu-delft/strategy/integrity-policy/tu-delft-code-of-conduct/\">Code of Conduct</a>). Together, we imagine, invent and create solutions using technology to have a positive impact on a global scale.</p>\n<p>Challenge. Change. Impact!Â </p>\n<p>Culture<br/>Youâ\u0080\u0099ll join an enthusiastic, inspiring, independent but also fun team who value diversity and want to change the world for the better. TU Delft is an academic community of world class researchers. Working at TU Delft will provide you with many opportunities to contribute to the small and large challenges that we face in achieving our goals.</p>\n<p>Career development<br/>TU Delft invests in your professional development through trainings, in-house knowledge sharing and career advancement.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For information about this vacancy and the procedure, you can contact Mark Schenk, manager IT Innovation, by email: <a href=\"mailto:M.M.A.Schenk@tudelft.nl\">M.M.A.Schenk@tudelft.nl</a>.</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tudelft.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tud-en-wide/4f5fb7eb63ad62ee5a7d5dfdc5376f8f.gif"}