{"url": "https://academicpositions.com/ad/politecnico-di-milano/2021/research-assistant-postdoc-for-fem-simulation-of-thermal-therapy-and-diagnostic-image-segmentation-for-patient-specific-models/173352", "title": "Research assistant/Postdoc for FEM simulation of thermal therapy and diagnostic image segmentation for patient specific models", "publish_date": "2021-12-21", "deadline": "2022-02-15", "location": "Piazza Leonardo da Vinci Milan, Italy", "city": "N/A", "country": "Italy", "position": "Research Assistant", "field": "Biomedical Engineering, Chemical Engineering, Computational Engineering, Image Processing, Laser Physics, and 2 moreMechanical Engineering,Mechanics", "salary": "N/A", "max_working_hours": "N/A", "employer": "Politecnico di Milano", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><img class=\"image_resized\" src=\"https://ap-production-media-archive.s3.eu-north-1.amazonaws.com/uploads/95HUyyWm8i2txyO0sGQ4k3fm6nMtLV0XOFxSyZ8P.jpg\" style=\"width:31%;\"/></p><p><strong>ORGANISATION/COMPANY</strong></p><p>Politecnico di Milano</p><p><strong>RESEARCH FIELD</strong></p><p>Engineering â\u0080\u0093 Biomedical Engineering </p><p>Engineering â\u0080\u0093 Mechanical Engineering </p><p>Engineering â\u0080\u0093 Computer science</p><p>Engineering â\u0080\u0093 Chemical Engineering </p><p><strong>RESEARCHER PROFILE</strong></p><p><span style=\"color:black;\">Postdoctoral Researcher or Research Assistant</span></p><p><strong>APPLICATION DEADLINE</strong></p><p>15 February 2022 - Europe/Milano </p><p><strong>LOCATION</strong></p><p>Italy â\u0080º Milano</p><p><strong>TYPE OF CONTRACT</strong></p><p>Temporary </p><p><strong>JOB STATUS</strong></p><p>Full-time</p><p><strong>OFFER STARTING DATE</strong></p><p>16/03/2022<br/><strong>EU RESEARCH FRAMEWORK PROGRAMME</strong></p><p>H2020 / European Research Council </p><p><strong>ERC GRANT AGREEMENT NUMBER</strong></p><p>759159</p><p><strong>Information about the position</strong></p><p>Politecnico di Milano is seeking candidates with strong research potential, interested in developing new tools for minimally invasive cancer treatment with laser. The research project focuses on the development of a FEM-based simulation for the optimization of minimally invasive laser procedures for cancer treatment. The model will drive the planning of the clinical procedure, based on the simulation of the temporal evolution of the temperature distribution within the target tissue. Segmentation of the 3D geometry of the patientâ\u0080\u0099s anatomy will be obtained from MR medical images.</p><p>It is required experience in FEM for biomechanical applications, and knowledge of Comsol Multiphysics and, preferably, Materialise Mimics.</p><p>The successful candidate will have the opportunity to work on a unique interdisciplinary project, in cooperation with medical partners and an active and international research team.</p><p>The project will be carried out in the Department of Mechanical Engineering (DMEC) of Politecnico di Milano.</p><p>The position is funded by the ERC Starting Grant â\u0080\u009cLaser Ablation: SElectivity and monitoRing for OPTImal tuMor removalâ\u0080\u009d.</p><p><strong>Information about the LASER OPTIMAL project - Laser ablation selectivity and monitoring for optimal tumor removal</strong></p><p>Further information on the project is available at the link: http://www.laseroptimal.polimi.it/ </p><h3><span style=\"color:windowtext;\"><strong>Skills/Qualifications</strong></span></h3><p>The successful candidate is required to have:</p><ul><li>PhD in at least one of the following subjects: Biomedical Engineering, Mechanical Engineering, Computer Science, Chemical Engineering.</li><li>Master of Science in at least one of the following subjects: Biomedical Engineering, Mechanical Engineering, Computer Science, Chemical Engineering.</li><li>Knowledge: Finite Element Methods in Biomechanics, Hyperthermia</li><li>Software: Comsol Multiphysics, Materialise Mimics</li><li>demonstrated record of relevant experience as evidenced by the track-record and publications</li><li>fluency in English, both spoken and written</li><li>The candidate should be able to work both independently and interactively in a team setting and possess a noticeable enthusiasm for research.</li></ul><p><strong>Starting Date:</strong> 16th March 2021</p><p><strong>Duration: </strong>12 months. </p><p><strong>Application</strong></p><p>The call for applicants will be published the 24th January, and the activities will start in March. The link to the official call is under preparation and will be posted on this website in the coming days.</p><p>Meanwhile, potential candidates can express interest and request further information on the position.</p><p>Applications shall be written in English and be compiled into a single PDF-file containing:</p><p>â\u0080¢ CV, including a list of publications if any</p><p>â\u0080¢ general description of future research interests (1 page)</p><p>â\u0080¢ contact information of at least two references</p><p>Important: the PDF-file should be sent via email to: paola.saccomandi@polimi.it</p><p>All interested candidates irrespective of age, gender, disability, religion or ethnic background are encouraged to apply.</p><p><strong>Contract duration</strong></p><p>The contract duration is 1 year.</p><p><strong>Benefits</strong></p><p>The candidate will also benefit from the collaborations with national and international partners already established by the supervisor, who holds prestigious European and national grants.</p><p>The researcher will be part of the research unit â\u0080\u009cMechanical and Thermal Measurementsâ\u0080\u009d at the Department of Mechanical Engineering of Politecnico di Milano (PoliMi). PoliMi provides excellent research conditions, in a quiet environment inside the active Milan region: in the QS ranking by subject PoliMi is the first Italian University in several research areas (Including Mechanical Engineering), among the first 6 European Universities in Europe and among the first 20 all over the world. The postdoctoral researcher will have access to funding for travels, conferences and visitors. Memberships to scientific societies are also fully funded by the Institution.</p><p><strong>Further information</strong></p><p>Politecnico di Milano https://www.polimi.it/ Politecnico di Milano is a scientific-technological university which trains engineers, architects and industrial designers. Our University has always focused on the quality and innovation of its teaching and research, developing a fruitful relationship with business and productive world by means of experimental research and technological transfer.</p><p>Research has always been linked to didactics and it is a priority commitment which has allowed Politecnico Milano to achieve high quality results at an international level as to join the university to the business world. Research constitutes a parallel path to that formed by cooperation and alliances with the industrial system.</p><p>The Department of Mechanical Engineering is currently ranked 7th in the world according to QS World University Rankings: Mechanical, Aeronautical and Manufacturing Engineering 2019.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJlY2JcL2RhYVwvZWNiZGFhMGQ2NjIwOWVhNGE1MWI3ZTkxNDRlNjRjYzkucG5nIiwiZWRpdHMiOltdfQ=="}