{"url": "http://www.academictransfer.com/en/309372/medewerker-studentenzaken-team-toetsing-05-fte-onderwijsintituut-faculty-of-health-medicine-and-life-sciences/", "title": "Medewerker Studentenzaken - team Toetsing (0.5 fte), Onderwijsintituut Faculty of Health, Medicine and Life Sciences", "publish_date": "2022-02-11", "deadline": "2022-02-20", "location": "Universiteitssingel 60, 6229 ER, Maastricht", "city": "Maastricht", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "19—20", "employer": "Maastricht University (UM)", "job_description": "<p><strong>Wat ga je doen</strong><br> Binnen FHML werken we met een toetsbureau waarbij alle logistieke processen rondom kennis toetsing zijn ondergebracht. Een groot deel van de schriftelijke toetsen wordt digitaal afgenomen met TestVision, de overige op papier. Binnen team Toetsing werk je samen met vier collega&rsquo;s. Je ondersteunt de toetsco&ouml;rdinatoren met het administratieve proces, waarbij je voor een groot deel belast bent met het proces rondom digitaal toetsen en toetsinzages, zoals communicatie met (blok)co&ouml;rdinatoren, invoeren van de toetsvragen, samenstellen van de toetsen en controleren van instellingen. Voor het overige deel verzorg je samen met je collega&rsquo;s alle voorkomende logistieke/administratieve werkzaamheden, zoals onder andere het behandelen van e-mail, afhandelen van vragen van studenten met behulp van de applicatie AskFHML (Verint), opstellen van toetsoverzichten in Excel, indelen van studenten, maken van presentielijsten en aanvragen en begeleiden van surveillanten, indien nodig ben je op de toetslocatie aanwezig. Verder woon je interne en in voorkomende gevallen ook centrale overleggen bij. Ter ondersteuning van deze taken heb je contact met stafleden, zowel in persoon als schriftelijk. Verder ben je achterwacht voor je teamgenoten.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.maastrichtuniversity.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/um-en-wide/0c1dd83b22059d7ee90c38e0f0c254be.jpg"}