{"url": "https://academicpositions.com/ad/university-of-luxembourg/2021/postdoctoral-researcher-in-european-integration-studies-political-science/172749", "title": "Postdoctoral researcher in European Integration Studies / Political Science", "publish_date": "2021-12-14", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "Postdoc", "field": "Comparative Democratization, Comparative Politics, Conflict Processes, Federalism and Intergovernmental Relations, Foreign Policy, and 28 moreFoundations of Political Theory,Health Politics and Policy,Human rights,Information Technology and Politics,International History and Politics,International Relations,International Security and Arms Control,Legislative Studies,National Politics,Political Communication,Political Economy,Political Methodology,Political Networks,Political Organizations and Parties,Political Psychology,Political Science Education,Political Theory,Politics,Politics and History,Politics, Literature and Film,Public Administration,Public Policy,Race, Ethnicity and Politics,Representation and Electoral Systems,Science, Technology and Environmental Politics,State Politics and Policy,Urban Politics,Women and Politics Research", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>University of Luxembourg</strong> is an <strong>international research</strong> university with a distinctly <strong>multilingual</strong> and <strong>interdisciplinary</strong> character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide. </p><p>The <strong>Faculty of Humanities, Education and Social Sciences</strong> (FHSE) brings together expertise from the humanities, linguistics, cognitive sciences, social and educational sciences. People from across 20 disciplines are working within the Faculty. Along with the <strong>disciplinary</strong> approach a very ambitious interdisciplinary research culture has been developed.</p><p>The facultyâ\u0080\u0099s research and teaching focuses on <strong>social, economic, political </strong>and<strong> educational</strong> issues with the common goal of contributing to an inclusive, open and resourceful society. The FHSE offers four Bachelor and 15 Master degrees and a doctoral school providing students with the necessary knowledge and high-qualified skills to succeed in their future career.</p><p>The University of Luxembourg, in the Institute of Political Science in the Department of Social Sciences of the Faculty of Humanities and Social Sciences is looking to hire a Postdoc.</p><p><strong>Your Role...</strong></p><p>Research assistance work within the â\u0080\u0098Banking on Europeâ\u0080\u0099 research project led by Professors Dermot Hodson (Birkbeck College, University of London) and David Howarth (University of Luxembourg)   </p><p><a href=\"https://wwwen.uni.lu/research/fhse/dsoc/people/david_howarth\" target=\"_blank\">https://wwwen.uni.lu/research/fhse/dsoc/people/david_howarth</a></p><p><strong>Project summary</strong></p><p>The aim of the project is to generate new knowledge among academics and policymakers about the evolution and accountability of pan-European public financial institutions. Institutions with the authority to raise funds on financial markets to provide grants, loans or guarantees were present at the outset of the European Communities and part of European responses to the economic crises of the 1970s, the reuniting of Europe in the 1990s and the euro crisis in the 2010s. They are now pivotal to the EUâ\u0080\u0099s COVID-19 response, including the Commissionâ\u0080\u0099s plan to borrow â\u0082¬750 billion to help with the costs of the pandemic. This project will generate new evidence on: (1) the evolution and accountability of pan-European public financial institutions since 1950; (2) who drives these developments and what this means for accountability; and (3) how accountable these bodies are in practice and how to strengthen their accountability. Our findings will encourage governments, parliaments, NGOs and pan-European public financial institutions to explore new and stronger accountability practices.</p><p><strong>What we expect from youâ\u0080¦</strong></p><ul><li>PhD in political science (political economy), history or a cognate discipline: defence completed successfully by the time of application.</li><li>Fluency in English; a good ability to read in two of following four languages: German, French, Italian and Dutch.</li><li>Experience with archive research preferred.</li><li>Experience interviewing policy-makers on technical issues preferred.</li><li>Background in social science research methods (qualitative and quantitative methods).</li><li>Research background in European Union / European integration studies.</li><li>Proven track record of publications preferred: at least one peer-reviewed journal article accepted for publication.</li><li>Experience working on a short-term (1-3 year) research project with tight deadlines preferred.</li></ul><p><strong>We Offer...</strong></p><p>Excellent salary and work conditions in a global top 300 university.</p><p>Research work on one of the main topics of European economic governance today.</p><p><strong>In Short...</strong></p><ul><li>Contract Type: Fixed Term Contract 24 Month</li><li>Work Hours: Full Time 40.0 Hours per Week</li><li>Foreseen starting date: June 2022</li><li>Location: Belval</li><li>Job Reference: UOL04594 - INTER/UKRI/21/15560511; Acronym: BANK-EU</li></ul><p><strong>How to apply...</strong></p><p>Applications should be submitted online and include:</p><ul><li>Curriculum Vitae</li><li>Cover letter</li><li>Copies of diplomas</li></ul><p>We ensure a full consideration for applications received by 15 January 2022. Please apply formally through the HR system. Applications by email will not be considered.</p><p>The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.</p><p><strong>Hereâ\u0080\u0099s what awaits you at the University</strong></p><ul><li><strong>Multilingual and international character</strong>. Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d (UniGR). </li><li><strong>A modern and dynamic university. </strong>High-quality equipment. Close ties to the business world and to the Luxembourg labour market. A unique urban site with excellent infrastructure.</li><li><strong>A partner for society and industry</strong>. Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic partners such as ministries, local governments, associations, NGOs â\u0080¦</li><li><a href=\"https://wwwen.uni.lu/university/about_the_university\" target=\"_blank\">Find out more about the University</a></li><li><a href=\"https://wwwen.uni.lu/contact\" target=\"_blank\">Addresses, maps &amp; routes to the various sites of the University</a></li></ul><p><strong>Further information...</strong></p><p><strong>For further information please contact:</strong></p><p>Prof. Dr. David Howarth</p><p>Email:  <a href=\"mailto:david.howarth@uni.lu\">david.howarth@uni.lu</a></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}