{"url": "https://www.academictransfer.com/en/309374/project-manager-research-projects/apply/", "title": "Project Manager Research Projects", "publish_date": "2022-02-11", "deadline": "2022-02-27", "location": "Burgemeester Oudlaan 50, 3062PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Researcher", "field": "Economics; Behaviour and society", "salary": "â\u0082¬3821â\u0080\u0094â\u0082¬5230 per month", "max_working_hours": "16—24", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "You will be responsible for implementing the formal procedures of projects (including organising meetings for projects involving researchers and project partners from RSM and the other project organisations and institutions, and includes project administration, and reporting. The majority of tasks involve monitoring project processes.<br><br>You will act as the contact point for funding institutions, partner organisations and stakeholders in project implementation. You monitor the implementation process, prepare and submit reports on the scientific and administrative milestones and deliverables of the project.<br><br>The project manager coordinates, monitors, and improves the reporting processes and ensures timely and up-to-date project reporting. In cooperation with the project controller, you will also monitor project budgets.<br><br>You will be expected to represent the RSM Project Desk in relevant discussions, such as funding team meetings and knowledge-sharing activities internally and externally.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>An academic background (preferably MSc level).</li>\n<li>Preferably several years' experience in research project management in the European Framework (FP7, H2020) and Dutch national funding programmes such as NWO schemes.</li>\n<li>Preferably an excellent knowledge of rules and procedures for national and European funding programmes, or the experience which will enable you to quickly master these rules and procedures.</li>\n<li>Excellent written and verbal communication skills, both in Dutch and English (CEFR C1).</li>\n<li>Ability to work flexibly.</li>\n<li>Excellent planning skills and ability and willingness to meet tight deadlines, with experience in applying these in a complex and dynamic international context.</li>\n</ul>\n<br/><strong>Your required competencies</strong><br/><ul>\n<li>Strong interpersonal and intercultural skills.</li>\n<li>Organisational and communication skills.</li>\n<li>Ability to work independently as well as in a team.</li>\n<li>Ability to interact constructively with a variety of stakeholders.</li>\n<li>Strong service orientation with a hands-on and proactive attitude.</li>\n<li>Professional and reliable.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><strong>Fixed-term</strong> contract: 12 months.</p>\n            \n            The conditions of employment correspond with the collective labour agreement for Dutch Universities (CAO NU). <a href=\"https://www.universiteitenvannederland.nl/files/documenten/CAO/2021/CLA_Universities_Netherlands_2021_2022.pdf\">https://www.universiteitenvannederland.nl/files/documenten/CAO/2021/CLA_Universities_Netherlands_2021_2022.pdf</a><br/><br/>Salary is subject to training and experience and may vary from a minimum of â\u0082¬ 2,846 (scale 10 CAO NU) gross per month and up to a maximum of â\u0082¬ 5,230 gross per month (scale 11 CAO NU), based on a full-time contract of 38 hours.<br/><br/>Erasmus University has attractive employment conditions, which include a holiday allowance of 8 per cent, an end-of-year bonus of 8.3 per cent, and a considerate amount of vacation days. More information is available at <a href=\"https://www.eur.nl/en/working/our-employer-vision/employment-conditions\">https://www.eur.nl/en/working/our-employer-vision/employment-conditions</a><br/><br/>Example training and career development opportunities:<br/><br/>EUR offers all employees an annual personal career budget which can be used to advance your skills and competences. There are lots of <a href=\"https://www.eur.nl/en/working/training-eur/development-opportunities-eur\">training, development, and coaching opportunities</a> at EUR too.\n          \n  </div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Rotterdam School of Management, Erasmus University</h4>\n              \n              Rotterdam School of Management, Erasmus University (RSM) is one of Europe's top-ranked business schools. RSM provides ground-breaking research and education furthering excellence in all aspects of management and is based in the international port city of Rotterdam - a vital nexus of business, logistics and trade. RSM's primary focus is on developing business leaders with international careers who can become a force for positive change by carrying their innovative mindset into a sustainable future. Our first-class range of bachelor, master, MBA, PhD and executive programmes encourage them to become critical, creative, caring and collaborative thinkers and doers. Study information and activities for future students, executives and alumni are also organised from the RSM office in Chengdu, China. <a href=\"http://www.rsm.nl/\">www.rsm.nl</a><br/><br/>RSM is an equal opportunity employer and explicitly encourages applications from candidates of all genders, ethnicities, and nationalities.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    The closing date is Sunday 27 February 2022.<br/><br/>Please provide the following documents for your application:<ul>\n<li>a motivation letter</li>\n<li>CV</li>\n</ul> Further information can be obtained from the Head of the Project Desk Marlies Vreeswijk at <a href=\"mailto:vreeswijk@rsm.nl\">vreeswijk@rsm.nl</a> or call 010-4082633.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}