{"url": "https://academicpositions.com/ad/american-university-of-iraq-baghdad/2022/rad-sciences-lab-instructor/175078", "title": "Rad Sciences Lab Instructor", "publish_date": "2022-02-09", "deadline": "N/A", "location": "Airport Road Baghdad, Iraq", "city": "N/A", "country": "Iraq", "position": "Lecturer", "field": "Medical Imaging, Medical Physics, Radiology,", "salary": "N/A", "max_working_hours": "N/A", "employer": "American University of Iraq - Baghdad", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>College of Healthcare Technology</strong></p><p><strong>Why the American University of Iraq â\u0080\u0093 Baghdad?</strong></p><p>Opening its doors in January of 2021, the new American University of Iraq â\u0080\u0093 Baghdad (AUIB) began as a dream of influential individuals in Iraqi and the United States business, industry and government who want to see a world-class institution of higher learning established in the city, reminiscent of the days when Baghdad was an educational mecca and flourishing capital of the Muslim world.  With a great library, palatial college buildings and student centers, state-of-the-art classrooms, laboratories, and athletic facilities, AUIB will be a beautiful campus attracting students, faculty, and staff from throughout the world.  We invite you to join us in this exciting new venture.</p><p>This position will report directly to <strong>Associate Vice President for Academic Affairs</strong></p><p><strong>Job Description, Duties, And Responsibilities</strong></p><ul><li>Teach basic and advanced laboratory courses for undergraduate Radiologic Sciences students.</li><li>Participate in designing lab trainings in novel radiologic sciences and medical imaging domains to reflect the latest developments in the field.</li><li>Assist in multidisciplinary research in medical imaging leading to publications in reputed journals and establish an extramurally funded research programs that augment the research directions of the college.</li><li>Assist in development of pioneer testing and research facilities and laboratories in the College of Healthcare Technologies.</li><li>Asist in advancing radiologic sciences and medical imaging laboratory practices in the region through assisting in designing and delivering various continuous education (CE) programs.</li><li>Be involved in assessment and committee work at the College and the University</li><li>Have strong commitment to continuous professional development</li></ul><p><strong>Qualifications</strong></p><ul><li>MS degree from a reputed university with work/training experience in a medical imaging domain (i.e., radiologic sciences, medical imaging, medical physics, or related field). Candidates with education and experience in US and US-styled educational institutions will be highly considered.</li><li>Preference will be also given to candidates with research credentials and interests in any of the areas of medical imaging and related fields.</li><li>Minimum of 2 years of laboratory teaching experience in a reputed university.</li><li>Excellent communication skills in English and familiarity with the American system of higher education.</li><li>Interpersonal, planning, and organizational skills with ability to effectively manage multiple projects and competing priorities.</li><li>A good team player with strong ability to work harmoniously with colleagues and students of all cultures and to build positive spirit and always look for a better way.</li><li>High standard and significant record of institutional, professional, and community service leadership in research, along with successful receipt and management of funded research projects, including the supervision of research staff and students and publications of high impact outputs.</li></ul><p><strong>Application Procedure: </strong></p><p>Applications should include:</p><ul><li><strong>Cover Letter</strong> </li><li><strong>Curriculum Vita</strong></li><li><strong>Passport First Data Page</strong></li><li><strong>Contact Information For Three (3) Professional References</strong></li><li><strong>Copies Of Degrees Or Certification</strong></li></ul><p>Applications will be accepted until the position is filled. Confidential review of materials and screening of candidates will begin immediately. </p><p>Please apply through AUIB website OR send your application and supporting documents to the following email address:</p><p><a href=\"mailto:jobs@auib.edu.iq\">jobs@auib.edu.iq</a> with <a href=\"mailto:Karin.Jesuis@auib.edu.iq\">Karin.Jesuis@auib.edu.iq</a> in copy.<strong> </strong></p><p><strong>A declaration of a relation at AUIB is obligatory</strong></p><p><strong>We will contact you if you are selected for interview.</strong></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pNGszZzI0c3NUb0VuOFpCbG8zVDI3Wm5TRU1RdXppU2hLRFdTdGVkLmpwZyIsImVkaXRzIjpbXX0="}