{"url": "https://academicpositions.com/ad/ku-leuven/2022/phd-structural-health-monitoring-and-predictive-maintenance-of-complex-systems/174850", "title": "PhD - Structural Health Monitoring and Predictive Maintenance of Complex Systems", "publish_date": "2022-02-03", "deadline": "2022-05-31", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "PhD", "field": "Computing in Mathematics, Natural Science, Engineering and Medicine, Engineering Physics, Industrial Engineering, Machine Learning, Manufacturing Engineering, and 1 moreMechanical Engineering", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-83)Applications are invited for a fully funded, full-time Joint PhD post within the Department of Mechanical Engineering of KU Leuven and the University of Melbourne. The successful candidate will be affiliated and work within the renowned Noise and Vibration Research Group of KU Leuven. She/He will be based at the Ghent Technology Campus with regular visits and full access to equipment at the main campus in Leuven. She/he will also be affiliated and work within the Asset Protection &amp; Management research group in the Department of Infrastructure Engineering of the University of Melbourne.Website unitProjectProject description: Structural failure in the aerospace, civil and energy sectors can be life threatening for users/passengers and financially catastrophic for operators and the manufacturer. This is the main reason for which critical structures (i.e. aircrafts, wind turbines etc.) spend large part of their lifecycle under inspection with the accompanied costs being significant. Online detection and characterization of minor failures within complex systems can lead to a radical reduction of this cost and eventually cheaper and safer transport and energy production.ProfileThe successful candidate will be expected to make significant contributions to the development of robust damage identification tools for complex industrial structures. Applicants should be able to demonstrate consistent knowledge in the areas of engineering dynamics and/or numerical modelling and/or data post-processing.OfferThis funding call is open to all EU and International applicants.Keywords: Structural Health Monitoring, Ultrasound and Vibration, Composites, 3D Printed Structures, Damage, Identification, Structural Health Prognosis, Bayesian Statistics, Machine LearningThe contract is offered initially for 1 year with an extension up to 4 years after a positive evaluation. Applications should be submitted through KU Leuvenâ\u0080\u0099s online platform with detailed CV, short motivation letter and degree transcripts attached.Interested?For more information please contact Prof. dr. ir. Dimitrios Chronopoulos, tel.: +32 9 310 25 41, mail: dimitrios.chronopoulos@kuleuven.be.You can apply for this job no later than May 31, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}