{"url": "https://www.academictransfer.com/en/309289/online-marketingmedewerker-08-fte/", "title": "ONLINE MARKETINGMEDEWERKER (0,8 fte)", "publish_date": "2022-02-09", "deadline": "2022-02-26", "location": "Burgemeester Oudlaan 50, 3062 PA, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "32", "employer": "Erasmus University Rotterdam (EUR)", "job_description": "<p><strong>Als ONLINE MARKETINGMEDEWERKER houd je je vooral bezig met SEA, SEO, e-mailmarketing en -automation en met het opzetten en monitoren van de verschillende online campagnes. Bovendien werk je aan de creatie van diverse content voor de digitale kanalen waarvan Erasmus Academie gebruikmaakt in haar communicatie met doelgroepen en stakeholders, in het bijzonder alumni. Je werkt daarin steeds nauw samen met het team van cursusco&ouml;rdinatoren enerzijds, en met alumni, docenten, kennispartners anderzijds. Daarnaast ben je verantwoordelijk voor de redactie en productie van - met name digitaal - promotiemateriaal zoals brochures en factsheets van opleidingen.</strong></p><p><strong>Wie ben jij?&nbsp;</strong></p><p>Je&nbsp;bent op zoek naar een inhoudelijke baan met uitdagingen en hebt ervaring met online marketing. SEA, SEO, e-mailmarketing en -automation zijn bekende begrippen waarmee je ervaring hebt. Dat geldt ook voor het opzetten en monitoren van de verschillende online campagnes en content creatie. Je bent iemand die niet te&nbsp;beroerd is&nbsp;om&nbsp;de handen uit de mouwen te steken. Een betrouwbare teamspeler ook, die een goede&nbsp;samenwerking en communicatie nastreeft met collega&rsquo;s. Je werkt zorgvuldig en bent klant- en doelgroepgericht. Je bent&nbsp;niet bang initiatief te nemen, bent resultaatgericht en presteert goed onder stress.&nbsp;</p><p><strong>Wat is de functie?&nbsp;</strong></p><p>Je werkt samen met een ervaren team van cursusco&ouml;rdinatoren en portfoliomanagers aan het bedenken, opzetten en onderhouden van online. marketingcampagnes voor zowel open opleidingen als incompany trainingen.&nbsp;Je&nbsp;wordt&nbsp;daarin&nbsp;aangestuurd door de marketing adviseur. Je doel is het online bereik van Erasmus Academie verder te vergroten en de conversie van de campagnes naar daadwerkelijke inschrijvingen te optimaliseren.</p><p>&nbsp;</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.eur.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/eur-en-wide/ce33222703c7a0b148d3a935910a2f60.png"}