{"url": "https://academicpositions.com/ad/university-namur/2021/a-full-time-lectureship-w-m-at-the-department-of-physics-department-faculty-of-sciences/173135", "title": "A full-time lectureship (W/M) at the Department of Physics department â\u0080\u0093 Faculty of Sciences", "publish_date": "2021-12-17", "deadline": "2022-02-15", "location": "rue de Bruxelles 61 Namur, Belgium", "city": "N/A", "country": "Belgium", "position": "Researcher", "field": "Accelerator Physics, Acoustics, Applied Physics, Atomic, Molecular and Optical Physics, Biophysics, and 24 moreChemical Physics,Computational Physics,Condensed Matter Physics,Cryogenics,Electromagnetism,Experimental Physics,Fluid Dynamics,Fluid Mechanics,Geophysics,Laser Physics,Materials Physics,Mathematical Physics,Medical Physics,Molecular Physics,Nuclear Physics,Optics,Particle Physics,Photonics,Plasma Physics,Quantum Physics,Solid-state Physics,Theoretical Physics,Thermodynamics,Vehicle Dynamics", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Namur", "job_description": "University faculty : SciencesDepartment : PhysicsGrade : instructorsContract : three yearsâ\u0080\u0099 contract followed by a definitive nomination upon evaluation.Category : academic personnelAllocation : University staffReference : CA720/2021-24ResponsibilitiesWithin the University of Namur, the Faculty of Sciences has nearly 1,400 students and 500 staff members, including 60 academics and 300 scientists. It offers 1st, 2nd and 3rd cycle programs in biology, chemistry, geology, geography, mathematics, physics and veterinary medicine.The Department of Physics of UNamur is recruiting a full-time lecturer who will provide bachelor's and master's in Physics. Research activities will be developed in UR LARN (https://www.unamur.be/sciences/physique/ur/larn) in the field of ion-inert matter interaction, will be based on existing equipment, in particular those of technological platforms (http://platforms.unamur.be/) and will be practiced in particular within the framework of the NISM institute. For example, the fundamental study of irradiation damage is a promising field given its importance in accelerator technology, in space flights or in the dismantling of nuclear power plants. The production of new materials by ion implantation, the characterization of materials, e.g. in the field of heritage sciences, or astrophysics are other possible directions of research. These research activities will be carried out in priority on the current accelerator ALTAIS which produces low energy particles but also on medium energy accelerators within the framework of national and international collaborations.Your missionsWithin the Department of Physics, you will take on teaching, research and service missions, and more specifically:â\u0080¢ Carry out high-level original fundamental and / or applied research in the field of ion-inert matter interaction. This task includes leading a research team and seeking funding.â\u0080¢ Get involved in the educational projects of the Department of Physics. She / he will provide basic physics courses to large audiences. She / he will also provide courses close to his / her specialty in bachelor's and master's degree. The total teaching load will be at least 150 hours per year at the end of the probationary period.â\u0080¢ Participate in the organization of the department and the attractiveness of its curriculum.â\u0080¢ Ensure the development of the scientific equipment of the UR LARN, including the ALTAIS accelerator, and obtain the necessary funding for this purpose.ProfileDiploma and experienceâ\u0080¢ You hold a doctorate in physical or materials sciences or a doctoral degree in a field recognized as relevant for the position by the selection committee;â\u0080¢ You have completed at least twelve months of postdoctoral stay outside the University where the doctoral research was conducted and have demonstrated significant international mobility;â\u0080¢ You demonstrate recent high-level research experience in the field of ion-inert matter interaction, leading to publications in international journals (peer reviewed).SkillsYou have the following skills and knowledge:â\u0080¢ an aptitude and great motivation for university teaching;â\u0080¢ a solid research experience;â\u0080¢ an ability to integrate into existing structures within UNamur, particularly within the physics department and UNamur research institutes;â\u0080¢ an aptitude for the management and development of a research team;â\u0080¢ an ability to obtain funding to carry out research projects;â\u0080¢ a very good knowledge of English and commit to being able to participate in administrative meetings and teach in French before the end of the probationary period (3 years).Essential selection criteria:â\u0080¢ The profile, experience and skills listed above.â\u0080¢ The quality of the research project and educational design provided in the application file.Â·â\u0080¢ The quality of the lesson given during the interview.â\u0080¢ Significant publications in quality journals (peer reviewed).Additional informationProfessor Laurent HOUSSIAU, Director of the Physics Department.Tel: +32 (0) 81 724512 - E-mail: direction.physique@unamur.beFor any administrative question, you can contact the Human Resources Department, Tel.: 081 / 72.40.40 - E-mail: developpement.rh@unamur.beRemarksSelection criteriaâ\u0080¢ Examination of application files by a recruitment and selection committee.â\u0080¢ The candidates selected for an audition will be invited to present their projects (research and educational) and to give a lesson, on an imposed theme, in front of the selection committee.â\u0080¢ The candidates ranked by the selection committee will be invited to an interview with the human resources department before the decision by the board of directors.â\u0080¢ The start of work is scheduled for 01/09/2022.How to apply?The application file will include:â\u0080¢ a complete curriculum vitae;â\u0080¢ a cover letter;â\u0080¢ the application form to be downloaded at the following address (https://www.unamur.be/universite/jobs/formulaires/formulaire-de-candidature-pour-le-personnel-academique-francais-anglais/view);â\u0080¢ a complete list of publications;â\u0080¢ a list of 3 reference experts, who will be contacted in the event of selection for the interview;â\u0080¢ a research project (5 to 10 pages) specifying any equipment needs and potential interactions with UNamur research teams, particularly in the physics department and within the institutes (NISM). It should be based on existing equipment at UNamur; â\u0080¢ a description of your educational project (2 to 4 pages).The file must be sent to Mr. Philippe LIZIN, Director of the Human Resources Department, by email to candidature@unamur.be by 02/15/2022 at the latest.The French version exists on the website: https://jobs.unamur.be/emploi.2021-12-16.9314177971.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Situated in the Southern, French-speaking part of Belgium, at the heart of Europe, the University of Namur comprises six Faculties, offering some forty academic programmes.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDE1XC8wNFwvbmFtdXIuanBnIiwiZWRpdHMiOltdfQ=="}