{"url": "https://academicpositions.com/ad/aalborg-university/2022/one-or-more-postdocs-in-computer-science/174560", "title": "One or More Postdocs in Computer Science", "publish_date": "2022-01-28", "deadline": "2022-02-18", "location": "Fredrik Bajers Vej 5 Aalborg, Denmark", "city": "N/A", "country": "Denmark", "position": "Researcher", "field": "Software Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Aalborg University (AAU)", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>At the Technical Faculty of IT and Design, Department of Computer Science we look for one or more Post-Doctoral Researchers from 1 June 2022 or soon thereafter. The position will start with a 1-year extendable contract.  The Department of Computer Science features a broad range of synergistic activities within research and education in the general area of computer science, including curiosity-driven research and targeted research in collaboration with industrial partners, as well as traditional university education, with a unique problem- and project-based focus, and continued education and knowledge dissemination. For more about the department see: https://www.cs.aau.dk/about</p><h2>JOB DESCRIPTION</h2><p><strong>About the Department</strong><br/>Department of Computer Science at Aalborg University is highly regarded in Denmark among researchers, students, and external partners because of our leading research, education, and collaboration. The department currently has more than 130 scientific staff, 15 administrative staff, and 1300 students.</p><p>Our research is recognised internationally and nationally to be at the highest level of excellence according to community standards, prioritizing quality over quantity. We balance applications and theory, and societal and scientific impact, applying research to solve real-world problems, while also conducting foundational research with potential long-term impact. As part of this, we are acknowledged and respected for close collaboration with industry and for applying research to create impact and value for society, in particular within the area of sustainable development.</p><p>Our educations are problem-based and recognised for producing highly skilled graduates with very high employability, who are experienced with project work on solving real-world problems in diverse teams and able to think critically about the technologies they develop. In the workplace, we strive for diversity in nationality, culture, and gender, success as a team effort, maintaining an inspiring physical work environment, and ensuring a good work-life balance.</p><p>Over the last two years, the department has grown over 35% in scientific staff, hiring more than 25 assistant/associate professors and 7 full professors. This expansion is fueled by the success of our educations and our steady growth in externally funded research projects.</p><p>In 2020 we have established a new unit on Aalborg Universityâ\u0080\u0099s Campus in Copenhagen, responsible for establishing a new bachelor's and master's educations in â\u0080\u009cSoftwareâ\u0080\u009d. This unit will over time build its own research profile and capacity, growing to around 20 scientific staff by 2025.</p><p>For more about the department <a href=\"https://www.cs.aau.dk/about\" target=\"_blank\"><strong>read here</strong></a>.</p><p>For more information about living in Denmark and Aalborg UniversityÂ´s international staff support, <a href=\"https://www.isu.aau.dk/\" target=\"_blank\"><strong>read here</strong></a>.</p><p><strong>Security by Digital Design in Denmark (Sb3D)</strong></p><p>The positions are within Software Engineering, in the context of Sb3D, the project Security by Digital Design in Denmark. The vision of the project is to improve how secure software is developed in Denmark. Sb3D is a project alliance between leading research groups in Denmark and the Alexandra Institute as well as Danish industry partners. You can read more <a href=\"https://www.industriensfond.dk/security-by-design-digital-denmark-sb3d%C2%A0%C2%A0\" target=\"_blank\"><strong>here</strong></a>.</p><p>The aim is to develop and test benchmarks and improve software process security that will enable the industry to improve the cybersecurity of their software-based products and services. The key problem is to explore how software companies may improve their software security processes while adhering to agile and flexible software processes. The project will involve benchmarking software companies and the improvement of their processes. The research is solution-oriented and requires collaboration with industrial partners.</p><p>Post-Doctoral Researchers will start with a 1-year extendable contract.</p><p>The Department of Computer Science is rapidly growing. Particularly promising researchers can apply for a tenure-track Assistant Professorship position.</p><p>You may obtain further professional information from Head of Department Peter Axel Nielsen, <a href=\"mailto:pan@cs.aau.dk\"><strong>pan@cs.aau.dk</strong></a>.<br/><strong>Location</strong></p><p>The positions are located in Aalborg or Copenhagen depending on the applicants and the proposed research. Travel to project partners and conferences is supported and expected.</p><p><strong>Qualification requirements</strong></p><p>The successfull Post-Doctoral Researchers should have a relevant PhD preferably, but not limited, in the area of Computer Science or Software Engineering. Promising candidates in related disciplines (e.g., Information technology, Information systems, Business,  Engineering) are also welcome.</p><p>Appointment as Postdoc presupposes scientific qualifications at PhDâ\u0080\u0093level or similar scientific qualifications. The research potential of each applicant will be emphasized in the overall assessment. Appointment as a Postdoc cannot exceed a period of four years in total at Aalborg University.</p><p>The application must contain the following:</p><ul><li>A motivated text wherein the reasons for applying, qualifications in relation to the position, and intentions and visions for the position are stated.</li><li>A current curriculum vitae.</li><li>Copies of relevant diplomas (Master of Science and PhD). On request you could be asked for an official English translation.</li><li>Scientific qualifications. A complete list of publications must be attached with an indication of the works the applicant wishes to be considered. You may attach up to 5 publications.</li><li>Dissemination qualifications, including participation on committees or boards, participation in organisations and the like.</li><li>Additional qualifications in relation to the position. References/recommendations.</li><li>Personal data.</li></ul><p>Shortlisting will be applied. After the review of any objections regarding the assessment committee, the head of department, with assistance from the chair of the assessment committee, selects the candidates to be assessed. All applicants will be informed as to whether they will advance to assessment or not.</p><p><strong>Submission</strong></p><p>The applications are only to be submitted online by using the \"Apply online\" button below.<br/>Aalborg University wishes to reflect the diversity of society and welcomes applications from all qualified candidates regardless of personal background or belief.</p><p>Information regarding guidelines, ministerial circular in force and procedures can be seen <a href=\"https://www.vacancies.aau.dk/academic-positions/appointment-and-assessment/application-requirements---academic-positions.cid259144\" target=\"_blank\"><strong>here</strong></a> </p><p>For further information concerning the application procedure please contact Lisbeth Palmelund by mail est-st-hr@adm.aau.dk or phone (+45) 9940 7553. </p><h2>AGREEMENT</h2><p>Employment is in accordance with the Ministerial Order on the Appointment of Academic Staff at Universities (the Appointment Order) and the Ministry of Finance's current Job Structure for Academic Staff at Universities. Employment and salary are in accordance with the collective agreement for state-employed academics.   </p><h2>VACANCY NUMBER</h2><p>2022-224-03931</p><h2>DEADLINE</h2><p>18/02/2022</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wNVwvYWFsYm9yZy1lbi1sb2dvLmpwZyIsImVkaXRzIjpbXX0="}