{"url": "https://www.academictransfer.com/en/309220/phd-student-for-clinical-symphony-project/apply/", "title": "PhD student for clinical SYMPHONY project", "publish_date": "2022-02-08", "deadline": "2022-02-22", "location": "'s-Gravendijkwal 230, 3015 CE, Rotterdam", "city": "Rotterdam", "country": "Netherlands", "position": "PhD", "field": "Health", "salary": "â\u0082¬2495â\u0080\u0094â\u0082¬3196 per month", "max_working_hours": "36", "employer": "Erasmus MC (University Medical Center Rotterdam)", "job_description": "This clinical PhD project is embedded within theme Treatment in workpackage (WP) 6 of the <strong>national SYMPHONY research consortium</strong>. The SYMPHONY consortium is an interdisciplinary collaboration between many disciplines and patients (<a href=\"http://www.symphonyconsortium.nl/\">www.symphonyconsortium.nl</a>). This consortium aims <strong>to orchestrate personalized treatment for patients with bleeding disorders in children and adults</strong> by establishing best treatment choice for each individual with a bleeding disorder based on bleeding tendency. This will be achieved by intensive collaborations between 12 workpackages (14 fte PhD and 1 fte postdoc).<br><br>In WP6, entitled: \"Dose individualization of factor concentrates and desmopressin using population pharmacokinetic and pharmacodynamic modelling\", six clinical and clinical pharmacology PhD students work closely together in the OPTI-CLOT/ To WiN study group. As clinical PhD (1 fte; only MDs, 3-4 years), you are responsible for the collection of data and patient samples from the six Hemophilia Treatment Centers in the Netherlands to develop and validate dosing models for expensive factors concentrates, desmopressin and other medication in unique prospective multicenter trials to treat bleeding disorders such as: hemophilia, von Willebrand disease. The ultimate goal of OPTI-CLOT is to optimize and implement personalized treatment, taking individual pharmacokinetics, lifestyle and bleeding phenotype into account, thereby improving quality of care. Background information about PK-guided dosing is found in this article published by the OPTI-CLOT study group: <a href=\"https://doi.org/10.1016/j.blre.2018.01.001\">https://doi.org/10.1016/j.blre.2018.01.001</a><br><br>The clinical PhD student and clinical pharmacology PhD student, work jointly within defined projects. The clinical PhD student specifically: A) coordinates clinical studies; B) contacts patients in the clinic, outpatient department and/or during home visits; C) plays a pivotal role in connecting patients, medical doctors and nurses with clinical pharmacologists; D) collects and analyzes retrospective and prospective data of completed, current and new studies.", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For this PhD-project we are in search of a motivated Dutch-speaking researcher who has recently graduated (MSc) as a Medical doctor. Excellent writing and communication skills in both English and Dutch are mandatory.<br/><br/>We are looking for enthusiastic candidates with good social and communication skills, who are ambitious and pro-active, work independently, are flexible and have a 'can do' mentality, analytical mindset and a demonstrable ability to work well in a multidisciplinary team.<br/><br/>Key skills the candidate will develop and use are handling/qualitative analysis, scientific and public communication (e.g. writing, presentation, etc.) and pharmacokinetic knowledge. Being able to present a certificate of good conduct, a valid proof of identity, diplomas and/ or relevant registration such as BIG/ RGS are conditions for the appointment.\n  </div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>You will receive a temporary position for 1 year. If the suitability is proven, this will be extended to 3 and potentially 4 years.</li>\n<li>The gross monthly salary is â\u0082¬ 2.570,- in the first year and increases to â\u0082¬ 3.271,- in the fourth year (scale OIO).</li>\n<li>Excellent fringe benefits, such as a 13th month that is already paid out in November and an individual travel expense package.</li>\n<li>Pension insurance with ABP. We take care of approximately 2/3 of the monthly contribution.</li>\n<li>Special benefits, such as an incompany physiotherapist and bicycle repairer. And there is also a gym where you can work on your fitness after work.</li>\n</ul>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Erasmus MC</h4>\n              \n              A healthy population and excellence in healthcare through research and education. This is what Erasmus MC stands for. Conducting groundbreaking work, pushing boundaries and leading the way. In research, education, and healthcare. We are practical people with a high level of expertise, working hard to improve and renew the healthcare of today and the public health of tomorrow.<br/><br/>The Erasmus MC candidate will be supervised by Dr. Marjon H. Cnossen and Prof. dr. F.W.G. Leebeek. The SYMPHONY consortium has a yearly General Assembly and many multidisciplinary meetings. The PhD will participate depending on the WP in available and required PhD courses and international conferences.\n              \n            \n  </div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n    For more information about this position, please contact Dr. Simone Reitsma, project manager SYMPHONY, <a href=\"mailto:symphony@erasmusmc.nl\">symphony@erasmusmc.nl</a> or contact Dr. Marjon H. Cnossen, principal investigator SYMPHONY, m.cnossen@erasmusmc.nl.<br/><br/>More information regarding SYMPHONY can be found on our website: <a href=\"http://www.symphonyconsortium.nl/\">www.symphonyconsortium.nl</a> including other vacancies available.<br/><br/>For queries regarding your application, please contact Alexandra Goud, Recruiter, by phone number: <a href=\"https://www.werkenbijerasmusmc.nl/en/vacancy/61142/0031650031006\">+31 (0)6 256 796 67</a><a>.</a><br/><br/>If you would like to apply, please do so by using the application form on our website.\n  </div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.erasmusmc.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/emc-en-wide/b36dde6a51ae5ce41bcb0544084319c5.png"}