{"url": "https://academicpositions.com/ad/ku-leuven/2022/hydrodynamic-and-mechanical-design-of-a-floating-platform-for-solar-energy/174439", "title": "Hydrodynamic and Mechanical Design of a Floating Platform for Solar Energy", "publish_date": "2022-01-25", "deadline": "2022-02-28", "location": "Oude Markt 13 Leuven, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Civil Engineering, Fluid Dynamics, Fluid Mechanics, Hydraulics, Mechanical Engineering, and 1 moreMechanics", "salary": "N/A", "max_working_hours": "N/A", "employer": "KU Leuven", "job_description": "(ref. BAP-2022-47)In the framework of the MarineSPOTS project, an experienced researcher position (post-doc or similar trough experience) is available. MarineSPOTS is a project funded by the Energy Transition Fund. The research will be carried out in the Department of Civil Engineering at KU Leuven. Both the Hydraulics and Geotechnics and the Structural Mechanics research sections of the department are involved. The aim of the project MarineSPOTS is to provide a scientific basis for the possible deployment of large-area floating photovoltaics (FPV) in the North Sea. The project will investigate the generation potential, concepts to integrate it into the electrical grid, potential environmental impacts, a structural concept, and all technical requirements and boundary conditions for a roll-out.Website unitResponsibilitiesThis part of the research will focus on the structural concept, which involves the hydrodynamic and the mechanical design of a floating platform for solar energy. These platforms are typically modular. The dynamic characteristics of the platform depend on the flexibility of individual units and the interconnections. They will determine the motion of the solar panels when subjected to environmental wave and wind loads.The aim is to verify the key design parameters that govern the expected motion of the floating structure and, as a consequence, the performance of the PV systems. This work foresees the investigation, development and construction of test hardware in two stages.In the first stage, a limited number of concepts for&nbsp;floating structures&nbsp;will be selected in close collaboration with the other work packages which consider the design, performance and reliability of the electrical system. These will be demonstrated and validated individually through a desk study on a theoretical basis, taking into account the knowledge gathered from confronting possible innovative ideas with a state of the art review of available concepts.In the second stage, dynamic tests in a wave tank will be prepared. For the floating structure showing the most potential in Phase 1 of the project, the mechanical response to wave loading will be validated using a scaled-down model under controlled wave loading for normal operating conditions and extreme survival conditions.You will prepare and carry out the computer modelling of the hydrodynamics and structural dynamics for a number of design options. In collaboration with the other researchers, you will make an interpretation of the obtained results. On the basis of the outcome, you will also prepare and execute the physical tests in the wave basin.ProfileYou have proven experience in this field of research.&nbsp;A PhD in Civil or Mechanical Engineering is an asset.&nbsp;Experience and interest in numerical simulation of dynamically loaded structures and solid knowledge of fluid mechanics are crucial. Experience with physical testing is a plus. Please submit a detailed portfolio demonstrating your modelling and scientific programming experience in the field of structural mechanics and hydrodynamics.You have an excellent command of English both for oral and written communication.You are creative, you are able to work independently and formulate/tackle research problems. You are a good communicator and willing to work in a multidisciplinary team.Applications should include(1) a motivation letter (max. 2 pages) describing why you are interested in this particular position and how it fits into your career plans, (2) a full cv showing how your profile fits the requirements,(3) a complete transcript of records to date, (4) a proof of proficiency in English (TOEFL, IELTS or native speaker) or Dutch, and (5) an electronic copy of or link to publications relevant for the position (PhD thesis/ Master thesis/ journal and conference publications / research project reports).OfferWe offer a dynamic, friendly and stimulating international research environment. The duration of the contract is 18 months. The salary and appointment terms are consistent with the general rules at our university.KU Leuven is a research-intensive, internationally oriented university that carries out both fundamental and applied scientific research. Our university is highly inter- and multidisciplinary focused and strives for international excellence. In this regard we actively work together with research partners in Belgium and abroad.You will work in Leuven, a historic, dynamic and lively city located in the heart of Belgium, within 20 minutes from Brussels, the capital of the European Union, and less than two hours from Paris, London and Amsterdam.Interested?For more information please contact Prof. Jaak Monbaliu, tel.: +32 16 32 16 61, mail: jaak.monbaliu@kuleuven.be or Prof. Geert Lombaert, tel.: +32 16 32 17 72, mail: geert.lombaert@kuleuven.be.Early application is encouraged. The position will be filled a.s.a.p. Applications will be reviewed in two stages. The first stage consists of an in-depth review of the application file. Shortlisted candidates will be invited for an online or live interview.&nbsp;Shortlisting and final selection will be based on scientific background, merit and research potential. The scientific merit of the candidates not only considers experience, publications, course grades, but also evidence of team work, interdisciplinary knowledge, creativity, independent working, transferable skills, and public engagement. Please note that the following minimal thresholds will be applied when assessing language proficiency: a TOEFL iBT full score of 94, with no section scores below 22, or an IELTS overall band score of 7.0, with no band scores below 6.5. Applications not meeting these thresholds will not be considered.You can apply for this job no later than February 28, 2022 via the online application toolKU Leuven seeks to foster an environment where all talents can flourish, regardless of gender, age, cultural background, nationality or impairments. If you have any questions relating to accessibility or support, please contact us at diversiteit.HR@kuleuven.be.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyZmFcL2RjN1wvMmZhZGM3NWRkOTM1YjM5NGYyNmUzODc3MzUwZWNiYTMucG5nIiwiZWRpdHMiOltdfQ=="}