{"url": "https://academicpositions.com/ad/university-of-luxembourg/2021/phd-candidates-in-computer-vision/150480", "title": "PhD Candidates in Computer Vision", "publish_date": "2021-11-16", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "PhD", "field": "Applied Mathematics, Computational Mathematics, Computer Science, Computer Vision, Electrical Engineering, and 6 moreEngineering,Image Processing,Machine Learning,Mathematics,Programming Languages,Signal Processing", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "SnT&nbsp;is a leading&nbsp;international research and innovation centre&nbsp;in secure, reliable and trustworthy ICT systems and services. We play an instrumental role in Luxembourg by fueling innovation through research partnerships with industry, boosting R&amp;D investments leading to economic growth, and attracting highly qualified talent.Weâ\u0080\u0099re looking for people driven by excellence, excited about innovation, and looking to make a difference. If this sounds like you, youâ\u0080\u0099ve come to the right place!Your RoleWe offer attractive PhD candidate positions including industrial PhD positions conducting research in close cooperation with an industrial partner.The successful candidates will join the Computer Vision, Machine Intelligence and Imaging (CVI2) headed by Prof. Djamila Aouada in order to pursue a PhD in the general area of Computer Vision. Multiple positions are open. They will carry out research in predefined topics contributing to CVI2â\u0080\u0099s activities in computer vision and pattern recognition.&nbsp; CVI2&nbsp;offers the opportunity to work on industrial projects (with industrial partners such as Lift-Me Off, ARTEC 3D and DataThings) or national and international academic projects. CVI2&nbsp;is a young group composed of highly motivated and active members. Their work focuses on innovative research topics such as 3D shape modelling, 6DOF object pose estimation, human behavior understating, and deep learning and is disseminated in top-tiers venues.The position holder will be required to perform the following tasks: Carrying out research in a predefined topic and producing results Disseminating results through scientific publications Providing support in setting up and running experiments in the SnT Computer Vision laboratory Proposing and implementing real-time solutions Participating in organizing relevant workshops and demonstrations Your Profile A masterâ\u0080\u0099s degree in Electrical Engineering, Computer Science, Applied Mathematics or a related field Strong background in image/signal processing or/and in computer vision Strong programming skills in Python/Matlab/C/C++ Strong mathematical background Familiarity with deep learning frameworks such Pytorch, Tensorflow Commitment, team working and a critical mind Fluent written and verbal communication skills in English are mandatory Hereâ\u0080\u0099s what awaits you at SnT A stimulating learning environment.&nbsp;Here post-docs and professors outnumber PhD students. That translates into access and close collaborations with some of the brightest ICT researchers, giving you solid guidance Exciting infrastructures and unique labs.&nbsp;At SnTâ\u0080\u0099s two campuses, our researchers can take&nbsp;a walk on the moon at the LunaLab, build a nanosatellite, or help make autonomous vehicles even better The right place for IMPACT.&nbsp;SnT researchers engage in demand-driven projects. Through our&nbsp;Partnership Programme, we work on projects with more than 45 industry partners Multiple funding sources for your ideas. The University supports researchers to acquire funding from national, European and private sources Competitive salary package. The University offers a 12 month-salary package, over six weeks of paid time off, health insurance and subsidised living and eating Be&nbsp;part of a multicultural family. At SnT we have more than 60 nationalities. Throughout the year, we organise team-building events, networking activities and more But wait, thereâ\u0080\u0099s more! Complete picture&nbsp;of the perks we offer Discover our Partnership Programme Discover CVI2â\u0080\u0099s research activities In Short Contract Type: Fixed Term Contract 3 Year Location:&nbsp;Kirchberg Job Reference:&nbsp;UOL03720 Start Date: as early as possible Further InformationApplications should be submitted online and include: Curriculum Vitae List of three referees, including details (name and email address, etc.) Publication list Transcript of all modules and results from university-level courses taken Research statement and topics of particular interest to the candidate (300 words) All qualified individuals are encouraged to apply.Early application is highly encouraged, as the applications will be processed upon reception. Please apply ONLINE formally through the HR system. Applications by email will not be considered.The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.About the University of LuxembourgThe&nbsp;University of Luxembourg&nbsp;aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international and&nbsp;interdisciplinary character. It fosters the cross-fertilisation of&nbsp;research&nbsp;and&nbsp;teaching, is relevant to its country, is known worldwide for its research and teaching in targeted areas, and is establishing itself as an innovative model for contemporary European Higher Education. It`s core asset is its well-connected world-class academic staff which will attract the most motivated, talented and creative students and young researchers who will learn to enjoy taking up challenges and develop into visionary thinkers able to shape society.Further informationFor further information you may check: www.securityandtrust.lu or contact&nbsp;Djamila.Aouada@uni.lu&nbsp;or&nbsp;Bjorn.Ottersten@uni.lu&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University of Luxembourg aspires to be one of Europeâ\u0080\u0099s most highly regarded universities with a distinctly international, multilingual and interdisciplinary character.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}