{"url": "http://www.academictransfer.com/en/309243/docent-vakdidactiek-economie-enof-bedrijfseconomie-06-08-fte/", "title": "Docent Vakdidactiek Economie en/of Bedrijfseconomie (0,6-0,8 fte)", "publish_date": "2022-02-09", "deadline": "2022-02-28", "location": "Warandelaan 2, 5037 AB, Tilburg", "city": "Tilburg", "country": "Netherlands", "position": "Other Category", "field": "Economie", "salary": "N/A", "max_working_hours": "24—32", "employer": "Tilburg University", "job_description": "<p>De Universitaire Lerarenopleiding Tilburg en het Tilburg Center of the Learning Sciences zoeken een docent Vakdidactiek Economie/Bedrijfseconomie voor het doceren aan en begeleiden van studenten in de masters Leraar VHO in Economie en Leraar VHO in Bedrijfseconomie.</p><p>&nbsp;</p><p>De taak omvat de volgende zaken:&nbsp;</p><ul> <li>het mede vormgeven aan en doceren van de cursus Vakdidactiek Economie en Bedrijfseconomie</li> <li>het begeleiden van Didactisch Lesontwerponderzoek en Didactisch Leeronderzoek&nbsp;</li> <li>het begeleiden, bezoeken en beoordelen van de schoolstages. &nbsp;</li> <li>het opnemen van organisatorische taken ten behoeve van de Universitaire Lerarenopleiding Tilburg&nbsp;</li> <li>het deelnemen aan universitaire, regionale en landelijke overlegorganen op het gebied van de lerarenopleidingen.&nbsp;</li> <li>het actief bijdragen aan de professionaliserings- en onderzoeksactiviteiten van het Tilburg Center of the Learning Sciences.&nbsp;</li> </ul><p>&nbsp;</p><p>De nieuwe collega verzorgt deze taken in samenwerking en afstemming met de andere vakdidacticus Economie en Bedrijfseconomie en in nauwe samenwerking met andere collega&rsquo;s van de Universitaire Lerarenopleiding Tilburg en het Tilburg Center of the Learning Sciences.</p>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.uvt.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uvt-en-wide/8bbc452c034c71750be03f93fe602eca.png"}