{"url": "https://academicpositions.com/ad/cemm/2021/project-scientists-to-join-the-superti-furga-lab-at-cemm-m-f-d/173111", "title": "Project Scientists to join the Superti-Furga Lab at CeMM (m/f/d)", "publish_date": "2021-12-17", "deadline": "N/A", "location": "Lazarettgasse 14, AKH BT 25.3 Vienna, Austria", "city": "N/A", "country": "Austria", "position": "Other Category", "field": "Biochemistry, Bioinformatics, Biophysics, Cell Biology, Computational Biology, and 5 moreGenetics,Molecular Biology,Pharmacy & Pharmacology,Structural Biology,Systems Biology", "salary": "N/A", "max_working_hours": "N/A", "employer": "CeMM", "job_description": "Do you want to be part of a very large multidisciplinary eï¬\u0080ort committed to understand human membrane transporters governing the interface between biological systems and the environment?We are looking for five dynamic individuals to complement the existing team and drive the eï¬\u0080ort to interpret, validate, publish and communicate the output of the public-private partnership&nbsp;RESOLUTE, comprising six pharmaceutical companies, one biotech and six academic research&nbsp;institutions (Superti-Furga et al, Nat Rev Drug Discov. 2020). Using hundreds of isogenic cell lines with loss and gain of function for each human SLC transporter, we obtained metabolomic/ionomic, transcriptomic and proteomic large-scale data sets annotated with subcellular localization. We also have single and combinatorial genetic data and a large collection of assays (Dvorak et al, Front.&nbsp;Pharmacol. 2021). You will work in the Giulio Superti-Furga group (CeMM, Vienna) in close&nbsp;collaboration with other project and data scientists. Together we want to bring knowledge on human transporters to the next level by turning data into biological insights.Project scientist in network biology and metabolismComputational and systems biologist with an interest in integrative approaches to deorphanize transporters and derive a novel functional map linking using multidimensional data sets.Project scientist in metabolism and transportersBiochemist/ molecular biologist/ cell biologist to validate selected transporter-metabolite relationships of a novel functional map using a variety of approaches.Project scientist in protein biochemistryProtein biochemist to characterize and functionally validate new high-aï¬\u0083nity binders to transporters.Project scientist in molecular cell biologyMolecular biologist / cell biologist to validate biochemically and functionally the most intriguing findings of the large-scale transporter interactome.Project scientist responsible for communication and business developmentScientist responsible for divulgation of the consortium output (data, reagents, technologies) and possible continuation/expansion of consortium activities.Requirements &amp; desired qualificationsProject scientist in network biology and metabolismPhD in computational biology, bioinformatics or similar experienceExperience in systems biology researchExperience in integrative, biological network analysisStrong data visualization skillsUnderstanding of basic statistics and experience in application of advanced statistical approachesProject scientist in metabolism and transportersPhD in cell biology, biochemistry, molecular biology or similarProficient knowledge in mammalian metabolismExperience in mammalian cell culture (immortalized cell line models) and viral delivery systemsExperience with biochemical/pharmacological analysis of transporters or membrane proteins desiredExperience in at least one field of systems biology research is plus (genomics, transcriptomics, proteomics, metabolomics)Project scientist in protein biochemistryPhD in biochemistry, biophysics, cell biology or similarExperience in quantitative biophysicsFamiliarity with validation technologies such as IF, WB, IP-MSKnowledge in structural biology is an advantageExperience with biochemical/pharmacological analysis of transporters or membrane proteins is a plusProject scientist in molecular cell biologyPhD in molecular biology, cell biology, biochemistry or similarExperience in site-directed mutagenesis and with CRISPR/Cas9 technologiesExperience in mammalian cell culture (immortalized cell line models) and viral delivery systemsExperience in validation technologies such as IF, WB, IP-MSExperience with biochemical/pharmacological analysis of transporters or membrane proteins is desirableProject scientist responsible for communication and business developmentPhD in natural sciences or equivalentExcellent communication and writing skillsInterest to travel on a regular basisPrior experience in promoting businesses or large initiativesFor all positionsInclination to work in a team is importantA proactive attitude is requiredExcellent written / oral communication skills in EnglishThe RESOLUTE ConsortiumStarting on July 1st of 2018, the RESOLUTE consortium is supported by the Innovative Medicines Initiative (IMI, www.imi.europa.eu) with 13 partners from academia and the pharmaceutical industry and is coordinated by the Superti-Furga laboratory. The RESOLUTE consortiumâ\u0080\u0099s mission is to de-orphanize human SLC transporters at a large scale and unlock them as potential pharmacological targets (Superti-Furga et al, Nat Rev Drug Discov. 2020). With a well-defined action plan, we are currently pushing towards a paradigm-shift in the science of human cellular transporters by creating a massive, historical advance in knowledge on hundreds of individual transporters and the way they act together.The Superti-Furga LaboratoryThe Superti-Furga group (http://superti-furga-lab.at/) is composed of an international and highly productive team of more than 30 scientists. As a leader in the field, the laboratory investigates how cells and biological systems in general manage access to the environment through cellular transport. In particular how access to nutrients and energy source is tuned to metabolism and need of individual cell types. Moreover, the lab has pioneered approaches for functional precision medicine. The laboratory operates on a truly multidisciplinary basis and involves functional genomics and proteomics, structural analysis, chemical biology, high-content imaging, bioinformatics and physiology, reflecting the blend of expertise of the laboratory members (Heinz et&nbsp;al, Nature. 2020;&nbsp;Girardi et al, Nat Chem Biol. 2020;&nbsp;Girardi et al, Nat Commun. 2020;&nbsp;Li et al, Nat&nbsp;Metab. 2021;&nbsp;Pemovska et al, Nat Commun. 2021).About the InstituteCeMM is one of Europeâ\u0080\u0099s leading biomedical research institutes. CeMM researchers routinely publish important discoveries in top journals. Over the last seven years, this included &gt;10 papers in Nature/Cell/Science/NEJM and &gt;30 papers in Nature/Cell sister journals â\u0080\u0093 with a team of 120-150 scientists. Research at CeMM is exceptionally collaborative and has strong focus on medical impact, based on a profound molecular understanding of diseases such as cancer and immune disorders.CeMM is part of the Austrian Academy of Sciences and a founding member of EU-LIFE. It is located at the center of one of the largest medical campuses in Europe, within walking distance of Viennaâ\u0080\u0099s historical city center. A study by â\u0080\u009cThe Scientistâ\u0080\u009d put CeMM among the top-5 best places to work in academia worldwide (https://www.the-scientist.com/features/best-places-to-work-academia-2012-40676). Vienna is frequently ranked the worldâ\u0080\u0099s best city to live. It is a United Nations city with a large English-speaking community. The oï¬\u0083cial language at CeMM is English, and &gt;49 diï¬\u0080erent nationalities are represented at the institute. CeMM promotes equal opportunity and harbors a mix of diï¬\u0080erent talents, backgrounds, competences, and interests.We oï¬\u0080erWork within an experienced, interdisciplinary, and international team at one of Austriaâ\u0080\u0099s leading research institutesAmple opportunities to contribute and gain experience in a key area of biomedical research and precision medicineAn inspiring workplace with an international setting, strong team spirit, and an excellent work climateA wide range of social, cultural, and sports activities organized by the instituteExcellent employee benefits including full insurance coverage (health, accident, retirement), health care services, subsidized cafeteriaStarting monthly gross salary of at least EUR 3.945,90 (following the recommendations of FWF)Support for relocating to Vienna is provided (relocation reimbursement, visa support, etc.)The contract for the position will be initially limited to 2 years, matching the projectâ\u0080\u0099s duration until December 2023.Application detailsPlease apply online (https://cemm.jobbase.io/job/m3htrrf0) with cover letter, CV and contact details of 2 referees, all in a single PDF document with up to 3 pages. Applications are evaluated on a rolling basis and the starting date for all positions is as soon as possible.Additional informationCity ViennaPosition type Full-time employeeStart of work 01.02.2022Responsible Memo Mokhles", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "CeMM is an interdisciplinary research institute of the Austrian Academy of Sciences committed to achieving maximum scientific innovation in molecular medicine to improve healthcare.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEzXC8wMlwvQ2VNTUxvZ28ucG5nIiwiZWRpdHMiOltdfQ=="}