{"url": "https://academicpositions.com/ad/university-of-nottingham/2022/research-associate-fellow-fixed-term/174772", "title": "Research Associate/Fellow (Fixed term)", "publish_date": "2022-02-02", "deadline": "2022-03-04", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Research Assistant", "field": "Biomedicine, Epidemiology, Statistics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference: MED555821Closing Date: Friday, 4th March 2022Job Type: ResearchDepartment: Rheumatology, Orthopaedics &amp; DermatologySalary: Â£27924 to Â£40927 per annum (pro rata if applicable) depending on skills and experience (minimum Â£31406 with relevant PhD). Salary progression beyond this scale is subject to performanceApplications are invited for the post of Research Associate/Fellow based in Academic Rheumatology, School of Medicine.&nbsp;The purpose of this role will be to have specific responsibility for research, for developing research objectives and proposals for a research project aiming to consolidate and harmonise cohort datasets and to measure burden of arthritis pain during the period of covid-19 pandemic and lockdown, and identify vulnerability factors and novel interventional targets. You will be expected to plan and conduct work using approaches or methodologies and techniques appropriate to the type of research and will be responsible for writing up their work for publication.&nbsp;The successful applicant will join an established team, led by Professors Weiya Zhang, whose main areas of research interest include epidemiology, specifically of osteoarthritis and gout and David Walsh, co-Director of Pain Centre Versus Arthritis undertaking a translational research programme into the mechanisms and management of arthritis pain.&nbsp;Further information about the Pain Centre Versus Arthritis can be found here&nbsp;Candidates should hold a PhD (or close to completion) relevant to epidemiology, statistics, biomedical disciplines or data management.The post will be offered on a fixed term basis until 30th March 2023. &nbsp;Hours of work are full-time (36.25 hours) ; however applications are also welcome from candidates wishing to work part-time (minimum 29 hours per week). Please specify in your application if you wish to work part time and the number of preferred hours. Job share arrangements may be considered.Informal enquiries may be addressed to Rose Farrands-Bentley, Rose.Farrands-Bentley@nottingham.ac.uk. Please note that applications sent directly to this email address will not be accepted.Our University has always been a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs â\u0080\u0093 indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. We welcome applications from UK, Europe and from across the globe. For more information on the support we offer our international colleagues, see our Moving to Nottingham pages.For successful international applicants, we provide financial support for your visa and the immigration health surcharge, plus an interest-free loan to help cover the cost of immigration-related expenses for any dependants accompanying you to the UK. For more information please see the our webpage on Financial support for visas and the immigration health surcharge.Job Description/Role ProfileAdditional informationAdditional InformationApply Online", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}