{"url": "https://academicpositions.com/ad/university-of-luxembourg/2022/doctoral-researcher-phd-student-in-luxembourgish-literature/175130", "title": "Doctoral researcher (PhD student) in Luxembourgish Literature", "publish_date": "2022-02-10", "deadline": "N/A", "location": "6, rue Richard Coudenhove-Kalergi , Luxembourg", "city": "N/A", "country": "Luxembourg", "position": "PhD", "field": "Germanic languages, Literary Theory, Romance languages, West Germanic languages, World Literatures,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Luxembourg", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>The<strong> University of Luxembourg</strong> is an <strong>international research</strong> university with a distinctly <strong>multilingual</strong> and <strong>interdisciplinary</strong> character. The University was founded in 2003 and counts more than 6,700 students and more than 2,000 employees from around the world. The Universityâ\u0080\u0099s faculties and interdisciplinary centres focus on research in the areas of Computer Science and ICT Security, Materials Science, European and International Law, Finance and Financial Innovation, Education, Contemporary and Digital History. In addition, the University focuses on cross-disciplinary research in the areas of Data Modelling and Simulation as well as Health and System Biomedicine. Times Higher Education ranks the University of Luxembourg #3 worldwide for its â\u0080\u009cinternational outlook,â\u0080\u009d #20 in the Young University Ranking 2021 and among the top 250 universities worldwide. </p><p>The <strong>Faculty of Humanities, Education and Social Sciences</strong> (FHSE) brings together expertise from the humanities, linguistics, cognitive sciences, social and educational sciences. People from across 20 disciplines are working within the Faculty. Along with the <strong>disciplinary</strong> approach a very ambitious interdisciplinary research culture has been developed.</p><p>The facultyâ\u0080\u0099s research and teaching focuses on <strong>social, economic, political </strong>and<strong> educational</strong> issues with the common goal of contributing to an inclusive, open and resourceful society. The FHSE offers four Bachelor and 15 Master degrees and a doctoral school providing students with the necessary knowledge and high-qualified skills to succeed in their future career.</p><p><strong>Your Role...</strong></p><p>The doctoral candidate will be a member of the Department of Humanities at the Faculty of Humanities, Education and Social Sciences. S/he will work under the supervision of Prof Dr Jeanne E. Glesener and assist the professor in research and teaching.</p><p><strong>Your Tasks</strong></p><p>Prepare a doctoral thesis in Luxembourgish Literature on one of the following topics:</p><ul><li>19th century Luxembourgish literature in Luxembourgish, German and French</li><li>The novel in Luxembourgish, German and French, 1980 - 2000</li><li>Translingual Luxembourgish Literature</li></ul><p>Mandatory enrolment in the Doctoral School in Humanities and Social Sciences.</p><p>Assist the professor in her administrative and teaching activities (3 hours per week).</p><p>Actively participate in the organization of scientific conferences, research activities in the Department of Humanities and in study program organization.</p><p><strong>What we expect from youâ\u0080¦</strong></p><ul><li>Excellent Masterâ\u0080\u0099s Degree in Comparative Literature or in French, German or English Literature</li><li>Research focus on comparative approaches, genre theory and multi/translingualism</li><li>Language skills: Luxembourgish (reading competence at least), French, German, English</li></ul><p><strong>In Short...</strong></p><ul><li>Contract Type: Fixed Term Contract 36 Month - extendable up to 48 months if required</li><li>Work Hours: Full Time 40.0 Hours per Week</li><li>Ideal starting date: May 2022</li><li>Location: Belval</li><li>Employee and student status</li><li>Job Reference: UOL04742</li></ul><p>The yearly gross salary for every PhD at the UL is EUR 37.101,36 (full time)</p><p><strong>How to apply...</strong></p><p>Applications should be submitted online and include:</p><ul><li>Cv</li><li>Motivation letter</li><li>Short abstract of PhD-project (1 000 words)</li><li>Copies of diplomas</li><li>References</li></ul><p>We ensure consideration until 1st of April 2022 then the posting will remain until until filled.</p><p>Please apply formally through the HR system. Applications by email will not be considered.</p><p>The University of Luxembourg embraces inclusion and diversity as key values. We are fully committed to removing any discriminatory barrier related to gender, and not only, in recruitment and career progression of our staff.</p><p><strong>Hereâ\u0080\u0099s what awaits you at the University</strong></p><ul><li><strong>Multilingual and international character</strong>. Modern institution with a personal atmosphere. Staff coming from 90 countries. Member of the â\u0080\u009cUniversity of the Greater Regionâ\u0080\u009d (UniGR). </li><li><strong>A modern and dynamic university. </strong>High-quality equipment. Close ties to the business world and to the Luxembourg labour market. A unique urban site with excellent infrastructure.</li><li><strong>A partner for society and industry</strong>. Cooperation with European institutions, innovative companies, the Financial Centre and with numerous non-academic partners such as ministries, local governments, associations, NGOs â\u0080¦</li><li><a href=\"https://wwwen.uni.lu/university/about_the_university\" target=\"_blank\">Find out more about the University</a></li><li><a href=\"https://wwwen.uni.lu/contact\" target=\"_blank\">Addresses, maps &amp; routes to the various sites of the University</a></li></ul>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIyMDEwXC8wOVwvTG9nby13ZWItUlZCLWtvcGllcmEucG5nIiwiZWRpdHMiOltdfQ=="}