{"url": "https://academicpositions.com/ad/university-of-amsterdam/2021/dentist-endodontist-teachers/173585", "title": "Dentist-endodontist Teachers", "publish_date": "2021-12-28", "deadline": "2022-04-03", "location": "Roeterseilandcampus, Nieuwe Achtergracht 166 Amsterdam, Netherlands", "city": "N/A", "country": "Netherlands", "position": "Other Category", "field": "Clinical Sciences, Dentistry, Health Science,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Amsterdam", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><span style=\"color:rgb(0,0,0);\">Are you a dentist-endodontist? Do you want to deploy your knowledge and skills in dental education? Then, we are looking for you!</span><br/><strong>Location: </strong><span style=\"color:rgb(0,0,0);\">AMSTERDAM</span><br/><strong>FTE: </strong><span style=\"color:rgb(0,0,0);\">0.4</span></p><h3>JOB DESCRIPTION</h3><p><span style=\"color:rgb(0,0,0);\">Due to educational innovations and to strengthen the (pre-)clinical education in the bachelor and master Dentistry, we are looking for dentist teachers. We are the Academic Center for Dentistry Amsterdam (ACTA), department of Endodontology. Our organization belongs to the absolute world top of research institutes (number 3 in the recent QS World rankings by subject). ACTA has nearly 500 staff members and around 900 students who are taking the Dentistry program. Around 300 patients visit ACTA every day on average.</span></p><p><span style=\"color:rgb(0,0,0);\">As a teacher you supervise motivated students who wish to provide the best dental care. With your experience, you increase their professional knowledge. You are a source of information, inspiration and you act as a role model. Your contribution to our next generation of dentists is great. ACTA works on the principle of competence-based training and also wants to educate the students in life-long-learning. You will acquire new didactic skills, which you can use in large and small-scale education, but also in your own practice. You work in a challenging academic environment with peers from various disciplines. You stay informed of the latest developments and your (international) network is boosted.</span></p><p><strong>Your duties</strong><br/><span style=\"color:rgb(0,0,0);\">At the department of Endodontology, we give theoretical and practical lessons at various levels of education: bachelor, master and oral health sciences program Endodontology.</span><br/><span style=\"color:rgb(0,0,0);\">You:</span></p><ul><li>coordinate, prepare, implement, execute and evaluate teaching activities. This concerns both (pre-)clinical and simulated education</li><li>supervise dental and OHS students during treatment</li><li>lead or participate in patient discussions</li><li>some jobs require that you are involved in research and supervise students whilst they are working on their theses</li></ul><h3>REQUIREMENTS</h3><p>We request that you:</p><ul><li>are in possession of a dental diploma recognized in the Netherlands or busy with getting a dental diploma recognized in the Netherlands (see bigregister.nl)</li><li>you are recognized as an endodontist by N.V.v.E, E.S.E or equivalent</li><li>have good communication and clinical skills</li><li>have an affinity with education and are willing to develop in this area. You have a basic qualification in teaching or are willing to obtain it</li><li>are flexible to work in a variation of tasks</li><li>have a good knowledge of the Dutch language, both orally and in writing</li><li>are at least available on Wednesdays</li></ul><h3>WHAT ARE WE OFFERING?</h3><p><span style=\"color:rgb(0,0,0);\">A challenging position within a socially involved organization. We offer you:</span></p><ul><li>options for following education in didactics and obtaining a basic qualification in teaching</li><li>room for personal development and career opportunities within ACTA</li><li>opportunities for didactic and dental courses</li><li>an environment where you can work with peers from a variation of disciplines</li><li>an international, modern and dynamic academic atmosphere</li></ul><p><span style=\"color:rgb(0,0,0);\">Working conditions</span><br/><span style=\"color:rgb(0,0,0);\">Depending on relevant work experience, the salary is a minimum of â\u0082¬ 3,821 and a maximum of â\u0082¬ 5,230 (scale 11) gross per month, based on 38 hours per week. The position is classified according to UFO profile Dentist teacher level 3 for at least 0.4 FTE (16 hours per week).</span></p><p><span style=\"color:rgb(0,0,0);\">The initial employment contract is for the duration of 1 year, followed by indefinite employment if a positive assessment of the performance and all job requirements are met.</span><br/><span style=\"color:rgb(0,0,0);\">In addition, ACTA has attractive fringe benefits and schemes that enable a good combination of work and private life, such as: 29 holidays in case of a full-time employment of 38 hours, 8% holiday allowance, 8.3% end-of-year bonus and a generous contribution to the ABP-pension scheme.</span></p><h3>ACTA</h3><p><span style=\"color:rgb(0,0,0);\">ACTA is the collaboration of the Faculties of Dentistry at Vrije Universiteit Amsterdam and the University of Amsterdam. We focus on all aspects of dentistry: from specialized training to outstanding research and the highest-quality patient care.</span><br/><span style=\"color:rgb(0,0,0);\">Working at ACTA is working on leading international research and training. In 2017, ACTA ranked eighth in the QS World University Rankings. In addition to being an educational and research institution, ACTA also provides healthcare services. You will be working with peers from a variety of disciplines. ACTA has nearly 500 staff members and around 900 students who are taking the Dentistry programme. Around 300 patients visit ACTA every day on average.</span></p><p><strong>Diversity</strong><br/><span style=\"color:rgb(0,0,0);\">Diversity is one of our universityâ\u0080\u0099s core values. We are an inclusive community, and we believe that diversity and international activities enhance the quality of education and research. We are always looking for people who can enhance diversity on our campus thanks to their background and experience.</span></p><p>Application</p><p><span style=\"color:rgb(0,0,0);\">Are you interested in this position? Please apply via the application button and upload your curriculum vitae and cover letter until </span><strong>April 3, 2022</strong><span style=\"color:rgb(0,0,0);\">. Please upload you curriculum vitae and motivation letter. At ACTA it is mandatory that all staff is protected against Hepatitis B. Therefore we request that you upload a statement of the degree of protection in your application using the button: \"Additional attachments\".</span></p><p><i><u>Applications received by e-mail will not be processed.</u></i></p><p><strong>Vacancy questions</strong><br/><span style=\"color:rgb(0,0,0);\">If you have any questions regarding this vacancy, you may contact:</span></p><p><span style=\"color:rgb(0,0,0);\">Name: Dr. Suzette van der Waal</span><br/><span style=\"color:rgb(0,0,0);\">Position: Head of the Department of Endodontology</span><br/><span style=\"color:rgb(0,0,0);\">E-mail: </span><a href=\"mailto:s.vd.waal@acta.nl\"><u>s.vd.waal@acta.nl</u></a><br/><span style=\"color:rgb(0,0,0);\">Telephone: +31 20 5980442 (only on Wednesday)</span></p><p><span style=\"color:rgb(0,0,0);\">For more information please go to </span><a href=\"http://www.acta.nl/\" target=\"_blank\"><u>www.acta.nl</u></a></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxNzVcLzk4MFwvMTc1OTgwN2QzNzE4YzUwNmIyODU5Y2ZmMDQ5ZTQ2NjMucG5nIiwiZWRpdHMiOltdfQ=="}