{"url": "https://academicpositions.com/ad/silicon-austria-labs-sal/2021/senior-scientist-rfic-design-mm-wave-and-sub-terahertz-receivers-f-m-d/165401", "title": "Senior Scientist - RFIC Design / mm-Wave and sub-Terahertz Receivers (f/m/d)", "publish_date": "2021-11-03", "deadline": "N/A", "location": "Inffeldgasse 33 Graz, Austria", "city": "N/A", "country": "Austria", "position": "Researcher", "field": "Communication Engineering, Electrical Engineering, Electronics, Engineering, Systems Engineering,", "salary": "N/A", "max_working_hours": "N/A", "employer": "Silicon Austria Labs (SAL)", "job_description": "YOUR FUTURE RESPONSIBILITIES System &amp; circuit solutions for multi-gigabit wireless chips. Involvement in receiver architecture selection &amp; receiver system to circuit specifications translation. Implementing blocks &amp; documenting design towards formal design reviews. Drive layout &amp; top-level simulations to validate top-level integration. Supervision of Junior Scientists. Project Responsibilities. YOUR PROFILE Masterâ\u0080\u0098s degree in relevant field with 5+ years of experience in related area of expertise or PhD with 3 years of experience. Deep understanding of fundamental microwave theories &amp; concepts such as:power waves and scattering parameters transmission-lines concepts power gain expressions gain, noise, and VSWR design trade-offs High proficiency in system specification &amp; ability to translate system into circuit requirements at IC level. Familiar with various RF receiver architectures &amp; their trade-offs. Understanding of mmWave device modeling. Insights into packaging effects, supply isolations, high frequency ESD structures &amp; circuit layout for optimum performance. Experience in simulation &amp; design of lumped &amp; distributed passive structures. Proficient with EDA CAD tools. (Cadence, Mentor, Ansys, etc.) Performing Analog Custom Layout. Experience in measuring IC performance &amp; debug of design to correlate simulations to measurements. IMPORTANT FACTS ABOUT SAL Start of your employment: 1st of August (negotiable) This position is endowed with a gross annual salary of&nbsp;â\u0082¬ 53.382.-&nbsp;based on the collective agreement for research (â\u0080\u009eForschungs-Kollektivvertragâ\u0080\u009c) excluding bonus and depending on your experience and skills. Home Office possible. â\u0082¬ 4.- /day food allowance in restaurants / â\u0082¬ 2.- /day in supermarkets. Family- &amp; Kids friendly. Free Coffee/Milk/Tee. BECOME PART OF SILICON AUSTRIA LABSSilicon Austria Labs is performing cutting-edge research in the course of the 6G Lighthouse on the physical layer of RF systems for future 5G/-6G (UE, front and backhaul), and millimeter-wave and sub- Terahertz imaging/-sensing/-radar applications. In this domain, the Research Unit for Millimeter Wave Technologies collaborates closely with university and leading industry partners on e.g. RF/ millimeter-wave transceiver architectures robust in terms of interference and coexistence, reconfigurable RF systems for transceivers and RF/-millimeter-wave front-end modules (architectural reuse and/ or resource sharing), and large-scale phased-array antennas and beamforming structures, which are targeting millimeter-wave and sub-Terahertz communications (5G, 6G), radars and imagers. In support of the design activities the mmWave RF Unit is equipped with the best in-class test infrastructure covering the GHz and THz frequency range.The top research center for electronic based systems (EBS). Unfold the future, unfold yourself.&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "In the network of science and industry, we carry out reÂ­search at the highest global reÂ­search level.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI3YjZcLzM0NlwvN2I2MzQ2ODRlNjQ2YThlYmM4ODM3ZmI2NDQ4OGM1NTcuc3ZnIiwiZWRpdHMiOltdfQ=="}