{"url": "https://academicpositions.com/ad/university-of-nottingham/2021/assistant-professor-in-business-law-and-corporate-governance/169213", "title": "Assistant Professor in Business Law and Corporate Governance", "publish_date": "2021-11-24", "deadline": "N/A", "location": "University Park Nottingham, United Kingdom", "city": "N/A", "country": "United Kingdom", "position": "Assistant Professor", "field": "Commercial Law, Corporate Governance,", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Nottingham", "job_description": "Reference: 182018Closing Date: Friday, 31st December 2021Department: Opportunities at the University of Nottingham in Ningbo ChinaSalary: Salary will be within the range of RMB 421,889 to RMB 555,548 per annum depending on skills and experience (salary progression beyond this scale is subject to performance).Your ResponsibilityYour key responsibilities include:To deliver teaching across a range of modules or within a subject area, providing curriculum leadership within own area of expertise.Be responsible for the design of course modules and/or programmes of study in specialist area and for their quality. Where appropriate identify the need for developing the content or structure of existing modules and make proposals on how this should be achieved.To supervise and examine Post graduate, Masters and PhD students.To take the lead on, plan, develop and conduct individual and/or collaborative research objectives, projects and proposals either as an individual or as part of a broader programme.To establish a scholarly reputation and regularly disseminate and explain research findings through leading peer-reviewed publications (on a sustained basis), conferences and other appropriate media.About YouPhD or equivalentin relevant subject area.Clear record or potential for publishing in high quality international journals in the subject area or closely relevant areasExperience and demonstrated success in delivering teaching within an agreed quality framework.Sufficient breadth or depth of specialist knowledge in the discipline to develop research programmes and methodologies.Excellent oral and written communication skills.About UsJoin a unique British University in China. University of Nottingham Ningbo China (UNNC) was the first Sino-foreign university to open its doors in China. Located in Ningbo, this award winning campus offering a UK style education has grown to establish a student body of over 8,000 in just 16 years.As a key component of UNNC,&nbsp;Nottingham University Business School (NUBS) China&nbsp;is an integral part of the Nottingham University Business School awarding the same internationally recognized degrees offered by Nottingham in the UK. In operation for just over 10 years, NUBS China currently has approximately 2,800 students of which about 400 are enrolled in postgraduate programmes including a Ph.D. programme. It has a rapidly expanding international faculty of about 90, all based in Ningbo China and coming from 27 countries or so. The school is EQUIS accredited and is part of a university that is highly rated and is seeking to improve further its ranking among the worldâ\u0080\u0099s top research and teaching universities. NUBS China focuses its efforts around the three \"I\"s-International, Innovative, and Interactive. Since 2011, NUBS China has rapidly progressed towards an increasing focus on high impact research, customized executive education, and high-quality teaching.The Department of International Business and Management plays an important part in the School's teaching programmes and offers a wide range of modules in OB/HRM, strategy, international business, business ethics and law at undergraduate and/or postgraduate levels.Your Remuneration, Benefits and SupportYou will be offered a fixed term contract initially with University of Nottingham Ningbo China for a period of up to five years with effect from 1 September 2022 or as soon as thereafter. This contract may be extended on an indefinite basis based on mutual agreement.&nbsp;Salary will be within the range of RMB 421,889 to RMB 555,548&nbsp;per annum depending on skills and experience (salary progression beyond this scale is subject to performance).&nbsp;In addition, an attractive package including employment support allowance, first arrival allowance and insurance will be provided for international appointments.How to ApplyApplicants should submit an application via our on-line application system before 31 December 2021 at&nbsp;https://hrms.nottingham.edu.cn/psc/PRDHCM/EMPLOYEE/HRMS/c/HRS_HRAM.HRS_APP_SCHJOB.GBL?Page=HRS_APP_JBPST&amp;Action=U&amp;FOCUS=Applicant&amp;SiteId=1&amp;JobOpeningId=182018&amp;PostingSeq=1&nbsp;Only on-line applications made at&nbsp;(http://job.nottingham.edu.cn) will be accepted. Referees will be contacted prior to interview and interviews will take place in Ningbo China.EnquiriesInformal enquiries regarding these vacancies may be addressed to Dr. Lei Li, Head of Department of International Business Management of Nottingham University Business School China at email: Lei.Li@nottingham.edu.cn. If you are unable to apply on-line please contact the Human Resources Office, Tel: 86 574 88180000(ext.8854), Email: job@nottingham.edu.cn. &nbsp;Equality and DiversityUniversity of Nottingham Ningbo China is an equal opportunity employer.&nbsp;We are committed to providing a fair, equitable and mutually supportive learning and working environment for our students and staff. It is our intention to ensure that job applicants and staff are treated solely on the basis of their merits, abilities and potential, regardless of gender, race, colour, nationality, ethnic or national origin, age, socio-economic background, disability, religious or political beliefs, trade union membership, family circumstances, sexual orientation or other irrelevant distinction.&nbsp;Job Description/Role Profile&nbsp;&nbsp;&nbsp;&nbsp;", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The Strategic Plan articulates the University's mission, vision and guiding principles.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiIxZTdcL2UwMFwvMWU3ZTAwZDI1MTMyMTNjMGIxN2EyNTkwY2QwYTM3NDkuanBlZyIsImVkaXRzIjpbXX0="}