{"url": "https://www.academictransfer.com/en/309343/projectmanagement-officer-pmo-10-fte/apply/", "title": "Projectmanagement Officer (PMO) (1,0 fte)", "publish_date": "2022-02-10", "deadline": "2022-03-15", "location": "Domplein 29, 3512 JE, Utrecht", "city": "Utrecht", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "N/A", "max_working_hours": "36—40", "employer": "Utrecht University", "job_description": "<p>De afdeling Service Management &amp; Architectural Services is op zoek naar een Projectmanagement Officer (PMO). Ben jij communicatief vaardig, houd je van processen verbeteren en vind je het leuk om de samenwerking op te zoeken? Dan maken we graag kennis met jou.</p> <p><br>Als Projectmanagement Officer ga je het team van Infra projectmanagers begeleiden en het projectmanagementproces professionaliseren. Je houdt je bezig met thema’s als: Wat hebben de Infra projectmanagers nodig om hun projecten optimaal uit te voeren? Welke procesverbeteringen zijn er nodig om projecten effectiever en efficiënter uit te voeren? Als PMO-er ben je gericht op de start en uitvoering van projecten. Ook geef je advies over mogelijke verbeteringen in ons projectmanagement.</p> <p><br>Je werkt in het cluster Infrastructure van de directie Information and Technology Services (ITS) bij de afdeling Service Management &amp; Architectural Services (SMAS). Je werkt nauw samen met onder andere projectmanagers, de projectportfoliomanager en met de collega’s van Planning &amp; Control. Je leidinggevende is het afdelingshoofd SMAS.</p> <p><br>Er zijn twee belangrijke pijlers in je functie.<br><br></p> <p>1. Je begeleidt programma’s en projecten:</p> <ul> <li>Je ondersteunt de programmamanager of projectmanager bij de uitvoering van het Infrastructure programma of project.</li> <li>Je zorgt voor het maken van rapportages en presentaties.</li> <li>Je houdt overzicht op de financiën.</li> <li>Je plant en bereidt overleggen voor.</li> <li>Je richt je op risico-, issue- en stakeholdermanagement.</li> </ul> <p><br>2. Je bent verantwoordelijk voor kwaliteit en verbetering:</p> <ul> <li>Je bent verantwoordelijk voor de kwaliteit van het projectmanagementproces.</li> <li>Je stelt rapportages op die inzicht geven in het Infrastructure portfolio.</li> <li>Je werkt aan verbeteringen in het projectmanagementproces, bijvoorbeeld de verandering naar een Agile werkwijze.</li> <li>Je voert kwaliteitscontroles op projectmanagementproducten uit, bijvoorbeeld het reviewen van Project Initiation Documents.</li> <li>Je begeleidt nieuwe projectmanagers, gericht op de benodigde processen, templates en tooling.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.uu.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uu-en-wide/67674af2e9b77c72917924b654f37798.jpg"}