{"url": "https://academicpositions.com/ad/hong-kong-university-of-science-and-technology-hkust/2022/head-of-the-department-of-computer-science-and-engineering/174255", "title": "Head of the Department of Computer Science and Engineering", "publish_date": "2022-01-20", "deadline": "N/A", "location": "The Hong Kong University of Science and Technology, Clear Water Bay , Hong Kong", "city": "N/A", "country": "Hong Kong", "position": "Researcher", "field": "Algorithms, Artificial Intelligence, Artificial Neural Network, Big Data, Computational Engineering, and 29 moreComputational Sciences,Computer Architecture,Computer Communications (Networks),Computer Engineering,Computer Graphics,Computer Vision,Computer and Society,Computing in Mathematics, Natural Science, Engineering and Medicine,Computing in Social science, Arts and Humanities,Cyber Security,Data Mining,Data Structures,Databases,Distributed Computing,Educational Leadership,Educational Management,Game Design,Human-computer Interaction,Informatics,Information Science,Information Systems (Business Informatics),Machine Learning,Machine Vision,Operating Systems,Parallel Computing,Programming Languages,Quantum Computing,Software Engineering,Theory of Computation", "salary": "N/A", "max_working_hours": "N/A", "employer": "Hong Kong University of Science and Technology (HKUST)", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p><strong>The University</strong></p><p>Founded in 1991, The Hong Kong University of Science and Technology (HKUST) is a world-renowned international research university dedicated to the advancement of learning and scholarship, with special emphasis on postgraduate education and close collaboration with industry, business, and government.  It promotes interdisciplinary studies and is dedicated to educating all-rounded students to acquire a strong entrepreneurial spirit and innovative thinking with a global outlook.  While the University is deeply rooted in Hong Kong, HKUST (GZ campus) is being developed in Guangzhou, Mainland China to complement the well-established disciplinary foundation at HKUST (Clearwater Bay campus).  HKUST (GZ campus) has established 4 transdisciplinary hubs and 16 thrust areas to achieve maximum synergy in education and research. With its short history, HKUST has established a strong presence in the global higher education scene and has been ranked among the top universities by QS Universities Rankings and the Times Higher Education Supplement.  English is the medium of teaching, research and administration. </p><p>HKUST is committed to increasing the diversity of its faculty and has a range of family-friendly policies in place.</p><p><strong>The Department</strong></p><p>The Department of Computer Science and Engineering (CSE) currently has 61 faculty members, teaching about 840 undergraduate students and 390 postgraduate research students.  The Department conducts comprehensive teaching and research programs in both basic and applied aspects of Computer Science and Engineering.  The academic degrees offered by the Department are: BEng, BSc, MSc, MPhil and PhD. Research activities in the department are broadly categorized into artificial intelligence; cybersecurity; data, knowledge and information management; human-computer interaction; networking and computer systems; software engineering and programming languages; theoretical computer science; vision and graphics.</p><p><strong>The Role</strong></p><p>Reporting to the Dean of Engineering, the Head of CSE is expected to provide leadership and manage the Department in its diverse academic and administrative functions.</p><p><strong>Terms &amp; Applications / Nominations</strong></p><p>Concurrent with a professorial appointment, the appointment as Head will normally be for an initial term of 3 years, and may be renewable for a second term.  Competitive remuneration and generous fringe benefits, including housing where appropriate, will be provided.  Outstanding faculty joining the university will be considered for nomination of the Global STEM Professorship Scheme sponsored by the Government of the Hong Kong Special Administrative Region.  Awardees under the Scheme will be offered a highly competitive package to establish his/her research program in Hong Kong, including the setup of first-rate laboratories and recruitment of research support personnel.</p><p>Applications/nominations for the position are invited from well-qualified and accomplished scholars. In addition to reputable academic qualification, extensive teaching and research experience, the successful candidate must have demonstrated capability to provide strong leadership at the tertiary level.  Proven capacity to interact effectively with government, industry and commercial sectors is an advantage. </p><p>Applications/nominations, together with full curriculum vitae, and names and email addresses of three referees, should be sent to the Search Committee Chair for Headship of CSE (email: <a href=\"mailto:dhcse@ust.hk\">dhcse@ust.hk</a>), HKUST, Clearwater Bay, Kowloon, Hong Kong. Review of applications will start from mid-March 2022 and the search will continue until the position is filled.</p><p>For more information about the University, the School of Engineering, and the CSE Department, please visit <a href=\"https://hkust.edu.hk/\" target=\"_blank\">https://hkust.edu.hk/</a>, <a href=\"https://seng.hkust.edu.hk/\" target=\"_blank\">https://seng.hkust.edu.hk/</a>, and <a href=\"https://cse.hkust.edu.hk/\" target=\"_blank\">https://cse.hkust.edu.hk/</a> respectively.</p><p>(Information provided by applicants will only be used for recruitment and other employment-related purposes.)</p><p><strong>HKUST is an equal opportunities employer and is committed to our core values of inclusiveness, diversity, and respect.</strong></p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI4MTZcLzUwZFwvODE2NTBkODFhN2UzOTY2NWY0NGY1OWQ4YzJhZTJiNGUucG5nIiwiZWRpdHMiOltdfQ=="}