{"url": "https://academicpositions.com/ad/institute-of-advanced-research-in-artificial-intelligence/2022/research-opportunities-at-iarai/175089", "title": "Research opportunities at IARAI", "publish_date": "2022-02-09", "deadline": "N/A", "location": "LandstraÃ\u009fer HauptstraÃ\u009fe 5 Vienna, Austria", "city": "N/A", "country": "Austria", "position": "Researcher", "field": "Algorithms, Artificial Intelligence, Artificial Neural Network, Big Data, Computer Vision, and 4 moreComputing in Mathematics, Natural Science, Engineering and Medicine,Data Mining,Machine Learning,Theory of Computation", "salary": "N/A", "max_working_hours": "N/A", "employer": "Institute of Advanced Research in Artificial Intelligence (IARAI)", "job_description": "<div class=\"editor ck-content mt-6 mb-6 mb-md-8 mt-md-8\" id=\"editor\">\n<p>We announce year-round, open-topic, academic opportunities at the <i>Institute of Advanced Research in Artificial Intelligence </i>in Vienna, Austria (<a href=\"http://www.iarai.ac.at\" target=\"_blank\">www.iarai.ac.at</a>).</p><p>The Institute pursues both basic and applied research in Artificial Intelligence.</p><p>Critical analyses and fundamental studies seek novel insights that shape the future of our society. Key areas of research include:</p><ul><li><a href=\"https://www.iarai.ac.at/research/world-simulation/\" target=\"_blank\">World Simulation</a> â\u0080\u0093 We train in simulators by reinforcement learning or other meta-learning strategies to study climate change models, smart cities, sustainable mobility, fleet management, <i>etc</i>.</li><li><a href=\"https://www.iarai.ac.at/research/prediction-through-description/\" target=\"_blank\">Prediction through Description</a> â\u0080\u0093 We investigate the reliability and interpretability of modern machine learning models. We focus on high impact questions such as predicting patterns in urban traffic or large-scale rainfall, assessing climate change, biomedical image classification, and helping discover new drugs.</li><li><a href=\"https://www.iarai.ac.at/research/a-theory-of-ai/\" target=\"_blank\">A Theory of AI</a> â\u0080\u0093 We work towards a rigorous understanding of the success of the latest â\u0080\u0098black-boxâ\u0080\u0099 algorithms that is also intuitive to humans.</li></ul><p>Unique Opportunities</p><p>We are building a unique environment of world-class researchers and industrial-scale real-world data openly shared with the scientific community. We take a proudly interdisciplinary approach to bring together top talent from complementary fields, combining in-depth domain knowledge in AI, simulation, and geospatial analysis from academia and industry. All our research is open and published. <a href=\"https://www.iarai.ac.at/contact/\" target=\"_blank\">Contact us</a> to contribute and join us. We organize and sponsor scientific visits, research exchanges, multi-month thematic focus programmes, and academic competitions such as <a href=\"http://www.traffic4cast.org/\" target=\"_blank\">Traffic4cast</a> at NeurIPS.</p><p>We invite applications for<strong> Research Group Leader</strong></p><p><strong>All applications have to include:</strong></p><ul><li>a full academic curriculum vitae,</li><li>a concise statement of research interests (up to five pages) where you can outline your research plans.</li></ul><p><strong>The Role of a Research Leader entails:</strong></p><ul><li>Establish and pursue an internationally recognized, freely chosen, program of ambitious and innovative research,</li><li>Build, manage, and develop a small team of scientists and students, with the potential to expand in the future,</li><li>Foster mutually beneficial relationships and collaborations at IARAI, other academic institutions, and the wider community.</li></ul><p><strong>What we are looking for:</strong></p><ul><li>Outstanding researchers, with proven research skills and a strong track record, who would head a group and lead its research direction. </li><li>Highly motivated, self-driven, and inspired thinkers, prepared to take risks in identifying and addressing important scientific problems.</li><li>Minimum requirements are a Ph.D. degree in Computer Science, Mathematics, Physics, or related field. </li><li>Willingness to acquire external funding is welcome but it is not essential (the job post is not project-based)</li><li>Strong leadership complemented by the ability to collaborate.</li></ul><p><strong>What you can expect:</strong></p><ul><li>the freedom to pursue your ground-breaking academic research,</li><li>the stimulating atmosphere conducive to the development of science,</li><li>possibility  to collaborate with other world-leading scientific partners </li><li>our generous remuneration packages that include comprehensive family health care, substantial pension plans (EU-wide), relocation support, etc.</li></ul><p>In the Heart of Europe</p><p>We work right in the city centre of <a href=\"https://www.britannica.com/place/Vienna\" target=\"_blank\">Vienna</a>, next to a <a href=\"https://www.city-walks.info/Vienna/Stadtpark.html\" target=\"_blank\">public park</a>, shared bike terminals, metro, and train stations. The airport is just 15 minutes by direct train. Come <a href=\"https://www.iarai.ac.at/contact/\" target=\"_blank\">visit us</a>!</p><p>Living and working in Vienna benefits from the outstanding services provided by the city and the state (strong public health service, exemplary public transport, â\u0080¦). There moreover is a wide range of recreation opportunities in easy reach, within the city or in the Vienna Woods, the Burgenland lake district, and the Semmering alpine mountain range. Together with the rich and varied <a href=\"http://www.wien.gv.at/english/culture/\" target=\"_blank\">cultural choices</a> on offer, they contribute to the high value of <a href=\"http://www.wien.gv.at/english/leisure/\" target=\"_blank\">leisure</a> time in Vienna. Residents form a very international community â\u0080\u0093 about two in five of the 1.9 million people living here came from abroad. The outstanding quality of life that attracts people to Vienna is regularly reflected in international studies, which consistently rank Vienna within the top three cities for general quality of life worldwide (<a href=\"https://www.wien.info/en/lifestyle-scene/most-livable-city\" target=\"_blank\">Vienna Tourism</a>, <a href=\"https://www.mercer.com/newsroom/2019-quality-of-living-survey.html\" target=\"_blank\">Mercer Consulting</a>) and as leading <a href=\"https://www.wien.info/en/vienna-for/smart-city-vienna\" target=\"_blank\">smart city</a> (<a href=\"https://www.rolandberger.com/en/Publications/Smart-City-Strategy-Index-Vienna-and-London-leading-in-worldwide-ranking.html\" target=\"_blank\">Roland Berger</a>).</p><p>Scientists do not need a work permit in Austria. A residency permit is required but granted automatically for researchers at universities and institutes.</p>\n</div>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJ1cGxvYWRzXC9pdGlxOTUwYnZURVBXbzRlanhKdXJ1SXlUQ1E5ajFaclpaSDRFMG00LnBuZyIsImVkaXRzIjpbXX0="}