{"url": "https://academicpositions.com/ad/university-brunei-darussalam/2022/we-are-looking-for-academics/174254", "title": "We are Looking for Academics", "publish_date": "2022-01-20", "deadline": "2022-02-26", "location": "Jalan Tungku Link Bandar Seri Begawan, Brunei", "city": "N/A", "country": "Brunei", "position": "Other Category", "field": "Economic Sociology, Energy Economics, Social Research, Social Stratification, Social Work, and 2 moreSociology,Welfare Economics", "salary": "N/A", "max_working_hours": "N/A", "employer": "University Brunei Darussalam", "job_description": "Universiti Brunei Darussalam (UBD) is a research-intensive university and the first university in Brunei, established in 1986. UBD is one of the fastest-growing young universities in the world and is currently ranked at 250 in the world QS Ranking and 22nd in the QS Top 50 under 50 world university rankings.Centre for Advanced Research (CARe) is a research centre within Universiti Brunei Darussalam that conducts empirical and comparative research on social issues in Brunei Darussalam and the region. Its research focuses clusters on three clusters: â\u0080\u009cYouth and the Economyâ\u0080\u009d, â\u0080\u009cWelfare and Povertyâ\u0080\u009d, â\u0080\u009cHealth and Ageingâ\u0080\u009d. CARe is driven by a team of dynamic researchers and provides excellent administrative support.As part of the Centreâ\u0080\u0099s strategic plan, CARe is expanding its research and academic capacity. Accordingly, we invite applications for these three positions:Labour EconomistSociologist or Anthropologist specialized in Poverty &amp; WelfareEconomist specialized in Poverty &amp; WelfareClosing date for application will be on 26th February 2022For more information please visit the link below for more information and application:https://ubd.edu.bn/about/career-opportunities/academic-positions/career-care/", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Over the past decade Universiti Brunei Darussalam has been on an exciting progressive journey of change, from what is fundamentally a teaching university to a first class international university of excellence in teaching and research.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiI3ZWNcL2E1MFwvN2VjYTUwOWI3YmY2ZjljMGI3NGIwNmNkODMwNjNiNDAucG5nIiwiZWRpdHMiOltdfQ=="}