{"url": "http://www.academictransfer.com/en/308862/technisch-teamleider/apply/", "title": "Technisch teamleider", "publish_date": "2022-02-01", "deadline": "2022-02-18", "location": "Rapenburg 70, 2311 EZ, Leiden", "city": "Leiden", "country": "Netherlands", "position": "Engineer/Technician", "field": "N/A", "salary": "N/A", "max_working_hours": "N/A", "employer": "Leiden University", "job_description": "<p>Studenten- en Onderwijszaken (SOZ), afdeling Centre for Innovation, is op zoek naar een:</p><p><strong>Technisch teamleider</strong></p><p>Bij het Centre for Innovation (CFI) werken we als multidisciplinair team samen aan innovatieve oplossingen om onderwijs, onderzoek en de samenleving in het algemeen te verbeteren. Als teamleider van het Data Intelligence team stuur je een klein team aan met verschillende technische achtergronden (data-analisten, UX/backend/frontend, XR-ontwikkelaars), speel je een rol in de strategieontwikkeling binnen het CFI, structureer je het softwareontwikkelproces en ondersteun je de teamleden bij het bereiken van hun professionele doelen.</p><p>Naast je rol als teamleider ben je betrokken bij projecten en speel je een belangrijke rol in het ontwikkelen, implementeren en ondersteunen van de mogelijkheden van het CFI op het gebied van data gedreven applicaties. Jouw taak bestaat uit het oplossen van uiteenlopende problemen.&nbsp;</p><p><strong>Wie zoeken we?&nbsp;&nbsp;</strong></p><p>Je hebt werkervaring in softwareontwikkeling of data science, waardoor je de kansen en uitdagingen begrijpt die komen kijken bij het werken op deze gebieden en succesvolle projecten aflevert. Je hebt goede relaties met externe partijen en bent betrokken geweest bij projectacquisitie. De afgelopen jaren heb je de overstap gemaakt naar een supervisie- of managementrol, maar je vindt het nog steeds leuk om af en toe je handen uit de mouwen te steken en op de hoogte te blijven van de nieuwste technologie&euml;n.&nbsp;</p><p>Je rapporteert aan de directeur van het CFI en hebt regelmatig overleg met de teamleiders van de andere teams binnen het Centre (Operations, Learning, Media, en Project Management teams).</p><p><strong>Belangrijkste verantwoordelijkheden</strong></p><ul> <li>Van de kandidaat wordt verwacht dat hij/zij</li> <li>Leiding geeft aan een team van zelfsturende professionals met verschillende technische achtergronden en hen ondersteunt in hun professionele ontwikkeling.</li> <li>Het team coacht, begeleidt en ontwikkelt, onder andere door toezicht te houden op de onboarding van nieuwe medewerkers en door carri&egrave;replanning en -mogelijkheden aan te bieden.</li> <li>Werknemers in staat stelt verantwoordelijkheid te nemen voor hun baan en doelstellingen, alsmede verantwoordelijkheden te delegeren en regelmatig feedback te geven.</li> <li>De workflow voor softwareontwikkeling beheert en verbetert.</li> <li>Samen met het team een strategie ontwikkelt rondom data en AI binnen het Centre for Innovation.</li> <li>Het Centre for Innovation vertegenwoordigt in technische werkgroepen binnen de Universiteit Leiden.</li> <li>Een netwerk van data en AI gerelateerde partners opbouwt binnen en buiten de Universiteit Leiden.</li> <li>Zowel aan bestaande producten werkt als nieuwe projecten voorstelt binnen het thema Data en AI, voor verschillende stakeholders. Bijvoorbeeld de Universiteit Leiden maar ook potenti&euml;le externe partners in domeinen waaronder het onderwijs.</li> <li>Werkt in een interdisciplinair team met technische, didactische, media- en projectmanagementexperts aan projecten die de leerervaring voor studenten verbetert, docenten ondersteunt en een maatschappelijke impact heeft.</li> <li>De missie van het Centre for Innovation en de Universiteit Leiden uitvoert en helpt realiseren.</li> <li>Bijdraagt aan de open-source gemeenschap, met veel vrijheid om naar eigen inzicht programmeertalen en tools te kiezen.&nbsp;</li> <li>Bestaande technologie&euml;n/bibliotheken van het Centrum beheert.</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.universiteitleiden.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/lei-en-wide/f66e61a821cf3294ef5ce4fcaacbdedb.png"}