{"url": "https://academicpositions.com/ad/university-of-agder-uia/2022/post-doctoral-research-fellow-in-robotics-deep-learning-and-control/175026", "title": "Post-Doctoral Research Fellow in robotics, deep learning and control", "publish_date": "2022-02-08", "deadline": "2022-02-28", "location": "Gimlemoen 25 Kristiansand, Norway", "city": "N/A", "country": "Norway", "position": "PhD", "field": "Artificial Intelligence, Artificial Neural Network, Computer Communications (Networks), Computer Vision, Control Systems Engineering, and 6 moreElectrical Engineering,Machine Learning,Mechanical Engineering,Mechatronics,Robotics,Signal Processing", "salary": "N/A", "max_working_hours": "N/A", "employer": "University of Agder (UiA)", "job_description": "About the positionThe Faculty of Engineering and Sciences at the University of Agder (UiA) has a joint Post-Doctoral Research Fellow position available within the fields of Deep Reinforcement Learning, Robotics and Cooperative Control. The position is within the Norwegian Research Council Long-term research project \"Collective Efficient Deep Learning and Networked Control for Multiple Collaborative Robot Systems (DEEPCOBOT)\". The position is located at Campus Grimstad and will be shared among the Department of Engineering Sciences (50%) and the Department of Information and Communication Technology (50%), for a period of two years. The start date is negotiable with the Faculty.The overall goal of the DEEPCOBOT project is the design of a new generation of decentralized data-driven deep learning-based controllers for multiple coexisting collaborative robots (cobots), which can interact both between themselves and with human operators in order to collectively learn from each otherâ\u0080\u0099s experiences and perform cooperatively different complex tasks in a large-scale industrial process environment. The project is motivated by the increasing demand of automation in industry, especially the demand of a safer, more intuitive, more comfortable and more efficient collaboration between multiple cobots and human operators to integrate the best of human abilities (creativity, adaptivity, interaction) and robotic automation (speed, reliability, precision and inexhaustible task execution capability), while being robust across different environments and human operators. This project will lead to several important advances in the areas of machine learning, decentralized control for cobots, graph signal processing, design of cross-layer network protocols for distributed computation and collective intelligence across multiple cobots.The position will cover theoretical advancements, algorithm design, as well as simulation and experimental evaluation, on two of the following research topics:1)&nbsp;&nbsp;&nbsp; Deep learning algorithms for the cobots to infer and predict the motion of human operators interacting with them, including also interpretable, active and transfer learning methods to speed up the learning process and the corresponding shared control strategies guiding the interaction between the cobot and human operators.2)&nbsp;&nbsp;&nbsp; Decentralized local controllers at the cobots using the reinforcement learning framework, where each cobot learns both from its local information and from other information about other cobotsâ\u0080\u0099 learning process in the neighborhood.3)&nbsp;&nbsp;&nbsp; Graph signal processing algorithms, graph neural networks and cross-layer network protocols to provide the required diffusion of information across the cobots so that both the deep learning process is efficient and stable, and the testing running phase is also executed correctly, satisfying the real-time and safety constraints, and minimizing energy consumption.The project will be integrated in two Centers at UiA, namely, the Top Priority Research Center of Mechatronics and the NFR-Toppforsk funded WISENET Center at UiA, where the Post-Doctoral Research Fellow will benefit intellectually from the interaction with internationally recognized researchers, well-equipped environments and will build on and strengthen the established cooperation in AI, Machine Learning, industrial robotics, and autonomous networked cyber-physical systems with industry partners, such as ABB Norway, Mechatronics Innovation Lab (MIL), Omron Electronics Norway, and international partners including University of California San Diego (USA), KTH Royal Institute of Technology (Sweden) and the University of Navarra (Spain). The project will give also the opportunity to pay extended visits to Universities in USA, Sweden and Spain. The&nbsp;robots&nbsp;used in this project&nbsp;are TIAGo robot, UR5 cobot, and ABB Yumi cobot.Required qualificationsTo be regarded as an eligible applicant, the candidates must have:A PhD in either Robotics, ICT, Mechatronics, Control, Mechanical Engineering, Electrical Engineering, Computer Science, or other related disciplines. Having a PhD thesis on a topic specifically related to the position is an advantage. It is desirable that the applicant has defended her/his doctoral thesis within the last five years.Candidates who are in the final stages of their PhD-project might be assessed. It is a prerequisite that the candidate can document an obtained PhD before the hiring process is completed.Written and spoken English proficiency.The candidate must have expertise in the following areas:Efficient deep learning and reinforcement learningAdvanced control theoryRoboticsIn addition, the candidate is expected to have good programming skills or experience in Python, Matlab, C/C++, Robot Operating System (ROS), and relevant tools (e.g. Tensorflow, Keras, PyTorch, github).Further provisions relating to the position as Post-Doctoral Research Fellow can be found in the&nbsp;Regulations Concerning Terms and Conditions of Employment for the post of Post-Doctoral Research Fellow, Research Fellow, Research Assistant and Resident.Desired qualificationsAdditional solid knowledge and experience in some of the following areas will be a plus:Advanced Optimization techniques.Robot-related instrumentation and sensors.Computer vision.Graph signal processing, graph neural networks.Wireless sensor networks and cyber-physical systemsNetwork communication protocols in industrial robotic environments.The publication of scientific papers on high impact journals and first-class international conferences related to these topics will be taken into account positively, as well as the previous participation in other national or international projects related to the topics above.Personal qualitiesScientific ambition, curious to learn and explore.Quick learner, motivated and strong interest in cutting-edge research.Good analytical, problem-solving and experimental skills.Strong academic credentials.Excellent written and spoken English language skills.Capacity for goal-oriented work and ability to concentrate.Good communication and team-working skills, inventiveness and a proactive attitude.Capacity also to perform independent researchWe offerWorld-class research facilities and the opportunity to work in a world-class research organisation with an excellent research environment. You will collaborate with top scientists in your field and have excellent prospects for personal development in an innovative working environment for aspiring researchers.Positive, inclusive and diverse work environment.Modern facilities and a comprehensive set of welfare offers.Professional development in a large, exciting and socially influential organisation.Membership of the Norwegian Public Service Pension Fund.A post-Doctoral research position should function as an intermediate step in the research career following the completion of a PhD degree and preceding a faculty position in a university. For this reason, our Centers are committed to offering the suitable environment and activities that allow the post-doctoral researcher to: (i) consolidate her/his research maturity, (ii) develop her/his teaching and supervision skills by working and co-advising PhD students, and (iii) build up a solid resume that facilitates her/his incorporation to the academia as an assistant or associate professor.More about working at UiA.Information about why UiA provides an excellent working environment can be found here.The position is remunerated according to the State Salary Scale, salary plan 17.510, code 1352 Post-Doctoral Research Fellow, NOK 544&nbsp;400-565&nbsp;500 gross salary per year. Higher salary grades may be considered for particularly well-qualified applicants. A compulsory pension contribution to the Norwegian Public Service Pension Fund is deducted from the pay according to current statutory provisions.General informationUiA is an open and inclusive university. We believe that diversity enriches the workplace and makes us better. We, therefore, encourage qualified candidates to apply for the position independent of gender, age, cultural background, disability or an incomplete CV.Women are strongly encouraged to apply for the position.&nbsp;The successful applicant will have rights and obligations in accordance with the current regulations for the position, and organisational changes and changes in the duties and responsibilities of the position must be expected. The engagement is to be made in accordance with the regulations in force concerning the acts relating to&nbsp;Control of the Export of Strategic Goods, Services and Technology. Appointment is made by the University of Agderâ\u0080\u0099s Appointments Committee for Teaching and Research Positions.Short-listed applicants will be invited for interview. With the applicantâ\u0080\u0099s permission, UiA will also conduct a reference check before appointment.&nbsp;More about the employment process.In accordance with the Freedom of Information Act Â§ 25 (2), applicants may request that they are not identified in the open list of applicants. The University, however, reserves the right to publish the names of applicants. Applicants will be advised of the Universityâ\u0080\u0099s intention to exercise this right.&nbsp;ApplicationThe application and any other necessary information about education and experience (including diplomas and certificates) are to be sent electronically only. Use the link \"Apply for this job\".The following documentation shall be submitted as attachments to the online application:CV with a complete list of scientific publications, indicating the main five scientific publications which the candidate wishes to particularly emphasise for the assessment process.Certificates and transcripts with grades (Bachelor, Master and PhD).A one-page summary of the PhD dissertation and electronic copy of your PhD thesis or link.Justification (maximum five pages) of the background of the candidate for the requirements of the position (see description above about the knowledge areas that a candidate should have).Project plan (maximum two pages) proposed by the candidate in relation to this post-doctoral position.Names and contact information of two reference persons.Any other relevant documentation.The applicant is fully responsible for submitting complete digital documentation before the closing date.&nbsp;All documentation must be available in a Scandinavian language or English.Application deadline: 28.02.22ContactFor questions about the position:Professor Jing Zhou, tel. +47 37 23 31 91, e-mail jing.zhou@uia.noProfessor Baltasar Beferull Lozano, tel. +47 37 23 31 59, e-mail baltasar.beferull@uia.noFor questions about the application process:Higher Executive Officer Lise Askbo Fylkesnes, tel. +47 37 23 31 25, e-mail:&nbsp;lise.a.fylkesnes@uia.no", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "The University was officially established in 2007, but has a history dating back to 1839, and was formerly known as Agder University College.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjNWRcLzYyOFwvYzVkNjI4MGVhN2ZjMjA3MDU2ZWRkZjU0YjAwMGRlNzYucG5nIiwiZWRpdHMiOltdfQ=="}