{"url": "http://www.academictransfer.com/en/308483/traffic-manager/", "title": "Traffic manager", "publish_date": "2022-01-20", "deadline": "2022-03-06", "location": "Lange Viestraat 6, 3511 BK, Utrecht", "city": "Utrecht", "country": "Netherlands", "position": "Other Category", "field": "N/A", "salary": "N/A", "max_working_hours": "32", "employer": "AcademicTransfer", "job_description": "<p>Als traffic manager ga je je breed bezighouden met alle aspecten van een vacaturebank: van klantcontacten, vacature-invoer, adviezen over onze producten en tools voor recruiters, aansturing van flexpool medewerkers en een beperkt aantal administratieve taken.&nbsp;&nbsp;</p><p>Bij veel andere organisaties zou deze functie als &ldquo;sales&rdquo; worden aangeduid, en soms doen wij dat intern ook. Want je bent verantwoordelijk voor de omzet van het verkopen van vacatureplaatsingen aan klanten buiten de co&ouml;peratie. Wij noemen het liever ServicesNL - service aan niet-leden -, want service verlenen aan klanten is het belangrijkste aspect van je functie. AcademicTransfer hoeft nauwelijks aan cold-calling te doen om vacatureplaatsingen te verkopen, organisaties zoals hogescholen en onderzoeksinstellingen uit het bedrijfsleven weten ons feilloos te vinden. Ze blijven graag terugkomen op basis van onze goede adviezen, meedenken en resultaten. En daar ben jij een kei in.</p><p><strong>Jouw taken</strong></p><ul> <li>voeren van adviesgesprekken met klanten over hun wervingsstrategie</li> <li>vacatures op ons platform plaatsen en bevestigen aan klanten</li> <li>analyseren van klantgedrag</li> <li>opstellen en/of aanvragen van media-adviezen</li> <li>adviseren over inzet van nieuwe wervingstools</li> <li>aansturen van een kleine flexpool voor vacature-invoer en het bewaken van het vacature-invoerproces, als meewerkend voormens</li> <li>administreren van klantcontracten en financi&euml;le administratie voorzien van benodigde facturatiegegevens</li> </ul>", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "N/A", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "http://www.academictransfer.com", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/academictransfer-en-wide_C6sSPAt/cfc6a58f348a7935190532022f7bb7c5.jpg"}