{"url": "https://www.academictransfer.com/en/309353/two-phd-candidates-in-climate-physics-08-10-fte/apply/", "title": "Two PhD candidates in Climate Physics (0.8 - 1.0 FTE)", "publish_date": "2022-02-11", "deadline": "2022-04-11", "location": "Domplein 29, 3512 JE, Utrecht", "city": "Utrecht", "country": "Netherlands", "position": "PhD", "field": "Natural sciences", "salary": "â\u0082¬2443â\u0080\u0094â\u0082¬3122 per month", "max_working_hours": "30—40", "employer": "Utrecht University", "job_description": "<p>This is a unique opportunity to pursue your own research idea in the field of climate physics and turn it into a PhD degree at Utrecht University! We invite applicants to develop a research idea in the field of climate physics that fits in one of the research themes of <a href=\"https://www.uu.nl/en/research/imau/research\">IMAU</a>. With your idea, contact a relevant IMAU staff member from this <a href=\"https://www.uu.nl/en/research/institute-for-marine-and-atmospheric-research-imau/two-phd-vacancies-in-climate-physics\">list,</a> who you envisage as the person to act as your daily supervisor. When you reach an agreement on the topic, together you submit a short proposal of max. 1,000 words (not including references) with a relevant figure. The proposal should include:</p> <ul> <li>a project title;</li> <li>background and relevance;</li> <li>methods, timeline, collaborators and (co-)promotors.</li> </ul> <p>Also please add a brief (max. one page) motivation letter, a short two-page CV that includes your MSc course and grade list, and a reference other than your IMAU supervisor.<br><br>Proposals will be judged based on proposal quality and applicant CV (both 50%). As a PhD candidate at the Department of Physics of Utrecht University, you are expected to spend approximately 10% of your time on teaching activities. This usually entails supervising class tutorials in the Bachelor's of Physics or the Climate Physics Master's programmes.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>We are looking for enthusiastic PhD candidates, who are keen to tackle outstanding problems in climate physics, whether they be theoretical, practical, or methodological. You are a fast learner, curious, and youÂ  have a broad interest. You possess an excellent command of English, both in writing and speaking. Applicants, currently enrolled in the Climate Physics Master's at Utrecht University should graduate no later than 1 September 2022. Other applicants must already hold a recently awarded MSc degree in climate physics, earth sciences, physics, applied mathematics or related fields.</p>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<ul>\n<li>a full-time position for 4 years (5 years 0.8 FTE is negotiable);</li>\n<li>an inspiring, open-minded research group at IMAU;</li>\n<li>a job with national and international collaborations;</li>\n<li>a full-time gross salary that starts at â\u0082¬2,443 and increases to â\u0082¬3,122 per month in the fourth year (scale P of the Collective Labour Agreement Dutch Universities);</li>\n<li>8% holiday bonus and 8.3% end-of-year bonus;</li>\n<li>a pension scheme, partially paid parental leave, and <a href=\"https://www.uu.nl/en/organisation/working-at-utrecht-university/terms-of-employment\">flexible employment conditions</a> based on the Collective Labour Agreement Dutch Universities (cao).</li>\n</ul>\n<p><br/>In addition to the employment conditions laid down in the cao for Dutch Universities, Utrecht University has a number of its own arrangements. For example, there are agreements on professional development, leave arrangements, and sports. We also give you the opportunity to expand your terms of employment via the Employment Conditions Selection Model. This is how we like to encourage you to continue to grow.<br/><br/>More information about working at the Faculty of Science can be found <a href=\"https://www.uu.nl/en/organisation/working-at-the-faculty-of-science?utm_source=fundamental-connections&amp;utm_medium=printuitingen\">here</a>.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p><a href=\"https://www.uu.nl/en/research/institute-for-marine-and-atmospheric-research-imau\">The Institute for Marine and Atmospheric Research Utrecht (IMAU)</a> offers an attractive research and teaching environment, in which the fundamentals of the climate system are studied. Research is organized in themes: Atmospheric Dynamics, Atmospheric Physics and Chemistry, Coastal and Shelf Sea Dynamics, Ice and Climate, Oceans and Climate and Earth System Modelling. In 2017, IMAU research quality and impact were qualified as 'world leading' by an international visitation committee. Currently, IMAU employs 20 faculty members and 10 support staff, and about 20 Postdocs and 30 PhD candidates.<br/><br/>At the <a href=\"https://www.uu.nl/en/organisation/faculty-of-science\">Faculty of Science</a>, there are 6 departments to make a fundamental connection with: Biology, Chemistry, Information and Computing Sciences, Mathematics, Pharmaceutical Sciences and Physics. Each of these is made up of distinct institutes that work together to focus on answering some of humanityâ\u0080\u0099s most pressing problems. More fundamental still are the individual research groups â\u0080\u0093 the building blocks of our ambitious scientific projects.Â <br/><br/><a href=\"https://www.uu.nl/en\">Utrecht University</a> is a friendly and ambitious university at the heart of an ancient city. We love to welcome new scientists to our city â\u0080\u0093 a thriving cultural hub that is consistently rated as one of the worldâ\u0080\u0099s happiest cities. We are renowned for our innovative interdisciplinary research and our emphasis on inspirational research and excellent education. We are equally well-known for our familiar atmosphere and the can-do attitude of our people. This fundamental connection attracts researchers, professors and PhD candidates from all over the globe, making both the university and the Faculty of Science a vibrant international and wonderfully diverse community.</p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>If you have any questions regarding the position, please contact <a href=\"https://www.uu.nl/staff/MRvandenBroeke\">Michiel van den Broeke</a>, via <a href=\"mailto:m.r.vandenbroeke@uu.nl\">m.r.vandenbroeke@uu.nl</a>.<br/><br/>Do you have a question about the application procedure? Please send an email to <a href=\"mailto:science.recruitment@uu.nl\">science.recruitment@uu.nl</a>.<br/><br/>Please note: Preferred starting time is in the summer or fall of 2022.</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.uu.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/uu-en-wide/67674af2e9b77c72917924b654f37798.jpg"}