{"url": "https://academicpositions.com/ad/imec/2022/process-engineer-early-late-shift/174877", "title": "Process Engineer (early-late shift)", "publish_date": "2022-02-04", "deadline": "N/A", "location": "Kapeldreef 75 Heverlee, Belgium", "city": "N/A", "country": "Belgium", "position": "Engineer/Technician", "field": "Applied Physics, Chemical Engineering, Industrial Engineering, Optics,", "salary": "N/A", "max_working_hours": "N/A", "employer": "imec", "job_description": "Guarantee the quality of the litho scanners and e-beam writer tools in our cleanroom, and own small research projects on these toolsWhat you will doAs Process Engineer, you will spend a part of your time in the cleanroom. You will start with a few months of training at imec Leuven. You will learn to operate the litho scanners and e-beam writer. You will learn how to execute and interpret machine tests that are needed to ensure the quality of the processed wafers. You will also gain experience with wafer metrology (such as electron microscopy) or tools that prepare the substrates (wafer track). We will teach you how to use the software of the litho tools, and how to process tool data using existing software routines.&nbsp;&nbsp;After your training, you will join the team of tool experts. You will define and handle small research projects on the litho scanners and e-beam writer, and will be responsible to monitor the quality of the tools. You will use your expertise to support less experienced tool users and work constructively with the tool supplier to understand issues and to plan repairs. You will correctly and timely execute the control cycles of the litho tools, organize your own work daily according to the agreed priorities, offer help to colleagues from R&amp;D, interpret data, ..&nbsp;What we do for youWe offer you the opportunity to join one of the worldâ\u0080\u0099s premier research centers in nanotechnology at its headquarters in Leuven, Belgium. With your talent, passion and expertise, youâ\u0080\u0099ll become part of a team that makes the impossible possible. Together, we shape the technology that will determine the society of tomorrow.We are committed to being an inclusive employer and proud of our open, multicultural, and informal working environment with ample possibilities to take initiative and show responsibility. In everything we do, your future colleagues are guided by the imec values of passion, excellence, connectedness and integrity. We commit to supporting and guiding you in this process; not only with words but also with tangible actions. Through imec.academy, 'our corporate university', we actively invest in your development to further your technical and personal growth.â\u0080¯&nbsp;We are aware that your valuable contribution makes imec a top player in its field. Your energy and commitment are therefore appreciated by means of a market appropriate salary with many fringe benefits.â\u0080¯&nbsp;Who you areMaster, or equivalent by experience, preferably in industrial engineering, physics, or chemistry (with specialization in process control).Experience in optical lithography, e-beam lithography or CD-SEM metrology is a plus.You can work on your own and are proactive.You are interested, or have experience, in process development in a high-tech cleanroom.You are willing to work in a dual-shift regime (early-late).You work accurately and have attention to detail.You are a fluent communicator and team player. Good knowledge of English.", "requirements_description": "N/A", "conditions_description": "N/A", "employer_description": "Imec is the world-leading research and innovation hub in nanoelectronics and digital technologies. The combination of our widely acclaimed leadership in microchip technology and profound software and ICT expertise is what makes us unique.", "department_description": "N/A", "additional_information": "N/A", "apply_link": "N/A", "employer_link": "N/A", "job_type": "N/A", "logo": "https://content.academicpositions.com/eyJidWNrZXQiOiJhcC1wcm9kdWN0aW9uLW1lZGlhLWFyY2hpdmUiLCJrZXkiOiJjZGRcL2E2ZFwvY2RkYTZkZTg0NDkzZDY0ZWEyODQwYWRkMzdmZDhiM2QucG5nIiwiZWRpdHMiOltdfQ=="}