{"url": "https://www.academictransfer.com/en/309388/two-early-career-researchers-in-structural-mechanics-numerical-and-experimental-study-on-assessment-of-masonry-city-infrastructure/apply/", "title": "Two Early-Career Researchers in Structural Mechanics: Numerical and Experimental Study on Assessment of Masonry City Infrastructure", "publish_date": "2022-02-11", "deadline": "2022-03-13", "location": "Mekelweg 2, 2628 CD, Delft", "city": "Delft", "country": "Netherlands", "position": "Researcher", "field": "Engineering", "salary": "â\u0082¬2846â\u0080\u0094â\u0082¬4490 per month", "max_working_hours": "N/A", "employer": "Delft University of Technology (TU Delft)", "job_description": "<p>In the Netherlands, there is an urgent need for assessing the remaining safety and reliability of existing masonry city infrastructures, such as quay walls and bridges, to prioritaising interventions. Assessors face multiple uncertainties and have to resort to general codes that is likely to induce conservatism and possible underestimation of the true safety, while in other cases overestimations may occur. For example, there is need for more guidance into the quasi-brittle nature of old multi-wythe masonry material behaviour and replacing linear-elastic based design checks by calibrated nonlinear computational models that better account for redistribution capacities and possible hidden reserves in the structures.</p> <p>For this project, we are looking for two full-time candidates, who will work in cooperation.</p> <p>One candidate will focus on the structural analysis of city infrastructures. A review of potential failure mechanics will be carried out at first, followed by selection of case studies to be analysed. Nonlinear finite element analyses based on continuum damage models will be performed, including parametric and sensitivity studies.</p> <p>The other candidate will perform experimental work to characterise the response of multi-wythe masonry, taking advantage of samples extracted from existing infrastructures. He/She will design and carry out various material characterisation tests for mortar, bricks and masonry (e.g. double punch test, core test, compression/shear/bending test on wallets/triplets).</p> <p>The candidate will work in the group of Structural Mechanics under the supervision of Dr Rita Esposito, Dr Francesco Messali and Prof Jan Rots. More information on the group can be found <a href=\"https://www.tudelft.nl/citg/over-faculteit/afdelingen/materials-mechanics-management-design-3md/sections-labs/applied-mechanics/chairs/structural-mechanics\">here</a>.</p>", "requirements_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Requirements</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>We are seeking a candidate with the following characteristics:</p>\n<ul>\n<li>A Masterâ\u0080\u0099s degree in Civil Engineering or a related field. If you are a doctorate holder please contact us to discuss possibility for your application.</li>\n<li>Independent and self-motivated, with the ability to work well with others</li>\n<li>Excellent communication skills (oral, written, presentation) in English. This can proven via a English proficiency certificate from TOEFL, IELTS or other equivalent institutions.</li>\n<li>For the candidate who will focus on the structural analysis, the knowledge of a finite element software package (preferably DIANA FEA) and of a programming language (preferably Python) is required. Experience with the numerical modelling of masonry structures is a plus.</li>\n<li>For the candidate who will focus on the experimental work, experience with laboratory testing for concrete or masonry is a plus.</li>\n</ul>\n</div>\n</div>", "conditions_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Conditions of employment</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>Salary and benefits are in accordance with the Collective Labour Agreement for Dutch Universities. The TU Delft offers a customisable compensation package, a discount on health insurance and sport memberships, and a monthly work costs contribution. Flexible work schedules can be arranged.</p>\n<p>For international applicants we offer the Coming to Delft Service and Partner Career Advice to assist you with your relocation. An International Children's Centre offers childcare and there is an international primary school.</p>\n</div>\n</div>", "employer_description": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Employer</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<h4>Delft University of Technology</h4>\n<p>Delft University of Technology is built on strong foundations. As creators of the world-famous Dutch waterworks and pioneers in biotech, TU Delft is a top international university combining science, engineering and design. It delivers world class results in education, research and innovation to address challenges in the areas of energy, climate, mobility, health and digital society. For generations, our engineers have proven to be entrepreneurial problem-solvers, both in business and in a social context. At TU Delft we embrace diversity and aim to be as inclusive as possible (see our <a href=\"https://www.tudelft.nl/en/about-tu-delft/strategy/integrity-policy/tu-delft-code-of-conduct/\">Code of Conduct</a>). Together, we imagine, invent and create solutions using technology to have a positive impact on a global scale.</p>\n<p>Challenge. Change. Impact!Â </p>\n</div>\n</div>", "department_description": "N/A", "additional_information": "<div class=\"_Section_Section_26Kh4ZAK\">\n<h2 class=\"_Section_title_2lZ2dR7H\">\n<span>Additional information</span>\n</h2>\n<div class=\"_Section_body_1yeeKPXy\">\n<p>For more information about this vacancy, please contact Rita Esposito (<a href=\"mailto:r.esposito@tudelft.nl\">r.esposito@tudelft.nl</a>) and Francesco Messali (<a href=\"mailto:f.messali@tudelft.nl\">f.messali@tudelft.nl</a>).</p>\n</div>\n</div>", "apply_link": "N/A", "employer_link": "http://www.tudelft.nl/", "job_type": "TEMPORARY", "logo": "https://www.academictransfer.com/media/derivatives/logos/tud-en-wide/4f5fb7eb63ad62ee5a7d5dfdc5376f8f.gif"}