{"name": "2021 04 10 brain tumor classification mlii final ", "full_name": " h1 Final project Machine Learning h3 MANIPULATING DATA h3 PREDICTION USING CNN ", "stargazers_count": 0, "forks_count": 0, "description": "In the no tumor case it s easy to see that there s no presence of a blob of any sort. Importing libraries We import the data that s stored online in the server itself. we will investigate if this needs to be a multi class classification problem xx We note above that the image sample was oriented correctly. 25 test split PREDICTION USING CNN We create a CNN using a standard setup of components that was used in the MNIST work. The meninges are membranes that surround your brain and spinal cord. We tried different configurations but it s not easy to calibrate a model. One thing to note is that our work has been model centric and not data centric i. We explored the data and addressed issues related to not having enough images in the dataset. Meningioma tumors are the most common types of brain tumors. Note that the tumors are broken into four categories The training data has an image count of 2296 The test data has an image count of 574 i. Trying different combinations of models is the only way to get to a good result We tried a few different cost functions and optimisers but using Adam and relu worked best In the United States approximately 54 000 people will receive a brain tumor diagnosis this year. Final project Machine Learning Project Completed by Prashant Khorana Leonce Ogoussan and Darshan Padmanabhan Executive summary Our objective was to investigate the brain tumor MRI data set and build a deep learning model using some of the concepts learned from this module. In order to speed up diagnoses and limit human error it is beneficial to use machine learning to indentify the type of brain tumors that shows up when the brain is scanned via an MRI. MANIPULATING DATA Note that augmentation of the data is needed to ensure that the sample is balanced and the model works on images that are flipped visually Creating the training data set We now load the images into a greyscale image array and that forms our baseline training and test data. Pituitary tumors are tumors that begin in the pituitary gland of the brain. A much deeper understanding of CNN hyper parameters is needed to build a good model. Note that not all image samples are flipped correctly Let us explore some sample images from all four categories Glioma tumors are tumors that start in the glial cells in the brain. We tested several different models and eventually settle on a model using a Convolutional Neural Net CNN with a relu activation function. Using a data source from Kaggle our team focused on a dataset of images of the different types of brain tumors. Glioma tumors represent 30 of all brain tumors. Meningioma tumors are tumors that grow in the meninges. The prognosis of a patient is very tied to the type of brain tumor. The features go into X and the labels go into y. This model achieved a 90 accuracy score on classify the tumorous and non tumorous images in the dataset. That would go beyond the scope of this study. Glial cells are non neuronal cells. Most pituitary tumors are benign growths. We have the following components for our CNN We have a sequential mode We use relu as an activation function We use same padding We also use a 2d layer and dropouts in the 20 30 range Now we flatter the model images add a dense layer and use dropouts Let us try another model with some other combinations I ve used a smaller batch size for this version Let us try a different optimiser for this version convert to one hot encoding. There are three major types of brain tumors Glioma Meningioma and Pituitary tumors. The data is broken down into a training folder and a test folder We load the data into a data directory and a categories directory Let s see how many categories there are. The nature of deep learning is such that there s no obvious way to configure a good model. why didn t manually investigate all the data to check for labeling errors. ", "id": "prashantkhorana/2021-04-10-brain-tumor-classification-mlii-final", "size": "4003", "language": "python", "html_url": "https://www.kaggle.com/code/prashantkhorana/2021-04-10-brain-tumor-classification-mlii-final", "git_url": "https://www.kaggle.com/code/prashantkhorana/2021-04-10-brain-tumor-classification-mlii-final", "script": "Flatten sklearn.metrics keras.preprocessing.image keras.layers keras.callbacks train_test_split Dropout Sequential MaxPool2D to_categorical # convert to one-hot-encoding Adam keras.utils.np_utils Conv2D seaborn numpy ReduceLROnPlateau sklearn.model_selection confusion_matrix ImageDataGenerator matplotlib.pyplot RMSprop Dense pandas create_training_data keras.optimizers to_categorical matplotlib keras.models ", "entities": "(('when brain', 'MRI'), 'be') (('it', 'sort'), 's') (('nature', 'obvious good model'), 'be') (('test data', '574 i.'), 'note') (('model', 'dataset'), 'achieve') (('that', 'meninges'), 'be') (('Using', 'brain tumors'), 'focus') (('54 approximately 000 people', 'brain tumor diagnosis'), 'be') (('us', 'one hot encoding'), 'have') (('That', 'study'), 'go') (('We', 'dataset'), 'explore') (('Glioma tumors', 'brain tumors'), 'represent') (('categories s', 'data directory'), 'break') (('Meningioma tumors', 'brain most common tumors'), 'be') (('MRI data', 'module'), 'Project') (('We', 'relu activation function'), 'test') (('that', 'MNIST work'), 'use') (('it', 'model'), 'try') (('didn why t', 'labeling errors'), 'investigate') (('that', 'online server'), 'import') (('that', 'baseline training'), 'note') (('that', 'brain'), 'note') (('prognosis', 'brain tumor'), 'be') (('much deeper understanding', 'good model'), 'need') (('labels', 'y.'), 'go') (('that', 'brain'), 'be') ", "extra": "['biopsy of the greater curvature', 'patient', 'test', 'diagnosis']"}