{"name": "an essential foundation to build smart nation ", "full_name": " h1 Comparative Analysis on AI and ML between High Income Countries and Middle Income Countries h2 Introduction h2 High and Middle Income Countries Definition h2 Profile of Respondents h2 Results h2 Conclusion h2 Reference ", "stargazers_count": 0, "forks_count": 0, "description": "Therefore there is a pressing need for policy makers of all levels of economy to find a solution to this inevitable future. g Malaysia and South Africa LMIC by 12 countries coloured in blue e. LI as well as middle income nations may no longer be able to count on low cost manufacturing as their booster for rapid growth and likely struggle to add value to ML. A widely respected firm PWC from the United Kingdom UK published The economic impact of artificial intelligence on the UK economy in 2017 claiming that there will be significant gains across all UK region as an impact from AI in 2030 at least as large as 5 of GDP and extra spending power per household of up to 1 800 2 300 a year by 2030. For 1st July 2019 until the following year High Income Country HIC economies are countries with GNI per capita exceeding 12 376 while Upper Middle Income Country UMIC with GNI per capita ranging from 3 996 to 12 375 Lower Middle Income Country LMIC with GNI per capita ranging from 1 026 to 3 995. We are now looking at income group countries against yearly compensation group. Meanwhile for the LMIC their involment just started to growth. 9 are UMIC and the rest LMIC. With that in mind let s think about how ML can help the economy Intuitively and supported by the findings in their 2017 report by PWC UK better productivity From this survey result showed 30 countries are HIC coloured in yellow e. Comparative Analysis on AI and ML between High Income Countries and Middle Income Countries https blogs. ML focuses on the development of computer programs that can access data and use it learn for themselves. It shows most of the respondent from LMIC had exprienced in using the application less than a year. However for HIC and UMIC their level of education is one step higher which is Master s degree because we believe other than experience level of educations also play a big role for one s to secure a job in the HIC and UMIC. Specifically ML addresses the question of how to build computers that improve automatically through experience. High and Middle Income Countries DefinitionAccording to the World Bank there are 4 income groups low income lower middle upper middle and high. 1 of respondents are classed in the HIC group meanwhile 17. com machine learning in economics how is it used. com terms m machine learning. com IntroductionHi Everyone this is our first time to participate in the ML DS Survey 2019. g United Kingdom UK and Australia followed by UMIC 15 countries coloured in green e. g Indonesia and Vietnam and lastly LIC by 1 country i. org 2019 10 02 world isn t ready for ai to upend global economy pub 799613. A threatening landscape of inequalities between nations and economies seems to be looming. Since only 73 respondents represent for LIC we decided to exclude LIC from this findings. Survey recorded participants from HIC group and UMIC are mostly aged 25 29 while participants in LMIC group consists of largely those aged 22 24 above or below 21 18 21. Since the popular job is Data Scientist it proven the respondent s knowledge in ML and AI application is well established and experience in using this application are between less than 2 years or more than 2 years for HIC UMIC and LMIC. Facts from this survey 47. HIC economies are looking set to invest and solidify their positions in riding the waves and be race winners but the rest are not looking good if they are unable to capitalize on these waves. edu research using big data and artificial intelligence to accelerate global development 2. Not very surprising that most of the respondents in Kaggler for HIC have high yearly compensation with more than 30 000 compared to other income group countries. Economic growth are driven by more than just a mere few factors however machine learning ML has caught attention of economists as a revolution that cannot be overlooked by policy makers. Profile of RespondentsThis findings showed 8762 respondents are from HIC followed by LMIC 6505 respondents and UMIC 3323 respondents. ConclusionWith all the excitement that comes with this revolutionary ML there are some who voiced concerns particularly for the LIC UMIC and LMIC to cope with the waves of change. The common point for economics and ML is that they are both driven by data. https carnegieendowment. It is an application of artificial intelligence AI that allows systems to keep built in algorithms current by adapting to changes and new data giving insightful accurate information without human intervention or assistance. Overall HIC UMIC and LMIC at least need to have Bachelors s degree for thier involvement in using ML and AI application. Meanwhile for Software Engineer recently show interest in exploring this application. We believe for the next 10 or 20 years the application of ML and AI is widely used in this 3 income group and in every job sectors. Our assumption is that LMIC have started to explore on the AI and DS recently compared to UMIC. uk economic services assets ai uk report v2. The accelerated pace that the market leaders are at will create gaps. These groups are classed separately based on Gross National Income GNI per capita in US Dollars converted using the World Atlas Bank method. Surprisingly LMIC showed higher percentage of respondents compared to UMIC different almost by half. From this analysis we found out an interesting fact that the involvement of HIC and UMIC in the application of using ML and AI has develop from the past 20 years. Some examples would be online chatbots on businesses websites or social media services and targeted ads. org wiki World_Bank_high income_economy cite_note worldbank1 47. Albeit the process differ in many aspects however the goal is the same efficiency. ResultsIgnoring the students in the survey Data Scientist is the most popular occupation among HIC and UMIC where most of the workers are in group 22 29 years old. Hoping that our topic catch your attention and can give a valuable information to everyone. Since most of the workers are started to exploring and using this application in their production. For LMIC and UMIC mostly their yearly compensations are less than 29 999 where LMIC is slightly higher than UMIC except for yearly compensation less than 999 where number of respondents for LMIC are 3 times higher than UMIC. Despite the growth of AI and ML there are big difference in gender which Male is the dominance group in using AI and ML. com duncanmadden files 2018 03 Literal Translation of Country Names. ", "id": "hamkamn90/an-essential-foundation-to-build-smart-nation", "size": "6878", "language": "python", "html_url": "https://www.kaggle.com/code/hamkamn90/an-essential-foundation-to-build-smart-nation", "git_url": "https://www.kaggle.com/code/hamkamn90/an-essential-foundation-to-build-smart-nation", "script": "seaborn numpy matplotlib.pyplot pandas colors plotly.express ", "entities": "(('we', 'HIC'), 'be') (('world isn 2019 10 02 ready ai', 'economy global pub'), 'org') (('that', 'automatically experience'), 'address') (('where most', 'group'), 'be') (('we', 'findings'), 'decide') (('well experience', 'HIC more than 2 UMIC'), 'prove') (('1', 'HIC group'), 'class') (('LMIC', 'recently UMIC'), 'be') (('involment', 'just growth'), 'start') (('examples', 'businesses online websites'), 'be') (('most', 'less year'), 'show') (('that', 'policy makers'), 'drive') (('HIC', 'yellow e.'), 'let') (('threatening landscape', 'nations'), 'seem') (('they', 'waves'), 'look') (('it', 'themselves'), 'focus') (('where number', '3 times UMIC'), 'be') (('application', 'job sectors'), 'believe') (('IntroductionHi this', 'ML DS first Survey'), 'com') (('policy Therefore pressing makers', 'inevitable future'), 'be') (('however goal', 'many aspects'), 'differ') (('widely respected firm PWC', 'year 2030'), 'publish') (('United Kingdom UK', 'green e.'), 'follow') (('HIC Overall UMIC', 'AI ML application'), 'need') (('topic', 'everyone'), 'hope') (('g Malaysia', 'blue e.'), 'colour') (('8762 respondents', 'LMIC 6505 respondents'), 'show') (('how it', 'economics'), 'use') (('they', 'data'), 'be') (('Surprisingly LMIC', 'different almost half'), 'show') (('systems', 'human intervention'), 'be') (('groups', 'World Atlas Bank method'), 'class') (('income as well middle nations', 'ML'), 'be') (('mostly 25 29 participants', 'aged 22 21'), 'record') (('very most', 'income group other countries'), 'surprising') (('who', 'change'), 'ConclusionWith') (('involvement', 'past 20 years'), 'find') (('Software Meanwhile Engineer', 'application'), 'show') (('Male', 'dominance AI'), 'be') (('most', 'production'), 'start') (('We', 'compensation yearly group'), 'look') (('market leaders', 'gaps'), 'create') (('Upper Middle Income Country UMIC', '3 995'), 'be') ", "extra": "['gender']"}