{"name": "basic keras model and visualization ", "full_name": " h4 Reading the training data the data is in the json format so we used the pandas read json The inclination angle should convert into the numeric h4 If the image consist of iceberg then it represent as 1 otherwise ship as 0 The iceberg images are shown below and how they appear in image with respect to different color grading here below shown h4 The images of the ships are shown in different color ratio of images And these graphs which helpfull for the furthe training of the model The below codes are very standard and commonly used codes You can find in Stackoverflow and other Kaggle resources h4 Here below the normal Keras model used the below code already refer from http www analyticmunch com deep learning projects We used normal 20 epochs The activation function is sigmoid because the output is 0 or 1 binary output And the loss function is used binary crossentropy The some resaerch papers and publishers recommend to use ADAM optimizer in keras h4 For Predictions test data has to load Then the model has to test ", "stargazers_count": 0, "forks_count": 0, "description": "The data was stored in the Kaggel website already so i directly check which all data there output of the files For Visualisation importing the required libraries Importing required packages for the graphics Checking the columns and head of the data cheking the data types Conts of the ice bergs and the ships presesnt in training data Train data Test data prediction. And these graphs which helpfull for the furthe training of the model. com deep learning projects http. For Predictions test data has to load. Here i used Python 3 environment data processing CSV file Input data files are available in the. If the image consist of iceberg then it represent as 1 otherwise ship as 0. The below codes are very standard and commonly used codes You can find in Stackoverflow and other Kaggle resources. The inclination angle should convert into the numeric. The some resaerch papers and publishers recommend to use ADAM optimizer in keras. The iceberg images are shown below and how they appear in image with respect to different color grading here below shown. Here below the normal Keras model used the below code already refer from http www. The activation function is sigmoid because the output is 0 or 1 binary output. And the loss function is used binary_crossentropy. We used normal 20 epochs. The images of the ships are shown in different color ratio of images. Then the model has to test. Reading the training data the data is in the json format so we used the pandas read_json. ", "id": "varunkashyapks/basic-keras-model-and-visualization", "size": "1072", "language": "python", "html_url": "https://www.kaggle.com/code/varunkashyapks/basic-keras-model-and-visualization", "git_url": "https://www.kaggle.com/code/varunkashyapks/basic-keras-model-and-visualization", "script": "Convolution2D keras.layers seaborn numpy matplotlib.pyplot Dense pandas GlobalAveragePooling2D subprocess keras.models check_output Sequential Dropout ", "entities": "(('inclination angle', 'numeric'), 'convert') (('which', 'model'), 'graph') (('You', 'Stackoverflow'), 'be') (('environment data processing CSV file Input data 3 files', 'the'), 'use') (('how they', 'here shown'), 'show') (('directly data there output', 'ships training data Train data Test data prediction'), 'store') (('then it', '0'), 'represent') (('images', 'images'), 'show') (('resaerch papers', 'keras'), 'recommend') (('we', 'pandas'), 'use') ", "extra": "['test']"}