{"name": "beer by name ", "full_name": " h1 An exploration of beer names h2 Look for the longest beer names h1 The longest beers h2 Historgram of letters in beer names h2 List of shortest beer names h2 Beer with foreign letters unlauts degree TM and a few h2 List of unusual unicode charcters and beer names h3 Some interesting observations h2 There are only two one word Breweries h2 Some interesting Correlations ", "stargazers_count": 0, "forks_count": 0, "description": "Look for longest and shortest beer names2. Alcohol and hops are very correlated. The Degree symobol was used in three beer names. An exploration of beer names1. Much weaker ibu ounces correlation than abv. suggests a preference for more abv over hops5. Alcohol and bottle size are correlated. Some interesting correlations Look for the longest beer namesHistogram of number of words in beer names The longest beersList of beers with 7 or more words Historgram of letters in beer names List of shortest beer names Shortest contains 2 characters Shortest word contains 3 characters Find unusual characters and unicode in names éè í ä ü ö Beer with foreign letters unlauts degree TM and a few List of unusual unicode charcters and beer names Some interesting observations Only three Trademark symbols from seperate breweries suggesting possible cut and paste artifact. Left single quoatation mark used once. Brewery_id and letter_count seem correlated. Surpringly strong association to me. Non ASCII chars in names4. How many single word breweries 5. Do newer breweries pick longer names 4. Apparent negative correlation between brewery_id and ounces. xe2 x80 x98 Havanüther is not an actual dictionary word. There are only two one word Breweries The one word breweries Histogram of number of words in brewery names Some interesting Correlations 1. Brewery names by wordcount letter3. Do newer breweries brew more standard 12 oz beers. Most of the umlauts ö were Kölsch related. Technically a unicode Right single quotation mark xe2 x80 x99 was used in place of apostrophes 15 times. Are bigger bottles used for cellaring of higher alcohol styles 3. ", "id": "seamusoc/beer-by-name", "size": "1785", "language": "python", "html_url": "https://www.kaggle.com/code/seamusoc/beer-by-name", "git_url": "https://www.kaggle.com/code/seamusoc/beer-by-name", "script": "defaultdict display HTML csv collections DictReader matplotlib.pyplot reader numpy pandas IPython.display datetime ", "entities": "(('Most', 'umlauts ö'), 'be') (('quotation mark xe2 x80 Technically unicode Right single x99', 'apostrophes'), 'use') (('only two one one word', 'brewery names'), 'be') (('í ü ö ä Beer', 'artifact'), 'look') (('Degree symobol', 'beer three names'), 'use') (('newer breweries', 'oz more standard 12 beers'), 'brew') ", "extra": "['test']"}