{"name": "birdclef2021 exploring the data ", "full_name": " h1 Training data Short audio h2 1 Primary species h2 2 Background species h2 3 Location location location h2 4 Rating h1 Training data Soundscapes h1 Test data ", "stargazers_count": 0, "forks_count": 0, "description": "Code adapted from https www. com shahules bird watch complete eda fe Make sure to check out the entire notebook. org one of the largest digital archives for bird sounds. All labels have to be considered as weak labels since we do know which species is audible in the recording but we do not know the exact timestamps of the vocalizations. nocall can never appear together with other codes. site Recording site of the soundscape data. The submission file needs to contain the ID of the processed audio chunk fileID_site_time and all audible species as a list of space delimited eBird codes. The data field seconday_labels contains lists of eBird codes i. Training soundscapes only represent two of the four locations COR and SSW. 1 Xeno canto uses open data licenses but some of them do not allow derivatives CC ND so we excluded them. ogg that s a mock filename the audio chunk ending at second 00 00 35 of the entire file would have the unique ID 1234_SSW_35. The data also shows us that the Red winged Blackbird rewbla American Robin amerob House Sparrow houspa and Northern Cardinal norcar appear to be some of the most common background species. time Time of recording as stated by the recordist. Sub sampling training data based on user rating might help to extract high quality training samples. Again you need to predict audible species for 5 second chunks of the audio data. com andradaolteanu birdcall recognition eda and audio fe Make sure to ckeck out the entire nootebook. To get a better understanding of the metadata let s look at a few entries. Training data Soundscapes One of the major obstacles in this competition is the significant gap between training and test recordings. Make sure to take a look at the test_soundscape_metadata which contains more information on each location. filename A reference to the sound file in the training data. Like this 1234_SSW_5 nocall 1234_SSW_10 bluwa1 1234_SSW_15 nocall 1234_SSW_20 bluwa1 redwa2 1234_SSW_25 nocall 1234_SSW_30 nocall And so on. the Western Bluebird wesblu a West coast species. org species gockin Red winged Blackbird https ebird. If your classifier thinks that species bluwa1 and redwa2 again mock codes vocalize during this time the final submission entry should look like this 1234_SSW_35 bluwa1 redwa2 A submission for this file should include ALL segments starting at 5 seconds. According to the recording locations the House Sparrow houspa has occurrences around the globe the Northern Cardinal norcar appears to be a typical East coast species of the U. You can access additional information on each bird species by combining the base URL https ebird. But they should nonetheless provide a good overview of what to expect in the hidden test data. org birdsong author Acknowledgement to the recordists who contributed the recording. Learn more about how and why birds vocalize here https academy. Yet some recordings contain very dense acoustic scenes with multiple birds vocalizing at the same time. Filenames contain the file ID recording site and recording date yyyymmdd. Crawling Xeno canto for more samples will not be necessary this year and in light of the API limitations imposed by Xeno canto https www. url A link to the original recording on Xeno canto. through loss masking for background species. Let s look at the most common entries for birds Nocall seems to be the most common which is no surprise Birds only vocalize occasionally during a recording. Let s look at the number of different species. Just as Xeno canto is a digital platform that collects audio recordings eBird https ebird. Primary speciesMost importantly the metadata specifies the audible species for each recording. org species rewbla American Goldfinch https ebird. Let s see how rating values are distributed across the training data Overall the training data contains high quality recordings and the majority of samples is rated with 3. test recordings that can be used for validation or even for training. Unique eBird codes Make bar chart Show chart Code adapted from https www. Let s look at one example When analyzing file 1234_SSW_20170101. com shahules bird watch complete eda fe Again make sure to check out the entire notebook. Test dataIf you re already familiar with the training soundscapes the hidden test set should not be a surprise. Our dataset contains recordings for 397 different primary species all of them defined by their eBird code the codes that we use as primary label. If you want to know more about the range of a certain species please take a look at the associated eBird entry. Most species have less than 500 recordings available on Xeno canto 1. The Bananaquit banana seems to only occur in Central and South America. Use this create the submission file entry. Let s look at some values We can see that the majority of recordings does not have an annotation of background species. These 20 recordings represent 2 of the 4 test recording locations. RatingXeno canto has a rating system for the quality of each recording. It contains 20 soundscape recordings of 10 minute duration for each of the four recording sites. birds primary label i. 0 the latter being the best possible rating and reflect the overall quality assigned by users and the number of background species. org species with a species code from the primary_label columns of the metadata. However we decided to include some examples of soundscape recordings i. Let s take a look at the label data for this set of recordings. It is up to you if you use training soundscapes for validation since they represent the hidden test set or if you use annotated segments for training to cope with the shift in acoustic domains. Make yourself familiar with the training and test data also make sure to check out our other notebooks let us know if you have any comments and of course don t hesitate to start a forum thread if you have any questions. seconds End time of the 5 second segment for which this entry states the label. We limited the number of recordings to 500 for each species but that only affected a dozen species. org is a citizen science project that collects observations of birds. audio_id Identifier used to reference audio recordings. Yet training with target samples i. Each recording comes with metadata specifying things like recording date recording location and of course the bird species that was recorded. Ratings are assigned by users and we adapted this rating scheme for the training data. Background speciesThe metadata for each recording lists the number of audible background species. org about terms we strongly discourage doing so. primary labels that recordists annotated. It is important to note that these lists might be incomplete and you might be able to hear background species although none are specified in the metadata. nocall references a segment without any bird vocalization. However the training data only contains species that are likely to occur at the test data recordings sites. Why is it important Not all birds occur at all locations at all times Let s look at a few examples As we can see different species occur over different spatial scales. Yet recording locations are a good starting point. SHP file Coordinate reference system Lat and Long need to be of type float not object Create geometry Geo Dataframe Create ID for species Add ID to geo_df PLOT Code adapted from https www. One of the core challenges of this competition is to reduce the number of false positives precision without losing too many true positives recall. But be aware The range of certain species may not be fully reflected by recording location data and the actual range may differ from what we can see in the data. soundscapes is often not possible somebody has to annotate the data for each new deployment for each new recording location. Whenever we had to limit the amount of recordings per species for the training data we used the 500 top rated samples. In combination with the recording data data field date this information can be very useful to map distribution and migration patterns. Segments can have more than one bird in that case eBird codes are separated by space. Excluding or including recordings of certain call types might help to diversify training data. eBird uses unique species codes to reference birds. In our case ratings range from 0. org species amegfiLet s take a look at the number of recordings for each species in the training data We can clearly see that we re facing a so called long tail classification problem with highly imbalanced training data. Data fields latitude and longitude contain GPS coordinates as provided by the recordist. It is important to note that the training data contains more classes than there are species annotated in the test data. In this competition we included recordings from 4 different sites COL Colombia COR Costa Rica SNE Sierra Nevada SSW Sapsucker Woods. Some recordists focus on a specific subsets of species so there might be some value in these data. Make sure to respect the license when sharing the data. Other data fields of the metadata might be of value at some point during development here is a brief description for each of them type Represents the type of the vocalization with song and call as the most common. Yet they might not be 100 representative some species might be missing and only audible in the hidden test set recording equipment might differ. Location data can help us to create subsets of the training data for each of the four test data recording locations which we will explore later. Therefore lists of secondary labels are not very reliable but they might still be useful for multi label training e. eBird code of the audible species of this segment. Can be used to diversify the training data. Training with weakly labeled data is one of the core challenges of this competition. We can see a few data fields and here s a brief description for each of them row_id Unique identifier of a 5 second segment of each soundscape file. Location location locationEach recording comes with a recording location specified in the metadata. Might be of value to distinguish between birds that vocalize during the day and those which only vocalize during the night. Training data Short audio The training data for this competition consists of a collection of so called focal recordings. There is a distinct shift in acoustic domains between the two and it can be very challenging to train classifiers that generalize well enough to bridge the gap. These recordings were made using semi professional equipment often using highly directional microphones and primarily focus on one single species. Please note secondary lables only contain labels of species that are actually represented in the data set. Please note that the training data only contains species that are likely to occur at the recording locations of the test data even though sometimes the majority of the recordings were made in Europe. Here are a few examples Golden crowned Kinglet https ebird. license All recordings have an open source license which is noted in this field. The primary species annotation consists of three data fields primary_label scientific_name and common_name http. But be aware Training with soundscape data for a few species might introduce unwanted biases when overfitting to one recording site. A value of 85 would mean that this particular segment starts at 00 01 20 and lasts until 00 01 25 of the audio file. A value of 0 means that this particular recording does not have a rating and it is by that the fallback value. Yet it is highly likely that most of them actually contain one or more additional species. All recordings were contributed by Xeno canto https www. Why is nocall important There s a simple reason Your classifier should be able to suppress false positives for these segments which is important for ornithologists when confronted with the detections. ", "id": "stefankahl/birdclef2021-exploring-the-data", "size": "11910", "language": "python", "html_url": "https://www.kaggle.com/code/stefankahl/birdclef2021-exploring-the-data", "git_url": "https://www.kaggle.com/code/stefankahl/birdclef2021-exploring-the-data", "script": "plotly.graph_objects geopandas shapely.geometry seaborn matplotlib.pyplot pandas Point Polygon ", "entities": "(('that', 'only a dozen species'), 'limit') (('Identifier', 'audio recordings'), 'audio_id') (('who', 'recording'), 'author') (('latitude', 'recordist'), 'contain') (('Bananaquit banana', 'only Central America'), 'seem') (('we', 'training data'), 'assign') (('We', 'soundscape file'), 'see') (('train very that', 'well enough gap'), 'be') (('particular segment', 'audio file'), 'mean') (('You', 'base URL https ebird'), 'access') (('Background speciesThe metadata', 'background audible species'), 'list') (('s', 'When file'), 'let') (('Again you', 'audio data'), 'need') (('org species', 'American Goldfinch https ebird'), 'rewbla') (('Primary speciesMost importantly metadata', 'recording'), 'specify') (('eda complete fe', 'Again entire notebook'), 'watch') (('RatingXeno canto', 'recording'), 'have') (('species primary annotation', 'data three fields'), 'consist') (('derivatives CC so we', 'them'), 'use') (('we', '500 top rated samples'), 'have') (('Crawling', 'Xeno canto https www'), 'be') (('they', 'test hidden data'), 'provide') (('data Other fields', 'most common'), 'be') (('00 00 35', 'unique ID'), 'ogg') (('which', 'only night'), 'be') (('we', 'terms'), 'discourage') (('20 recordings', 'test recording 4 locations'), 'represent') (('which', 'when detections'), 'be') (('Most species', 'Xeno available canto'), 'have') (('information', 'very distribution'), 'be') (('latter', 'background species'), '0') (('Blackbird rewbla American Robin amerob House Sparrow houspa', 'Northern Cardinal background most common species'), 'show') (('One', 'positives too many true recall'), 'be') (('Training data Soundscapes', 'significant training'), 'be') (('we', 'vocalizations'), 'have') (('1234_SSW_35 submission', '5 seconds'), 'look') (('Filenames', 'date yyyymmdd'), 'contain') (('Sub sampling', 'quality training high samples'), 'help') (('Training soundscapes', 'locations four COR'), 'represent') (('you', 'eBird associated entry'), 'take') (('However we', 'soundscape recordings i.'), 'decide') (('we', '4 different sites'), 'include') (('you', 'questions'), 'make') (('we', 'data'), 'differ') (('clearly we', 'training highly imbalanced data'), 'take') (('nocall', 'together other codes'), 'appear') (('nocall', 'bird vocalization'), 'reference') (('recordings', 'Xeno canto https www'), 'contribute') (('unique species', 'birds'), 'use') (('majority', '3'), 'let') (('bar chart chart Code', 'https www'), 'make') (('Training', 'competition'), 'be') (('digital that', 'eBird https ebird'), 'be') (('it', 'that'), 'mean') (('which', 'field'), 'license') (('audible species', 'eBird codes'), 'need') (('very they', 'label training still multi e.'), 'be') (('different species', 'different spatial scales'), 'be') (('org species', 'Blackbird https ebird'), 'gockin') (('majority', 'background species'), 'let') (('citizen science that', 'birds'), 'be') (('bird that', 'course'), 'come') (('how why birds', 'https here academy'), 'learn') (('100 species', 'recording equipment'), 'be') (('entry', 'label'), 'second') (('seconday_labels', 'codes eBird i.'), 'contain') (('Birds', 'only occasionally recording'), 'vocalize') (('we', 'primary label'), 'contain') (('It', 'recording four sites'), 'contain') (('recording', 'metadata'), 'come') (('highly most', 'actually one additional species'), 'be') (('that', 'data actually set'), 'note') (('you', 'acoustic domains'), 'be') (('this', 'submission file entry'), 'use') (('eda complete fe', 'entire notebook'), 'watch') (('s', 'recordings'), 'let') (('eBird codes', 'space'), 'have') (('s', 'few entries'), 'let') (('Northern Cardinal norcar', 'East coast typical U.'), 'have') (('Golden', 'Kinglet https ebird'), 'be') (('that', 'test data recordings sites'), 'contain') (('even sometimes majority', 'Europe'), 'note') (('multiple birds', 'same time'), 'contain') (('test that', 'even training'), 'recording') (('which', 'location'), 'make') (('recordings', 'primarily one single species'), 'make') (('training data', 'test data'), 'be') (('com andradaolteanu birdcall recognition eda', 'audio entire nootebook'), 'make') (('we', 'which'), 'help') (('Training data Short training data', 'so called focal recordings'), 'audio') (('s', 'different species'), 'let') (('Add PLOT Code', 'https www'), 'object') (('recordists', 'data'), 'focus') (('often somebody', 'recording new location'), 'be') (('Excluding', 'training data'), 'help') (('none', 'metadata'), 'be') ", "extra": "['annotation', 'test']"}