{"name": "build k means clustering from scratch ", "full_name": " h1 Online Retail Clustering h3 Agenda h3 Data used h3 This notebook has been created after multiple iteration h2 Importing libraries h2 Reading dataframe h2 Null value treatment h2 Creating attributes for clustering h2 Create Analytical data set for the clustering model h2 Anomaly detection h2 Performing scaling on the analytical data set h2 Mathematical implementation of K means clustering techinique h2 Plotting clusters ", "stargazers_count": 0, "forks_count": 0, "description": "Plotting clusters Pulling invoice data First attribute Total amount paid Second attribute Purchase recency UDF to convert string to datetime UDF to split date and pick out recent purchase days Attribute Frequency of purchase UDF to determine outliers in data for all the columns INSIGHTS There are outliers in amount and frequency column UDF to remove outlier Removed the anomalies in all the columns define standard scaler transform data Defining centroids Filtering the columns required for clustering Storing the sample dataframe to determine the number of centroids store current means store previous means distance matrix euclidean distance update cluster store previous cluster. Iteration 2 Created other data attributes which may help in Clustering3. Repeat iteration till the centroids don t change. Iteration 3 Scaled the data to improve the clustering technique4. Pick K points as the initial centroids from the data set either randomly or the first K. Assign each data point to the closest centroid using the distance found in the previous step. Find the new centroid by taking the average of the points in each cluster group. Online Retail Clustering Agenda We are required to cluster the customers using different attributes shared in the data Data used We have used the data to define the frequency of purchase recency of purchase and amount of purchase to cluster the customers This notebook has been created after multiple iteration 1. Iteration 4 Lastly realised there are anomalies and so implemented IQR to eliminate iteration Importing libraries Reading dataframe Null value treatment Creating attributes for clustering Create Analytical data set for the clustering model Anomaly detection Performing scaling on the analytical data set Mathematical implementation of K means clustering techinique1. Iteration 1 Implemented the K means algorithm using python2. Find the Euclidean distance of each point in the data set with the identified K points cluster centroids. ", "id": "prashantchoubey1/build-k-means-clustering-from-scratch", "size": "1427", "language": "python", "html_url": "https://www.kaggle.com/code/prashantchoubey1/build-k-means-clustering-from-scratch", "git_url": "https://www.kaggle.com/code/prashantchoubey1/build-k-means-clustering-from-scratch", "script": "splitDate seaborn numpy matplotlib.pyplot remove_outlier_IQR sklearn.preprocessing pandas StandardScaler viewDistribution convertDate ", "entities": "(('Pick K', 'data'), 'point') (('First attribute Total amount', 'centroids store means distance matrix euclidean distance update cluster current previous means store previous cluster'), 'plot') (('1 K', 'python2'), 'implement') (('notebook', 'multiple iteration'), 'Agenda') (('data 2 Created other which', 'Clustering3'), 'iteration') (('Iteration', 'clustering technique4'), 'scale') (('set', 'techinique1'), 'realise') ", "extra": "[]"}