{"name": "coronawhy org task transmission incubation ", "full_name": " h2 Table of Contents h2 Preamble h2 1 Introduction h2 Summary findings h3 What is the range of incubation periods BM25 h3 What is the range of incubation periods BM25 h3 How is the persistence of the virus on surfaces of different materials BM25 h3 How effective are movement control strategies BM25 h3 How effective are personal protective equipment BM25 h3 All questions LDA h2 2 Software h3 Approach h3 Proof of Concept Data Extraction and Synthesis Tool h2 3 Results h3 Demo Results from the Proof of Concept Data Extraction and Synthesis Tool h2 4 Additional Resources h2 5 Contributors ", "stargazers_count": 0, "forks_count": 0, "description": "20025452 2020 What is the range of incubation periods SARS CoV 2 transmission in cancer patients of a tertiary hospital in Wuhan 4 https doi. gov pmc articles PMC293432 2003 What is the range of incubation periods Hospitalized adult patients with 2009 influenza A H1N1 in Beijing China risk factors for hospital mortality 9 https www. Full code to feature extractions is documented here. 1670707465455 What further should be done to control COVID 19 outbreaks in addition to cases isolation and contact tracing measures 66. 3390 jcm9030789 2020 What is the range of incubation periods Use of an enzyme linked immunosorbent assay in bulk milk to estimate the prevalence of Neospora caninum on dairy farms in Prince Edward Island Canada 4 https www. 101608 2020 A considerable proportion of individuals with asymptomatic SARS CoV 2 infection in Tibetan population 74. 001 2020 What is the range of incubation periods Climate factors and incidence of Middle East respiratory syndrome coronavirus 5 https doi. 0000000000000782 2020 What is the prevalence of asymptomatic shedding Effect of isolation practice on the transmission of middle east respiratory syndrome coronavirus among hemodialysis patients A 2 year prospective cohort study 4 https doi. 20028472 2020 What is the range of incubation periods Clinical characteristics of 36 non survivors with COVID 19 in Wuhan China 4 https doi. 3243087185097 https aem. NOT animal OR dog OR canine OR feline OR. 20024281 2020 What is the prevalence of asymptomatic shedding 2019 novel coronavirus disease in hemodialysis HD patients Report from one HD center in Wuhan China 4 https doi. 1138992155207 https doi. gov pmc articles PMC6004632 2018 How long are individuals infectious Manifestations of Digestive system in hospitalized patients with novel coronavirus pneumonia in Wuhan China a single center descriptive study 4 2020 How long are individuals infectious Case control study to investigate risk factors for bovine neonatal pancytopenia BNP in young calves in southern Germany 4 https doi. 20051318 2020 What is the range of incubation periods The basic reproduction number and prediction of the epidemic size of the novel coronavirus COVID 19 in Shahroud Iran 4 https doi. Contributors https docs. 20028829 2020 Detecting Differential Transmissibilities That Affect the Size of Self Limited Outbreaks 41. 1016 s0167 5877 97 00038 x 1998 What is the range of incubation periods First respiratory transmitted food borne outbreak 4 https doi. Summary findings task summary 5. com uc id 1pSFM6Q82h4cQbxw2XqoFo 8c6UWZ48v9 Here I want to insert top article by each question top 10 20 from search engine and top 10 from lda if they exist Note some have zero results Demo Results from the Proof of Concept Data Extraction and Synthesis ToolThe following results are to demonstrate what the tool is intended to do and should not be interpreted as robust research findings as the tool did not capture all the data and did not differentiate study quality at this stage. gov pmc articles PMC7029158 2020 Duration of quarantine in hospitalized patients with severe acute respiratory syndrome coronavirus 2 SARS CoV 2 infection a question needing an answer 44. com uc id 1g4i0aS9QKdPyocosNPKcXYuyWeanj xD Overall progression of the disease including various periods appear to be much more studied than the effectiveness of control measures. 20053983 2020 What is the range of incubation periods Prediction of the Epidemic Peak of Coronavirus Disease in Japan 2020 4 https doi. com uc id 1rb_e2Nlr2JlFjDDSme7SkhWlzoy4UcXS https drive. gov pmc articles PMC5096632 2016 What is the prevalence of asymptomatic shedding Outbreak of Middle East respiratory syndrome coronavirus in Saudi Arabia a retrospective study 5 https www. 20034215 2020 What is the range of incubation periods Recommendations for standardized management of CML patients in the core epidemic area of COVID 19 Multi center survey results in Hubei Province China 4 https doi. 20034876 2020 What is the range of incubation periods Triaging patients in the outbreak of the 2019 novel coronavirus 4 https doi. 4935007392091 https doi. 003 2020 Interventions to mitigate early spread of SARS CoV 2 in Singapore a modelling study 43. 20044461 2020 Extensive Viable Middle East Respiratory Syndrome MERS Coronavirus Contamination in Air and Surrounding Environment in MERS Isolation Wards 62. 20025320 2020 What is the range of incubation periods Application and optimization of RT PCR in diagnosis of SARS CoV 2 infection 4 https doi. 027 2020 Investigation of three clusters of COVID 19 in Singapore implications for surveillance and response measures 66. 0127921238923 https doi. com arturkiulian coronawhy org global collaboration join slack for historical context on how this community started. 0702570545803 https doi. gov pmc articles PMC7086689 2004 How long do nosocomial pathogens persist on inanimate surfaces A systematic review 31. 012 2020 SARS CoV 2 and COVID 19 The most important research questions 82. gov pmc articles PMC3376788 2012 What is the range of incubation periods A Comparison of the Clinical and Epidemiological Characteristics of Adult Patients with Laboratory Confirmed Influenza A or B during the 2011 2012 Influenza Season in Korea A Multi Center Study 8 https www. 9225155818742 https doi. 0001 2020 Unique epidemiological and clinical features of the emerging 2019 novel coronavirus pneumonia COVID 19 implicate special control measures 59. Neurologic Complications in Hospitalized Pediatric Patients with Influenza Infection A Multicenter Retrospective Study in Korea 4 https www. com uc id 1SxwNE4 cKJfot4TukY80G0pjS4ShqFyK If we break down the articles by publish year we can see that studies pertaining to containment or preventive measures often concentrate around the times of large outbreaks. More research is required to identify what characterizes this population. 9463293572032 https www. gov pmc articles PMC3643978 2013 What is the range of incubation periods Importance of Internet Surveillance in Public Health Emergency Control and Prevention Evidence From a Digital Epidemiologic Study During Avian Influenza A H7N9 Outbreaks 8 https www. 113490 2020 What is the range of incubation periods Molecular characterization of a nosocomial outbreak of influenza B virus in an acute care hospital setting 4 https doi. For each question we represent top articles returned by the search system. Visit our website https www. 20045393 2020 Asymptomatic coronavirus infection MERS CoV and SARS CoV 2 COVID 19 78. 20032326 2020 What is the prevalence of asymptomatic shedding Effect of continuous renal replacement therapy on all cause mortality in COVID 19 patients undergoing invasive mechanical ventilation a retrospective cohort study 4 https doi. 20018887 2020 What is the range of incubation periods Transmission and epidemiological characteristics of Severe Acute Respiratory Syndrome Coronavirus 2 SARS CoV 2 infected Pneumonia COVID 19 preliminary evidence obtained in comparison with 2003 SARS 5 https doi. 20050328 2020 How effective are movement control strategies BM25 TITLE SCORE URL YEAR Feasibility of controlling COVID 19 outbreaks by isolation of cases and contacts 80. gov pmc articles PMC7097845 2020 Feasibility of controlling 2019 nCoV outbreaks by isolation of cases and contacts 74. gov pmc articles PMC7074995 2020 Sudden hyposmia as a prevalent symptom of COVID 19 infection. 20019836 2020 What is the range of incubation periods Can Search Query Forecast successfully in China s 2019 nCov pneumonia 5 https doi. 9851541758215 https doi. 8444326959545 https doi. 20031005 2020 What is the prevalence of asymptomatic shedding Analytical sensibility and specificity of two RT qPCR protocols for SARS CoV 2 detection performed in an automated workflow 4 https doi. cn112152 20200227 00137 2020 What is the prevalence of asymptomatic shedding The preliminary analysis on the characteristics of the cluster for the Corona Virus Disease 4 https doi. 9787102665153 https doi. 20029009 2020 What is the range of incubation periods Epidemiological and clinical features of 2019 nCoV acute respiratory disease cases in Chongqing municipality China a retrospective descriptive multiple center study 4 https doi. gov pmc articles PMC7108054 2016 Comparative analyses of SAR CoV2 genomes from different geographical locations and other coronavirus family genomes reveals unique features potentially consequential to host virus interaction and pathogenesis 49. Effectiveness of personal protective equipment and its usefulness to reduce risk of transmission in health care and community settingsSecond we chose a search engine as our tool of interest. 20049981 2020 Transmission potential of COVID 19 in Iran 39. 001586 2020 Survival of Severe Acute Respiratory Syndrome Coronavirus 47. 8293701422943 https doi. 20046557 2020 Effects of Air Temperature and Relative Humidity on Coronavirus Survival on Surfaces 66. com uc id 1ZDeKjogzH7jZjwxAzPpdK4o3YT_uoe0e https drive. 6563228098701 https doi. Together with the evaluation of existing preventive strategies we can assess whether current interventions and policies are supported by evidence and are adequate in curbing the pandemic. This provides a rough recommendation of similar articles. 2026315301112 https doi. com cid article pdf 59 11 1511 17854240 ciu635. 2709260455044 2020 A Territory wide study of COVID 19 cases and clusters with unknown source in Hong Kong community A clinical epidemiological and phylogenomic investigation 59. pdf 2015 What is the prevalence of asymptomatic shedding Middle East Respiratory Syndrome 4 https www. gov pmc articles PMC7108049 2017 An updated estimation of the risk of transmission of the novel coronavirus 2019 nCov 46. 1093 annweh wxaa024 2020 Stability and inactivation of SARS coronavirus 33. gov pmc articles PMC7086719 2015 What is the prevalence of asymptomatic shedding Fatality risks for nosocomial outbreaks of Middle East respiratory syndrome coronavirus in the Middle East and South Korea 4 https www. Once that s done the engine looks for input keywords in the specified fields such as title or abstract and return all articles containing matched keyword ranked by BM25 scores. cn112338 20200223 00153 2020 What is the prevalence of asymptomatic shedding Epidemiological identification of a novel infectious disease in real time Analysis of the atypical pneumonia outbreak in Wuhan China 2019 20 4 https doi. 5522962464252 https doi. 20049908 2020 Curtailing transmission of severe acute respiratory syndrome within a community and its hospital. gov pmc articles PMC7121202 2020 What is the range of incubation periods Clinical characteristics and outcomes of influenza and other influenza like illnesses in Mexico City 4 https doi. 5250852110046 https www. 20050005 2020 Viral load and outcome in SARS infection The role of personal protective equipment in the emergency department 56. 20027201 2020 What is the prevalence of asymptomatic shedding Prevalence and clinical features of 2019 novel coronavirus disease COVID 19 in the Fever Clinic of a teaching hospital in Beijing a single center retrospective study 4 https doi. 1093 annweh wxaa024 2020 Risk of transmission via medical employees and importance of routine infection prevention policy in a nosocomial outbreak of Middle East respiratory syndrome MERS a descriptive analysis from a tertiary care hospital in South Korea 42. 20024018 2020 What is the range of incubation periods Epidemic Situation of Novel Coronavirus Pneumonia in China mainland 4 https doi. 008 2012 How long are individuals infectious Age and Ebola viral load correlate with mortality and survival time in 288 Ebola virus disease patients 4 https doi. gov pmc articles PMC5693464 2017 What is the prevalence of asymptomatic shedding The global spread of Middle East respiratory syndrome an analysis fusing traditional epidemiological tracing and molecular phylodynamics 5 https www. 627098804733 https www. 8079728036177 https www. gov pmc articles PMC6078760 2018 What is the range of incubation periods Prevalence of Avian Influenza A H5 and A H9 Viruses in Live Bird Markets Bangladesh 6 https www. 20032896 2020 Estimating the serial interval of the novel coronavirus disease COVID 19 A statistical analysis using the public data in Hong Kong from January 16 to February 15 2020 54. 003 2017 What is the range of incubation periods Coronavirus Disease 2019 Coronaviruses and Blood Safety 4 https doi. 7271173187369 https doi. 0024960600275 https www. 20047159 2020 What is the prevalence of asymptomatic shedding Prominent changes in blood coagulation of patients with SARS CoV 2 infection 4 https doi. gov pmc articles PMC7137535 2020 Duration of quarantine in hospitalized patients with severe acute respiratory syndrome coronavirus 2 SARS CoV 2 infection a question needing an answer 57. 20024034 2020 What is the range of incubation periods Clinical features and progression of acute respiratory distress syndrome in coronavirus disease 2019 4 https doi. Each question takes on several semantic components relevant to TIES. gov pmc articles PMC7087622 2010 Impact of self imposed prevention measures and short term government intervention on mitigating and delaying a COVID 19 epidemic 52. com uc id 1vxEC_yGcj 1NgB9PrJjLRVCUDhpXphDx Non covid diseases appear to follow a similar distribution in which most studies focused on the disease transmission characteristics. gov pmc articles PMC5640221 2017 What is the prevalence of asymptomatic shedding Epidemiology and clinical profile of pathogens responsible for the hospitalization of children in Sousse area Tunisia 5 https www. 20043836 2020 2019 novel coronavirus infection and gastrointestinal tract 73. 20035212 2020 What is the range of incubation periods A high efficient hospital emergency responsive mode is the key of successful treatment of 100 COVID 19 patients in Zhuhai 4 https doi. com document d 1VWGV 7DC7zYcrwelEZmhahiIupazmTUuSca42vZPEDY edit usp sharingFrom our dataset children appear to have a slightly shorter incubation period than adults. 004 2004 Mass masking in the COVID 19 epidemic people need guidance 25. 3489846233645 https doi. gov pmc articles PMC1852591 2007 What is the range of incubation periods Consensus on emergency surgery and infection prevention and control for severe trauma patients with 2019 novel coronavirus pneumonia 4 2020 What is the range of incubation periods Coronavirus 2019 nCoV A brief perspective from the front line 4 https doi. The number of times an article appears determines its overall relevance to the initial search output. gov pmc articles PMC3265313 2011 ACE2 variants underlie interindividual variability and susceptibility to COVID 19 in Italian population 42. 6424751530181 2020 How is the persistence of the virus on surfaces of different materials BM25 TITLE SCORE URL YEAR Environmental Contamination and Viral Shedding in MERS Patients During MERS CoV Outbreak in South Korea 68. 0608980718569 https doi. 1016 s0167 5877 97 00038 x 1998 What is the prevalence of asymptomatic shedding Covid 19 Navigating the Uncharted 4 https www. gov pmc articles PMC6776345 2019 How long are individuals infectious Estimating survival rates in MERS CoV patients 14 and 45 days after experiencing symptoms and determining the differences in survival rates by demographic data disease characteristics and regions a worldwide study 5 https www. 3390 jcm9020462 2020 Risk Factors for Transmission of Middle East Respiratory Syndrome Coronavirus Infection During the 2015 Outbreak in South Korea 47. In addition we showcase the results from a proof of concept data extraction and synthesis system where we enrich the search results with additional attributes and outcome data. 20032052 2020 Clinical Characteristics of 74 Children with Coronavirus Disease 2019 60. 5601504501781 https www. 1016 0301 6226 93 90113 v 1993 How long are individuals infectious Colonization of Severe Acute Respiratory Syndrome Associated Coronavirus Among Health Care Workers Screened by Nasopharyngeal Swab 4 https doi. gov pmc articles PMC7087023 2016 What is the range of incubation periods Prospective study of avian influenza H9 infection in commercial poultry farms of Punjab Province and Islamabad Capital Territory Pakistan 5 https www. 1016 s0929 6646 08 60205 3 2008 What is the range of incubation periods Clinical characteristics and intrauterine vertical transmission potential of COVID 19 infection in nine pregnant women a retrospective review of medical records 4 https doi. gov pmc articles PMC4214794 2014 Estimating the reproduction number of COVID 19 in Iran using epidemic modeling 40. Prevalence of asymptomatic shedding and transmission e. 9589008566729 https doi. 5898626674211 https doi. gov pmc articles PMC6776345 2019 What is the range of incubation periods Fatality risks for nosocomial outbreaks of Middle East respiratory syndrome coronavirus in the Middle East and South Korea 5 https www. 5539153086103 Epidemiology genome and clinical features of the pandemic SARS CoV 2 a recent view 54. 5828089293875 https www. 8159722209341 https doi. 021 2016 How long are individuals infectious An attempt at measuring health in nucleus and multiplier pig farms 4 https doi. We focused on five main questions that we judge to have immediate policy impact. 1444582047464 https doi. gov pmc articles PMC6910886 2019 What is the range of incubation periods COVID 19 in a Designated Infectious Diseases HospitalOutside Hubei Province China 4 https doi. gov pmc articles PMC7049846 2020 What is the prevalence of asymptomatic shedding Genetic characterization of porcine epidemic diarrhea virus in Korea from 1998 to 2013 4 https www. 3172718238873 https doi. Part 2 Process based on Semantic Relationships To improve search experience and scope an LDA model learns correlations between articles based on amount of similar words used across all of the articles. 20042291 2020 Transmission potential of COVID 19 in South Korea 41. 009 2010 Expert consensus on preventing nosocomial transmission during respiratory care for critically ill patients infected by 2019 novel coronavirus pneumonia 29. gov pmc articles PMC7081172 2020 Transmission of COVID 19 in the terminal stage of incubation period a familial cluster 69. gov pmc articles PMC7108026 2016 Detection of Air and Surface Contamination by Severe Acute Respiratory Syndrome Coronavirus 2 SARS CoV 2 in Hospital Rooms of Infected Patients 67. com uzairakhan coronawhy task ties Data extraction and visualizations https www. gov pmc articles PMC7087023 2016 What is the prevalence of asymptomatic shedding La surveillance des personnes contacts pour Ébola effets sociaux et enjeux éthiques au Sénégal 4 https www. Understanding the duration before an exposed individual begins to show symptoms and the duration for which an individual will remain contagious even after recovery helps formulate quarantine and self isolating policies. 3555171829322 https doi. gov pmc articles PMC3850993 2013 What is the prevalence of asymptomatic shedding Potential Geographic Distribution of the Novel Avian Origin Influenza A H7N9 Virus 5 https www. 20024166 2020 What is the range of incubation periods The serial interval of COVID 19 from publicly reported confirmed cases 4 https doi. gov pmc articles PMC7088531 2016 What is the range of incubation periods Evaluation of SARS CoV 2 RNA shedding in clinical specimens and clinical characteristics of 10 patients with COVID 19 in Macau 5 https www. 006 2013 What is the range of incubation periods Correlation between antimicrobial consumption and incidence of health care associated infections due to methicillin resistant Staphylococcus aureus and vancomycin resistant enterococci at a university hospital in Taiwan from 2000 to 2010 4 https doi. 296 2020 How long are individuals infectious Vicarious traumatization in the general public members and non members of medical teams aiding in COVID 19 control 4 https doi. 8222889828582 https doi. 8042602908459 https doi. gov pmc articles PMC5217314 2017 What is the prevalence of asymptomatic shedding Occurrence of the Middle East Respiratory Syndrome Coronavirus MERS CoV across the Gulf Corporation Council countries Four years update 5 https www. com uc id 1lR2kqIyRIfuQJ1 nVkb4LMbZGikAQKkr 4. gov pmc articles PMC5059364 2016 What is the prevalence of asymptomatic shedding A DESCRIPTIVE STUDY OF PANDEMIC INFLUENZA A H1N1 PDM09 IN BRAZIL 2009 2010 5 https www. 3139956835525 https doi. 0000000000018782 2020 What is the prevalence of asymptomatic shedding Discussion on diagnosis and treatment of hepatobiliary malignancies during the outbreak of novel coronavirus pneumonia 4 https doi. 9229734015307 https doi. gov pmc articles PMC7096822 2016 What is the prevalence of asymptomatic shedding Investigating an outbreak of acute fever in Chuuk Federated States of Micronesia 4 https ojs. 20052308 2020 What is the range of incubation periods Clinical characteristics of COVID 19 infection in pregnant women a systematic review and meta analysis 4 https doi. 20038422 2020 The Characteristics of Middle Eastern Respiratory Syndrome Coronavirus Transmission Dynamics in South Korea 40. gov pmc articles PMC3747521 2013 Healthcare Worker Perceptions of Mask Use during a Nosocomial Pertussis Outbreak Pennsylvania 2003 33. gov pmc articles PMC7107832 2005 The Effects of Temperature and Relative Humidity on the Viability of the SARS Coronavirus 44. gov pmc articles PMC6256373 2018 What is the prevalence of asymptomatic shedding A double epidemic model for the SARS propagation 6 https www. IntroductionIn response to the current pandemic the scientific community requested help to process tens of thousands of research articles related to COVID 19. gov pmc articles PMC5426109 2017 What is the range of incubation periods Laboratory epidemiology of respiratory viruses in a large children s hospital A STROBE compliant article 6 https www. Due to difficulty in merging metadata with full text files we were only able to match 53 unique articles with additional attributes. gov pmc articles PMC7104710 2020 What is the range of incubation periods Clinical Features of 69 Cases with Coronavirus Disease 2019 in Wuhan China Clinical Infectious Diseases Oxford Academic 5 https doi. First we narrowed our focus to topics with in our view the most immediate policy implications Range of incubation periods for the disease in humans and how this varies across age and health status and how long individuals are contagious even after recovery. org content aem 76 9 2712. 5215211833701 https www. gov pmc articles PMC6405095 2019 What is the range of incubation periods Factors Associated With Time to Elimination of Porcine Epidemic Diarrhea Virus in Individual Ontario Swine Herds Based on Surveillance Data 5 https www. 20047977 2020 Are Powered Air Purifying Respirators a Solution for Protecting Healthcare Workers from Emerging Aerosol Transmissible Diseases 38. 1564809746008 https doi. copper steel plastic. com crispyc task ties data extraction eda 5. Part 1 Process based on topic and Word similarity BM25 The construction of the search engine begins with creating a schema to index all of the thousands of documents. 25748 2020 2019 novel coronavirus an emerging global threat 59. 22006 2020 First known person to person transmission of severe acute respiratory syndrome coronavirus 2 SARS CoV 2 in the USA 63. 1515 cclm 2020 0188 2020 What is the prevalence of asymptomatic shedding Discussion on diagnosis and treatment of hepatobiliary malignancies during the outbreak of novel coronavirus pneumonia 4 2020 What is the prevalence of asymptomatic shedding Seroprevalence of Antibodies to Pandemic H1N1 2009 Influenza Virus Among Hospital Staff in a Medical Center in Taiwan 4 https doi. Additional Resources Search engine and LDA https www. 20029306 2020 What is the range of incubation periods Estimation of instant case fatality rate of COVID 19 in Wuhan and Hubei based on daily case notification data 4 https doi. com uc id 1t vZhO3BOS4dHPuyhk7bcs0ODolEuQBZ Of the incubation periods that we collected from papers results section we can see that the median incubation period is about 5 days which is consistent with the majority of the reports. 14448062014 https doi. 1016 s0140 6736 20 30607 3 2020 Novel Coronavirus Disease 2019 COVID 19 An Emerging Infectious Disease in the 21st Century 62. If we break down the distribution by question we can see that studies on asymptomatic shedding also cover younger age groups. 011 2019 What is the range of incubation periods Epidemiological identification of a novel infectious disease in real time Analysis of the atypical pneumonia outbreak in Wuhan China 2019 20 5 https doi. 6116664938161 https www. 20038612 2020 What is the prevalence of asymptomatic shedding A Tempo geographic Analysis of Global COVID 19 Epidemic Outside of China 4 https doi. gov pmc articles PMC5059364 2016 What is the range of incubation periods A Comparative Study of Clinical Presentation and Risk Factors for Adverse Outcome in Patients Hospitalised with Acute Respiratory Disease Due to MERS Coronavirus or Other Causes 6 https www. 51264582289 https doi. This may suggest that an evaluative study is less feasible during non outbreak times. 6988682077355 https doi. 5029893105433 https www. gov pmc articles PMC6254533 2018 What is the prevalence of asymptomatic shedding Distribution of the COVID 19 epidemic and correlation with population emigration from wuhan China 4 https doi. 5887594233653 https doi. gov pmc articles PMC6518961 2019 What is the range of incubation periods Epidemiological Investigation of the Outbreak of Acute Respiratory Infection caused by Adenovirus Type B55 in a Physical Education School in 2017 5 https www. gov pmc articles PMC2941683 2010 What is the range of incubation periods Retrospective Evaluation of Control Measures for Contacts of Patient with Marburg Hemorrhagic Fever 9 https www. In addition the IQR is between 0 15 days which suggests the current convention of a 14 day quarantine might be adequate. 1016 s0196 0644 03 00817 5 2004 What is the range of incubation periods Porcine respiratory coronavirus spread in Catalunya Spain a previously infection free area 4 https doi. Consider the following example question What is the range of incubation periods in humans Instead of a google search we provide a strict semantically rich query such as the following covid 19 OR 2019 ncov OR ncov OR sars cov 2 OR. Effectiveness of movement control strategies to prevent secondary transmission in health care and community settings Persistence of virus on surfaces of different materials e g. 20028225 2020 What is the range of incubation periods BM25 TITLE SCORE URL YEAR Coronavirus Disease 2019 Coronaviruses and Blood Safety 112. 3996469079999 https doi. php wpsar article download 279 424 2014 What is the prevalence of asymptomatic shedding Real time estimation of the hospitalization fatality risk of influenza A H1N1 pdm09 in Hong Kong 4 https www. 081 2004 What is the prevalence of asymptomatic shedding Genetic characterization of human bocavirus among children with severe acute respiratory infection in China 4 https doi. However there are outliers whose incubation period lasts longer than 30 days. 100672 2020 First 12 patients with coronavirus disease 2019 COVID 19 in the United States 54. The downside however is that the search output can be too narrow when too many conditions are set or too broad when users do not have a clearly defined question. com uc id 1VrvlBTHH4D7xsrNp74wtLBamMZygG8Sy Table of Contents1. 628079748603 https doi. 7271866014761 https doi. 12851 2020 Epidemiology genome and clinical features of the pandemic SARS CoV 2 a recent view 71. 5822472168019 https doi. int csr resources publications ebola ebola case definition contact en. gov pmc articles PMC4546987 2015 What is the prevalence of asymptomatic shedding Real time characterization of risks of death associated with the Middle East respiratory syndrome MERS in the Republic of Korea 2015 5 https www. 20036780 2020 What is the prevalence of asymptomatic shedding PREDICTING THE EVOLUTION OF COVID 19 IN PORTUGAL USING AN ADAPTED SIR MODEL PREVIOUSLY USED IN SOUTH KOREA FOR THE MERS OUTBREAK 4 https doi. We developed a tool to help researchers identify among the thousands of research articles what is known about transmission incubation and environmental stability of COVID 19. cn112150 20200227 00196 2020 Analysis on the epidemic factors for the Corona Virus Disease 67. 20027755 2020 What is the range of incubation periods The Effects of Fangcang Huoshenshan and Leishenshan Makeshift Hospitals and Temperature on the Mortality of COVID 19 4 https doi. One subset of research questions relates to the lifespan of the virus. 0020 2020 Effective personal protective clothing for health care workers attending patients with severe acute respiratory syndrome 26. While we could not outpace the work of thousands of engineers over decades at Google the advantage of our highly narrow topic and a tool which experts are already highly familiar with seemed hard to ignore. 1366653736599 https doi. 8868255840328 https doi. 20018887 2020 What is the prevalence of asymptomatic shedding The Novel Coronavirus 2019 nCoV is Highly Contagious and More Infectious Than Initially Estimated 4 https doi. 20026559 2020 The value of early transmission dynamic studies in emerging infectious diseases 54. 20034629 2020 What is the range of incubation periods Transmissibility of 2019 Novel Coronavirus zoonotic vs. gov pmc articles PMC6822455 2019 The use of masks and respirators to prevent transmission of influenza a systematic review of the scientific evidence 40. 1016 s0140 6736 20 30360 3 2020 What is the range of incubation periods Effects of operational decisions on the diffusion of epidemic disease A system dynamics modeling of the MERS CoV outbreak in South Korea 4 https doi. 958272 2020 Clinical findings in a group of patients infected with the 2019 novel coronavirus SARS Cov 2 outside of Wuhan China retrospective case series 57. 1016 s0140 6736 20 30528 6 2020 Novel coronavirus infection and pregnancy 64. 20022400 2020 What is the range of incubation periods Epidemic analysis of COVID 19 in China by dynamical modeling 5 https doi. 1016 s1726 4901 10 70003 4 2010 What is the range of incubation periods Seroprevalence of SARS Coronavirus Among Residents Near a Hospital with a Nosocomial Outbreak 4 https doi. 0311203059996 https doi. 2320517721403 https doi. gov pmc articles PMC6788033 2019 What is the prevalence of asymptomatic shedding Occupational Animal Contact in Southern and Central Vietnam 5 https www. 1016 s1726 4901 09 70124 8 2005 What is the range of incubation periods Exudative epidermitis and porcine circovirus 2 infection in a Swedish SPF herd 4 https doi. 4165536075649 https doi. 20021162 2020 Serial interval in determining the estimation of reproduction number of the novel coronavirus disease COVID 19 during the early outbreak Journal of Travel Medicine Oxford Academic 68. 1265853521536 https doi. 003 2020 What is the range of incubation periods Dose dependent effects of specific egg yolk antibodies on diarrhea of newborn calves 5 https doi. 20029322 2020 How long are individuals infectious Seroprevalence and genotyping of avian infectious bronchitis virus detected from Iranian unvaccinated backyard chickens 4 https www. 20042358 2020 What is the prevalence of asymptomatic shedding SARS CoV 2 infection in health care workers a retrospective analysis and a model study 4 https doi. Visit our main notebook https www. 2059132506337 https www. 9608233002831 https doi. 5440500768382 https www. Part 3 Semantically meaningful Search Queries Instead of typing out a string of words that have approximate meanings like a google search our queries begin with precisely defined categories which the model is explicitly tuned to understand. These occur in two places First to extract sentences most similar to abstracts and second to replace context insensitive word representations traditionally used to train LDA. 014 2016 How effective are movement control strategies Negligible Risk of the COVID 19 Resurgence Caused by Work Resuming in China outside Hubei a Statistical Probability Study 4 https doi. 20027078 2020 Advances on presymptomatic or asymptomatic carrier transmission of COVID 19 59. 6222650433112 https doi. 1016 s0140 6736 20 30567 5 2020 The effect of non pharmaceutical interventions on COVID 19 cases deaths and demand for hospital services in the UK a modelling study 54. m606 2020 Analysis on the epidemic factors for the Corona Virus Disease 57. A keyword based search engine is simple and effective especially when the research question is specific or involves rarely used domain terminologies. gov pmc articles PMC4776270 2016 Sustainable social distancing through facemask use and testing during the Covid 19 pandemic 40. 1093 cid ciaa272 2020 What is the range of incubation periods Clinical analysis of 31 cases of 2019 novel coronavirus infection in children from six provinces autonomous region of northern China 5 https doi. 1007 s12630 020 01591 x 2020 Escalating infection control response to the rapidly evolving epidemiology of the coronavirus disease 2019 COVID 19 due to SARS CoV 2 in Hong Kong 58. cn112148 20200218 00093 2020 What is the range of incubation periods Diagnosis and clinical management of 2019 novel coronavirus infection an operational recommendation of Peking Union Medical College Hospital V2. 0815541143707 2020 Clinical features and sexual transmission potential of SARS CoV 2 infected female patients a descriptive study in Wuhan China 52. 81912004906 https www. org articles pmc4554585 pdf render 2013 What is the range of incubation periods Clinical and Laboratory Findings of the First Imported Case of Middle East Respiratory Syndrome Coronavirus to the United States 7 https academic. incubation periods and its related words such as exposure and symptom onset Part 4 Scanning for Relevant Articles Now that we have our search queries initial results are returned from the keyword search engine. 003 2020 What is the range of incubation periods Seroprevalence of Antibodies to Pandemic H1N1 2009 Influenza Virus Among Hospital Staff in a Medical Center in Taiwan 4 https doi. 1016 s1473 3099 20 30161 4 2020 Expert consensus on clinical diagnosis and treatment in foot and ankle surgery department during the epidemic of novel coronavirus pneumonia 53. Among the preventive measures movement control strategies have received more attention than personal protective equipment. 20042358 2020 What is the range of incubation periods SARS CoV 2 infection in health care workers a retrospective analysis and a model study 4 https doi. This notebook responds to Task What is known about transmission incubation and environmental stability We tackle this problem by creating a search system that comprises a keyword search engine and a recommender built with a semantic topic model. 6341219787311 https doi. 1016 s1473 3099 20 30162 6 2020 Fundamental principles of epidemic spread highlight the immediate need for large scale serological surveys to assess the stage of the SARS CoV 2 epidemic 41. 20030643 2020 How effective are personal protective equipment BM25 TITLE SCORE URL YEAR Practical recommendations for critical care and anesthesiology teams caring for novel coronavirus 2019 nCoV patients 64. 020 2007 What is the prevalence of asymptomatic shedding Seroepidemiological analysis of influenza pandemics in Shizuoka Prefecture and all Japan 4 https doi. 2479000402631 https doi. 20034827 2020 Dispersal of Respiratory Droplets With Open vs Closed Oxygen Delivery Masks Implications for the Transmission of Severe Acute Respiratory Syndrome 46. Software https drive. Our search engine is built with Whoosh a pure Python search engine library. To address the disadvantages we leveraged newer more sophisticated context specific models SciBERT with fine tuning around the essential keywords for our topic to present a state of the art search experience. 12174 2013 How long are individuals infectious Clinical characteristics of COVID 19 infected cancer patients A retrospective case study in three hospitals within Wuhan China 4 https doi. 008 2015 What is the range of incubation periods Infectious agents associated with diarrhoea of calves in the canton of Tilarán Costa Rica 4 https doi. 6613807546182 Duration of viral detection in throat and rectum of a patient with COVID 19 61. Participants in the studies on effectiveness of PPE were mostly in their 20s few data. AND incubation period OR onset AND exposure What the software sees is equivalent to the following Target disease COVID 19 and its synonyms such SARS Cov 2 novel coronavirus coronavirus disease 2019 etc Population of interest children elderly pregnant women healthcare workers and so on Population not of interest since the question is about humans it makes sense to exclude animal related keywords Setting healthcare facilities or community Outcome the specific variable we are trying to evaluate e. 1386277332264 https doi. pdf div class title real time estimation of the hospitalization fatality risk of influenza a h1n1 pdm09 in hong kong div. 003 2020 Patient collected tongue nasal and mid turbinate swabs for SARS CoV 2 yield equivalent sensitivity to health care worker collected nasopharyngeal swabs 56. Of the search results that we were able to extract mean or median age we can see that the majority of the study participants were adults and the most frequent mean or median age was in the early 40s. 624450617392 https doi. 6605769269316 https doi. org core services aop cambridge core content view 5CADC6C6F93B8CE22B3004366CAFE1C3 S0950268815003179a. 4418468040588 https doi. 582148016376 https www. cn112140 20200225 00138 2020 What is the range of incubation periods Comparison of heart failure and 2019 novel coronavirus pneumonia in chest CT features and clinical characteristics 5 https doi. 20021154 2020 What is the prevalence of asymptomatic shedding Phase adjusted estimation of the number of 2019 novel coronavirus cases in Wuhan China 4 https doi. 20029397 2020 What is the range of incubation periods Clinical Characteristics of Patients with Severe Pneumonia Caused by the 2019 Novel Coronavirus in Wuhan China 4 https doi. Finally articles that consistently appear across these lists are filtered to the top. 032 2020 What is the range of incubation periods Drugs supply and pharmaceutical care management practices at a designated hospital during the COVID 19 epidemic 5 https doi. gov pmc articles PMC7098032 2020 What is the range of incubation periods The experience of high flow nasal cannula in hospitalized patients with 2019 novel coronavirus infected pneumonia in two hospitals of Chongqing China 5 https www. 025 2020 What is the range of incubation periods Importation of travel related infectious diseases is increasing in South Korea An analysis of salmonellosis shigellosis malaria and dengue surveillance data 4 https doi. 010 2020 What is the range of incubation periods COVID 19 and gender specific difference Analysis of public surveillance data in Hong Kong and Shenzhen China from January 10 to February 15 2020 4 https www. Read our story https medium. 1155 2004 Are Powered Air Purifying Respirators a Solution for Protecting Healthcare Workers from Emerging Aerosol Transmissible Diseases 43. 004 2019 What is the range of incubation periods Predictive model of diagnosing probable cases of severe acute respiratory syndrome in febrile patients with exposure risk 4 https doi. gov pmc articles PMC6013221 2018 What is the prevalence of asymptomatic shedding Impact and clinical profiles of Mycoplasma pneumoniae co detection in childhood community acquired pneumonia 5 https www. 001 2020 What is the range of incubation periods Influence of meteorological factors and air pollution on the outbreak of severe acute respiratory syndrome 4 https doi. 2406224136167 https doi. 1016 s1726 4901 10 70003 4 2010 What is the prevalence of asymptomatic shedding Infectious agents associated with diarrhoea of calves in the canton of Tilarán Costa Rica 4 https doi. gov pmc articles PMC5094725 2016 What is the range of incubation periods To what extent are Arab pilgrims to Makkah aware of the middle east respiratory syndrome coronavirus and the precautions against it 6 https www. This could be due to the lack of research that investigates the environmental sustainability of the virus as suggested by the search result distribution. gov pmc articles PMC4945730 2016 What is the range of incubation periods Impact of a porcine epidemic diarrhea outbreak on swine productivity in Japan a retrospective cohort study 6 https www. 20049973 2020 2. 20045500 2020 How effective are movement control strategies Modeling risk of infectious diseases a case of Coronavirus outbreak in four countries 4 https doi. Summary findings What is the range of incubation periods BM25 TITLE SCORE URL YEAR The Incubation Period of Coronavirus Disease 2019 COVID 19 From Publicly Reported Confirmed Cases Estimation and Application 75. 147208158072 https doi. 4961448580559 https www. 003 2020 Asymptomatic carrier state acute respiratory disease and pneumonia due to severe acute respiratory syndrome coronavirus 2 SARSCoV 2 Facts and myths 96. particularly children. ResultsThe following plot shows the number of articles found by the keyword search engine and number of additional articles suggested by the LDA model. 20047159 2020 What is the range of incubation periods Estimating the presymptomatic transmission of COVID19 using incubation period and serial interval data 4 https doi. 1016 s0378 1135 02 00024 x 2002 What is the range of incubation periods A Locally Transmitted Case of SARS CoV 2 Infection in Taiwan 4 https www. 1726747587346 https doi. 001 2020 Unique epidemiological and clinical features of the emerging 2019 novel coronavirus pneumonia COVID 19 implicate special control measures 64. 4386153565966 https doi. 9769552645044 https www. 20023465 2020 How long are individuals infectious Improved survival rates in patients with H1N1 acute respiratory failure in Korea between 2009 and 2016 5 https www. pdf 2010 Effects of temperature on COVID 19 transmission 63. 25748 2020 Serial interval in determining the estimation of reproduction number of the novel coronavirus disease COVID 19 during the early outbreak Journal of Travel Medicine Oxford Academic 61. 8938200347631 https doi. 021 2020 How will country based mitigation measures influence the course of the COVID 19 epidemic 54. 20039602 2020 What is the prevalence of asymptomatic shedding Comorbid Diabetes Mellitus was Associated with Poorer Prognosis in Patients with COVID 19 A Retrospective Cohort Study 4 https doi. Instead of using traditional similarity models that do not account for context we use context sensitive ones SciBERT a BERT model pre trained on scientific literature to enable semantic searching. gov pmc articles PMC3972139 2014 What is the prevalence of asymptomatic shedding Surveillance operation for the 141st confirmed case of Middle East Respiratory Syndrome coronavirus in response to the patient s prior travel to Jeju Island 5 https www. gov pmc articles PMC5779801 2011 Severe acute respiratory syndrome SARS lessons learnt in Hong Kong 34. gov pmc articles PMC1564025 2006 COVID 19 pandemic Impact of lockdown contact and non contact transmissions on infection dynamics 28. 2706185582631 https www. 2481 2003 Estimation of the Transmission Risk of the 2019 nCoV and Its Implication for Public Health Interventions 50. 8304569382429 https doi. cn112338 20200228 00207 2020 Advances on presymptomatic or asymptomatic carrier transmission of COVID 19 59. 012 2004 Prevention of nosocomial transmission of swine origin pandemic influenza virus A H1N1 by infection control bundle 29. 20044271 2020 How effective are movement control strategies COVID 19 Projecting the impact in Rohingya refugee camps and beyond 4 https doi. For each result the topic model Part 2 finds the 20 closest matched articles. Contributors task team PreambleThis is a notebook created by a collaborative effort of CoronaWhy. 1927190014226 https doi. logo https drive. 1731272 2020 A Multiscale and Comparative Model for Receptor Binding of 2019 Novel Coronavirus and the Implication of its Life Cycle in Host Cells 57. pdf ua 1 2014 What is the prevalence of asymptomatic shedding 724. gov pmc articles PMC6609751 2019 What is the range of incubation periods Improved survival rates in patients with H1N1 acute respiratory failure in Korea between 2009 and 2016 5 https www. cn112150 20200227 00196 2020 Analysis on the epidemic factors for the Corona Virus Disease 57. But children s data come from only one study and should be interpreted with caution. org multi disciplinary global effort of volunteers. gov pmc articles PMC7113020 2017 How long are individuals infectious Preliminary study of the relationship between novel coronavirus pneumonia and liver function damage a multicenter study 5 https doi. com arturkiulian im an ai researcher and here s how i fight corona 1e0aa8f3e714. 20028431 2020 Coronavirus Disease 2019 COVID 19 Pandemic and Pregnancy 56. 003 2020 What is the prevalence of asymptomatic shedding Lack of SARS Transmission among Healthcare Workers United States 5 https www. 1016 s0140 6736 20 30520 1 2020 All questions LDA QUESTION TITLE SCORE URL YEAR What is the range of incubation periods Air pollution and case fatality of SARS in the People s Republic of China an ecologic study 10 https www. gov pmc articles PMC4456770 2014 What is the range of incubation periods Prevalence and analysis of associated risk factors for Cryptosporidium infection in lambs in Jammu district 7 http europepmc. gov pmc articles PMC7113032 2020 What is the range of incubation periods Risk factors for neonatal calf diarrhoea and enteropathogen shedding in New Zealand dairy farms 4 https doi. com uc id 1RrYF_32jb4mSZ5BM9iPmAanc1VYPrOoO ApproachTo maximize the effectiveness of a tool for experts we took the approach of building a powerful intuitive tool designed to tackle a very specific problem very well. 1016 0167 5877 95 00561 7 1996 What is the range of incubation periods Comparison of Hospitalized Patients with Acute Respiratory Distress Syndrome Caused by COVID 19 and H1N1 5 https doi. gov pmc articles PMC4588253 2015 What is the prevalence of asymptomatic shedding Impact of a porcine epidemic diarrhea outbreak on swine productivity in Japan a retrospective cohort study 5 https www. 20042317 2020 What is the range of incubation periods Comorbid Diabetes Mellitus was Associated with Poorer Prognosis in Patients with COVID 19 A Retrospective Cohort Study 4 https doi. 20037036 2020 What is the range of incubation periods A Fully Automatic Deep Learning System for COVID 19 Diagnostic and Prognostic Analysis 4 https doi. gov pmc articles PMC3906895 2014 What is the range of incubation periods Integrated cluster and case based surveillance for detecting stage III zoonotic pathogens an example of Nipah virus surveillance in Bangladesh 8 https www. 20027763 2020 What is the prevalence of asymptomatic shedding Case fatality risk of novel coronavirus diseases 2019 in China 4 https doi. 1265853521536 2020 Serial interval in determining the estimation of reproduction number of the novel coronavirus disease COVID 19 during the early outbreak Journal of Travel Medicine Oxford Academic 55. In this demonstration we extracted mean or median age from the Methods and Results sections of the papers as well as incubation periods and prevalence of asymptomatic infection in the Results section. 021 2020 Transmission of COVID 19 in the terminal stage of incubation period a familial cluster 68. These individuals can continue to transmit disease after quarantine. Introduction task introduction 3. 1016 0167 5877 94 90032 9 1994 What is the range of incubation periods Outbreak investigation for COVID 19 in northern Vietnam 4 https doi. 6424751530181 https doi. 010 2015 What is the range of incubation periods Insights into the cross species evolution of 2019 novel coronavirus 4 https doi. human to human transmission China 2019 2020 4 https doi. gov pmc articles PMC7121221 2020 What is the prevalence of asymptomatic shedding The outbreak pattern of SARS cases in China as revealed by a mathematical model 4 https doi. For example how long should a person in contact with a patient or with travel history to affected regions be quarantined How long should a recovering patient continue to self isolate to lower the risk of ongoing transmission Meanwhile knowledge regarding the virus s viability in various surfaces and environments is crucial for advising health care facilities schools workplaces and other community organizations on disinfection procedures and the use of personal protective equipment. 8848472827262 https doi. 027 2020 Analysis on the epidemic factors for the Corona Virus Disease 67. gov pmc articles PMC222908 2003 What is the range of incubation periods Projections of Ebola outbreak size and duration with and without vaccine use in Équateur Democratic Republic of Congo as of May 27 2018 5 https www. 8221578012529 2020 2019 nCoV new challenges from coronavirus 62. 20045740 2020 Transmission characteristics of the COVID 19 outbreak in China a study driven by data 58. gov pmc articles PMC3322937 2004 What is the prevalence of asymptomatic shedding The first detection of influenza in the Finnish pig population a retrospective study 5 https www. Software task software 6. pdf 2014 What is the range of incubation periods Institutional Preparedness to Prevent Future Middle East Respiratory Syndrome Coronavirus Like Outbreaks in Republic of Korea 7 https www. Preamble task preview 2. 2911729989487 https doi. 011 2006 Determining the filtration efficiency of half face medical protection mask N99 against viral aerosol 53. 1016 s1473 3099 20 30159 6 2020 What is the range of incubation periods Clinical characteristics of severe acute respiratory syndrome coronavirus 2 reactivation 4 https doi. 95 2006 What is the prevalence of asymptomatic shedding Demographic Variations of MERS CoV Infection among Suspected and Confirmed Cases An Epidemiological Analysis of Laboratory Based Data from Riyadh Regional Laboratory 4 https www. 6513908241144 https doi. gov pmc articles PMC5693564 2016 What is the prevalence of asymptomatic shedding Estimating the incubation period of hand foot and mouth disease for children in different age groups 5 https www. 5368471088273 https doi. 9894699579604 https doi. gov pmc articles PMC5705633 2017 What is the prevalence of asymptomatic shedding Epidemiological factors and worldwide pattern of Middle East respiratory syndrome coronavirus from 2013 to 2016 5 https www. 020 2017 What is the range of incubation periods Clinical Features and Outcomes of Severe Acute Respiratory Syndrome and Predictive Factors for Acute Respiratory Distress Syndrome 4 https doi. Proof of Concept Data Extraction and Synthesis Tool In addition to the search results we explored the feasibility of extracting study attributes and outcomes using a combination of Natural Language Processing techniques including entity relation extraction and rule based matching. 100672 2020 Prolonged viral shedding in feces of pediatric patients with coronavirus disease 2019 69. 5476541030732 https royalsocietypublishing. 6988682077355 2020 Diarrhea during COVID 19 infection pathogenesis epidemiology prevention and management 65. gov pmc articles PMC5362064 2017 What is the prevalence of asymptomatic shedding Ebola Virus Disease in West Africa The First 9 Months of the Epidemic and Forward Projections 4 http www. Task Overview task overview 4. 0169974924766 https doi. 023 2007 What is the range of incubation periods Lack of nasal carriage of novel corona virus HCoV EMC in French Hajj pilgrims returning from the Hajj 2012 despite a high rate of respiratory symptoms 4 https doi. 3866265470299 https www. gov pmc articles PMC5896642 2018 What is the prevalence of asymptomatic shedding The association between temperature rainfall and humidity with common climate sensitive infectious diseases in Bangladesh 5 https www. ", "id": "crispyc/coronawhy-org-task-transmission-incubation", "size": "60894", "language": "python", "html_url": "https://www.kaggle.com/code/crispyc/coronawhy-org-task-transmission-incubation", "git_url": "https://www.kaggle.com/code/crispyc/coronawhy-org-task-transmission-incubation", "script": "", "entities": "(('What', 'model https retrospective 4 doi'), '20042358') (('range', 'Predictive Acute Respiratory Distress Syndrome'), '020') (('gov pmc', 'question answer'), 'article') (('community we', 'interest'), 'effectiveness') (('how long individuals', 'even recovery'), 'narrow') (('What', 'https 4 doi'), '20021154') (('2 year prospective cohort', 'https 4 doi'), '0000000000000782') (('enteropathogen shedding', 'dairy https 4 doi'), 'article') (('we', 'policy immediate impact'), 'focus') (('Factors', 'Surveillance https Data 5 www'), 'article') (('Novel Coronavirus 6736 20 30607 3 2020 Disease', '21st Century'), '1016') (('2020 Clinical findings', 'China case 2 outside Wuhan retrospective series'), '958272') (('that', 'top'), 'filter') (('gov pmc 2017 What', 'Sousse area'), 'articles') (('First 9 Months', '4 www'), 'article') (('gov pmc What', 'Novel Influenza A https Avian Origin H7N9 Virus 5 www'), 'article') (('95 What', 'Riyadh Regional Laboratory'), '2006') (('we', 'very specific problem'), 'com') (('4901 10 70003 4 2010 What', 'https 4 doi'), '1016') (('Overall progression', 'control measures'), 'com') (('gov pmc range', 'Middle South https East 5 www'), 'article') (('we', 'additional attributes'), 'be') (('initial results', 'keyword search engine'), 'period') (('range', 'Wuhan China'), '2019') (('SCORE URL Incubation TITLE Period', 'Confirmed Cases 19 Publicly Reported Estimation'), 'finding') (('What', 'https Hong Kong 4 www'), 'download') (('20029322 How individuals', 'https Iranian unvaccinated backyard chickens 4 www'), '2020') (('COVID', 'Beijing'), '20027201') (('immunosorbent linked assay', 'Prince Edward https Island Canada 4 www'), '3390') (('google Instead we', 'such following covid 19 2019 ncov'), 'consider') (('range', 'https Hemorrhagic Fever 9 www'), 'article') (('gov pmc 2017 updated estimation', '46'), 'article') (('006 is', 'https 4 doi'), '2013') (('we', 'semantic searching'), 'use') (('current interventions', 'pandemic'), 'assess') (('How long individuals', 'multiplier https 4 doi'), 'be') (('experience', 'Chongqing https China 5 www'), 'article') (('How individuals', 'https 2009 5 www'), 'be') (('97 00038 1998 is', 'outbreak https First respiratory transmitted 4 doi'), '1016') (('gov pmc What', 'Micronesia'), 'article') (('ResultsThe', 'LDA model'), 'show') (('we', 'entity relation extraction'), 'Proof') (('2020 How country', 'COVID'), '021') (('gov pmc is', 'https 6 www'), 'article') (('gov pmc range', 'https 2017 5 www'), 'article') (('What', 'cases isolation tracing measures'), '1670707465455') (('CoV 2 Infection', 'https Taiwan 4 www'), '1016') (('Porcine respiratory coronavirus', 'Catalunya Spain'), '1016') (('Estimating', '16 February'), '20032896') (('most studies', 'disease transmission characteristics'), 'com') (('2020 Unique epidemiological features', 'control 19 implicate special measures'), 'COVID') (('number', 'search initial output'), 'appear') (('gov pmc', 'Mexico City'), 'article') (('is', 'https 4 doi'), '113490') (('Part', '2 20 closest matched articles'), 'find') (('what', 'environmental COVID'), 'develop') (('prevalence', 'https 5 www'), 'article') (('100672 2020 First 12 patients', 'United 19 States'), 'COVID') (('scientific community', 'COVID'), 'request') (('gov pmc 2015 What', 'Middle South https East 4 www'), 'article') (('Word construction', 'documents'), 'process') (('20047977 2020', 'Emerging Aerosol Transmissible Diseases'), 'be') (('gov pmc What', 'mathematical model'), 'article') (('retrospective cohort', 'https 5 www'), 'article') (('first detection', 'pig Finnish population'), 'article') (('Lack', 'respiratory symptoms'), '023') (('Case control infectious study', 'https 4 doi'), 'article') (('2004 prevalence', 'https 4 doi'), '081') (('Clinical Characteristics', 'https 4 doi'), '20029397') (('008 How individuals', 'https 4 doi'), '2012') (('2020 Unique epidemiological features', 'control 19 implicate special measures'), '0001') (('What', 'https automated workflow 4 doi'), '20031005') (('6424751530181 How persistence', 'South Korea'), '2020') (('2019 range', 'exposure https 4 doi'), '004') (('III zoonotic', 'https Bangladesh 8 www'), 'article') (('This', 'similar articles'), 'provide') (('tool', 'stage'), 'com') (('003 range', 'incubation periods'), '2017') (('gov pmc 2016 is', 'Punjab Province'), 'article') (('4901 10 70003 4 2010 range', 'https Nosocomial Outbreak 4 doi'), '1016') (('com uzairakhan coronawhy task', 'https Data extraction www'), 'tie') (('Full code', 'extractions'), 'document') (('we', 'search system'), 'represent') (('too when users', 'clearly defined question'), 'be') (('org articles', 'United 7 https'), 'render') (('gov pmc PMC1564025', 'contact infection non dynamics'), 'article') (('gov pmc How long nosocomial pathogens', 'systematic review'), 'article') (('What', 'China'), '20027763') (('That', 'Self Limited Outbreaks'), '20028829') (('about 5 which', 'reports'), 'com') (('movement control strategies', 'personal protective equipment'), 'receive') (('Importation', 'salmonellosis shigellosis surveillance malaria data'), '025') (('1 2014 What', '724'), 'pdf') (('How long individuals', 'https 4 doi'), 'be') (('novel coronavirus', 'Peking Union Medical College Hospital V2'), 'cn112148') (('2020 Transmission', 'incubation period'), '021') (('experts', 'already highly seemed'), 'outpace') (('Mass 2004 masking', 'guidance'), 'need') (('gov pmc What', 'traditional epidemiological tracing'), 'article') (('1016 6226 90113 How individuals', 'Nasopharyngeal https Swab 4 doi'), '0301') (('What', 'INFLUENZA A H1N1 BRAZIL'), 'article') (('Novel Coronavirus 2019 nCoV', 'https Highly More Initially 4 doi'), '20018887') (('gov pmc What', 'https Jeju Island 5 www'), 'article') (('survival Improved rates', 'https 2009 5 www'), 'article') (('Prolonged viral', '2019 69'), '100672') (('individuals', 'quarantine'), 'continue') (('where we', 'additional attributes'), 'showcase') (('prevalence', 'https Southern Vietnam 5 www'), 'article') (('engine', 'BM25 scores'), 'do') (('1155 2004', 'Emerging Aerosol Transmissible Diseases'), 'be') (('Participants', 'mostly 20s few data'), 'be') (('research especially when question', 'domain rarely used terminologies'), 'be') (('infectious Preliminary study', 'liver study https multicenter 5 doi'), 'article') (('hospital high efficient emergency responsive mode', 'https 4 doi'), '20035212') (('Transmission characteristics', 'data'), '20045740') (('6736 20 30360 3 2020 range', 'South Korea'), '1016') (('296 How individuals', 'COVID'), '2020') (('0167 5877 90032 9 is', '19 northern Vietnam'), '1016') (('What', 'Shizuoka Prefecture'), '020') (('3099 20 30162 6 2020 Fundamental principles', 'SARS CoV 2 epidemic'), '1016') (('gov pmc 2015 What', 'Korea'), 'article') (('003 2020 Patient', 'nasopharyngeal swabs'), 'collect') (('What', 'https 4 doi'), '20036780') (('What', 'https 4 doi'), '20047159') (('12851 2020 Epidemiology genome features', 'SARS pandemic CoV'), 'view') (('gov pmc What', 'https 2013 4 www'), 'article') (('19 infection', 'pregnant women'), '20052308') (('What', 'Taiwan'), 'cclm') (('incubation However period', 'longer than 30 days'), 'be') (('BM25', 'cases'), '20050328') (('Coronavirus', 'https front line 4 doi'), 'article') (('preventive measures', 'large outbreaks'), 'com') (('reproduction basic number', 'https 4 doi'), '20051318') (('search engine', 'Python search engine pure library'), 'build') (('what', 'population'), 'require') (('gov pmc What', 'https 5 www'), 'article') (('org core services', 'aop cambridge core 5CADC6C6F93B8CE22B3004366CAFE1C3 S0950268815003179a'), 'view') (('19 infection', 'retrospective medical records'), '1016') (('range', 'Infectious Hubei https 19 Designated Diseases HospitalOutside Province China 4 doi'), 'article') (('What', 'Epidemic 19 China'), '20038612') (('2016 What', 'Saudi Arabia'), 'article') (('is', 'https pneumonia 5 www'), 'article') (('Meanwhile knowledge', 'personal protective equipment'), 'quarantine') (('data', 'caution'), 'come') (('we', 'Results section'), 'extract') (('retrospective cohort', 'https 6 www'), 'article') (('model', 'which'), 'Queries') (('contacts', 'https Sénégal 4 www'), 'article') (('gov pmc ACE2 2011 variants', '19 Italian population'), 'article') (('Comorbid Diabetes asymptomatic Mellitus', 'COVID'), '20039602') (('retrospective cohort', 'https 4 doi'), '20032326') (('retrospective descriptive multiple center', 'https 4 doi'), '20029009') (('current convention', 'day 14 quarantine'), 'be') (('that', 'topic semantic model'), 'respond') (('gov pmc What', 'https 4 doi'), 'article') (('is', 'https 4 doi'), '0000000000018782') (('2015 What', 'Middle https East Respiratory Syndrome 4 www'), 'pdf') (('0167 95 00561 7 1996 range', 'COVID'), '1016') (('Four years', 'https 5 www'), 'article') (('LDA TITLE SCORE URL 6736 20 30520 1 range', 'China'), '1016') (('20024281 What', 'Wuhan China'), '2020') (('how community', 'historical context'), 'join') (('What', 'https United States 5 www'), '003') (('is', 'https SARS CoV 2 4 doi'), '20025320') (('20200227 00137 2020 What', 'Corona Virus https Disease 4 doi'), 'cn112152') (('Comorbid Diabetes Mellitus', 'COVID'), '20042317') (('LDA model', 'articles'), 'process') (('Escalating infection control 020 01591 response', 'Hong 2 Kong'), '1007') (('Exudative epidermitis 2 infection', 'SPF Swedish herd'), '1016') (('most frequent median age', 'early 40s'), 'see') (('gov pmc What', 'https Bangladesh 5 www'), 'article') (('014 2016', 'Hubei'), 'be') (('2016 Comparative analyses', 'virus potentially consequential interaction'), 'article') (('Effectiveness', 'different materials'), 'g.') (('gov pmc How individuals', 'study https worldwide 5 www'), 'article') (('we', 'e.'), 'period') (('is', 'https dynamical modeling 5 doi'), '20022400') (('movement control How strategies', 'https 4 doi'), '20044271') (('Coronavirus', 'four countries'), '2020') (('topic', 'art search experience'), 'address') (('Coronavirus Disease', '2019 19 Pandemic'), 'COVID') (('even recovery', 'self quarantine policies'), 'understand') (('here how i', 'corona 1e0aa8f3e714'), 'arturkiulian') (('Contributors task PreambleThis', 'CoronaWhy'), 'team') (('gov pmc 2010 Impact', 'term government short COVID 19 epidemic'), 'article') (('question', 'relevant TIES'), 'take') (('studies', 'age also younger groups'), 'see') (('These', 'traditionally LDA'), 'occur') (('evaluative study', 'outbreak less non times'), 'suggest') (('that', 'search result distribution'), 'be') (('One subset', 'virus'), 'relate') (('20200223 00153 2020 What', 'Wuhan China'), 'cn112338') (('com document edit 1VWGV 7DC7zYcrwelEZmhahiIupazmTUuSca42vZPEDY dataset children', 'adults'), 'd') ", "extra": "['biopsy of the greater curvature', 'disease', 'gender', 'onset', 'organization', 'outcome', 'patient', 'test', 'diagnosis', 'procedure']"}