{"name": "covid 19 literature clustering ", "full_name": " h1 COVID 19 Literature Clustering h4 t SNE Scatter Plot from CORD 19 h2 The full version of the interactive plot h2 https maksimekin github io COVID19 Literature Clustering plots t sne covid 19 interactive html h2 GitHub h2 https github com MaksimEkin COVID19 Literature Clustering h2 Link to the paper h2 https www maksimeren com publication eren doceng2020 h2 How to Cite This Work h1 Goal h4 We welcome feedback so that we can continue to improve this project h1 Approach h1 Table of Contents h1 Loading the Data h4 Cite Dataset Parsing Code Kaggle COVID EDA Initial Exploration Tool h3 Loading Metadata h3 Fetch All of JSON File Path h3 Helper Functions h3 Load the Data into DataFrame h2 Take a Look at the Data h1 Data Pre processing h3 Handling multiple languages h3 Stopwords h4 Cite Custom Stop Words Topic Modeling Finding Related Articles h3 Next let s create a function that will process the text data for us h1 Vectorization h1 PCA Clustering h3 How many clusters h3 Run k means h1 Dimensionality Reduction with t SNE h1 Topic Modeling on Each Cluster h3 Save current outputs to file h1 Plotting the data h2 Load the Keywords per Cluster h2 Setup h2 Widgets h2 Style h2 SHOW h1 Conclusion h1 Citation Sources ", "stargazers_count": 0, "forks_count": 0, "description": "Grouping the literature in this way allows for professionals to quickly find material related to a central topic. The similar article will thus be in closer proximity to each other. 3419591 author Eren Maksim Ekin and Solovyev Nick and Raff Edward and Nicholas Charles and Johnson Ben title COVID 19 Kaggle Literature Organization year 2020 isbn 9781450380003 publisher Association for Computing Machinery address New York NY USA url https doi. This project can further be improved by abstracting the underlying data analysis techniques as described in this notebook to develop a user interface tool that presents the related articles in a user friendly manner. Search can be performed inside of a selected cluster or the entire dataset if preferred. Hovering over points on the plot will give basic information like title author journal and abstract. This is a result of t SNE and k means finding different connections in the higher dimensional data. Load the Data into DataFrameUsing the helper functions let s read the articles into a DataFrame that can be used easily Take a Look at the Data Data Pre processingUnfortunately running the next steps of the notebook is not possible on the full dataset within Kaggle. com publication eren_doceng2020 How to Cite This Work inproceedings 10. We want to make sure that the important outputs for generating the bokeh plot are saved for future use. abstract is short enough get metadata information if more than one author more than 2 authors may be problem when plotting so take first 2 append with. The clustering of the data was done through k means on a pre processed vectorized version of the literature s body text. Through topic modeling we will find out what the most important terms for each cluster are. We welcome feedback so that we can continue to improve this project. com danielwolffram topic modeling finding related articles Let s take a look at the language distribution in the dataset Next let s create a function that will process the text data for us. howpublished url https www. Attempting to translate foreign texts gave the following problems 1. PNG attachment kmeans. In Kaggle we will limit the dataframe to 10 000 instancesNow that we have our dataset loaded we need to clean up the text to improve any clustering or classification efforts. With this increase in the scientific literature there arose a need for organizing those documents. This will reduce the complexity of our dimensionality reduction step and filter noise. This leads to the loss of experience from different geographic locations in dealing with COVID 19 The algorithms used in this notebook are stochastic so the results may vary depending on the random state. Approach Parse the text from the body of each document using Natural Language Processing NLP. Cite Custom Stop Words Topic Modeling Finding Related Articles https www. Topic Modeling on Each Cluster7. No in between clustering either looks ok or is very wrong Loss of foreign language papers. com maksimeren covid 19 literature clustering Unsupervised Learning Clustering with K Means inproceedings Raff2020 author Raff Edward and Nicholas Charles and McLean Mark booktitle The Thirty Fourth AAAI Conference on Artificial Intelligence title A New Burrows Wheeler Transform Markov Distance url http arxiv. Apply Dimensionality Reduction to each feature vector Xi using t Distributed Stochastic Neighbor Embedding t SNE to cluster similar research articles in the two dimensional plane X embedding Y1. t SNE will attempt to preserve the relations of the higher dimensional data as closely as possible when shrunk to 2D. We hope that our work will have some impact on the fight against COVID 19. This tool was created to help make it easier for trained professionals to sift through many many publications related to the virus and find their own determinations. API calls were limited2. We describe an approach to organize and visualize the scientific literature on or related to COVID 19 using machine learning techniques so that papers on similar topics are grouped together. Run k means Dimensionality Reduction with t SNEUsing t SNE https lvdmaaten. We greatly appreciate tips suggestions and upvotes If you would like to check out the interactive plot with the full dataset please visit https maksimekin. It can be downloaded and used locally offline. Instead of having to manually search for related work every publication is connected to a larger topic cluster. jpg First we will create 20 vectorizers one for each of our cluster labelsNow we will vectorize the data from each of our clustersTopic modeling will be performed through the use of Latent Dirichlet Allocation LDA. org wiki K means_clustering How many clusters To find the best k value for k means we ll look at the distortion at different k values. com MaksimEkin COVID19 Literature ClusteringLink to the paper https www. This is a model for processing biomedical scientific or clinical text. This looks pretty bland. Papers written on highly similar topics are typically near each other on the plot and bear the same k means label. Some areas we thought were great pros The tool is saved as an HTML file. We implemented this approach using the widely recognized CORD 19 dataset to present a publicly available proof of concept. beginning of the document was not in a good format what let s see if we can find any text in abstract. For example one subcluster consisted of papers that tried to determine the efficacy of masks in preventing the spread of COVID 19. The full plot is available is at https maksimekin. The papers are all up on the plot and can be quickly examined by hovering over them. As k means simply split the data into clusters topic modeling through LDA was performed to identify keywords. Cite Dataset Parsing Code Kaggle COVID EDA Initial Exploration Tool https www. To try to understand what the similarities may be we have also performed topic modeling on each cluster of papers to pick out the key terms. For example MASK CLUSTER EXAMPLE FROM FINAL PLOT. This gave the topics that were prevalent in each of the clusters. 3098111 acmid 3098111 publisher ACM address New York NY USA keywords cyber security jaccard similarity lempel ziv malware classification normalized compression distance Thank you for looking at our notebook. This has allowed for an interactive scatter plot of papers related to COVID 19 in which material of similar themes is grouped. In this notebook all of the algorithms are set to random state 42 the meaning of life to ensure reproducible results Citation SourcesKaggle Submission COVID 19 Literature Clustering Kaggle https www. First let s drop Null values Handling multiple languagesNext we are going to determine the language of each paper in the data frame. authors will fit in plot if only one author or Null valie add the title information add breaks when needed if title was not provided add the journal information add doi set seed hold label language go through each text split by space into list take the first x intex join with space ught. Not all of the sources are English and the language needs to be identified so that we know how to handle these instancesWe will be dropping any language that is not English. For topic modeling we will use LDA Latent Dirichlet Allocation. Apply k means clustering on Y2 where k is 20 to label each cluster on Y1. We will now fit_transform all the LDA models on their respective cluster vectorsExtracts the keywords from each clusterAppend list of keywords for a single cluster to 2D list of length NUM_TOPICS_PER_CLUSTER Save current outputs to fileRe running some parts of the notebook especially vectorization and t SNE are time intensive tasks. The centroids are updated iteratively. How to Use the Plot 10. Future thoughts to consider cons Possible false positives difficult to draw an exact line between subjects K means and t SNE are unsupervised approaches that will not necessarily predictably group instances. If the abstract seems interesting the user can click on the point to bring up a text box with more information that will contain a link to the full paper Patterns in the data found through clustering dimensionality reduction may not be readily apparent to researchers. t SNE was able to reduce the dimensionality of the texts but now clustering is required. It is portable mobile easily deployable and failover safe the risk of denial of service in the case of emergencies such as the loss of network connection is mitigated Dimensionality reduction allows for the whole dataset to be easily accessible. COVID 19 Literature Clusteringt SNE Scatter Plot from CORD 19The full version of the interactive plot https maksimekin. By doing so the navigation of topics and related papers is simplified. This is the desired number of clusters. By pairing this with Bokeh we can create an interactive plot of the literature. Distortion computes the sum of squared distances from each point to its assigned center. We will apply Principle Component Analysis PCA to our vectorized data. Now the above stopwords are used in everyday English text. So that step took a while Let s take a look at what our data looks like when compressed into 2 dimensions. Even so it was apparent that articles on key topics could be easily found near each other. Use Principal Component Analysis PCA to project down the dimensions of X to several dimensions that will keep. Dimensionality Reduction with t SNE6. We believe that health professionals can use this tool to find real links in the texts. To separate the literature k means will be run on the vectorized text. By organizing the literature qualified people can quickly find related publications that answer the task questions. This will convert our string formatted data into a measure of how important each word is to the instance out of the literature as a whole. The topics of these papers often intersect so it was hard to cleanly separate them. Interestingly both k means and t SNE can find independent clusters even though they were run independently. For this purpose we will be using the spacy library. Topic Modeling on Each ClusterNow we will attempt to find the most significant words in each cluster. However due to the complexity of the dataset k means and t SNE will sometimes arrive at different decisions. htmlGitHub https github. io tsne we can reduce our high dimensional features vector to 2 dimensions. Thank you Daniel Wolffram for the idea. This is for the interactive plot so that the hover tool fits the screen. Tucker booktitle High Performance Computing and Data Analytics Workshop year 2019 month September location Linthicum Heights MD USA inproceedings raff_lzjd_2017 author Raff Edward and Nicholas Charles title An Alternative to NCD for Large Sequences Lempel Ziv Jaccard Distance booktitle Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining series KDD 17 year 2017 isbn 978 1 4503 4887 4 location Halifax NS Canada pages 1007 1015 numpages 9 url http doi. By using Bokeh the plot will be interactive. Let s use the clusters found by k means as labels. com light on math machine learning intuitive guide to latent dirichlet allocation 437c81220158 source https miro. The maximum number of features will be the maximum number of unique words out of all of the papers PCA ClusteringLet s see how much we can reduce the dimensions while still keeping 95 variance. This will help visually separate different concentrations of topics. In order to find meaning in the clusters topic modeling will be performed to find the keywords of each cluster. com allen institute for ai CORD 19 research challenge inproceedings Shakespeare author Nicholas Charles title Mr. 3419591 abstract The world has faced the devastating outbreak of Severe Acute Respiratory Syndrome Coronavirus 2 SARS CoV 2 or COVID 19 in 2020. booktitle Proceedings of the ACM Symposium on Document Engineering 2020 articleno 15 numpages 4 keywords clustering document visualization COVID 19 dimensionality reduction location Virtual Event CA USA series DocEng 20 GoalGiven the large number of literature and the rapid spread of COVID 19 it is difficult for health professionals to keep up with new information on the virus. Applying the text processing function on the body_text. com max 1276 0 Sj65xR38wDwuxhtr. Look at clusters Look at titles abstract to see that they are similar Use classification to see if k means found effective decisionsAs neither of the authors is qualified to assess the meaning of the literature the analysis by inspection was performed solely on the titles. Given the number of clusters k k means will categorize each vector by taking the mean distance to a randomly initialized centroid. When distortion is plotted against k there will be a k value after which decreases in distortion are minimal. Can clustering similar research articles together simplify the search for related publications How can the content of the clusters be qualified By using clustering for labeling in combination with dimensionality reduction for visualization the collection of literature can be represented by a scatter plot. K means clustered the articles but did not label the topics. Sitting at home has given us time to try to help in our own way. io COVID19 Literature Clustering plots t sne_covid 19_interactive. First lets download our scripts from the repository that contains the plot settings and text Load the Keywords per Cluster Setup Widgets Style SHOW ConclusionIn this project we have attempted to cluster published literature on COVID 19 and reduce the dimensionality of the dataset for visualization purposes. This will add more meaning to the cluster by giving keywords to quickly identify the themes of the cluster. This is a generative statistical model that allows sets of words to be explained by a shared topicFor each cluster we had created a corresponding LDA model in the previous step. The topics of much of the given literature are continuous and will not have a concrete decision boundary. Plotting the dataThe previous steps have given us clustering labels and a dataset of papers reduced to two dimensions. If a narrower scope is required the plot will also have a search function that will limit the output to only papers containing the search term. This is a difficult time in which health care workers sanitation staff and much other essential personnel are out there keeping the world afloat. This work can be easily replicated and modified as needed serving as a foundation for future projects. Users will have the option of seeing the plot as a whole or filtering the data by cluster. html linear algebra data processing CSV file I O e. On this plot publications of highly similar topics will share a label and will be plotted near each other. K means and t SNE were able to independently find clusters showing that relationships between papers can be identified and measured. Due to their unsupervised nature this is not an exact science Not labeled data no certainty. It should be noted however that we are not epidemiologists and it is not our place to gauge the importance of these papers. These unsupervised techniques can show humans hidden connections in the literature If the topics clusters are not narrow enough for the user a search for a key term will only bring up papers that contain the search term. Apply Topic Modeling on X using Latent Dirichlet Allocation LDA to discover keywords from each cluster. VectorizationNow that we have pre processed the data it is time to convert it into a format that can be handled by our algorithms. title and journal attributes may be useful later when we cluster the articles to see what kinds of articles cluster together. The labeled plot gives better insight into how the papers are grouped. In these conditions our approach performs quite well to organize the literature by similarity. let s try to label it through the abstract then get the language Parser run kmeans with many different k Plot the elbow Changed perplexity from 100 to 50 per FAQ sns settings colors plot sns settings colors plot Creating a vectorizer number of topics per cluster Latent Dirichlet Allocation Model Functions for printing keywords for each topic save the COVID 19 DataFrame save the final t SNE save the labels generate with k means 20 required libraries for plot show on notebook target labels data sources hover over information map colors prepare the figure plot settings Keywords currently selected article WIDGETS pass call back arguments column widgetbox keyword widgetbox slider notes cite cite2 cite3 plot STYLE LAYOUT OF THE PAGE show. Citation Sources Loading the DataLoad the data following the notebook by Ivan Ega Pratama from Kaggle. 95 variance while removing noise and outliers in embedding Y2. Translating the language may not carry over the true semantic meaning of the textDownload the spacy bio parser StopwordsPart of the preprocessing will be finding and removing stopwords common words that will act as noise in the clustering step. read_csv Abstract Body text invalid paper format skip add break every length characters invalid paper format skip get metadata information no metadata skip this paper also create a column for the summary of abstract to be used in a plot no abstract provided abstract provided is too long for plot take first 300 words append with. https towardsdatascience. Investigate the clusters visually on the plot zooming down to specific articles as needed and via classification using Stochastic Gradient Descent SGD. Research papers will often use words that don t contribute to the meaning and are not considered everyday stopwords. Turn each document instance di into a feature vector Xi using Term Frequency Inverse Document Frequency TF IDF. Clicking on a point will bring up a menu with a URL that can be used to access the full publication. In LDA each document can be described by a distribution of topics and each topic can be described by a distribution of words. Fetch All of JSON File PathGet path to all JSON files Helper Functions File Reader ClassHelper function adds a break after every word when the character length reaches a certain amount. This should organize the papers such that related publications are nearby. Now there are other cases where the colored labels are spread out on the plot. 13046 year 2020 misc Kaggle author Kaggle title COVID 19 Open Research Dataset Challenge CORD 19 year 2020 month March note Allen Institute for AI in partnership with the Chan Zuckerberg Initiative Georgetown University s Center for Security and Emerging Technology Microsoft Research and the National Library of Medicine National Institutes of Health in coordination with The White House Office of Science and Technology Policy. This shows that structure within the literature can be observed and measured to some extent. For the parser we will use en_core_sci_lg. Shakespeare Meet Mr. Research in the subject matter was fast tracked to such a point that scientists were struggling to keep up with new findings. A surface level examination of the plot showed some very interesting organization of the data. PNG source https en. This function will convert text to lower case remove punctuation and find and remove stopwords. com ivanegapratama covid eda initial exploration tool Loading MetadataLet s load the metadata of the dateset. By using the 2 dimensions as x y coordinates the body_text can be plotted. We will be clustering based on the content of the body text. For this purpose we will be using tf idf. ", "id": "maksimeren/covid-19-literature-clustering", "size": "19478", "language": "python", "html_url": "https://www.kaggle.com/code/maksimeren/covid-19-literature-clustering", "git_url": "https://www.kaggle.com/code/maksimeren/covid-19-literature-clustering", "script": "PCA row RadioButtonGroup spacy.lang.en.stop_words toolbox_header bokeh.io pyplot Slider cdist lib.call_backs sklearn.decomposition bokeh.models pprint vectorize Image DetectorFactory Paragraph TapTool bokeh.plotting KMeans pyplot as plt TfidfVectorizer show seaborn numpy output_notebook FileReader cite metrics CountVectorizer dataset_description pandas linear_cmap matplotlib CustomJS transform layout description2 bokeh.transform TextInput description_slider input_callback figure __repr__ description TSNE LinearColorMapper sklearn.feature_extraction.text spacy_tokenizer STOP_WORDS ColumnDataSource detect selected_code get_breaks langdetect scipy.spatial.distance description_search notes HoverTool output_file Div IPython.display __init__ lib.plot_text sklearn.cluster bokeh.palettes selected_topics column bokeh.layouts sklearn matplotlib.pyplot header sklearn.manifold Category20 tqdm LatentDirichletAllocation MiniBatchKMeans widgetbox ", "entities": "(('that', 'several dimensions'), 'Use') (('results', 'random state'), 'lead') (('This', 'cluster'), 'add') (('papers', 'similar topics'), 'describe') (('was', 'texts'), 'require') (('that', 'task questions'), 'find') (('health professionals', 'texts'), 'believe') (('we', 'data frame'), 'let') (('decreases', 'distortion'), 'be') (('Attempting', 'following problems'), 'give') (('work', 'COVID'), 'hope') (('professionals', 'central topic'), 'allow') (('we', 'idf'), 'use') (('means', 'vectorized text'), 'run') (('topic modeling', 'cluster'), 'perform') (('more than 2 when plotting', 'so first 2 append'), 'be') (('Search', 'inside selected cluster'), 'perform') (('plane two dimensional X', 'embedding Y1'), 'apply') (('articles', 'easily other'), 'be') (('K', 'topics'), 'mean') (('we', 'clustering efforts'), 'limit') (('don t', 'meaning'), 'use') (('first intex', 'space'), 'fit') (('where k', 'Y1'), 'apply') (('SHOW project we', 'visualization purposes'), 'download') (('that', 'clusters'), 'give') (('column widgetbox keyword widgetbox slider notes', 'PAGE show'), 'let') (('We', 'concept'), 'implement') (('previous steps', 'two dimensions'), 'give') (('Users', 'cluster'), 'have') (('health professionals', 'virus'), 'Proceedings') (('clustering', 'body text'), 'do') (('data', 'when 2 dimensions'), 'take') (('analysis', 'solely titles'), 'look') (('we', 'key terms'), 'perform') (('is', 'https maksimekin'), 'be') (('we', 'k different values'), 'means_clustere') (('so navigation', 'topics'), 'simplify') (('that', 'search term'), 'have') (('Papers', 'label'), 'write') (('great tool', 'HTML file'), 'be') (('Hovering', 'title author journal'), 'give') (('whole dataset', 'network connection'), 'be') (('This', 'biomedical scientific text'), 'be') (('body_text', 'coordinates'), 'plot') (('provided abstract too plot', 'words first 300 append'), 'add') (('character when length', 'certain amount'), 'fetch') (('we', 'LDA Latent Dirichlet Allocation'), 'use') (('how papers', 'better insight'), 'give') (('similar article', 'other'), 'be') (('that', 'Kaggle'), 'be') (('even they', 't independent clusters'), 'find') (('19 material', 'similar themes'), 'allow') (('PCA how much we', 'still 95 variance'), 'be') (('most important terms', 'cluster'), 'find') (('It', 'locally offline'), 'download') (('we', 'abstract'), 'be') (('t SNE', 'higher dimensional data'), 'be') (('Now above stopwords', 'everyday English text'), 'use') (('Nicholas McLean Thirty Fourth AAAI Conference', 'url arxiv'), 'maksimeren') (('work', 'future projects'), 'replicate') (('you', 'https maksimekin'), 'appreciate') (('such related publications', 'papers'), 'organize') (('Distortion', 'assigned center'), 'compute') (('com exploration tool Loading ivanegapratama covid eda initial MetadataLet', 'dateset'), 'load') (('that', 'full publication'), 'bring') (('that', 'user friendly manner'), 'improve') (('publisher ACM New York NY USA keywords cyber security jaccard similarity lempel ziv malware classification compression acmid 3098111 normalized distance', 'notebook'), '3098111') (('Cite Custom', 'Topic Modeling Related Articles https Words www'), 'stop') (('how word', 'whole'), 'convert') (('that', 'algorithms'), 'process') (('function', 'stopwords'), 'convert') (('scientists', 'new findings'), 'track') (('This', 'dimensionality reduction step'), 'reduce') (('t SNE', 'sometimes different decisions'), 'arrive') (('it', 'papers'), 'note') (('that', 'clustering step'), 'carry') (('Run k', 't t SNE https SNEUsing lvdmaaten'), 'mean') (('we', 'Latent Dirichlet Allocation LDA'), 'create') (('this', 'unsupervised nature'), 'be') (('relationships', 'papers'), 'means') (('k means', 'keywords'), 'perform') (('surface level examination', 'data'), 'show') (('Halifax NS 17 2017 4503 4 Canada', 'url http 1007 1015 numpages 9 doi'), 'booktitle') (('t especially SNE', 'notebook'), 'fit_transform') (('cluster we', 'previous step'), 'be') (('that', 'search term'), 'show') (('Now other where colored labels', 'plot'), 'be') (('3419591 world', '2 19 2020'), 'abstract') (('that', 'language'), 'be') (('trained professionals', 'own determinations'), 'create') (('we', 'spacy library'), 'use') (('approach', 'similarity'), 'perform') (('topics', 'decision concrete boundary'), 'be') (('topic', 'words'), 'describe') (('we', 'cluster'), 'attempt') (('k means', 'randomly initialized centroid'), 'categorize') (('important outputs', 'future use'), 'want') (('all', 'reproducible results'), 'set') (('s', 'labels'), 'let') (('we', 'en_core_sci_lg'), 'use') (('that', 'us'), 'let') (('structure', 'extent'), 'show') (('t SNE', 'as closely possible when 2D.'), 'attempt') (('kinds', 'articles'), 'be') (('health care workers sanitation staff', 'much other essential out there world'), 'be') (('that', 'COVID'), 'consist') (('papers', 'quickly them'), 'be') (('that', 't approaches'), 'unsupervise') (('publication', 'topic larger cluster'), 'connect') (('hover tool', 'screen'), 'be') (('collection', 'scatter plot'), 'cluster') (('We', 'vectorized data'), 'apply') (('Sitting', 'own way'), 'give') (('we', 'literature'), 'create') (('This', 'topics'), 'help') (('We', 'body text'), 'cluster') (('that', 'readily researchers'), 'be') (('io we', '2 dimensions'), 'tsne') (('we', 'project'), 'welcome') (('often it', 'separate them'), 'intersect') ", "extra": "['organization']"}