{"name": "data analysis student s behavior ", "full_name": " h1 Analyzing Student s Behavior and Model suggestion for classification levels h3 Marlon Ferrari h4 This Data Science project was made under Capstone Data Science IBM Certification Program h2 Table of contents h1 1 Introduction h1 2 Data ", "stargazers_count": 0, "forks_count": 0, "description": "Now we are going to build the Kmeans with k 3So now we can see 3 clusters High applied Students Mid Applied Students Low Applied Students 4. Finally it is important to mention that location data was not possible to be used. So it is important to find a dataset with some key features like grade gender enrollment levels and so on. NORMALIZE OUR ARRAY GET X AXIS within cluster sum of squares Train Model and Predict REBUILDING THE MODEL WITH BEST K Train Model and Predict. Suprisingly discussion frequency is weakly linked to higher results at least directly. This can mean that well informed parents can better understand the student s enrollment and reality and are better satisfied. 1 Exploratory AnalysisIn the context to understand the student and his results setting up a dataframe with certain columnsTry to understand the results from countriesIt seems that parents which aren t envolved in answering the scholar s surveys are likely to become unsatisfied with the School. The act of visualizing the announcements makes the students more prepared for the tasks and they are most likely to plan the assessments of the week. Parent School Satisfaction the Degree of parent satisfaction from school nominal Yes No 16. So this research can be used as a starting point for further works and model adaptation. Topic course topic nominal English Spanish French Arabic IT Math Chemistry Biology Science History Quran Geology 8. Semester school year semester nominal First Second 9. The results concluded some points Parents active participation and tracking are important. The logical border and the lack of motivation can make the students leave. High visualization frequency is lined indeed to better classifications. Nowadays people in distant places poor countries can benefit from technology to achieve information and in this case the Massive Open Online Courses MOOCs had a major role. Despite that online learning has a potential value for increasing society levels. Parent Answering Survey parent answered the surveys which are provided from school or not nominal Yes No 15. So we need an one hot encoding on columns gender absence and classSo based on previous exploratory analysis was possible to identify that raised hands and announcements visualization brings most results respect high classification. Table of contents Introduction Business Problem introduction Data data Methodology methodology Analysis analysis Results and Discussion results Conclusion conclusion 1. It is known also that online learning suffers massive unenrollment. So we re going to test the features related. The data compounds 16 columns with aggregated informations about over 480 students of a Learning Platform called Kalboard360. Let s keep this feature. Question What s the relation between raising hands and classification So it seems that students which has low levels of raising hands are most likely to have Low classification. DataA description of the data and how it will be used to solve the problemTo guide my investigation I was looking for a Set to help to understand the student s behavior motivation and correlated characteristics in order to better understand why or how is the result of an enrollment. After querying correlated datasets in order to find those with better columns I found a nice DataSet from Kaggle called Students Academic Performance Dataset. Section ID classroom student belongs nominal A B C 7. Set the right content for the right student is a complex but essential task to keep the students enrolled motivated and getting high classification. MethodologyThe first steps are the data exploration and insight taking approach in order to better understand the data and the columns. MOOCs can join people all around the world to achieve understand in a wide range of areas delivering science and culture. In the otherside high frequency of raising hands are linked to higher classification. This way the data understanding will become a more powerfull decision making focused on student s behaviors. The purpose of this exploratory analysis is to identify hidden features and understand the relations between the features. It brought also a generation of people who studies through the digital environments. The datails will be shown next section. To make the construction process easiest to understand we re going to reimplement the dataset building phases. You can check it here https www. Absent parents are linked to absent students and more unsatisfaction with the school. Of course there are higher interactions levels ocrring with Higher graded students but the data shows that discussion is a secondary act. Under this context the online education evolved quickly and the transformation of the societies really started. Concluding this step on analysis we re going to understand the absence rate with the grade levelAs expected the lower the absence of the student the higher tends to become their classification. Finally I ll create a my predictive analysis by building a dataset with the best features for a supervised learning algorithm to predict the student s beahvior under certain conditions which will achieve my final objective. Nationality student s nationality nominal Kuwait Lebanon Egypt SaudiArabia USA Jordan Venezuela Iran Tunis Morocco Syria Palestine Iraq Lybia 3. Place of birth student s Place of birth nominal Kuwait Lebanon Egypt SaudiArabia USA Jordan Venezuela Iran Tunis Morocco Syria Palestine Iraq Lybia 4. The best model was the K Nearest neighbors with k 4 and accuracy of 0. As a final result a predictive model is offered in order to help the online platforms to understand the student s acts and take decisions. Question What is the relation between active parents and student s classification So definitively parent s active behavior has an important role on student s growth. If MOOCs platforms achieve student understanding and predicting I think it s possible to menage the student s churn and find a way to give them the needed motivation. 2 Building a supervised algorithmNow it s time to build a model to predict the student s classification based on his actions on the Online Learning enviroment. With this set in mind I started a search for MOOCs generated Students Data to investigate and prepare some conclusions about the theme. Raised hand how many times the student raises his her hand on classroom numeric 0 100 11. Visited resources how many times the student visits a course content numeric 0 100 12. Location data is also important to understand cultural marks which will be explored by locations APIs. 1 Clustering DataSetNow that we know what are the important features to understand the student s behavior and classification we re going to build a dataset for a K Means algorithm which will show the student s cluster. That s because it refers to Born location of the student and this is not a important feature. So both features will compound our X axisUsing the Elbow Method to find the best K for Kmeans based on our dataSo the ideal K is 3. Viewing announcements how many times the student checks the new announcements numeric 0 100 13. Discussion groups how many times the student participate on discussion groups numeric 0 100 14. Low levels of resource exploring means lower levels of classification. ConclusionData analytics and Data Science are vital fields for improving Online Courses experience. Introduction A description of the problem and a discussion of the backgroundThe Internet revolution brought more than social medias and faster information exchanges. Extract our dependent variable YGets X independent variables and normalize themNow we re going to check the accuracy and performance of the following models K Nearest Neighbor KNN Decision Tree Support Vector Machine Logistic RegressionCreate the train test sets KNN Decision Tree Suport Vector Machine SVM Logistic Regression Model Performance Results and DiscussionThe presented research focused in data analytics and building a machine learning model to understand the student s behavior and classification under online learning courses. Next I ll do a descritive analysis by building a dataset for a clustering algorithm. Students who read announcements and visit the course resources are most likely to have higher classification. Next we re going to check the act of visiting the course resources. com aljarah xAPI Edu Data. Analyzing Student s Behavior and Model suggestion for classification levels Marlon Ferrari This Data Science project was made under Capstone Data Science IBM Certification Program. Actions related to discussions are less likely to improve student s classification. Parent responsible for student nominal mom father 10. So it could be a more important data the place where the student was conected because the high absence levels could be related to poor Internet connection areas like conflicted areas and under development countries. Educational Stages educational level student belongs nominal lowerlevel MiddleSchool HighSchool 5. Understanding student s behavior Next it is important to know what characteristics are linked to students sucess. High levels of visiting resources are linked to higher classification. 1 Data StructureAs previously mentioned this dataset includes 16 columns 1. Under this context what are the related features which causes it How understand the student scenario and predict his churn or low grades I think that is a relevant point. AnalysisAs mentioned this section will understand the data in order to compose the clustering dataset. Let s identify the correlations between the student s actionsThis made clear that our best correlated features are raisedHands and visitedResources which will compose our model dataset further. This will with no doubt improve education levels of their countries and help to improve their economy. Guided by the analysis exploration I ll be able to build a model to predict student s behavior or results. Student Absence Days the number of absence days for each student nominal above 7 under 7 The most important characteristic of this dataset is that it has included the parent s data which is a nice approach to understand the student. Gender student s gender nominal Male or Female 2. Grade Levels grade student belongs nominal G 01 G 02 G 03 G 04 G 05 G 06 G 07 G 08 G 09 G 10 G 11 G 12 6. ", "id": "marlonferrari/data-analysis-student-s-behavior", "size": "10749", "language": "python", "html_url": "https://www.kaggle.com/code/marlonferrari/data-analysis-student-s-behavior", "git_url": "https://www.kaggle.com/code/marlonferrari/data-analysis-student-s-behavior", "script": "sklearn.metrics sklearn.tree sklearn.cluster KMeans KNeighborsClassifier DecisionTreeClassifier seaborn numpy sklearn sklearn.model_selection metrics f1_score matplotlib.pyplot pandas LogisticRegression svm log_loss sklearn.neighbors sklearn.linear_model jaccard_similarity_score train_test_split preprocessing ", "entities": "(('it', 'needed motivation'), 'think') (('discussion Suprisingly frequency', 'weakly higher results'), 'link') (('also online learning', 'massive unenrollment'), 'know') (('raised hands', 'high classification'), 'need') (('that', 'churn'), 'be') (('absence high levels', 'development countries'), 'be') (('Next I', 'clustering algorithm'), 'do') (('So it', 'grade gender enrollment levels'), 'be') (('Set', 'high classification'), 'be') (('who', 'digital environments'), 'bring') (('visualization High frequency', 'indeed better classifications'), 'line') (('data way understanding', 'decision more powerfull behaviors'), 'become') (('So we', 'features'), 'go') (('quickly transformation', 'societies'), 'evolve') (('they', 'week'), 'make') (('this', 'student'), 's') (('Next we', 'course resources'), 'go') (('Actions', 'less classification'), 'be') (('first steps', 'better data'), 'be') (('which', 'school'), 'answer') (('level Educational Stages educational student', 'lowerlevel MiddleSchool nominal HighSchool'), 'belong') (('Data 1 StructureAs', '16 columns'), 'mention') (('I', 'theme'), 'with') (('I', 'Kaggle'), 'find') (('which', 'nice student'), 'day') (('best model', '0'), 'be') (('K', 'dataSo'), 'compound') (('students', 'motivation'), 'make') (('Section ID classroom student', 'A B nominal C'), 'belong') (('it', 'Online Learning enviroment'), 'build') (('which', 'most Low classification'), 'question') (('High levels', 'higher classification'), 'link') (('MOOCs', 'science'), 'join') (('So definitively active behavior', 'growth'), 'question') (('Results', 'Conclusion conclusion'), 'introduction') (('mentioned', 'clustering dataset'), 'understand') (('which', 'final objective'), 'create') (('I', 'behavior'), 'be') (('how many times student', 'discussion groups'), 'group') (('This', 'economy'), 'improve') (('purpose', 'features'), 'be') (('which', 'School'), 'seem') (('which', 'locations APIs'), 'be') (('discussion', 'interactions Of course higher Higher graded students'), 'be') (('online platforms', 'decisions'), 'offer') (('better why result', 'enrollment'), 'description') (('Raised hand how many times student', 'classroom numeric'), 'raise') (('3 clusters', 'k'), 'go') (('we', 'building dataset phases'), 'make') (('new announcements', 'announcements'), 'view') (('GET X AXIS', 'BEST K Train Model'), 'NORMALIZE') (('K Nearest Neighbor KNN Decision Tree Support Vector Machine Logistic train test', 'online learning courses'), 'extract') (('the lower absence', 'student'), 'go') (('ConclusionData analytics', 'Data Online Courses vital experience'), 'be') (('Marlon Data Science project', 'Capstone Data Science IBM Certification Program'), 'analyze') (('Low levels', 'classification'), 'mean') (('Massive Open Online Courses MOOCs', 'major role'), 'benefit') (('Introduction description', 'social medias'), 'bring') (('course resources', 'most higher classification'), 'be') (('data', 'Learning Platform'), 'compound') (('Visited how many times student', 'course content numeric'), 'resource') (('which', 'model dataset'), 'let') (('So research', 'further works'), 'use') (('characteristics', 'students'), 'behavior') (('Absent parents', 'more school'), 'link') (('which', 'cluster'), '1') (('well informed parents', 'better enrollment'), 'mean') ", "extra": "['gender', 'test']"}