{"name": "decision trees for binary classification 0 99 ", "full_name": " ", "stargazers_count": 0, "forks_count": 0, "description": "That is pretty good In order to improve the accuracty of our model however we will need to add back some of the features that we previously removed and we will need to engineer some new features. Int Rev Cell Mol Biol. Likewise a growing body of literature suggests that there is some connection between the shape of the nucleus and human disease states such as cancer and aging. Step 5 Preprocess Data Step 6 Describe Processed Data Here with this heatmap we can see that big mis shapen nuclei are typicaly from cancerous samples. Let s explore that in more detail. Abberant nuclear shape can be used to identify cancer cells e. Sizing up the nucleus nuclear shape size and nuclear envelope assembly. Step 1 Import Modules Step 2 Describe Data Step 3 Minimze and Describe Dataset Step 4 Plot Data I predict that the nuclei from the malignant samples were larger than the nuclei from the benign samples. pap smear tests and the diagnosis of cervical cancer. This script takes as an input the CSV file from the Kaggle Breast Cancer Wisconsin Dataset https www. This confirms my prediction that healthy nuclei have a default size and that cancer cells have a wide range of sizes typically greater than the default size. Step 7 Compare Classification Algorithms It looks like our model can predict with about 90 accuracty whether or not a given sample is malignant. predict c print accuracy_score d predictions print Logistic Regression Training set accuracy s accuracy_score d predictions. csv Get rid of the space in the file name Run the function Furthermore we will need to split up our training data setting aside 20 of the training data for cross validation testing such that we can avoid potentially overfitting the data. 2016 New Insights into Mechanisms and Functions of Nuclear Size Regulation. The measurements were made from digital images of a fine needle aspirate of a breast tissue mass. Predicting Breast Cancer From Nuclear Shape The nucleus is an organelle present within all eukaryotic cells including human cells. boxplot algorithm comparison predictions model. Let s look at all of the features now. chdir Users ptm desktop Current_working_directory trainingData pd. Next we will identify a suitable classification algorithm that we can use to predict whether or not a given sample is malignant. Great This means that our classification algorithms should have somethinggood to work with. As such the quantitative analysis of nuclear size of shape has important biomedical applications. Furthermore I will need to add in a feature selectionstep and I will also need to add in a parameter optimization step. These additions can be found in the following kernel https www. For more information please refer to the following resources http www. Nuclear structure in cancer cells. com paultimothymooney predicting breast cancer from nuclear shape os. com uciml breast cancer wisconsin data containing information on various features describing the size and shape of the nucleus. edu levy_lab Vukovic LD Jevtic P Edens LJ Levy DL. The output of this script is a prediction of whether or not a given sample is cancerous. ", "id": "paultimothymooney/decision-trees-for-binary-classification-0-99", "size": "2915", "language": "python", "html_url": "https://www.kaggle.com/code/paultimothymooney/decision-trees-for-binary-classification-0-99", "git_url": "https://www.kaggle.com/code/paultimothymooney/decision-trees-for-binary-classification-0-99", "script": "sklearn.metrics areaToCategory sklearn.naive_bayes sklearn.tree makeAHeatMap sklearn.discriminant_analysis pivotTheData plotSymmetryDistribution plot_learning_curve KNeighborsClassifier DecisionTreeClassifier describeDataAgain seaborn numpy LinearSVC plotConcaveDistribution plot_confusion_matrix learning_curve GradientBoostingClassifier selectParametersForSVM sklearn.ensemble sklearn sklearn.model_selection confusion_matrix RandomForestClassifier concaveToCategory LinearDiscriminantAnalysis defineModels matplotlib.pyplot pandas plotSizeDistribution textureToCategory LogisticRegression accuracy_score plotSmoothnessDistribution smoothnessToCategory compareABunchOfDifferentModelsAccuracy diagnosisToBinary GridSearchCV model_selection sklearn.neighbors sklearn.linear_model SVC GaussianNB sklearn.svm printColumnTitles symmetryToCategory plotTheData train_test_split make_scorer plotTextureDistribution ", "entities": "(('chdir Users ptm', 'trainingData pd'), 'desktop') (('given sample', 'classification suitable algorithm'), 'identify') (('additions', 'kernel https following www'), 'find') (('measurements', 'breast tissue mass'), 'make') (('nucleus', 'human cells'), 'predict') (('such we', 'potentially data'), 'get') (('quantitative analysis', 'important biomedical applications'), 'have') (('cancer cells', 'default typically greater size'), 'confirm') (('given sample', 'about 90 accuracty'), 'step') (('c print accuracy_score d predictions', 'accuracy_score d predictions'), 'predict') (('classification algorithms', 'somethinggood'), 'mean') (('I', 'parameter optimization also step'), 'need') (('nuclei', 'benign samples'), 'step') (('script', 'Kaggle Breast Cancer Wisconsin Dataset https www'), 'take') (('Likewise growing body', 'such cancer'), 'suggest') (('Abberant nuclear shape', 'cancer cells e.'), 'use') (('mis shapen big nuclei', 'cancerous samples'), 'Step') (('previously we', 'new features'), 'be') (('given sample', 'script'), 'be') ", "extra": "['biopsy of the greater curvature', 'disease', 'test', 'cervical cancer', 'diagnosis']"}