{"name": "eda of kaggle data science survey 2020 by country ", "full_name": " h1 Kaggle 2020 State of Data Science Survey h2 Contents h2 Responses per Country h2 Breakdown by Country and Age h3 Note about the Sample Data h2 Breakdown by Country and Highest Educational Achievement h2 Breakdown by Online Educational Platforms h2 Breakdown by Country and Job Title h3 Data Scientists h2 Breakdown by Years of Coding Experience h2 What Language Would you Recommend an aspiring Data Scientist Learn First h2 What type of computing platform do you use most often for your data science projects h2 TPU Usage h2 Years using Machine Learning methods h2 Primary Analysis Toolset h2 Company Size h2 How many people are responsible for Data Science workloads at the place of business h2 Machine Learning h2 Rates of Pay h3 Conclusion ", "stargazers_count": 0, "forks_count": 0, "description": "Remember there can be a selection bias in these results especially if we consider the age of respondents. Note about the Sample Data Back to Contents s 0 Although this notebook is focusing on analyzing the data by country we can see in the following chart that the age of respondents impacts on other facets of the data in this case how long it took to complete the survey in seconds capped at 3000 seconds or 50 minutes. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 20GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session Load the data shorten longest country names create a mapping dict from question id to question content countries sorted by count the label locations the width of the bars Add some text for labels title and custom x axis tick labels etc. We can also see that the number of responses from India increased noticeably from 2019 to 2020 but the responses from the USA fell in 2020 compared to 2019. This is why we use a log transformed version of the chart below. Instead it might be because Indian respondents tend to be younger. properties width 80 background f5f5f5 title text Survey Response Time in Seconds subtitle Broken down by Age fontSize 20 fontWeight 600 subtitleFontSize 14. It is encoded on the x axis and in the size of the circle. Respondents aged 18 21 are unlikely to have a PhD for example If there are respondents in that age group with a PhD please feel free to contact me about teaming up in future competitions Breakdown by Online Educational Platforms Back to Contents s 0 Now that we ve looked at formal education let s take a look at online educational platforms. The highest percentage of respondents who were Data Scientists was in Israel followed by Poland and France. TPU s are specialized hardware than enable fast processing of neural networks. In India and the USA respondents were most likely to work for companies with 20 or more Data Scientists but in Brazil Canada and China respondents were most likely to work for companies where there were only 1 2 people working on Data Science. We will normalize the data so that we can see a clearer picture for countries with fewer respondents. We have double encoded the count for each category. However in other countries with a large number of overall respondents the picture is quite different. However as per the caveats previously stated we must recognise that we are looking at the real world data available in the survey. These countries are Bangladesh Tunisia Sri Lanka and Nepal. How many people are responsible for Data Science workloads at the place of business Back to Contents s 0 Looking now at the number of Data Scientists rather than the overall number of employees. Where the respondent s places of business is in Europe and North America plus Israel Australia and South Africa the place of business is more likely to have ML models in production. TPU Usage Back to Contents s 0 Staying on the them of hardware let s see how many times respondents have used TPU s. Years using Machine Learning methods Back to Contents s 0 Here we analyze the number of years of experience with machine learning methods that respondents have by country. Let s visualize on a map the proportion of respondents who have at least 5 years experience with ML methods by country. jpg We can see the differing ages of respondents between countries more clearly if we focus on the top 8 countries by number of respondents. Please leave any feedback in the comments below. We can also see that a few categories did not get any responses in certain countries. Once again we should consider the issues of sample size and selection bias in drawing too many conclusions from our dataset. Column Q1 N header alt. However it could also potentially suggest that the question needs to be reworded. Back to Top s top This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. Header titleOrient bottom labelOrient bottom labelPadding 0. We can see that in India many respondents are in the youngest age categories. encode y alt. For example respondents from India have tended to be younger than those from the US. This likely includes students. By working through the data in the survey breaking down the information by country we have found many interesting insights. Contents Responses per Country s 1 Comparison to 2019 s 1a Breakdown by Country and Age s 2 Note about the Sample Data s 2a Breakdown by Country and Highest Educational Achievement s 3 Breakdown by Country and Online Educational Platform s 3alt Breakdown by Country and Job Title s 4 Proportion of Respondents who are Data Scientists s 4a Breakdown by Country and Years of Coding Experience s 5 Recommended Programming Language for aspiring Data Scientists by Country s 6 Breakdown by Country and Type of Computing Platform s 7 Breakdown by Country and TPU Usage s 8 Breakdown by Country and Years using ML Methods s 9 Breakdown by Country and Primary Analysis Toolset s 9x Breakdown by Country and Company Size s 10 Breakdown by Country and Number of People Responsible for Data Science workloads s 11 Breakdown by Country and Machine Learning reaching Production s 12 Breakdown of Rates of Pay by Country s 13 Responses per Country Back to Contents s 0 First we will see how many responses there were in each country. However there are many potential factors that could contribute to this. The focus of this EDA will be on how Data Science varies by country. OK let s compare this year s response counts to last year s survey responses. It could be to do with the age of respondents or the type of jobs they do or simply an artifact of the data. We can see quite a lot of respondents in the first category earning under 1000USD. Axis labels False values 0 grid False ticks True column alt. Responsible for Data Science workloads could mean anyone who works in Data Science or Data Science managers. Now let s look at percentages within each country. In some countries Basic Statistical software was the most popular category amongst respondents e. We can see respondents to the Kaggle survey from over 50 different countries. This was also true for Russia and China. Here we can see responses by country. Let s plot this on a map to see if this provides any further insights. Color Q1 N legend alt. X density Q stack center impute None title None axis alt. Company Size Back to Contents s 0 Respondents were asked about the size of the company that they work for. This means that the income difference between respondents in different countries may be considerably greater than the difference in spending power between respondents in those countries. In Brazil China Canada and in the Other category responses grouped together from countries with less than 50 responses each the most popular response was that only 1 or 2 people were responsible for Data Science workloads in the place of business. mark_area orient horizontal. Unlike some of our other analyses there doesn t seem to be a clear geographic proximity pattern that explains this. Egypt Japan Peru Philipines. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. Let s take a look at this data in percentage terms. Here we can see some distinct geographical patterns. transform_density Time from Start to Finish seconds as_ Time from Start to Finish seconds density extent 0 3000 groupby Q1. However there are a few exceptions to this. Also although Coursera is most popular in most countries the percentage of respondents in each country that have used it can vary dramatically. Data Scientists Back to Contents s 0 Let s just focus on the job of Data Scientist. Respondents from Switzerland are most likely to have 5 or more years of experience using machine learning methods. The positive color The negative color column to add to hover information sort by count column to add to hover information large violinplots in Altair can look good but can be computationally intensive and it may be better to consider using matplotlib seaborn altair usually limits input sources to 5000 rows but I have overriden that setting the code commented below produces the chart below but the chart is loaded from a saved image that uses less memory alt. We can see in general that there are few respondents with 5 years of experience with ML methods. To remove the highlight filter click on the chart outside the legend. The chart above is interactive so feel free to zoom into your home country. In Sri Lanka over 55 of respondents had used Coursera but in Japan it was under 22. Y Time from Start to Finish seconds Q title color alt. Since 2017 it has conducted an annual survey of the state of Data Science. Despite the growth of cloud solutions and deep learning a personal computer or laptop is still by far the most popular choice. The leading countries in terms of TPU usage are Viet Nam Peru and Romania whilst TPU usage is least frequent in Ireland. The absolute counts there are much higher and we shouldn t lose sight of that when we look at log counts and percentages in other charts. In third place is Other which is all other countries not on the list aggregated into one category. How would that look on a map The chart below is interactive. This suggests that those businesses are not doing Data Science. The comparison chart only shows countries which were recorded in both years. In most countries it looks like a cloud based platform is the second most popular although this doesn t seem to be true in Belgium or Viet Nam where deep learning solutions are more popular. In all countries the most popular response Never shows that most respondents have not used a TPU. For example in the USA and Switzerland it is skewed to the right more than in most other countries. Comparing this to other nations we can see that respondents elsewhere tend to be older. In Portugal Poland Japan and Singapore respondents tended to work for larger companies. I hope this notebook was interesting and insightful and that you learnt something new about the state of Data Science in your own country and the changing state of Data Science globally. Let s visualize on a map the percentage of respondents under 25 by country. Feel free to zoom into your home country. Other maps later in the notebook are interactive in the same way. We include the chart above to remind ourselves of the importance of India and the USA to the survey. This may well be an artifact of the data and we should note infer too much from this. There are many possible reasons for this which could make an interesting notebook in itself. One important factor could be the relatively younger age of respondents there which we have already observed but I won t attempt a full explanation here. credit to this notebook https www. We should also bear in mind that these figures do not take into account the cost of living in the respective countries. We see that in some countries approximately half of respondents are students. Again we can see that there is one category that dominates in every country. However this chart certainly suggests that the skilled Data Science and Machine Learning professionals of the future will predominantly come from Asia. If you click on a country you can get the percentage displayed in a popup. If you liked the notebook or found it helpful please upvote. We can see that in most countries the smallest employer size was the most popular at 0 49 employees. First we look at the log count per country. From this chart we can see that in the USA and India the largest single group of respondents were in places of business that had at least 20 people responsible for Data Science workloads. We see that Basic Statistical Software Microsoft Excel Google Sheets etc. Perhaps not surprisingly we can see that SQL and R are both widely recommended in all countries. The results noted here are based on this data and may not all extrapolate to be fully representative of all countries for all of the questions we have looked at. ML is less established in production in other parts of Africa. For example in Romania Kaggle Learn courses are more popular whilst in Brazil Udemy just pips Coursera to be the most popular platform there. What type of computing platform do you use most often for your data science projects Back to Contents s 0 Q11 asked respondents which platform they used most often for their data science projects. jpg attachment Annotation 202020 12 22 20231942. Meanwhile in Japan and Russia the most common answer was that 0 people were responsible for Data Science workloads. Let s take a look at the year on year change by countries. The chart below is interactive. It seems that this option is less popular amongst respondents in much of Asia. read_csv enable altair to plot all the data Input data files are available in the read only. Thailand had the biggest year on year increase in responses followed by Indonesia Iran and Malaysia. Ireland had the biggest fall followed by Canada. We log transform the count values to get a more informative visualization. This sample may suffer from selection bias and sampling error. ConclusionData Science is flourishing in 2020. What Language Would you Recommend an aspiring Data Scientist Learn First Back to Contents s 0 This gives a view of where Data Scientists think Data Science is heading and is not clouded by the legacy of languages that Data Scientist may or may not already know. Let me know your thoughts and any feedback in the comments below. configure_facet spacing 0. We should remember as we are going through the later charts and recognize that they are not randomly sampled and as a result are likely to have selection bias. Looking across other countries it appears that the age range with the most consistlently high percentage of respondents is 25 29. Deep Learning platforms are more popular than cloud based platforms with respondents in Belgium and Viet Nam. If we prepared the same chart by country then it may appear that Indian respondents were quicker but this may not be telling anything about India. Breakdown by Years of Coding Experience Back to Contents s 0 Here we analyse how the number of years of coding experience respondents have varies by country. Breakdown by Country and Job Title Back to Contents s 0 Let s take a look at the breakdown of job title by country. We will log transform the counts per platform per country and provide 2 charts one for the original count and one for the transformed count. Let s take a look at how this breaks down by country. We can see that in most countries local development environments were the most popular analysis toolset amongst respondents. Again following our theme we will take a look at this by country. This is particularly noticeable in the USA. You can zoom in and out select countries and hover over a country to see the relevant stats for that nation. Remember rates of pay will be impacted by other variables such as age and years of experience. This chart allows us to compare counts for different platforms across countries. Chart df_survey_responses. We see that there are a few countries where the category with the highest percentage for that country is ages 22 24. Here we can see that the biggest single group of respondents is Indian respondents with under 1 year of experience using Machine Learning methods. Respondents from Sweden were more likely to have 20 years of coding experience. India leads the way by a large margin from the USA. Here we see that Coursera and Kaggle Learn have some popularity in all countries. Aspiring data scientists may find more detail on skills in demand in their own country but remember that the sample size of responses for many of the countries listed may not be very large and the results may not be very reliable as a result. Also note that the percentages for each country do not need to sum to 100 because respondents were asked to select all platforms they had used. Kaggle 2020 State of Data Science SurveyKaggle is the world leader for competitive Data Science. Of course we don t know for sure how representative Kaggle is of the participation in Data Science and Machine Learning of the general population of different countries. It appears that a minimum count of 50 is required for the country to be included a distinct nation in the survey. TPU usage was highest amongst respondents in Viet Nam. This map is interactive. The first few categories may include people who work part time. This notebook will conduct an EDA of the data in the 2020 survey. In Europe and North America responses have shrunk or been static year on year with no countries seeing major growth. This can be higher in countries with higher average incomes. Annotation 202020 12 22 20231942. Click on any programming language in the legend and it will highlight that programming language on the chart making it easier to focus in on specific data. We can see that Python is by far the most popular language recommended in all countries. Machine Learning Back to Contents s 0 Does the place of business incorporate Machine Learning Let s see specifically the proportion of respondents whose place of business incorporates ML in production. Here we see that Coursera is the most popular platform amongst respondents in most countries. Legend title Age orient top x alt. configure_view stroke None only top countries shorten longest country names sort by count sort by count sort by count sort by count Add the country code for a new choropleth map merge to get total respondents per country column to add to hover information sort by count Add the country code for a new choropleth map column to add to hover information get prod totals get overall totals column to add to hover information. Meanwhile other regions saw rapid growth especially the area from North Africa passing East through the Middle East India to South East Asia saw a large growth in responses especially in South East Asia. com anshulverma2207 kaggle data survey 2020 for some insights into this map. OK there are some new insights here. Europe and North America have the lowest proportion of respondents under 25. Brazil Russia India and China the original BRIC nations all report very similar results on this metric slightly behind most of Europe but ahead of Spain and Ireland. We can also see that the distribution is skewed differently in different countries. Let s take a look at the other categories excluding personal computers. As an example if we click on MATLAB in the legend at the bottom of the chart we can see it was more popular with respondents in Iran and Romania than in other countries. There do seem to be some geographic patterns here. Here we can see the popularity of Coursera in India. However even in the country Switzerland where this value was highest it was still under 50 percentage includes those who did not answer this question. As we saw in the previous chart the percentage of respondents under 25 is very high in much of Asia. For example no respondents in Switzerland used Cloud based data software. The country with the highest proportion of respondents in this category is Nepal closely followed by Morocco and Nigeria. Based on observations of respondents ML models were most likely to reach production in Israel followed by Belarus and the UK. Here we break down their answers by country. This is interesting because most of these are in close geographic proximity to each other and to India. We can see that Belgium has the highest proportion of respondents who have 20 years of experience with Machine Learning methods whilst Saudi Arabia and Thailand have the most newcomers to Machine Learning. Primary Analysis Toolset Back to Contents s 0 Let s see what respondents use as their primary analysis toolset in each country. Breakdown by Country and Highest Educational Achievement Back to Contents s 0 Let s take a look at the breakdown of highest educational achievement by country in this Kaggle survey. We also see that all platforms have users in almost all countries. Let s dive into the data a bit more deeply. At the other end of the scale we can see a non negligible subset who earn over 500 000USD. This category had more responses in 2020 compared to 2019. and Local development environments RStudio JupyterLab etc. Respondents from Iran and Switzerland have been more likely to have a PhD. Rates of Pay Back to Contents s 0 Let s take a look at rates of pay by country. are the most popular categories. We knew that in India the category with the highest count was 18 21. The lowest was Sri Lanka followed by China. Otherwise the data gets bucketed to the Other category. Due to the high absolute counts in India and to a lesser extent the USA we don t learn much about alternative platforms in other countries. Breakdown by Country and Age Back to Contents s 0 We break down the responses by age and country and count the entries in each. ", "id": "datahobbit/eda-of-kaggle-data-science-survey-2020-by-country", "size": "19540", "language": "python", "html_url": "https://www.kaggle.com/code/datahobbit/eda-of-kaggle-data-science-survey-2020-by-country", "git_url": "https://www.kaggle.com/code/datahobbit/eda-of-kaggle-data-science-survey-2020-by-country", "script": "numpy matplotlib.pyplot platform_country_chart analysis_altair platform_altair abbreviate_nations pandas prog_lang_country altair chart_country plotly.express ml_prod ", "entities": "(('why we', 'chart'), 'be') (('we', 'many interesting insights'), 'find') (('We', '1000USD'), 'see') (('it', 'specific data'), 'click') (('India', 'USA'), 'lead') (('they', 'platforms'), 'note') (('they', 'selection bias'), 'remember') (('country', 'survey'), 'appear') (('also distribution', 'differently different countries'), 'see') (('Input data data files', 'read'), 'enable') (('We', 'category'), 'encode') (('Romania Kaggle Learn courses', 'just Coursera'), 'be') (('Europe', '25'), 'have') (('don sure how Kaggle', 'different countries'), 'know') (('How many people', 'employees'), 'be') (('We', 'ML methods'), 'see') (('that', 'Data Science responsible workloads'), 'see') (('category', '2019'), 'have') (('who', 'over 500 000USD'), 'see') (('Otherwise data', 'Other category'), 'bucket') (('most respondents', 'TPU'), 'show') (('rates', 'experience'), 'remember') (('responses', '2019'), 'see') (('it', 'country'), 'be') (('TPU usage', 'Viet Nam'), 'be') (('respondents', 'other nations'), 'see') (('s', 'country'), 'let') (('which', 'years'), 'show') (('Viet learning where deep solutions', 'Belgium'), 'look') (('employer smallest size', 'most 0 49 employees'), 'see') (('how number', 'country'), 's') (('percentage', 'Asia'), 'be') (('s', 'survey last responses'), 'let') (('other countries', 'one category'), 'be') (('We', 'more informative visualization'), 'log') (('how this', 'country'), 'let') (('a few where category', 'country'), 'see') (('this', 'India'), 'appear') (('s', 'data'), 'let') (('that', 'memory less alt'), 'look') (('chart', 'home above so country'), 'be') (('However many potential that', 'this'), 'be') (('Here we', 'distinct geographical patterns'), 'see') (('who', 'question'), 'be') (('income difference', 'countries'), 'mean') (('development local environments', 'analysis most popular respondents'), 'see') (('they', 'data science most often projects'), 'use') (('Data Scientist', 'that'), 'recommend') (('Axis', '0 grid False ticks'), 'label') (('Brazil Russia India', 'Spain'), 'report') (('We', 'survey'), 'include') (('country', 'closely Morocco'), 'be') (('Machine certainly skilled Data Science professionals', 'predominantly Asia'), 'suggest') (('Coursera', 'most countries'), 'see') (('0 s', 'country'), 'breakdown') (('s', 'country'), 'rate') (('when we', 'other charts'), 'be') (('us', 'countries'), 'allow') (('age', 'respondents'), 'appear') (('especially we', 'respondents'), 'remember') (('picture', 'overall respondents'), 'be') (('First we', 'country'), 'look') (('how many times respondents', 'TPU'), 'Usage') (('We', 'over 50 different countries'), 'see') (('Science SurveyKaggle', 'world Data competitive Science'), 'be') (('how long it', '3000 seconds'), 'note') (('TPU s', 'neural networks'), 'be') (('Other maps', 'same way'), 'be') (('me', 'comments'), 'let') (('option', 'Asia'), 'seem') (('which', 'itself'), 'be') (('most', 'India'), 'be') (('notebook', '2020 survey'), 'conduct') (('we', 'fewer respondents'), 'normalize') (('ML', 'Africa'), 'be') (('proximity clear geographic that', 'this'), 'seem') (('s', 'countries'), 'let') (('we', 'too much this'), 'be') (('respondents', 'larger companies'), 'tend') (('who', 'people'), 'include') (('don t', 'other countries'), 'due') (('0 s', 'Data Scientist'), 'Scientists') (('We', 'each'), 's') (('Data how Science', 'country'), 'be') (('biggest single group', 'Machine Learning methods'), 'see') (('Ireland', 'Canada'), 'have') (('respondents', 'country'), 'Toolset') (('0 s', 'Kaggle survey'), 'breakdown') (('one that', 'country'), 'see') (('we', 'available survey'), 'state') (('We', 'transformed count'), 'log') (('Viet Nam TPU usage', 'least Ireland'), 'be') (('approximately half', 'respondents'), 'see') (('businesses', 'Data Science'), 'suggest') (('This', 'higher average incomes'), 'be') (('Here we', 'India'), 'see') (('Coursera', 'countries'), 'see') (('respondents', 'country'), 's') (('already I', 'full explanation'), 'be') (('you', 'Data changing Science'), 'hope') (('who', 'country'), 'let') (('also a few categories', 'certain countries'), 'see') (('very results', 'very result'), 'find') (('figures', 'respective countries'), 'bear') (('Here we', 'country'), 'break') (('who', 'Poland'), 'be') (('Respondents', 'coding experience'), 'be') (('we', 'country'), 'take') (('Local development', 'RStudio JupyterLab'), 'environment') (('we', 'questions'), 'base') (('This', 'particularly USA'), 'be') (('s', 'percentage terms'), 'let') (('many respondents', 'age youngest categories'), 'see') (('s', 'online educational platforms'), 'be') (('Python', 'most popular countries'), 'see') (('it', 'notebook'), 'like') (('it', 'other countries'), 'as') (('It', 'circle'), 'encode') (('Respondents', 'more PhD.'), 'be') (('prod totals', 'information'), 'stroke') (('who', 'Data Science'), 'mean') (('more clearly we', 'respondents'), 'see') (('also platforms', 'almost all countries'), 'see') (('only 1 people', 'business'), 'be') (('Basic Statistical software', 'respondents most popular e.'), 'be') (('it', '22'), 'use') (('North Israel South place', 'production'), 'be') (('chart', 'map'), 'look') (('sample', 'selection bias'), 'suffer') (('Thailand', 'Indonesia Iran'), 'have') (('Once again we', 'dataset'), 'consider') (('lowest', 'Sri China'), 'be') (('Deep Learning platforms', 'Belgium'), 'be') (('First we', 'how many country'), 's') (('North America responses', 'major growth'), 'shrink') (('percentage', 'popup'), 'get') (('it', 'most other countries'), 'be') (('respondents', 'data Cloud based software'), 'use') (('this', 'further insights'), 'let') (('they', 'simply data'), 'be') (('who', 'Machine Learning'), 'see') (('Respondents', 'machine learning methods'), 'be') (('SQL', 'widely countries'), 'see') (('they', 'that'), 'size') (('s', 'personal computers'), 'let') (('place', 'production'), 'Learning') (('ML models', 'Belarus'), 'be') (('category', 'highest count'), 'know') (('it', 'Data Science'), 'conduct') (('It', 'kaggle python Docker image https github'), 'come') (('Now s', 'country'), 'let') (('most common 0 people', 'Data Science workloads'), 'be') (('width', 'labels title'), 'list') (('respondents', 'US'), 'tend') (('ConclusionData Science', '2020'), 'flourish') (('You', 'nation'), 'zoom') (('especially area', 'South East especially Asia'), 'see') ", "extra": "['annotation']"}