{"name": "full preprocessing tutorial ", "full_name": " h2 Introduction h1 Loading the files h1 Resampling h1 3D plotting the scan h1 Lung segmentation h1 Normalization h1 Zero centering h1 What s next ", "stargazers_count": 0, "forks_count": 0, "description": "Some scanners have cylindrical scanning bounds but the output image is square. 0 is treated as background which we do not want Pick the pixel in the very corner to determine which label is air. png Zero centeringAs a final preprocessing step it is advisory to zero center your data so that your mean value is 0. 3D plotting visualization is very useful to see what we are doing. Unfortunately the packages available in this Kaggle docker image is very limited in this sense so we will use marching cubes to create an approximate mesh for our 3D object and plot this with matplotlib. Also it takes quite a while. To do this you simply subtract the mean pixel value from all pixels. Instead the second largest air pocket in the body will be segmented. Here s some code you can use 1 http i. read_csv Some constants Load the scans in given folder path Convert to int16 from sometimes int16 should be possible as values should always be low enough 32k Set outside of scan pixels to 0 The intercept is usually 1024 so air is approximately 0 Convert to Hounsfield units HU Show some slice in the middle Determine current pixel spacing Position the scan upright so the head of the patient would be at the top facing the camera Fancy indexing verts faces to generate a collection of triangles not actually binary but 1 and 2. If we choose to resample everything to 1mm 1mm 1mm pixels we can use 3D convnets without worrying about learning zoom slice thickness invariance. The CT scanners are calibrated to return accurate HU measurements. 5 which means that the distance between slices is 2. Loading the filesDicom is the de facto file standard in medical imaging. If you don t do this yet your image are int16 s which are smaller than float32s and easier to compress as well. Fortunately I participated in the LUNA16 competition as part of a university course on computer aided diagnosis so I have some experience working with these files. Quite slow and ugly but the best we can do. Tip To save storage space don t do normalization and zero centering beforehand but do this online during training just after loading. The steps Threshold the image 320 HU is a good threshold but it doesn t matter much for this approach Do connected components determine label of air around person fill this with 1s in the binary image Optionally For every axial slice in the scan determine the largest solid connected component the body air around the person and set others to 0. The first step is setting these values to 0 which currently corresponds to air. These files contain a lot of metadata such as the pixel size so how long one pixel is in every dimension in the real world. Looking at the table from Wikipedia and this histogram we can clearly see which pixels are air and which are tissue. There is no such thing as an image with lower contrast or brightness like in normal pictures. Below is code to load a scan which consists of multiple slices which we simply save in a Python list. 25 in the LUNA16 competition. You can do all these steps offline one time and save the result and I would advise you to do so and let it run overnight as it may take a long time. Pretty cool no Anyway when you want to use this mask remember to first apply a dilation morphological operation on it i. org wiki Tracheotomy this will not be the case I do not know whether this is present in the dataset. You can recognize this by checking the fraction of image that the mask corresponds to which will be very small for this case. with a circular kernel. The pixels that fall outside of these bounds get the fixed value 2000. Let s also visualize the difference between the two. Before we start let s import some packages and determine the available patients. pacemaker example 1 NormalizationOur values currently range from 1024 to around 2000. Let s resample our patient s pixels to an isomorphic resolution of 1 by 1 by 1 mm. Our plot function takes a threshold argument which we can use to plot certain structures such as all tissue or only the bones. If this tutorial helped you at all please upvote it and leave a comment linear algebra data processing CSV file I O e. You can then first apply a morphological closing operation with a kernel a few mm in size to close these holes after which it should work or more simply do not use the mask for this image. It consists of a series of applications of region growing and morphological operations. Some preprocessing is required before they are ready for consumption by your CNN. Anything above 400 is not interesting to us as these are simply bones with different radiodensity. The unit of measurement in CT scans is the Hounsfield Unit HU which is a measure of radiodensity. This fills the structures in the lungs in the mask. To determine this mean you simply average all images in the whole dataset. using ConvNets A common method of dealing with this is resampling the full dataset to a certain isotropic resolution. A commonly used set of thresholds in the LUNA16 competition to normalize between are 1000 and 400. Lung segmentation Normalization that makes sense. the distance between slices may differ which can hurt performance of CNN approaches. We can deal with this by isomorphic resampling which we will do later. This expands the mask in all directions. CT scanners are carefully calibrated to accurately measure this. 400 is a good threshold for showing the bones only see Hounsfield unit table above. Improvement Pick multiple background labels from around the patient More resistant to trays on which the patient lays cutting the air around the person in half Fill the air around the person Method of filling the lung structures that is superior to something like morphological closing For every slice we determine the largest solid structure This slice contains some lung Make the image actual binary Invert it lungs are now 1 Remove other air pockets insided body There are air pockets. Beautiful But there s one thing we can fix it is probably a good idea to include structures within the lung as the nodules are solid we do not only want to air in the lungs. Next let s go back to HU units by multiplying with the rescale slope and adding the intercept which are conveniently stored in the metadata of the scans. Below code worked well for us and deals with the edge cases Please note that when you apply this to save the new spacing Due to rounding this may be slightly off from the desired spacing above script picks the best possible spacing with rounding. This is my first time working with it but it seems to be fairly straight forward. Keep only the largest air pocket the human body has other pockets of air here and there. Also particulary noisy images for instance due to a pacemaker in the image below this method may also fail. At this moment we top the leaderboard there This tutorial aims to provide a comprehensive overview of useful steps to take before the data hits your ConvNet other ML method. Whilst this may seem like a very simple step it has quite some edge cases due to rounding. We will use this for lung segmentation in a bit ResamplingA scan may have a pixel spacing of 2. If that sounds like a lot of work we found this to be around 0. Zero centering the scans. The method that me and my student colleagues developed was quite effective. It involves quite a few smart steps. Warning Do not zero center with the mean per image like is done in some kernels on here. pngLet s take a look at one of the patients. What s next With these steps your images are ready for consumption by your CNN or other ML method. Let s do this Spooky Lung segmentationIn order to reduce the problem space we can segment the lungs and usually some tissue around it. 725 this can be problematic for automatic analysis e. In this case we will use only connected component analysis. Every folder in the dataset is one scan so one patient. From Wikipedia HU examples 1 By default however the returned values are not in this unit. IntroductionWorking with these files can be a challenge especially given their heterogeneous nature. 3D plotting the scanFor visualization it is useful to be able to show a 3D image of the scan. What we will cover Loading the DICOM files and adding missing metadata Converting the pixel values to Hounsfield Units HU and what tissue these unit values correspond to Resampling to an isomorphic resolution to remove variance in scanner resolution. One metadata field is missing the pixel size in the Z direction which is the slice thickness. It relies on the fact that the air outside the patient is not connected to the air in the lungs. Fortunately we can infer this and we add this to the metadata. This pixel size coarseness of the scan differs from scan to scan e. The air structures in the lung alone will not contain all nodules in particular it will miss those that are stuck to the side of the lung where they often appear So expand the mask a little This segmentation may fail for some edge cases. If the patient has a tracheostomy https en. For a different scan this may be 1. ", "id": "gzuidhof/full-preprocessing-tutorial", "size": "8351", "language": "python", "html_url": "https://www.kaggle.com/code/gzuidhof/full-preprocessing-tutorial", "git_url": "https://www.kaggle.com/code/gzuidhof/full-preprocessing-tutorial", "script": "resample normalize zero_center numpy matplotlib.pyplot skimage measure plot_3d pandas mpl_toolkits.mplot3d.art3d load_scan get_pixels_hu largest_label_volume segment_lung_mask Poly3DCollection morphology ", "entities": "(('pngLet s', 'patients'), 'take') (('you', 'pixels'), 'subtract') (('which', 'Z direction'), 'miss') (('you', 'whole dataset'), 'average') (('we', 'Quite slow'), 'do') (('human body', 'air'), 'keep') (('connected components', '0'), 'step') (('we', 'metadata'), 'infer') (('segmentation', 'edge cases'), 'miss') (('noisy Also particulary images', 'method'), 'fail') (('we', 'matplotlib'), 'be') (('commonly used set', 'LUNA16 competition'), 'be') (('It', 'region growing operations'), 'consist') (('air Instead second largest pocket', 'body'), 'segment') (('we', 'Python simply list'), 'be') (('label', 'very corner'), 'treat') (('s', '1 mm'), 'let') (('it', 'image'), 'apply') (('s', 'available patients'), 'start') (('mean value', 'data'), 'Zero') (('Tip', 'online training'), 'do') (('we', 'which'), 'deal') (('apply', 'best possible spacing rounding'), 'work') (('tissue', 'scanner resolution'), 'cover') (('using', 'certain isotropic resolution'), 'resample') (('IntroductionWorking', 'especially heterogeneous nature'), 'be') (('which', 'currently air'), 'set') (('we', 'such tissue'), 'take') (('they', 'CNN'), 'require') (('patient', 'tracheostomy https'), 'have') (('ResamplingA scan', '2'), 'use') (('this', 'analysis automatic e.'), '725') (('data', 'ML ConvNet other method'), 'top') (('lungs', 'air now 1 Remove other pockets body'), 'Fill') (('this', 'dataset'), 'Tracheotomy') (('we', 'very what'), 'be') (('that', 'fixed value'), 'get') (('This', 'mask'), 'fill') (('however returned values', 'unit'), 'from') (('which', 'Wikipedia'), 'see') (('camera Fancy indexing verts', 'triangles'), 'read_csv') (('tutorial', 'comment linear algebra data processing CSV file'), 'upvote') (('400', 'Hounsfield unit only table'), 'see') (('pacemaker NormalizationOur example 1 values', 'around 2000'), 'range') (('which', 'very case'), 'recognize') (('this', '0'), 'find') (('folder', 'dataset'), 'be') (('int16 which', 'float32s'), 'do') (('it', 'scan'), 'be') (('Loading', 'file de facto medical imaging'), 'be') (('air', 'lungs'), 'rely') (('s', 'two'), 'let') (('distance', 'slices'), '5') (('Hounsfield Unit which', 'radiodensity'), 'be') (('output image', 'scanning cylindrical bounds'), 'have') (('which', 'CNN approaches'), 'differ') (('Lung segmentation that', 'sense'), 'Normalization') (('we', 'slice thickness zoom invariance'), 'choose') (('we', 'only lungs'), 'beautiful') (('which', 'scans'), 'let') (('me', 'that'), 'be') (('we', 'component only connected analysis'), 'use') (('CT scanners', 'HU accurate measurements'), 'calibrate') (('so how one pixel', 'real world'), 'contain') (('overnight it', 'long time'), 'do') (('CT scanners', 'carefully accurately this'), 'calibrate') (('experience', 'files'), 'participate') (('it', 'rounding'), 'seem') (('we', 'usually it'), 'let') (('Warning', 'kernels'), 'do') (('it', 'first it'), 'be') (('Pretty when you', 'it'), 'cool') (('these', 'simply different radiodensity'), 'be') (('images', 'CNN'), 'be') ", "extra": "['biopsy of the greater curvature', 'patient', 'diagnosis', 'lung']"}