{"name": "goodreads analysis and recommending books ", "full_name": " h1 Background checkup h3 If you like my work please consider upvoting my kernel h1 What s in this kernel h1 Loading libraries with installation h1 Getting Basic Ideas h4 Columns Description h1 Exploratory Data Analysis h3 Which are the books with most occurances in the list h3 What is the distribution of books for all languages h3 Which are the top 10 most rated books h3 Which are the authors with most books h3 Getting overall performance for an author over time h4 Stephen King h4 Agatha Christie h4 Dan Brown h4 J K Rowling h3 Which are the top 10 highly rated authors h3 What is the rating distribution for the books h3 Is there any relationship between ratings and review counts h3 Is there a relationship between number of pages and ratings h2 Is there a relationship between ratings and ratings count h3 Which are the books with the highest reviews h1 Topic Modelling h3 KMeans Clustering without outliers h2 KMeans with optimisation h2 Recommendation Engine h4 The Catcher in the Rye h4 The Hobbit or There and Back Again h4 Harry Potter Book 5 h2 x ", "stargazers_count": 0, "forks_count": 0, "description": "Rowling And finally Harry Potter. Checking for any relation between them. gif KMeans clustering is a type of unsupervised learning which groups unlabelled data. As the rating count seems to decrease the average rating seems to become sparser with higher volatility and less accuracy. Checking out the Workings of the System let s try with following examples. For the given list if I ask recommendations for The Catcher in the Rye five books related to it would appear. Which are the books with the highest reviews From all the above inferences we can fundamentally decide that although the reviews matter there can t be any specific relation between them and the ranking for all the books Topic Modelling KMeans Clustering without outliers http shabal. Rowling predominantly in the head of this dataframe. Agatha Christie 10 3. His performance has been steadily consitent dipping once in the nineties and after the new turn of the decade. The goal is to find groups in data. Most of her books have performed admirably still staying well above 4 presumably because of Poirot and his fabulous skills Might even give Sherlock a run for his money From this chart it s perhaps safe to assume that the performance of her books were perhaps the least volatile Dan Brown Presumably a fan favourite for the current generation Dan Brown seems to write fabulous thrillers with a knack for them to still retain the potential to be brilliant page turners. The kurtosis of the graph just seems to land between 3 and 4 signifying that for the effort it took to read and the thrilling unputdownable nature of the book the majority of the ratings lie between 3 and 4. The phenomenon for this era the book which sold the most copies in the world. System by name The Catcher in the Rye System by Name The Hobbit System by partial name Harry Potter Book 5 The Catcher in the Rye The Hobbit or There and Back Again Harry Potter Book 5 Since most users won t remember the name for the entire book Especially how it has been entered in the books database the function to get ID from the partial names helps to choose to ID of the book the user is looking for. It can be observed that even now the majority of text reviews for books still lie under 1000 making this whole scenario inconclusive. Perhaps a personal favourite for many of us yet we sure were rooting for this Which are the top 10 highly rated authors We can infer from the plot that J. Yet when we glance at the first and fifth book of Harry Potter we can also notice that there has been a ridiculously huge margin in the number of readers ratings for the books signifying that there were people who did not pick up the next book in the series and or only found the first book to touch their hearts up to an extent to drop a vote Which are the authors with most books We can see from the above plot that Agatha Christie has the most number of books in the list although a lot of them might be just various publications for the same book considering the fact that her work has been here for quite a while spanning decades. Is there relationship between ratings and review counts 15 9. Yet from the data yet obtained it can be observed that he has the least ratings amongst the four chosen authors yet he is consistent. Loading required libraries with installation 1 2. What is the distribution of books across languages 5 3. For the sake of brevity only english language has been used Stephen King We can notice from the plot that Stephen King was at his best in 1987 hitting the peak. KNN is used for both classification and regression problems. Is there a relationship between number of pages and ratings Analysis This plot doesn t give that much of an accurate inference due to the massive presence of outliers for books above 1000 pages for the _maximum_ density is between 0 1000 pages. As the count increases the rating would end up near the cluster given above. Book Recommendation Engine 22 Loading libraries with installation Getting Basic Ideas Let s begin the journey there seems to be J. Is there a relationship between ratings and ratings count 17 11. Performance of an author over time 8 1. Is there a relationship between number of pages and ratings 16 10. The min max scaler is used to reduce the bias which would have been present due to some books having a massive amount of features yet the rest having less. We ve always conisdered the magical persona books seem to hold and with this notebook we step out on a journey to see what kind of books really drives people to read in this era of modern smart devices. Infact apart from a few such as Catcher in the Rye and Animal Farm all of the books seem to be from a series of books getting the notion into our head that once people begin most of them seem to dive in with the notion of completing it. The average rating seems to become sparse while the number keeps on decreasing. Which are the books with most occurances in the list 4 2. Known for his famous works such as Rita Hayworth and Shawshank which coincidently resides within his best range 1982 1987 Stephen King is a legend in his own rights. Books having scores near 5 are extremely rareSurprisingly it can be seen that the ratings between 0 and 1 are much more numerous in number leading to a conclusion that if a person does read a book and end up hating it it ll still get a minimum of around 2 stars just for the effort they put up for reading the book. These books have come up in this database over and over again with various publication editions. Dan Brown 11 4. Seems like some books do age well and these have just braved the flow of time. e Harry Potter and the Sorcerer s stone Twilight 1 The Hobbit Angels and demons 1. There might be a relationship but the reviews seem to be predominant amongst books with decent ratings. From the list we can see that most of the books from the given chart are either old steadfast classics or books which are usually assigned to schools. Stephen King 9 2. With over a hundred thousand ratings there are books which just tend to become popular as each day seems to pass. It s also impressive to note the vast dominance Tolkien has over the competition easily dethroning any other competiton while being above 4. jpg crop 1xw 1xh center top resize 500 Background checkup. com max 1400 1 j95msWf8y2B_cbQVMzxFWg. Let s remove them and form inferences KMeans with optimisation Finding the outliers and then removing them. From the names in the list we can again gather that most of the authors have either been writing for decades churning numerous books from time to time or are authors who are regaled as the classics in our history. This uses the Indices metric from the nearest neighbors to pick the books. What s in this kernel 1. Based on a book entered by the user the nearest neighbours to it would be classified as the books which the user might like. With such a vast overwhelming number of factors we ll go over such demographics Does any relationship lie between ratings and the total ratings given Where do majority of the books lie in terms of ratings Does reading a book really bring forth bias for the ratings Do authors tend to perform same over time with all their newer books Or do they just fizzle out. Getting basic ideas about the data 2 3. Yet as we ve all come to know and love her there s Mary here too. The green squares are the centroids for the given clusters. KMeans Clustering with optimisaztion 21 5. 2 Harry potter s first book dominates the section by having more than 5000000 ratings. 13 digits language_code Tells the language for the books Num_pages Contains the number of pages for the book Ratings_count Contains the number of ratings given for the book text_reviews_count Has the count of reviews left by users Exploratory Data Analysis Which are the books with most occurances in the list We can see that One Hundred Years Of Solitude and Salem s List have the most number of occurrances with the same name in the data. Recommendation Engine Having seen the clustering we can infer that there can be some recommendations which can happen with the relation between Average Rating and Ratings Count. The basic idea behind analysing the Goodreads dataset is to get a fair idea about the relationships between the multiple attributes a book might have such as the aggregrate rating of each book the trend of the authors over the years and books with numerous languages. The series which has steadfastly garnered fans all over the world. From the above plot now we can see that once the whole system _can_ be classified into clusters. With this I attepmt to find a relationship or groups between the rating count and average rating value. Agatha Christie Agatha Christie has been a legend throughout the course over the years. x If you liked the kernel do consider upvoting it Finding Number of rows and columns Taking the first 20 If possible please get your own Creating a function to get book details from the ISBN 13 value. Is there any relationship between ratings and review counts Analysis We can infer from the plot that most of the ratings for the books seems to lie near 3 4 with a heavy amount of reviews lying barely near 5000 approximately. Is there a relationship between ratings and ratings count There seem to be some outliers present in this. Which are the top 10 most rated books 6 4. Which are the top 10 most rated books 1 We can see that the beginning books of the series usually have most of the ratings i. R tolkien has the highest ratings for his books making his average consistency rather impressive. Rowling the database is nearly ready for EDA Columns Description bookID Contains the unique ID for each book series title contains the titles of the books authors contains the author of the particular book average_rating the average rating of the books as decided by the users ISBN ISBN 10 number tells the information about a book such as edition and publisher ISBN 13 The new format for ISBN implemented in 2007. Perhaps they are all scam reviews or the density of the books in that field are just that _more_. Exploratory Data Analysis 3 1. Based on that logic let s explore the scenario in that range Analysis From the given plot we can infer that the highest ratings ever given usually are for books with the page range of 200 400 peaking near 250. As the number of ratings increase the rating for the book seems to taper towards 4. Taking the Ratings_Distribution A self created classifying trend the recommendation system works with the algortihm of K Nearest Neighbors. What is the rating distribution for the books 14 8. In classification problems to predict the label of a instance we first find k closest instances to the given one based on the distance metric and based on the majority voting scheme or weighted majority voting neighbors which are closer are weighted higher we predict the labels. Alternate scraping solution when both the API s fails Gathering the data for the year column for the books from their ISBN 13 values Trying out with goodreads api now Going with webscraping Extracting year with regex The finction for getting the final dataframe for the charts Finding the top 15 authors with the most number of books Removing Any null values Draw a circle now Equal Aspect ratio ensures that pie is drawn as a circle Checking for any relation between them. Do number of pages make an impact on reading styles ratings and popularity Can books be recommended based on ratings Is that a factor which can work If you like my work please consider upvoting my kernel. It seems hype does play a role in this. png In a setting such as this the unsupervised learning takes place with the similar neighbors being recommended. RowlingRanging from authors spanning a few decades with their titles to some of the current favourites let s see how they fared over time. Topic Modelling 19 1. Which are the authors with most books 7 5. We ll test out the performance of these four authors over time Stephen King Agatha Christie Dan Brown J. Creating specific functions to help in finding the book names Get index from Title Get ID from partial name Because not everyone can remember all the names Print the similar books from the feature dataset. I ll use the Elbow Curve method for the best way of finding the number of clusters for the dataFrom the above plot we can see that the elbow lies around the value K 5 so that s what we will attempt it withWe can see from the above plot that because of two outliers the whole clustering algortihm is skewed. Getting overall performance for an author over time Let s test out the functions now. Min Max scaler would find the median for them all and equalize it. com images j k rowling book quote 1531932701. What is the rating distribution for the books From the given plot we can infer that Majority of the ratings lie near 3. Rowling 12 6. What is the distribution of books for all languages From the given graph we can infer that in the given data majority of the books are in english languages with some further categorised into English US english UK and english CA. A boy with a scar a penchance for heroism. And the beauty shines when observing the plot. in visuals kmeans random. It could lead to the fact that most of the people seem to prefer books with a moderate amount of pages and that thicker books seems to scare people away. Which are the top 10 highly rated authors 13 7. Which are the books with the highest reviews 18 4. For a better outlook let s consider the count around 2000000 ratingsFrom the graph we can see that there can be a potential relationship between the average rating and ratings count. Fixing the name for every Harry Potter series to be just J. Computing K means with K 5 thus taking it as 5 clusters assigning each sample to a cluster Vector Quantisation some plotting using numpy s logical indexing red circles blue circles yellow circles magenta circles black circles Computing K means with K 8 thus taking it as 8 clusters assigning each sample to a cluster Vector Quantisation some plotting using numpy s logical indexing red circles blue circles yellow circles magenta circles black circles ID for the Book 5. KMeans Clustering with outliers 20 2. All above four brilliantly defying the rating trends which nearly all seem to follow. Creating a books features table based on the Ratings Distribution which classifies the books into ratings scale such as Between 0 and 1 Between 1 and 2 Between 2 and 3 Between 3 and 4 Between 4 and 5Broadly the recommendations then consider the average ratings and ratings cout for the query entered. Let s fix this just for the sake of brevity with all the numerous listings her books are sure to have. ", "id": "hoshi7/goodreads-analysis-and-recommending-books", "size": "14873", "language": "python", "html_url": "https://www.kaggle.com/code/hoshi7/goodreads-analysis-and-recommending-books", "git_url": "https://www.kaggle.com/code/hoshi7/goodreads-analysis-and-recommending-books", "script": "sklearn.cluster KMeans plot plot_author_chart MinMaxScaler get_id_from_partial_name get_index_from_name Article show seaborn numpy segregation newspaper scipy.cluster.vq print_similar_books Line2D pylab bookdata sklearn sklearn.model_selection neighbors matplotlib.pyplot progressbar kmeans pandas matplotlib.colors ProgressBar tqdm matplotlib.lines vq html sklearn.preprocessing goodreads_api_client train_test_split final_df reg ", "entities": "(('just day', 'hundred over a thousand ratings'), 'be') (('book', 'numerous languages'), 'be') (('nearly all', 'rating brilliantly trends'), 'defy') (('reviews', 'decent ratings'), 'be') (('s', 'journey'), 'get') (('recommendation self created classifying system', 'K Nearest Neighbors'), 'take') (('which', 'world'), 'phenomenon') (('_', 'clusters'), 'see') (('KNN', 'classification problems'), 'use') (('Stephen 1982 1987 King', 'own rights'), 'know') (('pie', 'them'), 'solution') (('yet rest', 'less'), 'use') (('Which', 'highest reviews'), 'be') (('people', 'it'), 'infact') (('page range', '250'), 'let') (('Catcher', 'it'), 'appear') (('publisher 13 new format', '2007'), 'be') (('similar neighbors', 'place'), 'png') (('who', 'history'), 'gather') (('groups', 'unlabelled data'), 'be') (('we', 'potential average rating'), 'let') (('then average ratings', 'ratings query'), 'feature') (('average consistency', 'books'), 'have') (('rating', '4'), 'seem') (('kind', 'modern smart devices'), 'conisdere') (('withWe', 'two outliers'), 'use') (('well these', 'time'), 'seem') (('top 10 highly rated We', 'plot'), 'favourite') (('user', 'which'), 'classify') (('Min Max scaler', 'it'), 'find') (('number', 'decreasing'), 'seem') (('which', 'all world'), 'series') (('Majority', '3'), 'be') (('steadfast old which', 'usually schools'), 'see') (('green squares', 'given clusters'), 'be') (('some', 'Book'), 'mean') (('Stephen King', 'peak'), 'use') (('give', '1000 pages'), 'be') (('We', 'time'), 'test') (('Perhaps they', 'just _'), 'be') (('KMeans', 'optimisaztion'), 'cluster') (('Which', 'most books'), 'be') (('books', 'publication over over various editions'), 'come') (('them', 'still potential'), 'perform') (('jpg crop 1xw 1xh center', 'Background top 500 checkup'), 'resize') (('distribution', 'languages'), 'be') (('possible own', 'ISBN 13 value'), 'consider') (('rating count', 'higher volatility'), 'seem') (('we', 'all her'), 'come') (('we', 'labels'), 'find') (('Harry 2 first book', 'more than 5000000 ratings'), 'dominate') (('most', 'barely 5000'), 'infer') (('they', 'newer books'), 'go') (('some', 'English english US UK'), 'infer') (('14 8', 'books'), 'be') (('they', 'book'), 'be') (('beginning books', 'ratings i.'), 'be') (('rating', 'cluster'), 'end') (('s', 'then them'), 'let') (('majority', '3'), 'seem') (('performance', 'decade'), 'be') (('One Hundred Years', 'data'), 'digit') (('Clustering', 'outliers'), 'decide') (('I', 'rating count'), 'attepmt') (('names', 'feature dataset'), 'create') (('s', 'functions'), 'let') (('thicker books', 'people'), 'lead') (('work', 'decades'), 'notice') (('whole scenario', 'still 1000'), 'observe') (('This', 'books'), 'use') (('books', 'numerous listings'), 'let') (('user', 'book'), 'system') (('he', 'four chosen authors'), 'obtain') (('beauty', 'when plot'), 'shine') (('s', 'examples'), 'let') (('how they', 'time'), 'let') (('which', 'Average Rating'), 'see') (('Agatha Christie Agatha Christie', 'years'), 'be') (('Which', 'list'), 'be') (('Tolkien', '4'), 's') (('you', 'kernel'), 'make') ", "extra": "['test']"}