{"name": "gradcam extracting masks from classifier ", "full_name": " h1 Intro h1 Plan h1 Libraries h1 Preparing data h2 One hot encoding classes h2 Stratified split into train val h2 Data preprocessing h3 Validation images h3 Masks h1 Grad CAM routines h1 Precision to threshold mapping per class h1 Vizually comparing GradCAM s with masks h1 Estimating performance h1 Predicting test masks h1 Conclusion h1 Credits ", "stargazers_count": 0, "forks_count": 0, "description": "Predicting test masks Predicting test masks 8. I d use the classifier trained in this notebook https www. Yet for illustration purposes let s produce no masks for precisions under 0. Conclusion Conclusion 9. Vizually comparing GradCAM s with masks 6. Data preprocessing Validation imagesReading val images resizing and storing in memory to speed up experiments. ipynb and was slightly reorganized mask routines were taken from Andrew s notebook https www. 85 and otherwise I use binarization threshold of 0. I try to unify thresholding while preserving class specific characteristics by thresholding on precision. 2 if precision is under 0. Vizually comparing GradCAM s with masksI ve prepared codes to experiment with different binarization thresholds for different precisions. com artgor segmentation in pytorch using convenient tools scriptVersionId 20202006. com eclique keras gradcam blob master gradcam_vgg. Credits Grad CAM function was taken from here https github. Vizually comparing GradCAM s with masks. Libraries Libraries 2. dictionary for fast access to ohe vectors sorting present classes in lexicographical order just to be sure helper functions credits https www. Preparing data Preparing data One hot encoding classes One hot encoding classes Stratified split into train val Stratified split into train val Data preprocessing Data preprocessing Validation images Validation images Masks Masks 3. I d use explainability technique Gradient weighted Class Activation Mapping http gradcam. com eclique keras gradcam blob master grad_cam. Estimating performance Predicting test masks ConclusionIt s interesing to experiment with explainability techniques and it s cool to see that a classifier itself has some localization capabilities. Credits Credits Libraries Preparing data One hot encoding classes Stratified split into train valThe same split was used to train the classifier. com artgor segmentation in pytorch using convenient tools scriptVersionId 20202006 gradcam functions source inspiration https github. As we ve found out here https www. Estimating performance Estimating performance 7. com samusram cloud classifier for post processing some classes are harder than others. org to extract masks from the classifier. IntroIn this notebook I d like to check what we can get directly from a classifier. com samusram cloud classifier for post processing. MasksAnalogously storing in memory validation masks. com artgor segmentation in pytorch using convenient tools scriptVersionId 20202006 to perform elementwise binarization on all images at once consice even though unnecessary passing through all the values credits https www. It can be considered the most simple baseline for weakly supervised segmentation based on image level labels. Grad CAM routines Precision to threshold mapping per classUsing validation data I map confidence to val precision. Precision to threshold mapping per class Precision to threshold mapping per class 5. py for batch gradcam Process CAMs for a given class probability finds corresponding precision credits https www. Grad CAM routines Grad CAM routines 4. ", "id": "samusram/gradcam-extracting-masks-from-classifier", "size": "2652", "language": "python", "html_url": "https://www.kaggle.com/code/samusram/gradcam-extracting-masks-from-classifier", "git_url": "https://www.kaggle.com/code/samusram/gradcam-extracting-masks-from-classifier", "script": "remove_small_mask_components sklearn.metrics __init__ tensorflow.keras.utils deepcopy tqdm_notebook make_mask tensorflow.keras.models numpy.random numpy tqdm_notebook as tqdm get_labels __getitem__ auc estimate_dice generate_gradcam_masks get_probability_for_precision_threshold copy Sequence seed DataGenenerator(Sequence) sklearn.model_selection tensorflow.python.framework on_epoch_start rle_decode Image matplotlib.pyplot tensorflow pandas set_random_seed __len__ ops tensorflow.keras tqdm dice load_model precision_recall_curve backend visualize_img_gradcam_mask backend as K get_tabular_precisions grad_cam_batch train_test_split IPython.display mask2rle ", "entities": "(('mask slightly reorganized routines', 'notebook https www'), 'take') (('I d', 'notebook https www'), 'use') (('py', 'precision credits https corresponding www'), 'find') (('classifier', 'localization capabilities'), 'interese') (('Validation', 'Masks Masks'), 'class') (('encoding One hot classes', 'classifier'), 'library') (('Credits Grad CAM function', 'https github'), 'take') (('samusram', 'others'), 'be') (('It', 'image level labels'), 'consider') (('s', '0'), 'let') (('com', 'post processing'), 'samusram') (('com artgor segmentation', 'https www'), 'scriptVersionId') (('we', 'directly classifier'), 'IntroIn') (('I', 'precision'), 'try') (('helper just functions', 'https www'), 'dictionary') (('otherwise I', '0'), '85') (('I', 'val precision'), 'routine') ", "extra": "['test']"}