{"name": "histopathologic cancer detection model 2 ", "full_name": " h2 Introduction to Problem and Notebook h2 Notes on Approaching the Challenge h2 Useful Terminology h2 Introduction to Data h2 Initial Data Load h2 Exploratory Data Analysis h3 A Note on Noise h2 Data Processing h2 Model Choise h3 Quick Notes on CNNs h3 Training h2 Finetuning h2 Model Performance h2 Interpretation h2 Potential Next Steps h2 Unforeseen Obstacles h2 References h3 Blogs h3 Kaggle h3 Papers h3 Other references ", "stargazers_count": 0, "forks_count": 0, "description": "According to Saba 2020 https reader. This seems to be an important statistic. We highlight the 32x32px region where we must search for evidence of metastastic cancer. Next we show the scatter plots of means vs standard deviations of pixel values across RGB. The main influences on this notebook are certainly the Joni Juvonen notebook https www. We will load only the training data from the Kaggle competition as this is labelled and can be used for training our model and assessing performance. Quick Notes on CNNsCNNs general start with several layers of data processing inorder to reduce noise and increase the visibility of important features which are easier to learn by neural networks. 50 death rate and apply the false negative rate 3 the trained model in our Fast AI notebook https www. pdf Survey of over 130 papers. The data for this competition is a slightly modified version of the PatchCamelyon PCam benchmark dataset. Gaussian noise distribution is estimated via skimage. org docs dev auto_examples filters plot_denoise_wavelet. Positives seem to come from a smaller sample which is natural given we have far less observations here. FinetuningFinetuning involves unfreezing the pretrained model lowering the learning rate and continuing training. com making sense of shapley values dc67a8e4c5e8 are not available for deep learning models but Fast AI has suggested visual attention maps to address interpretability. 6 million cancer deaths Contains a brief description and comparison of currentreported techniques results datasets for cancer2. com qitvision a complete ml pipeline fast ai we do not expect these anomolies to affect results. After the patch level CNN is trained another ML model is often developed for the whole image level decision Introduction to DataPCam PatchCamelyon is a binary classification image dataset containing labeled low resolution images of lymph node sections extracted from digital histopathological scans in tif format. com gomezp complete beginner s guide eda keras lb 0 93 although here we flip RGB accoring to OpenCV we can see that Negative samples are bimodel in terms of brightness one bright peak and one dark prak Negative samples have skewed to darker RGB channels in general Positive samples have a lighter G channel than RBNext we plot the average positive and negative class pictures where positive images should appear less green and brighter in general. In addition we study examples of false negatives using fastai s ClassificationInterpretation. Potential Next Steps We still do not know the model performance on unseen testing data Noise reduction and more regularisation may help with overfitting More methodical tuning over epochs and hyper parameters would certainly improve performance More features such as chemistry and phenotypic information could be used to help with the classification Due to noise we may be susceptable to adversarial examples Unforeseen ObstaclesSome challenges that I had to overcome in creating this notebook Enabling GPU for kaggle Enabling an environment with fastai v1. pdf Investigate to what extent alternative variants of Artificial Neural Networks ANNs are susceptible to adversarial attacks On PCam Stochastic ANNs are more robust but this is more prevalent in MNIST4. In analysing model performance we pay close attention to false negatives i. The following code plots the distribution of RGB values for positive and negative classesIn agreement with gomezp https www. Scaling renormalisation centering and even data augmentation and batching is done for free by ImageDataBunch through the function get_transforms. Model ChoiseResults from previous sections indicate that i there are some distributional differences between positive and negative classes ii many features are required to explain differences iii noise and therefore overfitting may be an issue. pdf and here https towardsdatascience. From Kaggle https www. In addition using ImageDataBunch for data augmentation and regularisation we can combat overfitting. PCam was created specifically for machine learning reasearches to be able to approach the problem of cancer detection as easily as they would the MNIST or CIFAR10. nl posts pcam and the associated git repository. We settle for correlations of i the RGB means of each pixel for ii the center of each patch. The optimal lr is just before the base of the loss and before the start of divergence. We see a bimodal distribution for negative class noise with the main peak close to zero. com an overview of resnet and its variants 5281e2f56035. We will specifically use the one cycle policy https arxiv. com qitvision a complete ml pipeline fast ai the fastai library has implemented a training function for one cycle policy that we can use with only a few lines of code. com questions 29223 exploratory data analysis with image datset Standard practices for EDA with image data2. It can handle large amounts of data and features. com c histopathologic cancer detection overview In this competition you must create an algorithm to identify metastatic cancer in small image patches taken from larger digital pathology scans. Generally creates smaller outputs that contain enough information Flattening Layer Data to 1d for the Fully Connected Layer Fully Connected Layer The deep NN to learn the features and make predictions TrainingWe will train via transfer learning. html sphx glr auto examples filters plot denoise wavelet py. We see that the final accuracy is impressive. In addition the loss functions of the training and validation sets seem to smoothly decrease and do not diverge. Several other excellent resources were also useful for direction. There is a divergence of training and validation performance indicating some overfitting to the training set. The following code Records all images which are dark larges pixel value 10 Records all images which are light lowest pixel value 245 Records a robust wavelet based estimator of the Gaussian noise standard deviation Checks if any images are loaded with the wrong data type np. com reader sd pii S1876034120305633 token 104840BB146B11F0239FAFE45FC879C93B6D4A7CDDED333EADDB2F5FA1BDE8BA672FD2C0C22DB5753011ED959877D131 GLOBOCAN statistics show that 18. A positive label indicates that the center 32x32px region of a patch contains at least one pixel of tumor tissue. The results show that the lr increases and then decreasese. com reader sd pii S1876034120305633 token ABA60CEBDF6831129168852D8363149C13690BB0BDBAFC23E032ED6FE278A1836BA034EEA21BE7726614DB65F2AC5EF1 Systematic review of current techniques in diag nosis and cure of several cancers affecting human body badly. Automation of this process through machine learning and computer vision is therefore potentially a high impact topic of research. 0 Being unable to save data in input For reference here is the original plan to execute on the notebook 1. Explanation of trainable False. Further regularisation techniques are used. It is important that the loss is still descending where we select the learning rate. com metastasis detection using cnns transfer learning and data augmentation 684761347b59 Transfer learns with NasNet on augmented PCam. If we take this approx. We see a bimodal distribution for noise with the main peak close to zero. For the readers information we plot the evolution of the learning rate and the evolution of the loss function. io guides transfer_learning Transfer learning and fine tunining in Keras. The notebook is built on the following general approach Information gathering Split the problem into smaller parts see Plan Overview at the end of the notebook Execute Refine plan as more information and obstacles become apparentThe review paper Deep neural network models for computational histopathology A survey https arxiv. com qitvision a complete ml pipeline fast ai we are potentially missing 299k untreated deaths. Testing has shown that the conclusions insights scale to more data. Initially we have 96x96x3 27 648 features per image which is too large to process quickly. One interesting non overlapping section is the low mid mean mid std region that only positive samples seem to occupy. Introduced serveral papers that propose interesting variants of ResNet or provide insightful interpretation of it. The below plots show us that total variance in pixel observations RGB across 96x96 pixels explained by the first 2000 principal components is around 90 for both positive and negative samples. nl posts pcam Datasets such as Camelyon require developing intricate dataloaders that take care of balancing different types of tissue and can efficiently work with the terabytes of data available. com an overview of resnet and its variants 5281e2f56035 The core idea of ResNet is introducing a so called identity shortcut connection that skips one or more layers. This is because of the time cost of an optimal search and the assumption that the data set and the modelling framework is equivalent. In particular they highlight patch level CNNs and transfer learning as the preffered approach. Predicts on augmented images and averages output. nl post getting started with camelyon Test set accuracy is 0. com fmarazzi baseline keras cnn roc fast 10min 0 925 lb Loads data in batches to avoid memory error Augments images with ImageDataGenerator Defines own 3 level CNN Does normalisation Predicts on testing set directly not on augmented images averaging 5. 1m new cancer cases emerged in 2018 that caused 9. We will work with resnet50 due to the successful implementation here https github. Load data Plot samples and highlight 32x32 centre Look for nulls and duplicates Examine data balance over under sampling is not needed Examine RGB distribution Plot mean vs sd for RGB look for outliers and anomalies Correlation of pixles PCA and number of important features may be needed for feature selection PCA for positives vs negatives Estimate noise may need adversarial examples if noise is higher 1 255 precision of images Normalise data Create crops and augmented images Choose model pretrained NN ResNet50 Image clustering on ResNet50 features Shuffle date split into training testing Transfer learning use callback to save the best weights Regularisation Fine tunining Examine loss function for overfitting Examine precision recall matrix Investigate P R curve Examine permutation importance of false negatives how are these different from true negatives Summarise references References Blogs1. Metastases most commonly develop when cancer cells break away from the main tumor and enter the bloodstream or lymphatic system. A Note on NoiseWe plot the Gaussian noise distribution estimated via skimage. It is quite clear why removing a couple of layers in a ResNet architecture doesn t compromise its performance too much the architecture has many independent effective paths and the majority of them remain intact after we remove a couple of layers. We can see that there are no samples which do not have int dtypes. This has proven to improve results in computer vision. 8563 with Vgg16 Kaggle1. As per qitvision https www. Negative samples seem to have an order of magnitude more outliers. pdf Image based cell profiling is a high throughput strategy for the quantification of phenotypic differences among a variety of cell populations Interesting EDA Other references1. The process of patch production is described in its creator s post http basveeling. com emackie complete beginner s guide eda keras lb 0 93 edit Good comparison of positive an negative samples at EDA stage Builds and trains CNN ROC fast model3. 220025 it total What is the label Read image Check for anomylous data types Build separate positive and negative samples for examination later Record noise of image Record mean and std of each image Record noise of image Record mean and std of each image is this too dark do not include in statistics is this too bright do not include in statistics each possible pixel value will get a bin in the following histograms RGB channels All channels Set image labels we use a bit fewer bins to get a smoother image Plot average images Free memory we use a bit fewer bins to get a smoother image Free memory also the default batch size 1cycle policy get accuracy plot learning rate of the one cycle load the baseline model unfreeze Fit new model with lower learning rates get accuracy Confusion matrix probs from log preds Compute ROC curve Compute ROC area RGB channels. gov pmc articles PMC6344799 were extremely helpful in understanding that there is a consensus on the machine learning approach to classification of PCam. This is over other methods such as ImageDataGenerator in Keras. In general lower numbers mean more noise. 1 million new cancer cases emergedin 2018 that caused 9. These systems carry fluids around the body TIF files contain an image saved in the Tagged Image File Format TIFF a high quality graphics format Whole slide images WSIs are high quality digital scans of glass slides used in pathology Patch based learning splits the WSI into smaller non overlapping patches which are used as training records for a machine learning model. Normalisation is done using imagenet_stats. 03962 Propose a new model for digital pathology segmentation based on the observation that histopathology images are inherently symmetric under rotation and reflection6. Resnet50 is a 50 layer deep convolutional neural network CNN. Model PerformanceThe following code gives us the final performance of the model in terms of accuracy the confusion matrix the area under curve and the precision recall curve. Exploratory Data AnalysisWe will now begin to examine the data quality and the high level properties of the data at the class level. com humanunsupervised humanunsupervised. We also take this approach here Methods based on CNNs have consistently outperformed other handcrafted methods in a variety of deep learning The most popular and widely adopted technique in digital pathology is the use of transfer learning approach We discuss CNNs transfer learning and the PCam data set in more detail later in the notebook. Not including PCam According toGLOBOCAN statistics about 18. The low peak may warrent a noise cancelling method such as wavelet denoising https scikit image. Useful TerminologyThe following definitions and terms helped provide clarity and make swifter modelling choices Metastasis is the spread of cancer from the point of onset to different parts of the body. Initial Data LoadWe will load data directly from the Kaggle directory. References Antony de Perio. com qitvision a complete ml pipeline fast ai entry using Fast AI and the Antonio de Perio blog post https towardsdatascience. com feature importance with neural network 346eb6205743 Permutation importance is calculated after a model has been fitted If I randomly shuffle a single feature in the data leaving the target and all others in place how would that affect the final prediction performances 8. Here areas of the images important to classification are highlighted as a heatmap. pdf and article Artificial Intelligence in Pathology https www. The following code executes this. com histopathological cancer detection with deep neural networks 3399be879671 Jupyter notebook uses fast. Packs the clinically relevant task of metastasis detection into a straight forward binary image classification task akin to CIFAR 10 and MNIST. I shall cite these as we go and also summarise at the end of the notebook. We can also see the loss function evolving over training. com bbm406f19 week 1 histopathological cancer detection 30649d8dd847 4 week project to classify PCam images using Vgg16. Here positive and negative samples look very similar to the eye. As it helps to visualise the data we will load 5 random samples of the positive and negative classes. com emackie a complete ml pipeline fast ai edit2. Interpretation There may be overfitting after fine tuning Fine tuning does improve results on the validation set The AUC and precision recall results look positive but there is room for improvement False negatives with features highlighted show us that whitespace potentially the brightness may be leading to missclassifcationWe should most likely submit the transfer learned model before fine tuning. com histopathological cancer detection with deep neural networks 3399be879671 on Towards Data Science. In addition to inter pathologist variability some systems which require quantitative analysis are too time consuming to use in a routine clinical setting. In addition we can only find a minority of samples which are either very light or very dark. We have 131k negative and 89k positive labels leading to an imbalance of 60 40 indexed by the image ID. pdf This paper advocates against permute and predict methods for interpreting black box functions Forces the original model to extrapolate to regions where there is little to no data Recommends explicitly removing features conditional permutations or model distillation methods7. com questions 2440504 noise estimation noise measurement in image Scikit Image has an noise estimate sigma function which works with colour images quick look at the label stats As per qitvision reverse the cv2 colours from bgr to rgb we will then see the same images as directly from PCam plus I wouldn t want this to affect a pretrained model s ability OpenCV reads the image in bgr format by default We flip it to rgb for visualization purposes random sampling Negatives Create a Rectangle patch Positives Create a Rectangle patch As we count the statistics we can check if there are any completely black or white images If no pixel reaches this threshold image is considered too dark If no pixel is under this threshold image is considerd too bright max length of positive and negative samples for i idx in tqdm enumerate iterable computing statistics. https stackoverflow. The important components of a CNN can be summarised as follows Convolutional Layer This layer applies some filters to an image to remove low and high level features Stride Is the value which indicates that the filter will shift the image in increments of Stride pixels steps Padding After convolution to manage the size difference between the input and outputs Activation Layer Non linearity through activation function Pooling Layer Reduces the offset between the new representation and the number of parameters within the neural network. This was certainly a useful step in order to confront some of the author s initial biases namely that a CNN coded from scratch CNN would certainly be the only solution. https geertlitjens. ipynb and the glowing reviews here https arxiv. In the following code we use the qitvision optimal learning rates and weight decay. We also examine the correlation between different features. int8 Due to time constraints we only load 10k images. There is a lot of overlap in the distributions. A higher variance seems to be explained by fewer principal components for negative samples in general which ties in with the idea that negative samples are more noisy. Data ProcessingFor image data processing we use ImageDataBunch PyTorch directly as in Antonio de Perio s notebook. com cc786537662 initial eda image processing Interesting EDA for image processing Papers1. Unfortunately Shapley Values https towardsdatascience. com artgor simple eda and model in pytorch Defines their own 3 level CNN Then goes to ResNet4. gov pmc articles PMC6344799 The history of artificial intelligence in the medical domain recent advances in artificial intelligence applied to pathology and future prospects Normalization is one of the techniques used to reduce digital immaging5. However this is using resnet50 weights trained to another data set and we may acheive better performance by retraining. https towardsdatascience. In addition researching the problem benefits us with context clarity and insights into the data. PCam is derived from the Camelyon16 Challenge which contains 400 H E stained WSIs of sentinel lymph node sections. when metastastic cancer exists but is not detected. ai to augment PCam and transfer learn fine tune a Resnet50 model. Introduction to Problem and NotebookOver the last 50 years several scoring systems have been proposed that allow pathologists to grade tumours based on their appearance. We can also study the PCA of the images. The method relies on finding the optimal learning rate and weight decay L2 penalty values. com blob master pcam pcam cancer detection. This does not seem imbalanced enough to warrant methods such as weighting our positive class subsampling or oversampling. At a high level this notebook is organised as follows Background on how we approach the challenge and information relevant to the problem Exploratory data analysis Modelling the classification problem Model performance Notes on Approaching the ChallengeWe began by information gathering. ", "id": "emackie/histopathologic-cancer-detection-model-2", "size": "20991", "language": "python", "html_url": "https://www.kaggle.com/code/emackie/histopathologic-cancer-detection-model-2", "git_url": "https://www.kaggle.com/code/emackie/histopathologic-cancer-detection-model-2", "script": "sklearn.utils sklearn.metrics PCA fastai.vision readImage skimage.restoration resnet50 estimate_sigma matplotlib.patches shuffle seaborn numpy getLearner auc PIL sklearn.decomposition sklearn.model_selection Image matplotlib.pyplot pr_curve pandas fastai roc_curve torchvision.models train_test_split ", "entities": "(('normalisation', '5'), 'cnn') (('data even augmentation', 'function'), 'center') (('post http', 'creator'), 'describe') (('we', 'loss function'), 'plot') (('data', 'that'), 'be') (('therefore overfitting', 'differences iii noise'), 'indicate') (('gov pmc PMC6344799', 'PCam'), 'article') (('transfer_learning Transfer', 'fine Keras'), 'guide') (('total variance', 'around positive samples'), 'show') (('filters', 'wavelet denoise py'), 'plot') (('we', 'ClassificationInterpretation'), 'study') (('Model PerformanceThe following code', 'confusion curve'), 'give') (('center 32x32px region', 'tumor tissue'), 'indicate') (('whitespace', 'fine tuning'), 'overfitte') (('following code', 'gomezp https www'), 'plot') (('Normalisation', 'imagenet_stats'), 'do') (('which', 'int dtypes'), 'see') (('Initial Data LoadWe', 'Kaggle directly directory'), 'load') (('noise Gaussian distribution', 'skimage'), 'estimate') (('which', 'too routine clinical setting'), 'be') (('filter', 'neural network'), 'summarise') (('We', 'image ID'), 'have') (('684761347b59 Transfer', 'augmented PCam'), 'learn') (('main influences', 'notebook'), 'be') (('This', 'computer vision'), 'prove') (('that', 'data'), 'require') (('Execute Refine plan', 'apparentThe review network Deep neural computational histopathology'), 'build') (('how these', 'negatives Summarise true references'), 'need') (('still where we', 'learning rate'), 'be') (('as easily they', 'MNIST'), 'create') (('we', 'better performance'), 'use') (('method', 'learning weight L2 penalty optimal rate values'), 'rely') (('loss functions', 'training sets'), 'seem') (('pdf cell Image based profiling', 'cell populations'), 'be') (('particular they', 'preffered approach'), 'highlight') (('Here areas', 'heatmap'), 'highlight') (('we', 'overfitting'), 'combat') (('which', 'machine learning model'), 'carry') (('nl post', 'camelyon Test set accuracy'), 'start') (('This', 'Keras'), 'be') (('negative samples', 'idea'), 'seem') (('that', 'one layers'), 'com') (('we', 'qitvision learning optimal rates'), 'use') (('images', 'data type wrong np'), 'record') (('optimal lr', 'divergence'), 'be') (('We', 'cycle policy https specifically one arxiv'), 'use') (('that', '9'), 'emerge') (('anomolies', 'results'), 'qitvision') (('Unforeseen ObstaclesSome I', 'fastai v1'), 'improve') (('Being', 'here original notebook'), '0') (('RGB', 'patch'), 'settle') (('we', 'code'), 'qitvision') (('Data image data ProcessingFor we', 'directly Antonio de notebook'), 'processing') (('cancer most commonly when cells', 'bloodstream'), 'develop') (('histopathology images', 'inherently rotation'), 'propose') (('ML model', 'tif format'), 'develop') (('this', 'performance'), 'load') (('future Normalization', 'digital immaging5'), 'article') (('com ml complete we', 'potentially 299k untreated deaths'), 'qitvision') (('modelling choices swifter Metastasis', 'body'), 'help') (('you', 'pathology larger digital scans'), 'overview') (('we', '10k only images'), 'load') (('Here positive samples', 'very eye'), 'look') (('we', 'layers'), 'be') (('low peak', 'https scikit such wavelet image'), 'warrent') (('we', 'positive classes'), 'load') (('where we', 'metastastic cancer'), 'highlight') (('Exploratory data analysis', 'information gathering'), 'organise') (('com', 'ml complete pipeline'), 'emackie') (('conclusions', 'more data'), 'show') (('FinetuningFinetuning', 'learning rate'), 'involve') (('which', 'neural networks'), 'start') (('that', 'it'), 'introduce') (('we', 'far less observations'), 'seem') (('We', 'close zero'), 'see') (('we', 'negatives false i.'), 'pay') (('S1876034120305633', 'human body'), 'token') (('which', 'lymph node sentinel sections'), 'derive') (('GLOBOCAN 104840BB146B11F0239FAFE45FC879C93B6D4A7CDDED333EADDB2F5FA1BDE8BA672FD2C0C22DB5753011ED959877D131 statistics', '18'), 'pii') (('data', 'PatchCamelyon PCam benchmark slightly modified dataset'), 'be') (('We', 'successful implementation'), 'work') (('Recommends', 'conditional permutations'), 'pdf') (('accuracy Confusion matrix', 'log Compute ROC curve Compute ROC area RGB preds channels'), 'total') (('namely CNN', 'scratch'), 'be') (('This', 'class such positive subsampling'), 'seem') (('loss also function', 'training'), 'see') (('com', 'Then ResNet4'), 'define') (('that', 'appearance'), 'propose') (('1 cancer million new emergedin 2018 that', '9'), 'case') (('Exploratory Data AnalysisWe', 'class level'), 'begin') (('Next we', 'RGB'), 'show') (('how that', 'prediction final performances'), 'com') (('we', 'notebook'), 'cite') (('more this', 'more MNIST4'), 'Investigate') (('It', 'data'), 'handle') (('We', 'different features'), 'examine') (('i', 'computing iterable statistics'), 'have') (('Several other excellent resources', 'also direction'), 'be') (('6 cancer million deaths', 'cancer2'), 'contain') (('Fast AI', 'interpretability'), 'make') (('general lower numbers', 'more noise'), 'mean') (('which', 'samples'), 'find') (('where positive images', 'class average positive pictures'), 'lb') (('which', 'image'), 'have') (('TrainingWe', 'transfer learning'), 'create') (('We', 'later notebook'), 'take') (('Jupyter 3399be879671 notebook', 'deep neural networks'), 'com') (('Automation', 'impact therefore potentially high research'), 'be') (('Negative samples', 'magnitude more outliers'), 'seem') (('only positive samples', 'std low mid mean mid that'), 'be') ", "extra": "['biopsy of the greater curvature', 'onset', 'test', 'metastasis']"}