{"name": "how to get 1 000 lb 1 000 ", "full_name": " h1 This is a leak from the original dataset h2 Create some functions to convert csv files to dict h2 Create a function that generate all the information from the leak that may be helpful later h2 Simply run the function above in train valid and test h2 Test if the leak has real effect on LB h2 So I postprocessed my highest scored submission h2 Wow negative labels in valid set really work how about positive labels Will it affect the private LB h2 Make a perfect cheatsheet ", "stargazers_count": 0, "forks_count": 0, "description": "Learn from bestfiting s solution for HPA competition I was trying to reproduce finding WSI ids in https www. This is a leak from the original datasetSee discussion https www. com c histopathologic cancer detection discussion 85283How did I discover this Carefully watch LB people see if anybody discovered a leak that boost them up with only a few submissions. I know that if the image is not tumor_patch then no cancer should be detected in the sliced images So I postprocessed my highest scored submission. Make a perfect cheatsheet creates a dictionary where each key is the sha 1 hash of the image data and the value is the index in the h5 file creates a dictionary where each key is the img_id and the value is tumor or not creates a dictionary where each key is the h5 index and the value is the wsi Test Code origin_dict Label. com c histopathologic cancer detection discussion 85424Some of the codes are from https www. com c histopathologic cancer detection discussion 85283 Trying to develop my postprocess technique inspired from TGS Salt Create some functions to convert csv files to dict Create a function that generate all the information from the leak that may be helpful laterI did not know how big the leak was at this point. Simply run the function above in train valid and test Test if the leak has real effect on LBAfter looking at the files I generated above I realized tumor_patch might be useful 1. Wow negative labels in valid set really work how about positive labels Will it affect the private LB It will affect private LB since my score stay exactly the same with only private LB postprocessed. ", "id": "kokecacao/how-to-get-1-000-lb-1-000", "size": "1405", "language": "python", "html_url": "https://www.kaggle.com/code/kokecacao/how-to-get-1-000-lb-1-000", "git_url": "https://www.kaggle.com/code/kokecacao/how-to-get-1-000-lb-1-000", "script": "postprocess tqdm create_wsi_dict numpy tqdm_notebook as tqdm pathlib create_labels_dict tqdm_notebook pandas create_pcam16_hash_table Path ", "entities": "(('I', 'https www'), 'try') (('85424Some', 'https www'), 'be') (('helpful how leak', 'point'), 'try') (('So I', 'highest scored submission'), 'know') (('exactly same only private LB', 'private LB'), 'work') (('that', 'only a few submissions'), 'discussion') (('tumor_patch', 'files'), 'run') (('h5 index', 'dictionary'), 'make') (('This', 'datasetSee discussion https original www'), 'be') ", "extra": "['test']"}