{"name": "intro to seismic salt and how to geophysics ", "full_name": " h1 Data Exploration h1 Train Model h1 Test Data h1 Prepare Submission ", "stargazers_count": 0, "forks_count": 0, "description": "com keegil keras u net starter lb 0 277Let s throw a Unet at our data. All of this is one to one from Ketil and does not differ from any of the other segmentation tasks. Test DataFirst we ll get the test data. So I had a look at https www. This one isn t in keras but obviously we re stealing this one too from Ketil. I am blatanly stealing from Ketil at this point. However you can glean some information from them how to approach seismic data. You can imagine it like an ultra sound of the subsurface. org action doSearch AllField salt. The U Net is basically looking like an Auto Encoder with shortcuts. pdf Seismic data interpreters are used to interpreting on 2D or 3D images that have been heavily processed. These started to flow behave ductile and find a way into other layers above. org wiki Seismic_Data_Analysis is open access. If you find you need some geophysical helpers you can import Bruges https github. The seismic itself is pretty old in the publication and you re dealing with data that is less noisy here which is nice. Data ExplorationLet s look at some data. Code for automatic seismic interpretation can be found here https github. TGS provided some nice PNG files instead. First we ll need to get our data into a shape that works for U Nets. A nice CSV with predictions. We ll look at it again just to be sure. Seismic Data with salt CC BY SA Yilmaz https wiki. All credit goes to him and his nice code. So if you talk to cynic geophysicists you ll hear that deep learning better outperform the Chaos attribute. One common seismic attribute is called chaos or seismic disorder. Talk about biasing your data. Seismic data usually has wavelengths around 1m to 100m. Prepare SubmissionWe need to prepare the submission. We build models on one type of seismic and have no idea whether it generalizes. org wiki Salt_flanks. Let s do it quick and dirty for now but eventually consider aliasing and all that fun. Recently geoscience has started to adopt deep learning and it has seen a clear boom particularly in imaging salt. To give you the gist these salt diapirs form from salt layers somewhere else that were under much pressure. The standard work of seismic data analysis https wiki. This takes a while it s 18000 samples. We have many examples without salt as you can see by the masks that are entirely dark. com content documents Resource 20Center Articles INT_Imaging_Salt_tutorial_141101. If you re running this on kaggle this is the point you want to have GPU support. Set some parameters Get and resize train images and masks Check if training data looks all right Define IoU metric Build U Net model Get and resize test images Predict on train val and test Threshold predictions Create list of upsampled test masks Perform a sanity check on some random training samples if last run is unsaved i. That is great and adresses a problem in deep learning geoscience at the moment. There is an entire research branch dedicated to salt tectonics that is the movement of salt in the subsurface. However in an ultra sound we use much smaller wavelengths to image our body. com bolgebrygg MalenoV https github. Train ModelOur task just like the segmentation task for nuclei is evaluated on the mean IoU metric. You ll find sections on Salt in there as well https wiki. We re also sprinkling in some earlystopping to prevent overfitting. It s just something to keep in mind while thinking about resolution. These can be seen like feature maps on the texture of the seismic. That has some physical implications but for now we don t have to deal with that. Sand gets deposited on top of existing sand. com the showroom data for my thesis. Imaging salt has been a huge topic in the seismic industry basically since they imaged salt the first time. png Caption Figure 5. Check them out to improve on this. 0 1 Conflicting dips associated with salt flanks a CMP stack without dip moveout correction b time migration of the stack in a c the stack with dip moveout correction d time migration of the stack in c. org wiki Salt flank_reflections and https wiki. Salt bodies are important for the hydrocarbon industry as they usually form nice oil traps. I mentioned that seismic is kind of like ultrasound. We can see that TGS chose to use very varied data by inspecting. com agile geoscience bruges Let s dive in for now. I have written a bit about salt on my blog http the geophysicist. A good starting point is this publication http www. That s great an algorithm we build will then know that patches exist entirely without salt. That means it should be a power of 2. org images 1 14 Ch05_fig0 1. In comes salt which is behaving very much unlike other rocks. com crild facies_netYou will notice that these solutions load a specific SEG Y file which luckily we don t have to bother with. com wp content uploads 2016 08 Chopra_Marfurt_TLE_Aug2016 LowRes. You can think of Earth as layered. So there s a clear motivation to delineate salt bodies in the subsurface. Interpretation on seismic images has long used texture attributes to identify better and highlight areas of interest. The Society of Exploration geophysicist alone has over 10 000 publications with the keyword salt https library. If you would like to do a deep dive you can see this publication https www. org wiki Salt flank_reflections media File Ch05_fig0 1. Building the sequential Model. Seismic data is a neat thing. For salt you will notice that the texture in the salt masks is rather chaotic where the surrounding seismic is more striped. We can draw heavily on other work instead of regurgitating the geophysics work that has been done before. com waldeland CNN for ASI https github. ", "id": "jesperdramsch/intro-to-seismic-salt-and-how-to-geophysics", "size": "5586", "language": "python", "html_url": "https://www.kaggle.com/code/jesperdramsch/intro-to-seismic-salt-and-how-to-geophysics", "git_url": "https://www.kaggle.com/code/jesperdramsch/intro-to-seismic-salt-and-how-to-geophysics", "script": "keras.preprocessing.image skimage.transform keras.layers keras.callbacks tqdm_notebook keras.layers.core mean_iou EarlyStopping chain skimage.morphology itertools imread Conv2D numpy array_to_img Input RLenc Conv2DTranspose img_to_array ModelCheckpoint ImageDataGenerator keras.layers.convolutional load_img matplotlib.pyplot label tnrange tensorflow pandas Lambda resize tqdm imshow load_model Model concatenate MaxPooling2D backend backend as K keras.layers.pooling keras concatenate_images keras.models keras.layers.merge skimage.io ", "entities": "(('All', 'segmentation other tasks'), 'be') (('You', 'https in there as well wiki'), 'find') (('Seismic data', 'usually wavelengths around 1 m to 100 m'), 'have') (('s', 'now eventually aliasing'), 'let') (('that', 'U Nets'), 'need') (('basically they', 'salt'), 'be') (('that', 'masks'), 'have') (('SubmissionWe', 'submission'), 'prepare') (('it', 'particularly salt'), 'start') (('However you', 'how seismic data'), 'glean') (('somewhere else that', 'much pressure'), 'give') (('I', 'geophysicist'), 'write') (('TGS', 'very varied data'), 'see') (('less here which', 'data'), 'be') (('Interpretation', 'interest'), 'use') (('1 Conflicting dips', 'c.'), '0') (('luckily we', 'which'), 'notice') (('that', 'subsurface'), 'be') (('you', 'GPU support'), 'run') (('You', 'subsurface'), 'imagine') (('last run', 'training random samples'), 'Set') (('Sand', 'existing sand'), 'deposit') (('you', 'Bruges https github'), 'find') (('TGS', 'PNG nice files'), 'provide') (('you', 'publication https www'), 'like') (('Train ModelOur task', 'IoU mean metric'), 'evaluate') (('rather where surrounding seismic', 'salt masks'), 'notice') (('then patches', 'entirely salt'), 's') (('we', 'body'), 'use') (('deep learning', 'Chaos better attribute'), 'hear') (('they', 'oil usually nice traps'), 'be') (('Code', 'https here github'), 'find') (('That', 'moment'), 'be') (('publication', 'www'), 'be') (('I', 'point'), 'be') (('we', 'don that'), 'have') (('These', 'seismic'), 'see') (('that', '2D images'), 'use') (('Society', 'keyword salt https library'), 'have') (('obviously we', 'too Ketil'), 't') (('that', 'geophysics instead work'), 'draw') (('These', 'other layers'), 'start') (('which', 'very much other rocks'), 'in') (('it', 'idea'), 'build') (('We', 'overfitting'), 'sprinkle') (('It', 'resolution'), 's') (('com keegil u net lb 0 277Let', 'data'), 'keras') (('U Net', 'shortcuts'), 'look') (('credit', 'him'), 'go') ", "extra": "['test']"}