{"name": "kiva poverty targeting ", "full_name": " h1 Intro Kernels h1 Table of Contents h1 1 What is Kiva h1 2 Notes On Kiva for Relieving Poverty h1 3 Multi Dimensional Poverty Index MPI h2 3 1 National MPI Based Calculations h3 3 1 1 Critique 1 Null Rural Percentages h3 3 1 2 Critique 2 Rural Percentage Accuracy h3 3 1 3 Critique 3 Overall Changes Over Time h2 3 2 Sub National MPI Based Calculations h3 3 2 1 Critique 4 Inherited National MPI and Mixed Methodology h3 3 2 2 Critique 5 Inaccurate Region Assignment h3 3 2 3 Sub National Regional Reassignment and Scoring Loan Theme Partner Regions h3 3 2 4 Sub National Regional Reassignment and Scoring Loans h3 3 2 5 Sub National Regional Reassignment and Scoring Loans Weighted Instead of Averaged h1 4 Kenya Analysis h2 4 1 Kenya MPI Analysis National MPI 0 187 h2 4 2 Kenya FGT Analysis ", "stargazers_count": 0, "forks_count": 0, "description": "Some Nampula loans stayed Nampula others went to Zambézia or null. 3 Sub National Regional Reassignment and Scoring Loan Theme Partner RegionsI do not know the methodology Kiva has used to associate loans or partners to regions. I think this will help us see the differences better. com annalie kivampi for Field Partner MPI calculated with both National MPI and Sub National MPI. Multi Dimensional Poverty Index MPI 3 3. Something of serious note here is how drastic the MPI Score has now changed. Kenya has had a lot of redistricting which can be read about on wikipedia https en. 133 this will surely affect our scoring. read in MPI read in kiva data read in kiva enhanced data read in geospatial regions read in cato data read in world bank findex and rural population data read in kenya poverty metrics read in philippines demographics. Our polygons are the same but we ll have to convert our loans into points. Elliot has a follow up https www. Thus they are the most accurate representation of the data provided. com timosdk exploring motivations for kiva loans notebook that he found mutliple people in Peru requesting loans for 600 1200 stereo systems. Purple to Mustard is an improvement in mpi_region accuracy at the loan attribute level and the result of weighting loans not as an average of regions but with a funded_amount weighting. The ideal case for a standard Kiva loan is likely to an entrepeneur who would otherwise seek a local black market mafia type money lender who would charge much higher rates. mean loan_amount np. where gdf_points r_map gdf_regions mpi_region_new i gdf_points mpi_region_new leverage helper file amended sub national loans average Get total volume and average MPI Regional Score for each partner loan theme Get a volume weighted average of partners loanthemes. Partner 23 shouldn t have an MPI of 0. The next and last mpi_region located amended calculations are not done at the region partner level but are both accounted for by the location on the actual atomic loans in the Kiva challenge set. The reason for this drastic change can be from two factors and in this case is arguably both 1. That s not going to goose a GDP number GINI coefficient MPI metric or any other nation state aggregate. I actually picked Mozambique at random Partner ID 23 was a low number when visually scanning through some data and found their to be pretty significant regional inaccuracies. On the map they seem to loan to the most impoverished places and that was a big jump down. Hardcore or Extreme Poverty Households individuals whose monthly adult equivalent total consumption expenditure per person is less than KSh 1 954 in rural and peri urban areas and less than KSh 2 551 in core urban areasI think it s best to use Severity of Poverty let s first take a look at a regional map by this metric. com doyouevendata kenya poverty metrics by district. Differing opinion of what rural is or simply poorly tracked metric or bad guess 2. The KDE map might not match as well but the data is missing so it appears more closely correlated than it really likely is. We can t simply replace current MPI numbers with new MPI numbers when they are released and expect to have an accurate picture of the story as it unfolded. This is certainly more than some of my friends are willing to spend on a kickin stereo. First let s take a look at the Sub National Field Partner MPI Scoring with the current methodology. We will have a location point and determine which region polygon it is in. 2 Kenya FGT AnalysisAs noted above in Section 2 2 understanding poverty at a more local level is of interest to Kiva in understanding its borrowers situations. Much of poverty reduction comes from state supported initiatives such as providing security for people and property so that markets can function and flourish. 1 Critique 1 Null Rural Percentages 3_1_1 3. We now have 5 partners instead of just 2. As I have only done Kenya those field partners will be omitted from this graph. Wow that s really quite telling Overall the Kiva field partners in Kenya don t appear to be delving into the areas experiencing the most poverty. Where are these really Everything ending with Maputo is actually a part of Maputo Province MPI 0. Since 2013 they ve had 47 counties. I ve posted a few with the differences below. Kiva s largest impact will be from directing it s risk tolerant capital provided by its users into the hands of borrowers who have difficulty accessing basic banking functions to securely save money or to borrow at fair market rates. We re not going to observe something at a high level aggregate like GDP for a region because there are many other factors going on but mostly for the simple reason that there is not enough Kiva loan activity going on to observe results at such a high aggregate level. For those that do not Kiva inherits the National MPI as noted above. This seems like a significant mixing of methodology one with hard MPI provided regional numbers and one with pretty soft appearing field partner rural percentages. However not all countries have this region level data. where gdf_points r_map gdf_regions residence_county i gdf_points residence_county leverage helper file add in kenya overall poverty county data add in kenya overall poverty county data add in kenya overall poverty county data add in kenya overall poverty county data add in kenya overall poverty county data. How many loans and how much money have they lent out Not every country has a Sub National entry however which is where we pulled our MPI National from. Kiva has been around a decade and is likely to be around for some time a lot can change in the span of decades. 43635 and now it s 1 10th of that at 0. So are the poverty dimensions over time as state policies and various aid efforts work to improve situations. Almost all of the regions on the left became associated with the MPI Region of the capital city which has the lowest regional MPI of 0. There is a spatial join which likely works much better than the code I have been using however it does not appear that it will be available any time soon https www. The purple line takes the mean of the regional MPI number while the mustard color takes a funded_amount weighted calcuation of regional MPI. com gaborfodor additional kiva snapshot however I was not sure how well it would tie in to the challenge snapshot of field partners and their aggregate metrics. Let s stick with overall for now and plot our loans on it. However MPI National itself seems to be similar in methodology to Kiva s rural percentage rating I have made a new MPI National Calculated here what I ve done is leverage the provided MPI Rural and MPI Urban and pulled a country level rural percentage from World Bank info for the most recent year I found available 2016. There are some wonky Regional MPI based green outliers here 340 246 505 529 most likely from loans associated with incorrectly assigned MPI regions. Intro KernelsThis is going to be my third Kiva Kernel. org wiki Sub Counties_of_Kenya. 2 Kenya FGT Analysis 4_2 1. Year 1 100 loans at 0 rural. Note again the KDE plot in Section 3 3 hides the fact that the differences in the presence of both can be quite dramatic and for that matter many partners are simply lost under the National based calculation. We can prove the latter is true with a browse of the available data first let s take a look at the MPI Regional values then a look at our loan region and mpi_region assignments. The GDP effects are not observable although what is observable is how difficult life in areas is and how Kiva addressing lack of credit and capital may offer some relief. Partner 23 had a value of 0. set_index Compute the MPI Score for each loan theme Create new column LocationName that concatenates the columns Country and Sub national region Merge dataframes Get total volume and average MPI Regional Score for each partner loan theme Get a volume weighted average of partners loanthemes. 2 Critique 2 Rural Percentage AccuracyThis critique is twofold 1. In the next section we ll run these numbers for the actual loans in our challenge set of loans. What is Kiva 1 2. It is provided at the National level and in some countries at a Sub National level. national scores subnational scores amended region theme scores amended loan scores averaged amended loan scores weighted combine for comparison read on geospatial data aggregate districts into regions used for MPI level in MOZ make a geodataframe for the regions assign regional MPI to regions amended sub national partner regions Get total volume and average MPI Regional Score for each partner loan theme Get a volume weighted average of partners loanthemes. Many loans are in the city region partner 23 has more in the province and partner 486 is going out into the much more impoverished areas. Rural areas have higher values than urban ones. For this I am going to use the data provided in the All Kiva Challenge Loan Location Coordinates https www. Looking at either may yield different results I focued on field partners in my initial kernel and will repeat some of that work here. com doyouevendata an exploratory look at kiva lenders this is a kernel I made exploring the additional uploaded loan set and kiva lender files while I was waiting for my original Kernel to be resolved. 1 Critique 4 Inherited National MPI and Mixed MethodologyFor Sub National MPI where Kiva is able to associate a country s region level specific MPI with lenders we should see a valuable increase in understanding a lender s situation. Kiva results also can be difficult to measure. Now we ve picked up another lender 210 has entered the scene. Sub National KDE in Section 3 3 smooths over and hides the fact of this being an extremely different value. Unfortunately we lost some loans 16 from Kiva s method thought to be in the city ended up as null. 2 Critique 2 Rural Percentage Accuracy 3_1_2 3. Machava 15 appears to be a neighborhood in Matola within the province as well. 43635 National but neither should it have a value of only 0. We ll need to stitch together the geospatial counties into these dissolved regions to properly plot our points in polygons and associate them with MPI. Kenya AnalysisKenya has the 6th most loans per capita and the 2nd most loans in terms of absolute numbers. To save time actual point in polygon code is probably commented out with a private dataset from a prior run leveraged as a helper dataset simply to save me time when running this kernel. 5 Sub National Regional Reassignment and Scoring Loans Weighted Instead of Averaged 3_2_5 4. Rural percentage is a field partner level attribute. Let s place our loans into these counties and take a look at what we can see. Now what s our field partner calculated Sub National MPI This makes sense visually if we plot these partners on a map as well. There are some wonky National MPI based blue outliers here particuarly for partner 218. It s a bit surprising to see that clearly the poorest part of this country has not received any aid from any field partner. As noted above National MPI as presently calculated does not seem particularly trustworthy. Kiva Exploration by a Kiva Lender and Python Newb https www. Instead of showing the percentage and multiplying it by an arbitrary value to get some color I m going to normalize the value for the next graph. We will determine in which region a location lies by using geopandas and geodataframes. 187 Let s do the same analysis above for Kenya. Comparing green existing Sub National region partner based MPI to red amended mpi_region Sub National region partner based MPI we can see some partners with little change and some with quite significant changes. add kenya graphs and highlights from the actual report1. within gdf_regions geometry i gdf_points mpi_region_new np. Merge dataframes why did this NaN that worked as null turn into a nan that i m forced to treat like a string Get total volume and average MPI Regional Score for each partner loan theme Get a volume weighted average of partners loanthemes. com doyouevendata kiva exploration by a kiva lender and python newb El Salvador easily would be the country with the most observable impact at the nation state level https www. How is this metric tracked over time It seems an application point in time field partner level attribute. Can we expect fair peer comparisons when mixing such different methodologies The safer route to me would appear to calculate the National MPI based off of World Bank data as proposed in Section 3. agg MPI Regional np. Overall Poverty Households individuals whose monthly adult equivalent total consumption expenditure per person is less than KSh 3 252 in rural and peri urban areas and less than KSh 5 995 in core urban areas3. The Kiva lending user is directly paid back from the associated loan and thus can be thought of as crowdfunding the purchase of a loan a borrower has requested. The big difference in the partners above is entirely due to the rural percentage of 85 vs. Sub National resulted in the following https www. I would argue the Field Partner MPI increases in accuracy going from methodologies left to right ans that the most accurately calculated Field Partner MPI is that in mustard which uses the base loans updated mpi_region values and takes a funded_amount weighted calculation across all the loans and regions a field partner has disbursed funds to. Furthermore it is provided across three levels 1. 1 Kenya MPI Analysis National MPI 0. Per Section 11 of my first Kernel https www. What results does that produce What s the map look like now and how do these methods all compare 1. I ll again note that I didn t look for this extreme a situation I simply began looking at field partner 23 because it was near the top of the loan_theme_regions file. 1 National MPI Based CalculationsHere s the results of the Mozambique field partner calculations as currently done. Should we use funded_amount or loan_amount I would say the latter as a field lender may disburse the loan with their own capital or the loan may already by pre disbursed. How is outlined in Annalie s kernel https www. What s it look like if we use the values from the actual loans This would be the ideal calculation given all available data. I would argue left to right or reading the methodologies from top to bottom is an improvement in calculating Field Partner MPI at each step. I am going to do it with one method using geospatial objects that appears to work reasonably well. These do produce different numbers a particularly large amount in the case of partner 491. Some of these look similar although we can see 468 dropped from 0. The values all appear to be nice whole numbers in multiples of 5 for the most part. Notes On Kiva for Relieving PovertyI am a fan and happy user lender of Kiva although it should also be noted that Kiva cannot work miracles. com doyouevendata kiva exploration by a kiva lender and python newb I suppose I ll refer to this now as my initial Exploratory Data Analysis kernel. Comparing National vs. 2 Critique 5 Inaccurate Region Assignment 3_2_2 3. A higher value MPI is worse. 3 Critique 3 Overall Changes Over Time 3_1_3 3. If this value is simply replaced it would incorrectly score this as 90 of 110 loans were applied to rural areas. 3 Sub National Regional Reassignment and Scoring Loan Theme Partner Regions 3_2_3 3. I believe the amended red is an improvement in accuracy. That s not great it s a huge amount of lost data If Kiva has a null value it is arguably better to simply inherit the National MPI provided in the Sub National file. Green to Red is an improvement in mpi_region accuracy at the field partner attribute level. 2 Sub National MPI Based Calculations 3_2 3. These are National values which get weighted into the Partner ID MPI Score based on the rural percentage. I think this is the case although this may be in part due to some National values being inherited and we also may be looking at too high level a plot here to recognize the more meaningful differences that result when we look at the indivial loan themes or field partners. This set uses Foster Greer Thorbecke FGT indices https en. Loans are crowdsourced in increments of 25 and disbursed by field partners expected to generally be at market or below market interest rates. 2 Sub National MPI Based Calculations 3. Are there any flaws with this methodology 3. All field partner loans are plotted above from the Kiva Challenge dataset. org wiki Foster E2 80 93Greer E2 80 93Thorbecke_indices which includes1. Note the pretty large difference between MPI Rural and MPI Urban here rural is pretty high at 0. This results in a bunch of field partners simply dropping out of any kind of peer analysis. 4 Sub National Regional Reassignment and Scoring LoansWe ve calculated the above using the loan_theme_region aggregates provided. It is certainly different than a loan for a store to expand their inventory or a farmer to purchase some pigs or for someone to purchase their own toilet. com gaborfodor also has an excellent dataset containing even more loans and their locations https www. The more able Kiva is able to understand a locality the better it is able to address its needs and work with its field partners to do so. and get weighted average for partners. An Exploratory Look at Kiva Lenders https www. The geospatial regions are actually at a lower district level so we ll have to combine them into larger polygons at our MPI regional level. Multi Dimensional Poverty Index MPI MPI is a poverty metric measuring multiple dimensions and intensity of poverty in an area. loan geodataframe seems like this should work per stack overflow but it puts a lower case nan in and isnull doesn t work properly on it. edu predicting poverty linear algebra data processing CSV file I O e. png However note that they have about 6 250 loans per million residents. Headcount Rate the proportion of the population that cannot afford the basic basket of goods as measured by a predetermined threshold. This will resulted in the lightest color being used for the region with the lowest value Nyeri and the darkest color being used for the region with the highest value Turkana. amended sub national loans weighted national scores subnational scores amended region theme scores amended loan scores averaged amended loan scores weighted combine for comparison read on geospatial data additional manual assignment Buret In 2010 the district was split between Kericho County and Bomet County. I think this has two problems as well 1. MOZ spatial projection loan theme geodataframe seems like this should work per stack overflow but it puts a lower case nan in and isnull doesn t work properly on it. I believe the region of MOZ simply dropped out of calculations. Red to Purple is an improvement in mpi_region accuracy at the loan attribute level. com wp content uploads 2018 04 11. 1 National MPI Based Calculations 3_1 3. Table of Contents 1. Kiva has one lever to pull and that lever does not address things like a corrupt state or resolve violent conflicts. 25 people with Kiva capital provided loans per 1 000 people. Severity of Poverty index that tries to take into account both of the above. aggregate shapes into counties make a geodataframe for the regions our points are still kenya set regions to kenya counties commented out for speed sake of me working on my own work in this kernel for i in range 0 len gdf_regions print i is str i at strftime Y m d H M S gmtime gdf_points r_map gdf_points. We ll use this methodology with the aggregate field partner numbers in the loan theme regions input as was done for the existing Sub National methodology. It seems a fair methodology to use this MPI National if MPI has not provided one for a country in their MPI Sub National file. Since the country level aggregates are not great for measuring the problems Kiva is trying to tackle they are best off trying to go regional or local as much as possible. 3 Critique 3 Overall Changes Over TimeMetnioned in the above section is the question of whether rural_percentage has changes tracked over time however it s not the only thing changing. Kenya Analysis 4 4. For those partners that provided loans in multiple countries I would have to do point in polygon analysis and updates for each to fully calculate the numbers correctly. png Kiva is leveraging the MPI in evaluating countries field partners and themes. Do we see any regional changes At the top we can see a significant change we moved 1700 loans from Maputo City 0. read on geospatial data massage regional data aggregate districts into regions used for MPI level in MOZ make a geodataframe for the regions assign regional MPI to regions manual updates due to character or spelling differences Merge dataframes why did this NaN that worked as null turn into a nan that i m forced to treat like a string Get total volume and average MPI Regional Score for each partner loan theme Get a volume weighted average of partners loanthemes. com wp content uploads 2018 04 natreg. gif These look pretty similar with the thought being that the Sub National is an improvement in granularity in understanding the loan themes at a more local level. 043 to the Maputo Province 0. 85 of loans being rural by Partner 23 may be an exaggeration of reality for whatever reason. Here we can see the problem Maputo City is the capital of Mozambique. sum Why should we take the average of MPI when we can dollar or loan count weight it instead Let s try another method where we do so. The reason I find these calculations questionable has to do with the rural_pct. com annalie kivampi LS LTsubnat. Notes On Kiva for Relieving Poverty 2 3. It s 12pm on April 9th and the only contact I had my ticket was asking which kernel it was I only had 1 I am now giving up on rescuing the draft work I had and creating this kernel. It would also be much more time to run this method for significantly more loans. MPI reports data for 8 regions these were provinces in Kenya also dissolved in 2013. 2 Critique 5 Inaccurate Region AssignmentI do not know what methodology went into current Kiva loan mpi_region assignment but the accuracy of assigning loans to the right regions is important when using the regional based Sub National MPI values. within gdf_regions geometry i gdf_points residence_county np. com elliottc kivampi building on this which also includes similar logic for loan themes. The Kenya National Bureau of Statistics provided the 2015 16 Integrated Household Budget Survey KIHBS https www. are field partners actually tracking this Or are these very off the cuff guesses or loosely calculated values for a section or even many of them I assume the field partner is providing them would they have any incentive to goose the number There s so many nice round numbers that I question if many of these are actually accurate real. add philippines consumption2. Does Mozambique have any null rural percentage partners Yes it does. Poverty Gap the poverty gap index depth of poverty provides information on how much poorer the poor people are relative to the poverty line. What is Kiva Kiva is an organization which connects risk tolerant lenders and their capital to people in poor areas with difficulty accessing credit. National MPI methodology seems very skewed when not absent. It includes food poverty overall poverty and a hardcore poverty set of tables at the 47 county level for Kenya. do something with findex 4. com mithrillion kiva challenge coordinates dataset provided by Mithrillion https www. org sites default files mpi. Beluga https www. com product feedback 53008 and I m unsure how to add it myself. The next graph will include include field partners who only lent within Kenya so that a proper comparison between the metrics can be made. 5 Sub National Regional Reassignment and Scoring Loans Weighted Instead of AveragedI think this has to do with this specific bit of code inherited from Annalie s kernel https www. ke launch 201516 kenya integrated household budget survey kihbs reports 2 from which I have uploaded a dataset https www. Kiva Poverty Targeting this kernel in which I will reuse and expand upon previous work particularly from the first kernel. Food Poverty Households individuals whose monthly adult equivalent food consumption expenditure per person is less than KSh 1 954 in rural and peri urban areas and less than KSh 2 551 in core urban areas2. My kernel in edit mode now appears all in one line and I opened a support ticket on April 1st at 12 08am. 1 Critique 4 Inherited National MPI and Mixed Methodology 3_2_1 3. Loans being incorrectly assigned to MPI regions. now let s do loans commented out for speed sake of me working on my own work in this kernel for i in range 0 len gdf_regions print i is str i at strftime Y m d H M S gmtime gdf_points r_map gdf_points. This Sub National level is at the top most administrative regions level for countries. do something with stanford data http sustain. groupby Partner ID. 1 Critique 1 Null Rural PercentagesIs this field populated for a field partner 120 of 302 or nearly 40 of f provided field partners have a null value for rural percentage. just putting this in Kericho to make my life easier The Iteso in Kenya numbering about 578 000 live mainly in Busia county. Also all loans are not equally helpful or impactful it was amusing to find in Tim W s Kernel https www. Year 2 10 loans and 90 rural. 4 Sub National Regional Reassignment and Scoring Loans 3_2_4 3. read_csv prettier graphs need dis too for da youtube memes let s me iterate stuff to work with dates looks cool man read some files. I have several calls to action in it and some interesting views and exploration of some outliers in data of interest. Here it is for Mozambique. ", "id": "doyouevendata/kiva-poverty-targeting", "size": "23536", "language": "python", "html_url": "https://www.kaggle.com/code/doyouevendata/kiva-poverty-targeting", "git_url": "https://www.kaggle.com/code/doyouevendata/kiva-poverty-targeting", "script": "geopandas gmtime HTML # for da youtube memes plotly.offline Point shapely.ops ones seaborn numpy plotly.graph_objs time strftime datetime # to work with dates ceil plotly.tools matplotlib.pyplot numpy.linalg pandas cascaded_union log10 Polygon fuzzywuzzy inv shapely.geometry process IPython.display datetime ", "entities": "(('store', 'own toilet'), 'be') (('loan amended scores', 'partners loanthemes'), 'amend') (('National MPI Based 1 CalculationsHere', 'Mozambique field partner calculations'), 's') (('Kiva', 'regions'), 'know') (('Unfortunately we', 'null'), 'lose') (('These', 'partner'), 'produce') (('mustard color', 'regional MPI'), 'take') (('really Everything', 'Maputo actually Province'), 'be') (('we', 'MPI regional level'), 'be') (('com annalie kivampi', 'National MPI'), 'calculate') (('calculations', 'rural_pct'), 'have') (('cool man', 'files'), 'need') (('argue', 'step'), 'be') (('len gdf_regions 0 i', 'str strftime Y m d H M S'), 'make') (('we', 'Maputo City'), 'see') (('Rural areas', 'urban ones'), 'have') (('lever', 'violent conflicts'), 'have') (('many partners', 'simply National based calculation'), 'hide') (('This', 'ideal available data'), 'look') (('which', '0'), 'associate') (('I', 'how it'), 'feedback') (('I', 'interest'), 'have') (('that', 'predetermined threshold'), 'rate') (('first s', 'loan region'), 'prove') (('len gdf_regions 0 i', 'str strftime Y m d H M S'), 'let') (('that', 'most impoverished places'), 'seem') (('it', 'percentage null rural partners'), 'have') (('That', 'MPI metric'), 'go') (('food consumption monthly adult equivalent expenditure', '2 551 core urban areas2'), 'be') (('it', 'polygon'), 'have') (('png Kiva', 'countries field partners'), 'leverage') (('state policies', 'aid various situations'), 'be') (('I', 'particularly first kernel'), 'Targeting') (('this', '3 3 smooths over fact'), 'KDE') (('we', 'situation'), '1') (('which', 'wikipedia https'), 'have') (('It', 'significantly more loans'), 'be') (('Purple', 'funded_amount weighting'), 'be') (('s', 'Kenya'), 'let') (('that', 'above'), 'index') (('Kiva', 'National MPI'), 'for') (('it', 'story'), 'replace') (('Thus they', 'most accurate data'), 'be') (('Now we', '210 scene'), 'pick') (('mutliple people', 'stereo 600 1200 systems'), 'notebook') (('Kenya FGT 2 AnalysisAs', 'borrowers situations'), 'note') (('latter', 'own capital'), 'use') (('Nampula others', 'Zambézia'), 'stay') (('This', 'kickin stereo'), 'be') (('It', 'application time field partner level attribute'), 'track') (('consumption monthly adult equivalent total expenditure', '5 core urban areas3'), 'be') (('Kenya AnalysisKenya', 'absolute numbers'), 'have') (('s', 'metric'), 'be') (('visually we', 'map'), 'calculate') (('We', 'instead just 2'), 'have') (('Sub National', 'more local level'), 'gif') (('m', 'partners loanthemes'), 'dataframe') (('Sub National', 'https following www'), 'result') (('original Kernel', 'additional uploaded loan set'), 'doyouevendata') (('Foster Greer Thorbecke FGT', 'https'), 'use') (('23 it', 'loan_theme_regions file'), 'note') (('I', 'differences'), 'post') (('I', 'Exploratory Data Analysis now initial kernel'), 'exploration') (('Sub National level', 'countries'), 'be') (('MPI', 'MPI Sub National file'), 'seem') (('big difference', '85'), 'be') (('Furthermore it', 'three levels'), 'provide') (('who', 'much higher rates'), 'be') (('I', 'https dataset www'), 'ke') (('field partner', 'funds'), 'argue') (('s', 'it'), 'let') (('reason', 'case'), 'be') (('they', 'problems'), 'be') (('I', 'work'), 'look') (('Red', 'loan attribute level'), 'be') (('We', 'Sub National existing methodology'), 'use') (('it', 'only 0'), '43635') (('total volume', 'partners loanthemes'), 'where') (('where we', 'MPI National'), 'loan') (('field partners', 'graph'), 'omit') (('simply it', 'rural areas'), 'score') (('First s', 'current methodology'), 'let') (('values', 'most part'), 'appear') (('which', 'loan themes'), 'build') (('com doyouevendata kiva exploration', 'nation state level https www'), 'be') (('Multi Dimensional Poverty Index MPI MPI', 'area'), 'be') (('Iteso', 'Busia mainly county'), 'put') (('com gaborfodor', 'even more loans'), 'have') (('I', '12 08am'), 'appear') (('Loans', 'market interest rates'), 'crowdsource') (('i gdf_points', 'gdf_regions geometry'), 'within') (('National which', 'MPI rural percentage'), 'be') (('markets', 'people'), 'come') (('Kenya National Bureau', 'Integrated Household Budget Survey KIHBS https 2015 16 www'), 'provide') (('their', 'low when visually data'), 'be') (('I', 'next graph'), 'of') (('however it', 'time'), 'be') (('Kiva field partners', 'most poverty'), 'tell') (('we', 'quite significant changes'), 'see') (('that', 'geospatial objects'), 'go') (('bit clearly poorest part', 'field partner'), 's') (('region', 'simply calculations'), 'believe') (('Sub National Regional 5 Reassignment', 'Loans'), 'weight') (('this', 'kernel https www'), 'weight') (('district', 'Kericho County'), 'weight') (('location', 'geopandas'), 'determine') (('MPI here rural', 'pretty 0'), 'be') (('it', 'Sub National file'), 's') (('it', 'likely much better code'), 'be') (('field partner loans', 'Kiva Challenge above dataset'), 'plot') (('We', 'high aggregate level'), 'go') (('when we', 'loan indivial themes'), 'think') (('significant mixing', 'pretty soft appearing field partner rural percentages'), 'seem') (('I', 'available 2016'), 'seem') (('Maputo City', 'Mozambique'), 'see') (('poverty county overall data', 'poverty county kenya overall data'), 'where') (('how much poor people', 'poverty line'), 'provide') (('safer route', 'Section'), 'expect') (('us', 'differences'), 'think') (('It', 'Sub National level'), 'provide') (('better it', 'field partners'), 'be') (('each', 'fully numbers'), 'have') (('these', 'also 2013'), 'datum') (('we', 'what'), 'let') (('field partners', 'peer analysis'), 'drop') (('now how methods', '1'), 'produce') (('many', 'these'), 'track') (('proper comparison', 'metrics'), 'include') (('m', 'partners loanthemes'), 'make') (('85', 'reason'), 'be') (('we', 'loans'), 'run') (('also Kiva', 'miracles'), 'be') (('However they', 'million residents'), 'note') (('where we', 'method'), 'take') (('MPI here how Score', 'serious note'), 'be') (('how Kiva', 'relief'), 'be') (('lot', 'decades'), 'be') (('accuracy', 'Sub National MPI when regional based values'), 'know') (('borrower', 'loan'), 'pay') (('equally it', 'Kernel https Tim W www'), 'be') (('we', 'points'), 'be') (('Machava', 'province'), 'appear') (('We', 'MPI'), 'need') (('Nyeri', 'highest value'), 'result') (('25 people', '1 000 people'), 'provide') (('Loans', 'MPI incorrectly regions'), 'assign') (('Merge Sub national dataframes', 'partners loanthemes'), 'compute') (('However countries', 'region level data'), 'have') (('I', 'kernel'), 's') (('doesn t', 'properly it'), 'seem') (('468', '0'), 'look') (('which', 'credit'), 'be') (('Null Rural 1 Critique 1 field', 'rural percentage'), 'PercentagesIs') (('Many loans', '486 much more impoverished areas'), 'have') (('who', 'market fair rates'), 'be') (('It', 'Kenya'), 'include') (('located amended calculations', 'Kiva challenge set'), 'do') (('amended red', 'accuracy'), 'believe') (('how well it', 'field partners'), 'snapshot') (('I', 'Kiva Challenge Loan Location Coordinates https www'), 'go') ", "extra": "['organization', 'test']"}