{"name": "large scale anisotropy ", "full_name": " h1 Large scale anisotropy study of data from the Pierre Auger Observatory h2 Loading the dataset h2 Healpy coordinates h2 Count map h2 Exposure map h2 Smoothed count and exposure maps h2 Smoothed flux and significance maps h2 Rayleigh analysis in right ascension ", "stargazers_count": 0, "forks_count": 0, "description": "It should be noted that along this limit about half of the smoothing disk is filled with events or with a non zero exposure. csv which contains among many pieces of information the energy the Galactic equatorial coordinates of each event and the value of the exposure at the arrival time of the event. HEALPix uses classical spherical coordinates theta phi that are directly linked to Galactic coordinates l phi_ rm G b 90 circ theta_ rm G where the Galactic Center l 0 circ b 0 circ is at the origin or to equatorial coordinates alpha phi_ E 180 circ delta 90 circ theta_ rm E where alpha 180 circ delta 0 circ is at the origin. This jupyter notebook loads the data released by the Pierre Auger Collaboration and displays on the sphere the arrival directions of events above a threshold energy E E_ rm min. To avoid divisions by zero pixels above the maximum declination are discarded when displaying the flux map. The function LoadShapedData loads the arrival directions of events above an energy threshold E_ rm min and returns a shaped dataset stored in a single Pandas DataFrame. install the uploaded version of healpy 1. We load below the dataset. Local significances are determined with the LiMa method Li Ma Astrophysical Journal Vol. The released events have been selected below a zenith angle 60 circ and above an energy E 2. A top hat smoothing with a 45 radius is used here as in The Pierre Auger Collaboration Science 357 6357 1266 https science. 07321 small non uniformities in the exposure of the array as a function of right ascension and the tilt of the array towards the south east are not accounted for. org abs astro ph 0004016 and depends on declination in equatorial coordinates. Note that this simple propagation of uncertainties fails for values of a_ alpha and b_ alpha that are compatible with zero. For the sake of simplicity we adopt a simple propagation of the uncertainties which yields sigma_ r_ alpha sqrt frac 2 N and sigma_ alpha_0 frac 1 r_ alpha sqrt frac 2 N. org is used here to switch from equatorial coordinates to Galactic coordinates when needed. The significance of an excess or lack of events in a given region with respect to the rest of the sky is estimated as in Biteau J. The probability that an amplitude larger than r_ alpha arises from isotropy can be computed as P r_ alpha exp Nr_ alpha 2 4. With only events up to zenith angles of 60 and 10 of the full dataset neither the Rayleigh analysis nor the chi 2 test yield any significant deviation from isotropy. jpg attachment PierreAugerObservatoryLogo. org content 357 6357 1266 https arxiv. io is used to bin the data on the celestial sphere. The uncertainties on the parameters are extracted from the diagonal terms of the covariance matrix. If galactic coordinates get the declination value for a given l b Compute the exposure_map for each pixel regarding its declination. The validity of the smoothing is limited at large declinations delta 24 for a maximum zenith angle of 60 above which the exposure is close to zero. It should be noted that an alternative convention could consist in estimating the flux as sum_ rm pix in cal R N_ rm pix omega_ rm pix. Such local significances do not account for the scan of direction of the center of the test region. Smoothed flux and significance mapsThe flux map is obtained here as the ratio of the smoothed count and exposure maps resulting in a flux estimate Phi_ cal R sum_ rm pix in cal R N_ rm pix sum_ rm pix in cal R omega_ rm pix where N_ rm pix is the number of events in a given pixel and omega_ rm pix the associated exposure over a region cal R defined as a disk of used defined radius. A Rayleigh analysis in right ascension is performed whose results can be compared with those published in The Pierre Auger Collaboration 2017 Science 357 6357 1266 https science. 5 EeV for which the full efficiency of the surface detector is reached. 07321 with only 10 of the data one mostly observes fluctuations due to the limited statistics. A full marginalization should be performed as in the above mentioned publication to obtain refined uncertainties. 0 disable astropy internet download of leap second file this prevents astropy from downloading the latest leap second file something impossible in this kaggle version of the notebook without internet connection kaggle specific linking dataset to augeropendata directory Data analysis Create spherical map Manage convert astro coordinates Tools for Rayleigh analysis Plotting Data loading encapsulated to make it less installation and OS dependant Load data Safeguard select only events above Eth 2. The flux map appears to differ from the one published in The Pierre Auger Collaboration 2017 Science 357 6357 1266 https science. You can run it by clicking on Copy and Edit in the top right corner. We adopt the first convention for the sake of simplicity. We select the relevant columns for the anisotropy analysis and print out the characteristics of one random event in the dataset. gov toolbox tb_pixelcoords. The function PlotHPmap displays using matplotlib the map in the chosen coordinate system as illustrated below. For a single pixel the significance is given by small S sqrt 2 times sqrt N_ rm on log left frac 1 alpha alpha big frac N_ rm on N_ rm on N_ rm off big right N_ rm off log left 1 alpha big frac N_ rm off N_ rm on N_ rm off big right times rm sign rm XS where N_ rm on corresponds to the number of events counted in the region of interest ON region N_ rm off corresponds to the number of background events counted in the rest of the sky OFF region alpha is the ratio of the exposures of the ON and OFF regions and where rm XS N_ rm on alpha times N_ rm off is the number of events in excess in the ON region with respect to the background. 5 EeV where full efficiency is reached for zenith angles 60 EeV Example print the energy and the galactic coordinates of a randomly selected event If equatorial coordinates If equatorial coordinates l π projected to 0 2 π Coordinate conversion returns phi theta Event selection above Emin Pixel index for each events of coordinates theta phi Count map of parameter nside npix corresponds to the number of pixel associated to a NSIDE healpy map Transform healpix map into matplotlib map grid_map grid size for matplotlib Define the figure width of the figure Set the size of the other fonts minimum and maximum values along the z scale colorbar Plot the map reverse the longitude axis 1 astronomical convention Plot the labels considering if it is galactic or equatorial coordinates Plot the count map EeV data Emin Maximum zenith angle in the dataset Latitude of the center of the array near Malargüe Argentina Get the healpy coordinates of each pixel Transform the y x values into whether galactic coordinates or whether equatorial coordinates. This is the kaggle version of a Pierre Auger Observatory Open Data notebook. The uncertainties of the Fourier parameters a_ alpha and b_ alpha are analytical and such as sigma_ a_ alpha sigma_ b_ alpha sqrt frac 2 N. We define in the raw code the function HealpyCoordToMap which converts the spherical coordinates used by HEALPix phi theta to Galactic coordinates l b if galCoord True or to equatorial coordinates alpha delta if galCoord False. com auger observatory drt csvfiles. Count mapA HEALPix map is defined by the size of its binning through the parameter NSIDE generally a power of 2 see https lambda. We compare below the Rayleigh approach to a chi 2 difference test where both a cosine modulated and a constant model are fitted to the data binned in right ascension. UHECR 2018 EPJ Web of Conferences 210 01005 https www. jpg Plot the two exposure map Size of figs beam in the spherical harmonics space Parameters of the maps EeV top hat radius in degrees Define title and the color bar title of the smoothed exposure map Plot the two exposure map Size of figs Define title and the color bar title of the smoothed count map Plot the two exposure map Size of figs data above 8 EeV LiMa significance map ensures non negative log terms induced by smoothing ensures non negative log terms induced by smoothing Parameters of the maps EeV top hat radius in degrees Exposure map Count map data above 8 EeV Flux map degrees corresponding to a 60 maximum zenith angle uniform above maximum dec Normalize to the total number of events in the smoothing region alpha Non Noff Significance map Compute the significance map uniform above maximum dec Used to display a symmetric color scale Get the average flux the error by binning in r. Ten percent of the data accumulated by the Pierre Auger Observatory are stored in the file dataSummary. The function LoadCountMap stores arrival directions of events with an energy above a user defined threshold energy E_ mathrm min into a HEALPix map a 1D numpy array. The Rayleigh analysis in right ascension consists in determining the amplitude r_ alpha and phase phi_ alpha of the first harmonic Fourier component as r_ alpha sqrt a_ alpha 2 b_ alpha 2 tan alpha_0 b_ alpha a_ alpha where a_ alpha frac 2 N sum_ i 1 N cos alpha_i and b_ alpha frac 2 N sum_ i 1 N sin alpha_i and where N is the number of events. jpg Large scale anisotropy study of data from the Pierre Auger ObservatoryNotebook released together with the Pierre Auger Observatory Open Data release 2021 DOI 10. Exposure mapThe exposure of the Pierre Auger Observatory surface detector is purely geometric see Sommers P. Note that in order to run this notebook needs to install healpy which will take a few seconds at the beginning. Smoothed count and exposure mapsOne may wish to display smoothed maps to highlight features on a specific angular scale. Both approaches result in consistent estimates away from the border of the field of view of the Observatory. com science article abs pii S0927650500001304 via 3Dihub https arxiv. org articles epjconf abs 2019 15 epjconf_uhecr18_01005 epjconf_uhecr18_01005. Large scale deviations from isotropy as function of right ascension can be further quantified as shown in the following section. Both the energy threshold and the smoothing radius can be changed by the user. PierreAugerObservatoryLogo. Compute the exposure in equatorial coordinates save the figure in a file equatorial. the flux_map Normalize to average value Load the dataset EeV change 180 180 to 0 360 Rayleigh analysis Bin and fit the data Number of bin used Create the figure width of the figure Plot the data. Loading the datasetThe released data can be retrieved from the git directory https gitlab. Rayleigh analysis in right ascensionA Rayleigh analysis in right ascension can be performed to quantify any possible large scale anisotropy of the flux described as Phi Phi_0 times 1 r_ alpha cos alpha alpha_0. Astroparticle Physics 2001 271 https www. The analysis presented here is simplified with respect to that performed in The Pierre Auger Collaboration 2017 Science 357 6357 1266 https science. More information at the Auger open data website. The aim being to highlight possible dipolar features in the flux map the latter is displayed with a diverging color map contrarily to exposure and count maps which are displayed with sequential colormaps. The robustness of such an analysis lies in the constancy of the exposure of the Observatory as a function of right ascension. The inverse function MapToHealpyCoord is also defined. Healpy coordinatesThe healpy package which is based on the C library HEALPix https healpy. tt Astropy https www. ", "id": "augeropendata/large-scale-anisotropy", "size": "9734", "language": "python", "html_url": "https://www.kaggle.com/code/augeropendata/large-scale-anisotropy", "git_url": "https://www.kaggle.com/code/augeropendata/large-scale-anisotropy", "script": "Chi2_Const RA_Binning display LiMaMap LoadExposureMap HealpyCoordToMap FuncCos FitFirstHarmonics rcParams Chi2_Cos Get_ra_dec zipfile Math AugerLoad LoadCountMap MapToHealpyCoord numpy PlotHPmap LoadSmoothedMap healpy scipy.stats astropy.coordinates ZipFile TwoSidedSignificance FuncConst astropy.utils matplotlib.image iers matplotlib.pyplot Rayleigh Latex pandas astropy.units top_hat_beam LoadShapedData scipy.special matplotlib exposure chi2 minimize scipy.optimize erfcinv least_squares curve_fit IPython.display HTML ", "entities": "(('constant model', 'right ascension'), 'compare') (('We', 'dataset'), 'select') (('where N', 'events'), 'consist') (('count which', 'sequential colormaps'), 'display') (('b _ that', 'zero'), 'note') (('top hat', 'Pierre Auger Collaboration here Science'), 'use') (('io', 'celestial sphere'), 'use') (('function LoadCountMap stores arrival directions', 'HEALPix map'), 'array') (('scale Large deviations', 'further following section'), 'quantify') (('exposure', 'file equatorial'), 'compute') (('arises', 'P r _ alpha exp'), 'compute') (('We', 'simplicity'), 'adopt') (('Load data dependant Safeguard', 'Eth'), 'astropy') (('This', 'Pierre Auger Observatory Open Data kaggle notebook'), 'be') (('Argentina', 'galactic coordinates'), 'print') (('Ten percent', 'file'), 'store') (('Such local significances', 'test region'), 'account') (('_ rm 90 circ where alpha', '180 circ 0 circ origin'), 'use') (('Local significances', 'LiMa method'), 'determine') (('approaches', 'Observatory'), 'result') (('about half', 'non zero exposure'), 'note') (('significance', 'Biteau J.'), 'estimate') (('Healpy coordinatesThe healpy which', 'C library'), 'package') (('flux map', 'Pierre Auger Collaboration'), 'appear') (('alternative convention', 'cal R N _ rm pix omega _ rm pix'), 'note') (('galactic coordinates', 'declination'), 'get') (('significance map uniform', 'r.'), 'Plot') (('jupyter', 'threshold energy E E _ rm min'), 'notebook') (('which', 'event'), 'csv') (('Exposure mapThe exposure', 'Pierre Auger Observatory surface detector'), 'be') (('Rayleigh analysis', 'Phi Phi_0 times'), 'perform') (('You', 'top right corner'), 'run') (('exposure', 'zero'), 'limited') (('org', 'Galactic coordinates'), 'use') (('which', 'beginning'), 'note') (('full marginalization', 'refined uncertainties'), 'perform') (('one', 'limited statistics'), '07321') (('_ rm _ rm pix where pix', 'used defined radius'), 'flux') (('Count mapA HEALPix map', 'see https 2 lambda'), 'define') (('released data', 'git directory https gitlab'), 'retrieve') (('tilt', 'south east'), 'account') (('Rayleigh analysis 360 Bin', 'data'), 'Load') (('analysis', 'Pierre Auger Collaboration'), 'simplify') (('robustness', 'right ascension'), 'lie') (('released events', '60 circ energy'), 'select') (('N _ off', 'background'), 'give') (('smoothing radius', 'user'), 'change') (('Smoothed count', 'specific angular scale'), 'wish') (('galCoord', 'coordinates alpha equatorial delta'), 'define') (('scale jpg Large anisotropy study', 'Pierre Auger Observatory Open Data together release'), 'release') (('LoadShapedData', 'Pandas single DataFrame'), 'load') (('full efficiency', 'surface detector'), 'eev') (('sigma _ 2 alpha_0', '_ alpha sqrt 1 r frac'), 'adopt') (('results', 'Pierre Auger Collaboration'), 'perform') (('uncertainties', 'covariance matrix'), 'extract') (('_ alpha', 'b _ sigma _'), 'parameter') ", "extra": "['biopsy of the greater curvature', 'test']"}