{"name": "nlp what the philosopher said ", "full_name": " h1 Introduction h1 A Function Is All you Need h1 Aristortle h1 Berkeley h1 Deleuze h1 Derrida h1 Descartes h1 Fichte h1 Foucault h1 Hegel h1 Heidegger h1 Hume h1 Husserl h1 Kant h1 Keynes h1 Kripke h1 Leibniz h1 Lewis h1 Locke h1 Malebranche h1 Marx h1 Merleau Ponty h1 Moore h1 Plato h1 Popper h1 Quine h1 Ricardo h1 Russell h1 Smith h1 Spinoza ", "stargazers_count": 0, "forks_count": 0, "description": "Fichte https upload. png 225px Bertrand_Russell_transparent_bg. Arguing that transcendental consciousness sets the limits of all possible knowledge Husserl redefined phenomenology as a transcendental idealist philosophy. He also influenced architecture in the form of deconstructivism music art and art criticism. In most of the Anglosphere where analytic philosophy is dominant Derrida s influence is most presently felt in literary studies due to his longstanding interest in language and his association with prominent literary critics from his time at Yale. Husserl s thought profoundly influenced 20th century philosophy and he remains a notable figure in contemporary philosophy and beyond. org wikipedia commons thumb d dc Portrait_of_David_Ricardo_by_Thomas_Phillips. His philosophy of spirit conceptually integrates psychology the state history art religion and philosophy. In this notebook we would like to Introduce you to some of the world reknowned philosophers and to carry out a Sentiment analysis on what they have said. Fichte was also the originator of thesis antithesis synthesis an idea that is often erroneously attributed to Hegel. org wikipedia commons thumb 9 9c Derrida_Dibujo. One of the early thinkers of the Enlightenment and modern biblical criticism including modern conceptions of the self and the universe he came to be considered one of the great rationalists of 17th century philosophy. He laid the foundation for 17th century continental rationalism later advocated by Spinoza and Leibniz and was later opposed by the empiricist school of thought consisting of Hobbes Locke Berkeley and Hume. Although their popularity has fluctuated over the years Plato s works have never been without readers since the time they were written. Quine was a teacher of logic and set theory. Much of his work remains unpublished or exists only as tape recordings and privately circulated manuscripts. While working on adding automatic multiplication and division to Pascal s calculator he was the first to describe a pinwheel calculator in 1685 and invented the Leibniz wheel used in the arithmometer the first mass produced mechanical calculator. Kripke https upload. against him causing him to be effectively expelled and shunned by Jewish society at age 23 including by his own family. Malebranche https upload. Almost all capitalist governments had done so by the end of the two decades following Keynes s death in 1946. Kripke has made influential and original contributions to logic especially modal logic. Alfred North Whitehead once noted the safest general characterization of the European philosophical tradition is that it consists of a series of footnotes to Plato. In 1933 due to racial laws having been born to a Jewish family he was expelled from the library of the University of Freiburg and months later resigned from the Deutsche Akademie. His own most decisive philosophical influences are usually thought to have been along with Socrates the pre Socratics Pythagoras Heraclitus and Parmenides although few of his predecessors works remain extant and much of what we know about these figures today derives from Plato himself. jpg 330px Hegel_by_Schlesinger. jpg Baruch de Spinoza born Baruch Espinosa later as an author and a correspondent Benedictus de Spinoza anglicized to Benedict de Spinoza 24 November 1632 21 February 1677 was a Dutch philosopher of Portuguese Sephardi origin. They also include the books The Web of Belief which advocates a kind of coherentism and Word and Object 1960 which further developed these positions and introduced Quine s famous indeterminacy of translation thesis advocating a behaviorist theory of meaning. One of the 20th century s most influential philosophers of science Popper is known for his rejection of the classical inductivist views on the scientific method in favour of empirical falsification. He was frequently called an atheist by contemporaries although nowhere in his work does Spinoza argue against the existence of God. After obtaining work between 1960 and 1966 at the University of Clermont Ferrand he produced The Birth of the Clinic 1963 and The Order of Things 1966 publications which displayed his increasing involvement with structuralism from which he later distanced himself. In this and other works he developed the concept of division of labour and expounded upon how rational self interest and competition can lead to economic prosperity. Others cite Of Grammatology 1967 Writing and Difference 1967 and Margins of Philosophy 1972. jpg John Maynard Keynes 1st Baron Keynes CB FBA 5 June 1883 21 April 1946 was an English economist whose ideas fundamentally changed the theory and practice of macroeconomics and the economic policies of governments. The so called Neoplatonism of philosophers like Plotinus and Porphyry greatly influenced Christianity through Church Fathers such as Augustine. org wikipedia commons thumb 1 17 Nicolas_Malebranche. jpg 330px Plato_Silanion_Musei_Capitolini_MC1377. png The aspects of Bertrand Russell s views on philosophy cover the changing viewpoints of philosopher and mathematician Bertrand Russell 1872 1970 from his early writings in 1896 until his death in February 1970. jpg Johann Gottlieb Fichte 19 May 1762 29 January 1814 was a German philosopher who became a founding figure of the philosophical movement known as German idealism which developed from the theoretical and ethical writings of Immanuel Kant. Smith wrote two classic works The Theory of Moral Sentiments 1759 and An Inquiry into the Nature and Causes of the Wealth of Nations 1776. Many elements of Descartes s philosophy have precedents in late Aristotelianism the revived Stoicism of the 16th century or in earlier philosophers like Augustine. Most comprehensively in On the Plurality of Worlds Lewis defended modal realism the view that possible worlds exist as concrete entities in logical space and that our world is one among many equally real possible ones. jpg Martin Heidegger 26 September 1889 26 May 1976 was a German philosopher who is widely regarded as one of the most important philosophers of the 20th century. In the opening section of the Passions of the Soul an early modern treatise on emotions Descartes goes so far as to assert that he will write on this topic as if no one had written on these matters before. In philosophy Leibniz is most noted for his optimism i. jpg 330px Frans_Hals_ _Portret_van_Ren C3 A9_Descartes. Recently philosophers and scholars have begun to appreciate Fichte as an important philosopher in his own right due to his original insights into the nature of self consciousness or self awareness. Malebranche is best known for his doctrines of vision in God occasionalism and ontologism. jpg Immanuel Kant 22 April 1724 12 February 1804 was a German philosopher and one of the central Enlightenment thinkers. He also advocated ontological relativity in science known as the Duhem Quine thesis. By the late 1930s leading Western economies had begun adopting Keynes s policy recommendations. Hegel has been seen in the twentieth century as the originator of the thesis antithesis synthesis triad but as an explicit phrase it originated with Johann Gottlieb Fichte. jpg Aristortle was born around 384 B. He determined ontology as absolute logic he assembled all the delimitations of philosophy as presence later remarking that Hegel is thus the last philosopher of the book and the first philosopher of writing indicating the relation of Hegel to post structural thought by stating if there were a definition of Différance it would be precisely the limit the interruption the destruction of the Hegelian dialectical synthesis wherever it operates. org wikipedia commons thumb 7 73 Frans_Hals_ _Portret_van_Ren C3 A9_Descartes. His thought has influenced academics especially those working in communication studies anthropology psychology sociology criminology cultural studies literary theory feminism Marxism and critical theory. Lewis taught briefly at UCLA and then at Princeton University from 1970 until his death. But Lewis is most famous for his work in metaphysics philosophy of language and semantics in which his books On the Plurality of Worlds 1986 and Counterfactuals 1973 are considered classics. Plato was the innovator of the written dialogue and dialectic forms in philosophy. Although he once characterized himself as a pure metaphysician 16 his work has influenced a variety of disciplines across the humanities including philosophy art and literary theory as well as movements such as post structuralism and postmodernism. This led to his famous quip that philosophy of science is philosophy enough. jpg David Hume 26 April 1711 OS 25 August 1776 was a Scottish Enlightenment philosopher historian economist librarian and essayist who is best known today for his highly influential system of philosophical empiricism skepticism and naturalism. Derrida https upload. He regarded himself as showing the way past the impasse between rationalists and empiricists and is widely held to have synthesized both traditions in his thought. jpg Maurice Jean Jacques Merleau Ponty 14 March 1908 3 May 1961 was a French phenomenological philosopher strongly influenced by Edmund Husserl and Martin Heidegger. In 1996 he was awarded the Kyoto Prize in Arts and Philosophy for his outstanding contributions to the progress of philosophy in the 20th century by proposing numerous theories based on keen insights in logic epistemology philosophy of science and philosophy of language. An opponent of philosophical rationalists Hume held that passions rather than reason govern human behaviour famously proclaiming that Reason is and ought only to be the slave of the passions. Since the 1960s Kripke has been a central figure in a number of fields related to mathematical logic modal logic philosophy of language philosophy of mathematics metaphysics epistemology and recursion theory. Moore citing Bernard Williams s criteria for a great thinker ranks Deleuze among the greatest philosophers. As a representative of the seventeenth century tradition of rationalism Leibniz developed as his most prominent accomplishment the ideas of differential and integral calculus independently of Isaac Newton s contemporaneous developments. His most popular works were the two volumes of Capitalism and Schizophrenia Anti Oedipus 1972 and A Thousand Plateaus 1980 both co written with psychoanalyst Félix Guattari. his conclusion that our universe is in a restricted sense the best possible one that God could have created an idea that was often lampooned by others such as Voltaire. org wikipedia commons thumb 4 43 Karl_Popper. Heidegger approaches this question through an analysis of Dasein his term for the specific type of being that humans possess. His most famous contribution is the theory of Forms known by pure reason in which Plato presents a solution to the problem of universals known as Platonism also ambiguously called either Platonic realism or Platonic idealism. Mathematical works have consistently favored Leibniz s notation as the conventional expression of calculus. What is Art For Aristortle has written a manuel for writting great plays named The Poetics. Derrida wrote of Hegel in his work Of Grammatology that he undoubtedly summed up the entire philosophy of the logos. In his Latin and Dutch works he used Latin Benedictus de Spinoza. jpg Willard Van Orman Quine June 25 1908 December 25 2000 was an American philosopher and logician in the analytic tradition recognized as one of the most influential philosophers of the twentieth century. He also refined the binary number system which is the foundation of nearly all digital electronic solid state discrete logic computers including the Von Neumann machine which is the standard design paradigm or computer architecture followed from the second half of the 20th century and into the 21st. jpg Paul Michel Doria Foucault 15 October 1926 25 June 1984 was a French philosopher historian of ideas writer political activist and literary critic. The book contains his rule following argument a paradox for skepticism about meaning. His political philosophy embraced ideas from major democratic political ideologies including socialism social democracy libertarianism classical liberalism and conservatism and attempted to reconcile them. org wikipedia commons thumb a ae Aristotle_Altemps_Inv8575. Smith studied social philosophy at the University of Glasgow and at Balliol College Oxford where he was one of the first students to benefit from scholarships set up by fellow Scot John Snell. In the Netherlands he used the Portuguese name Bento. In 1970 Foucault was admitted to the Collège de France a membership he retained until his death. Hegel s principal achievement was his development of a distinctive articulation of idealism sometimes termed absolute idealism in which the dualisms of for instance mind and nature and subject and object are overcome. org wikipedia commons thumb 8 88 Plato_Silanion_Musei_Capitolini_MC1377. He grew up to be most influencial Philosopher ever and was given nicknames like The Master and The Philosopher Oh forgot to mention he was also the tutor of Alexander The Great. His master slave dialectic has been influential especially in 20th century France. Kripke also gave an original reading of Ludwig Wittgenstein known as Kripkenstein in his Wittgenstein on Rules and Private Language. While serving as overseer of the Wolfenbüttel library in Germany he devised a cataloging system that would serve as a guide for many of Europe s largest libraries. He filled the Edgar Pierce Chair of Philosophy at Harvard from 1956 to 1978. org wikipedia commons thumb 8 8d Edmund_Husserl_1910s. His books were later added to the Catholic Church s Index of Forbidden Books. Kant s comprehensive and systematic works in epistemology metaphysics ethics and aesthetics have made him one of the most influential figures in modern Western philosophy. Heidegger https upload. Born in Trier Germany Marx studied law and philosophy at university. In the capitalist mode of production this manifests itself in the conflict between the ruling classes known as the bourgeoisie that control the means of production and the working classes known as the proletariat that enable these means by selling their labour power in return for wages. Hegel s work has been considered the completion of philosophy by multiple of the most influential thinkers in existentialism post structuralism and twentieth century theology. org wikipedia commons thumb 6 64 Heidegger_2_ 281960 29. Foucault s theories primarily address the relationship between power and knowledge and how they are used as a form of social control through societal institutions. Following an illness he died in Freiburg in 1938. Foucault subsequently published The Archaeology of Knowledge 1969. The work opposed Descartes philosophy of mind body dualism and earned Spinoza recognition as one of Western philosophy s most important thinkers. org wikipedia commons thumb 5 5d John_Smibert_ _Bishop_George_Berkeley_ _Google_Art_Project. In his later life he took a tutoring position that allowed him to travel throughout Europe where he met other intellectual leaders of his day. His contributions to classical republicanism and liberal theory are reflected in the United States Declaration of Independence. jpg 330px Aristotle_Altemps_Inv8575. Hume also denied that humans have an actual conception of the self positing that we experience only a bundle of sensations and that the self is nothing more than this bundle of causally connected perceptions. It is through this engagement that his writings became influential in the project of naturalizing phenomenology in which phenomenologists use the results of psychology and cognitive science. The reason for this approach is that we already have a pre ontological understanding of being that shapes how we experience the world. In his mature work he sought to develop a systematic foundational science based on the so called phenomenological reduction. org wikipedia commons thumb b b8 John_Locke. Berkeley is also known for his critique of abstraction an important premise in his argument for immaterialism. jpg 330px Adam_Smith_The_Muir_portrait. His metaphysical treatise Difference and Repetition 1968 is considered by many scholars to be his magnum opus. Beginning with A Treatise of Human Nature 1739 40 Hume strove to create a naturalistic science of man that examined the psychological basis of human nature. org wikipedia commons thumb f f2 Kant_gemaelde_3. We never actually perceive that one event causes another but only experience the constant conjunction of events. Merleau Ponty https upload. The nature of Kant s religious views continues to be the subject of scholarly dispute with viewpoints ranging from the impression that he shifted from an early defense of an ontological argument for the existence of God to a principled agnosticism to more critical treatments epitomized by Schopenhauer who criticized the imperative form of Kantian ethics as theological morals and the Mosaic Decalogue in disguise and Nietzsche who claimed that Kant had theologian blood and was merely a sophisticated apologist for traditional Christian faith. His best known philosophical statement is cogito ergo sum I think therefore I am French Je pense donc je suis found in Discourse on the Method 1637 in French and Latin and Principles of Philosophy 1644 in Latin. Keynes advocated the use of fiscal and monetary policies to mitigate the adverse effects of economic recessions and depressions. Smith was controversial in his own day and his general approach and writing style were often satirised by writers such as Horace Walpole. Lewis https upload. Although he was a proponent of scientific racism for much of his career Kant s views on race changed significantly in the last decade of his life and he ultimately rejected racial hierarchies and European colonialism in Perpetual Peace A Philosophical Sketch 1795. jpg 330px Painting_of_David_Hume. The class I believe is self explanatory. This theory denies the existence of material substance and instead contends that familiar objects like tables and chairs are ideas perceived by the minds and as a result cannot exist without being perceived. He was the lead editor of Les Temps modernes the leftist magazine he established with Jean Paul Sartre and Simone de Beauvoir in 1945. jpg Edmund Gustav Albrecht Husserl April 1859 27 April 1938 was a German philosopher who established the school of phenomenology. The articulation of the primacy of embodiment led him away from phenomenology towards what he was to call indirect ontology or the ontology of the flesh of the world la chair du monde seen in his final and incomplete work The Visible and Invisible and his last published essay Eye and Mind. com watch v csIW4W_DYX4 Berkeley https upload. Born in Poitiers France into an upper middle class family Foucault was educated at the Lycée Henri IV at the École Normale Supérieure where he developed an interest in philosophy and came under the influence of his tutors Jean Hyppolite and Louis Althusser and at the University of Paris Sorbonne where he earned degrees in philosophy and psychology. There are 4 great questions which Aristortle has answered What makes people Happy Hmm So According to Aristortle a person his happy if he she posses the following virtues Courage Temperance Liberality Magnificence Pride Patience Truthfulness Witiness Friendliness Modesty. After several years as a cultural diplomat abroad he returned to France and published his first major book The History of Madness 1961. Though often cited as a structuralist and postmodernist Foucault rejected these labels. Marx s political and philosophical thought had enormous influence on subsequent intellectual economic and political history. JPG Saul Aaron Kripke born November 13 1940 is an American philosopher and logician in the analytic tradition. org wikipedia commons thumb 9 98 Maurice_Merleau Ponty. Quine was famous for his position that first order logic is the only kind worthy of the name and developed his own system of mathematics and set theory known as New Foundations. Considered one of the first of the British empiricists following the tradition of Sir Francis Bacon Locke is equally important to social contract theory. Spinoza s magnum opus the Ethics was published posthumously in the year of his death. He won the first Schock Prize in Logic and Philosophy in 1993 for his systematical and penetrating discussions of how learning of language and communication are based on socially available evidence and of the consequences of this for theories on knowledge and linguistic meaning. Plato is also considered the founder of Western political philosophy. From 1930 until his death 70 years later Quine was continually affiliated with Harvard University in one way or another first as a student then as a professor. org wikipedia commons thumb d d4 Kripke. There is no complete gathering of the writings of Leibniz translated into English. In his doctrine of transcendental idealism Kant argued that space and time are mere forms of intuition which structure all experience and therefore that while things in themselves exist and contribute to experience they are nonetheless distinct from the objects of experience. Husserl studied mathematics taught by Karl Weierstrass and Leo Königsberger and philosophy taught by Franz Brentano and Carl Stumpf. He was elected a fellow of the British Academy in 1918. jpg René Descartes 31 March 1596 11 February 1650 was a French born philosopher mathematician and scientist who spent a large portion of his working life in the Dutch Republic initially serving the Dutch States Army of Maurice of Nassau Prince of Orange and the Stadtholder of the United Provinces. How can ideas cut through a Busy World Like most of us Aristortle also wondered why the Best idea not always wins the argument He studied his surroundings and came up with the art of Rhetoric where he emphasied on the ideas of making a discussion funny because people has short attention spans being empathetic toward other person and being persuasive. org wikipedia commons thumb 8 8d Christoph_Bernhard_Francke_ _Bildnis_des_Philosophen_Leibniz_ 28ca. According to Popper a theory in the empirical sciences can never be proven but it can be falsified meaning that it can and should be scrutinised with decisive experiments. Smith https upload. In his earlier work Merleau Ponty supported Soviet communism while remaining critical of Soviet policies and Marxism in general adopting a skeptical stance which he termed Western Marxism. Now we are writting a class for text Summarization copying this class from one of my Previous Notebooks If interested you can check it here https www. jpg Gilles Deleuze 18 January 1925 4 November 1995 was a French philosopher who from the early 1950s until his death in 1995 wrote on philosophy literature film and fine art. Many intellectuals labour unions artists and political parties worldwide have been influenced by Marx s work with many modifying or adapting his ideas. By these literary devices Aristorle wants to bring home the notion that tragedy can befall on anyone and in such moments we must be kind and compasenate toward others. He also became active in a number of left wing groups involved in campaigns against racism and human rights abuses and for penal reform. Of special importance is his concept of spirit Geist sometimes also translated as mind as the historical manifestation of the logical concept and the sublation Aufhebung integration without elimination or reduction of seemingly contradictory or opposing factors examples include the apparent opposition between necessity and freedom and between immanence and transcendence. His endorsement of the Soviet show trials and prison camps was published as Humanism and Terror in 1947 though he would later denounce Soviet terror as being counter to the purportedly humanist aims of the revolution. He is closely associated with Australia whose philosophical community he visited almost annually for more than 30 years. jpg 330px Karl_Marx_001. His work retains major academic influence throughout the US continental Europe South America and all other countries where continental philosophy has been predominant particularly in debates around ontology epistemology especially concerning social sciences ethics aesthetics hermeneutics and the philosophy of language. Kant published other important works on ethics religion law aesthetics astronomy and history during his lifetime. Marx is typically cited as one of the principal architects of modern social science. His works on the logic and semantics of counterfactual conditionals are broadly used by philosophers and linguists along with a competing account from Robert Stalnaker together the Stalnaker Lewis theory of counterfactuals has become perhaps the most pervasive and influential account of its type in the philosophical and linguistic literature. Paul Tillich wrote that the historical dialectical thought of Hegel has influenced world history more profoundly than any other structural analysis. com thumbor 960x0 https 3A 2F 2Fspecials images. Leibniz Spinoza and Descartes were all well versed in mathematics as well as philosophy and Descartes and Leibniz contributed greatly to science as well. Like Descartes and Kant before him Fichte was motivated by the problem of subjectivity and consciousness. Keynes s influence started to wane in the 1970s partly as a result of the stagflation that plagued the Anglo American economies during that decade and partly because of criticism of Keynesian policies by Milton Friedman and other monetarists 6 who disputed the ability of government to favourably regulate the business cycle with fiscal policy. Hume argued that inductive reasoning and belief in causality cannot be justified rationally instead they result from custom and mental habit. Foucault later published Discipline and Punish 1975 and The History of Sexuality 1976 in which he developed archaeological and genealogical methods which emphasized the role that power plays in society. jpg David Ricardo 18 April 1772 11 September 1823 was a British political economist one of the most influential of the classical economists along with Thomas Malthus Adam Smith and James Mill. jpg 330px Maurice_Merleau Ponty. Like the other major phenomenologists Merleau Ponty expressed his philosophical insights in writings on art literature linguistics and politics. jpg 330px Karl_Popper. Heidegger in various places further stated Hegel s thinking to be the most powerful thinking of modern times. org wikipedia commons 0 04 Keynes_1933. Beyond his religious views Kant has also been criticized for the racism presented in some of his lesser known papers such as On the Use of Teleological Principles in Philosophy and On the Different Races of Man. His writings influenced Voltaire and Jean Jacques Rousseau and many Scottish Enlightenment thinkers as well as the American Revolutionaries. It introduces the concept of names as rigid designators true in every possible world as contrasted with descriptions. Leibniz also contributed to the field of library science. A humanist he served as President of the British Ethical Union now known as Humanists UK from 1935 to 1936. jpg 3Ffit 3Dscale Introduction Let us start by asking ourself a Simple question Who is a Philosopher and what is Philosophy A Philosopher is some who practices Philosopy. What are Friends for According to Aristortle there are 3 kinds of friendships The one where each individual is seeking fun or him herself. In his early work he elaborated critiques of historicism and of psychologism in logic based on analyses of intentionality. Some critics consider Speech and Phenomena 1967 to be his most important work. In most of these fields he is considered among the most important figures of recent decades. Marx actively pressed for its implementation arguing that the working class should carry out organised proletarian revolutionary action to topple capitalism and bring about socio economic emancipation. Hegel has influenced many thinkers and writers whose own positions vary widely. Heidegger s later work includes criticism of the view common in the Western tradition that all of nature is a standing reserve on call as if it were a part of industrial inventory. The term Philosophy is derived from the Ancient Greek word Philosophos meaning Lover of Wisdom The coining of this term may be attributed to the great Greek Philosopher Pythagoras in 6th centyary B. In it he developed his theory of experience to answer the question of whether synthetic a priori knowledge is possible which would in turn make it possible to determine the limits of metaphysical inquiry. He postulated that at birth the mind was a blank slate or tabula rasa. Georg Wilhelm Friedrich Hegel said The fact is that Spinoza is made a testing point in modern philosophy so that it may really be said You are either a Spinozist or not a philosopher at all. A 1970 Princeton lecture series published in book form in 1980 as Naming and Necessity is considered one of the most important philosophical works of the 20th century. He received the 2001 Schock Prize in Logic and Philosophy. He wrote in several languages primarily in Latin French and German but also in English Italian and Dutch. In his works he sought to synthesize the thought of St. jpg George Berkeley 12 March 1685 14 January 1753 known as Bishop Berkeley Bishop of Cloyne of the Anglican Church of Ireland was an Anglo Irish philosopher whose primary achievement was the advancement of a theory he called immaterialism later referred to as subjective idealism by others. Spinoza s given name which means Blessed varies among different languages. In it Spinoza wrote the last indisputable Latin masterpiece and one in which the refined conceptions of medieval philosophy are finally turned against themselves and destroyed entirely. Hume https upload. He is considered one of the fundamental figures of modern Western philosophy with his influence extending to the entire range of contemporary philosophical issues from aesthetics to ontology to politics both in the analytic and continental tradition. He turned down rewards and honours throughout his life including prestigious teaching positions. E in the Greek kingdom of Macedonia where his father was the royal doctor. During his career Derrida published more than 40 books together with hundreds of essays and public presentations. org wikipedia commons thumb c ce Hegel_by_Schlesinger. incontestable that Hegel faithful to tradition sees the matter of thinking in beings as such and as a whole in the movement of Being from its emptiness to its developed fullness. In political discourse he is known for his vigorous defence of liberal democracy and the principles of social criticism that he believed made a flourishing open society possible. He maintained an early commitment to naturalistic explanations of moral phenomena and is usually taken to have first clearly expounded the is ought problem or the idea that a statement of fact alone can never give rise to a normative conclusion of what ought to be done. Moore https upload. He married Jenny von Westphalen in 1843. Smith laid the foundations of classical free market economic theory. org wikipedia en a ad David K. Leibniz https upload. Deleuze https upload. org wikipedia commons thumb a a6 Bertrand_Russell_transparent_bg. jpg 330px John_Smibert_ _Bishop_George_Berkeley_ _Google_Art_Project. Kant https upload. Locke s theory of mind is often cited as the origin of modern conceptions of identity and the self figuring prominently in the work of later philosophers such as Jean Jacques Rousseau David Hume and Immanuel Kant. jpg 330px Portrait_of_David_Ricardo_by_Thomas_Phillips. jpg 330px Derrida_Dibujo. Employing a critical approach known as historical materialism Marx predicted that capitalism produced internal tensions like previous socio economic systems and that those would lead to its self destruction and replacement by a new system known as the socialist mode of production. This problem of induction means that to draw any causal inferences from past experience it is necessary to presuppose that the future will resemble the past a presupposition which cannot itself be grounded in prior experience. He died at the age of 44 in 1677 from a lung illness perhaps tuberculosis or silicosis exacerbated by the inhalation of fine glass dust while grinding lenses. He detailed these ideas in his magnum opus The General Theory of Employment Interest and Money published in 1936. Due to his political publications Marx became stateless and lived in exile with his wife and children in London for decades where he continued to develop his thought in collaboration with German thinker Friedrich Engels and publish his writings researching in the reading room of the British Museum. Immanuel Kant credited Hume as the inspiration who had awakened him from his dogmatic slumbers. Such is one example of Locke s belief in empiricism. jpg Gottfried Wilhelm von Leibniz 1 July 1646 14 November 1716 was a prominent German polymath and one of the most important logicians mathematicians and natural philosophers of the Enlightenment. Augustine and Descartes in order to demonstrate the active role of God in every aspect of the world. Keynesian economics provided the theoretical underpinning for economic policies undertaken in response to the financial crisis of 2007 2008 by President Barack Obama of the United States Prime Minister Gordon Brown of the United Kingdom and other heads of governments. jpg Georg Wilhelm Friedrich Hegel 27 August 1770 14 November 1831 was a German philosopher and the most important figure in German idealism. In his natural philosophy he differed from the schools on two major points first he rejected the splitting of corporeal substance into matter and form second he rejected any appeal to final ends divine or natural in explaining natural phenomena. In Being and Time 1927 Heidegger addresses the question of the meaning of being which is concerned with what it is that makes beings intelligible as beings. He was the only major phenomenologist of the first half of the twentieth century to engage extensively with the sciences and especially with Gestalt psychology. Ricardo https upload. jpg 330px Kant_gemaelde_3. jpg 330px Heidegger_2_ 281960 29. Moore was an English philosopher. Hume was also a sentimentalist who held that ethics are based on emotion or sentiment rather than abstract moral principle. His best known titles are the 1848 pamphlet The Communist Manifesto and the three volume Das Kapital 1867 1883. Fichte also wrote works of political philosophy he has a reputation as one of the fathers of German nationalism. Particularly in his later writings Derrida addressed ethical and political themes in his work. The constitution of meaning in human experience was his main interest and he wrote on perception art politics religion psychology psychoanalysis language nature and history. Kant was an exponent of the idea that perpetual peace could be secured through universal democracy and international cooperation and that perhaps this could be the culminating stage of world history. However the advent of the global financial crisis of 2007 2008 sparked a resurgence in Keynesian thought. These include the Universal Natural History 1755 the Critique of Practical Reason 1788 the Critique of Judgment 1790 Religion within the Bounds of Bare Reason 1793 and the Metaphysics of Morals 1797. Spinoza lived an outwardly simple life as an optical lens grinder collaborating on microscope and telescope lens designs with Constantijn and Christiaan Huygens. His principal contribution is a semantics for modal logic involving possible worlds now called Kripke semantics. org wikipedia commons 8 8d Johann_Gottlieb_Fichte. Inspired by the groundbreaking ideas of René Descartes Spinoza became a leading philosophical figure of the Dutch Golden Age. In his work Systematic Theology theologian Paul Tillich referred to Hegel s work as perfect essentialism later writing essentialism was in Hegel s system fulfilled. He has introduced the ideas of PeriPeteia or sudden change in fornute and Anagnoresis or a sudden moment of dramatic revelation. Kant drew a parallel to the Copernican revolution in his proposal that the objects of the senses must conform to our spatial and temporal forms of intuition and that we can consequently have a priori cognition of the objects of the senses. Marx s critical theories about society economics and politics collectively understood as Marxism hold that human societies develop through class conflict. He was with Bertrand Russell Ludwig Wittgenstein and before them Gottlob Frege one of the founders of analytic philosophy. Descartes has often been called the father of modern philosophy and is largely seen as responsible for the increased attention given to epistemology in the 17th century. The one where everyone wants a strategic advantage from one another. Martin Heidegger observed in his 1969 work Identity and Difference and in his personal Black Notebooks that Hegel s system in an important respect consummates western philosophy by completing the idea of the logos the self grounding ground in thinking through the identification of Being and beings which is the theme of logic writing It is. The Wealth of Nations was a precursor to the modern academic discipline of economics. He is also the namesake of Platonic love and the Platonic solids. In his theology he insists on the absolute freedom of God s act of creation. Karl Barth described Hegel as a Protestant Aquinas while Maurice Merleau Ponty wrote that all the great philosophical ideas of the past century the philosophies of Marx and Nietzsche phenomenology German existentialism and psychoanalysis had their beginnings in Hegel. He had a significant influence on the humanities and social sciences including philosophy literature law anthropology historiography applied linguistics sociolinguistics psychoanalysis and political theory. Kant s views continue to have a major influence on contemporary philosophy especially the fields of epistemology ethics political theory and post modern aesthetics. jpg Karl Heinrich Marx FRSA 5 May 1818 14 March 1883 was a German philosopher economist historian sociologist political theorist journalist and socialist revolutionary. jpg Jacques Derrida July 15 1930 October 9 2004 was a French philosopher best known for developing a form of semiotic analysis known as deconstruction which he analyzed in numerous texts and developed in the context of phenomenology. He attempted to explain the relationship between reason and human experience and to move beyond what he believed to be the failures of traditional philosophy and metaphysics. A Function Is All you Need Aristortle https upload. The one which is True Friendship. In an attempt to counter the skepticism he found in the writings of philosopher David Hume he wrote the Critique of Pure Reason 1781 1787 one of his most well known works. This places him with Francis Bacon Thomas Hobbes John Locke and George Berkeley as a British Empiricist. jpg 330px Edmund_Husserl_1910s. In the 17th century Dutch Republic the rise of early modern rationalism as a highly systematic school of philosophy in its own right for the first time in history exerted an immense and profound influence on modern Western thought in general with the birth of two influential rationalistic philosophical systems of Descartes who spent most of his adult life and wrote all his major work in the United Provinces of the Netherlands and Spinoza namely Cartesianism and Spinozism. His metaphysics incorporated seminal contributions to quantified modal logic the development of counterpart theory counterfactual causation and the position called Humean supervenience. He argued that aggregate demand total spending in the economy determined the overall level of economic activity and that inadequate aggregate demand could lead to prolonged periods of high unemployment. Unlike the work of nearly all of his contemporaries Plato s entire body of work is believed to have survived intact for over 2 400 years. A 2009 poll conducted among analytic philosophers named Quine as the fifth most important philosopher of the past two centuries. Kripke is also partly responsible for the revival of metaphysics after the decline of logical positivism claiming necessity is a metaphysical notion distinct from the epistemic notion of a priori and that there are necessary truths that are known a posteriori such as that water is H2O. org wikipedia en d de Gilles_Deleuze. Along with Russell he led the turn away from idealism in British philosophy and became well known for his advocacy of common sense concepts his contributions to ethics epistemology and metaphysics and his exceptional personality and moral character. Merleau Ponty emphasized the body as the primary site of knowing the world a corrective to the long philosophical tradition of placing consciousness as the source of knowledge and maintained that the body and that which it perceived could not be disentangled from each other. org wikipedia commons 7 76 Michel_Foucault_1974_Brasil. He became a well known and influential public figure while his approach to philosophy and the notorious abstruseness of his work made him controversial. An important part of Deleuze s oeuvre is devoted to the reading of other philosophers the Stoics Leibniz Hume Kant Nietzsche and Bergson with particular influence derived from Spinoza. His work in economics laid the basis for much of the current understanding of labour and its relation to capital and subsequent economic thought. importing required libraries loading data Making some essential imports Defining a Class for extracting Summary Function for Printing Corpus Function For calculating sentence score based on computed normalized word Frequencies World Cloud Plotter A Function for Sentiment Analysis Our Main Function making a Corpus and finding sentiments text Cleaning and plotting wordCloud Extractive Text summarization Benchmarks. One of the most notable intellectual figures of the Dutch Golden Age Descartes is also widely regarded as one of the founders of modern philosophy. Refusing to accept the authority of previous philosophers Descartes frequently set his views apart from the philosophers who preceded him. His philosophical accomplishments and moral character prompted Gilles Deleuze to name him the prince of philosophers. jpg Sir Karl Raimund Popper CH FBA FRS 28 July 1902 17 September 1994 was an Austrian British 10 philosopher academic and social commentator. It was the 17th century arch rationalists like Descartes Spinoza and Leibniz who have given the Age of Reason its name and place in history. Russell https upload. From this it follows that the objects of experience are mere appearances and that the nature of things as they are in themselves is consequently unknowable to us. Descartes https upload. Smith obtained a professorship at Glasgow teaching moral philosophy and during this time wrote and published The Theory of Moral Sentiments. Leibniz s contributions to this vast array of subjects were scattered in various learned journals in tens of thousands of letters and in unpublished manuscripts. jpg Nicolas Malebranche Oratory of Jesus August 1638 13 October 1715 was a French Oratorian 1 priest and rationalist philosopher. Kant believed that reason is also the source of morality and that aesthetics arise from a faculty of disinterested judgment. org wikipedia commons b b9 1914_George_Edward_Moore_ 28cropped 29. He was a member of the Cambridge Apostles the intellectual secret society from 1894 to 1901 and chairman of the Cambridge University Moral Sciences Club from 1912 to 1944. Hegel https upload. Husserl https upload. Hume influenced utilitarianism logical positivism the philosophy of science early analytic philosophy cognitive science theology and many other fields and thinkers. Hume s compatibilist theory of free will takes causal determinism as fully compatible with human freedom. He became one of the most prolific inventors in the field of mechanical calculators. There are 30 Philosophers in the given data set so without further delay lets begin. At the core of Merleau Ponty s philosophy is a sustained argument for the foundational role perception plays in understanding the world as well as engaging with the world. Contrary to Cartesian philosophy based on pre existing concepts he maintained that we are born without innate ideas and that knowledge is instead determined only by experience derived from sense perception a concept now known as empiricism. jpg David Kellogg Lewis September 28 1941 October 14 2001 was an American philosopher who is widely regarded as one of the most important philosophers of the 20th century. He is buried in the Christian churchyard of Nieuwe Kerk in The Hague. During the Great Depression of the 1930s Keynes spearheaded a revolution in economic thinking challenging the ideas of neoclassical economics that held that free markets would in the short to medium term automatically provide full employment as long as workers were flexible in their wage demands. reference https www. He is a Distinguished Professor of Philosophy at the Graduate Center of the City University of New York and emeritus professor at Princeton University. Jewish religious authorities issued a herem. Leibniz along with René Descartes and Baruch Spinoza was one of the three great 17th century advocates of rationalism. Leibniz made major contributions to physics and technology and anticipated notions that surfaced much later in philosophy probability theory biology medicine geology psychology linguistics and computer science. org wikipedia commons thumb d d4 Karl_Marx_001. He wanted to put an end to what he saw as an era of futile and speculative theories of human experience while resisting the skepticism of thinkers such as Hume. Spinoza was raised in the Portuguese Jewish community in Amsterdam. jpg John Locke FRS 29 August 1632 28 October 1704 was an English philosopher and physician widely regarded as one of the most influential of Enlightenment thinkers and commonly known as the Father of Liberalism. It also contains Kripke s causal theory of reference disputing the descriptivist theory found in Gottlob Frege s concept of sense and Bertrand Russell s theory of descriptions. He wrote works on philosophy politics law ethics theology history and philology. Demonstrating the ideology of science in his observations whereby something must be capable of being tested repeatedly and that nothing is exempt from being disproved Locke stated that whatever I write as soon as I discover it not to be true my hand shall be the forwardest to throw it into the fire. Foucault https upload. com vanvalkenberg text summarization using spacyThe basic idea behind this algorithm is to find the sentence that has the maximum number of the most commonly used words in the text corpus after removing the stopwords like the is that etc. He is best known for contributions to phenomenology hermeneutics and existentialism. Plato https upload. Spinoza https upload. Lewis made significant contributions in philosophy of mind philosophy of probability epistemology philosophical logic aesthetics philosophy of mathematics philosophy of time and philosophy of science. The work of Leibniz anticipated modern logic and analytic philosophy but his philosophy also assimilates elements of the scholastic tradition notably that conclusions are produced by applying reason to first principles or prior definitions rather than to empirical evidence. After graduating he delivered a successful series of public lectures at the University of Edinburgh leading him to collaborate with David Hume during the Scottish Enlightenment. jpg 330px Wvq passport 1975 400dpi crop. For Marx class antagonisms under capitalism owing in part to its instability and crisis prone nature would eventuate the working class development of class consciousness leading to their conquest of political power and eventually the establishment of a classless communist society constituted by a free association of producers. His work greatly affected the development of epistemology and political philosophy. org wikipedia commons thumb e ea Spinoza. jpg Plato 428 427 or 424 423 348 347 BC was an Athenian philosopher during the Classical period in Ancient Greece founder of the Platonist school of thought and the Academy the first institution of higher learning in the Western world. org wikipedia commons thumb e ea Painting_of_David_Hume. com 2Fdam 2Fimageserve 2F1027476298 2F960x0. He taught philosophy as a Privatdozent at Halle from 1887 then as professor first at Göttingen from 1901 then at Freiburg from 1916 until he retired in 1928 after which he remained highly productive. Plato has also often been cited as one of the founders of Western religion and spirituality. He was also a politician and a member of the Parliament of Great Britain and Ireland. In philosophy of mathematics he and his Harvard colleague Hilary Putnam developed the Quine Putnam indispensability thesis an argument for the reality of mathematical entities. Quine https upload. His views on philosophy of religion including his rejection of miracles and the argument from design for God s existence were especially controversial for their time. These writings influenced various activists and political movements. It was only in the 20th century that Leibniz s law of continuity and transcendental law of homogeneity found mathematical implementation by means of non standard analysis. jpg George Edward Moore OM FBA 4 November 1873 24 October 1958 usually cited as G. Originally trained in mathematics he built on and greatly refined earlier work on the causes of business cycles and was one of the most influential economists of the 20th century. In his work Adam Smith introduced his theory of absolute advantage. Keynes https upload. As a leader of the British delegation Keynes participated in the design of the international economic institutions established after the end of World War II but was overruled by the American delegation on several aspects. Locke was the first to define the self through a continuity of consciousness. Locke https upload. He developed highly controversial ideas regarding the authenticity of the Hebrew Bible and the nature of the Divine. For example the roots of post structuralism and its unifying basis lies in large part in a general opposition not to the philosophical tradition tout court but specifically to the Hegelian tradition dominating philosophy in the twentieth century prior to post structuralism. The latter often abbreviated as The Wealth of Nations is considered his magnum opus and the first modern work of economics. Popper https upload. These first three histories exemplified a historiographical technique Foucault was developing called archaeology. jpg 330px Christoph_Bernhard_Francke_ _Bildnis_des_Philosophen_Leibniz_ 28ca. Foucault died in Paris from complications of HIV AIDS he became the first public figure in France to die from complications of the disease. He led a systematic attempt to understand science from within the resources of science itself 13 and developed an influential naturalized epistemology that tried to provide an improved scientific explanation of how we have developed elaborate scientific theories on the basis of meager sensory input. org wikipedia commons thumb 6 62 Wvq passport 1975 400dpi crop. His name has been used as an adjective a noun and a school of social theory. 9 The Economist has described Keynes as Britain s most famous 20th century economist. From 1966 to 1968 Foucault lectured at the University of Tunis before returning to France where he became head of the philosophy department at the new experimental university of Paris VIII. org wikipedia commons thumb 4 43 Adam_Smith_The_Muir_portrait. jpg 330px Nicolas_Malebranche. His partner Daniel Defert founded the AIDES charity in his memory. He is one of the major figures associated with post structuralism and postmodern philosophy. This conception of the human is in contrast with that of Rationalist thinkers like René Descartes who had understood human existence most basically as thinking as in Cogito ergo sum I think therefore I am. Marx has been described as one of the most influential figures in human history and his work has been both lauded and criticised. When Time magazine included Keynes among its Most Important People of the Century in 1999 it stated that his radical idea that governments should spend money they don t have may have saved capitalism. His major writings include the papers On What There Is which elucidated Bertrand Russell s theory of descriptions and contains Quine s famous dictum of ontological commitment To be is to be the value of a variable and Two Dogmas of Empiricism 1951 which attacked the traditional analytic synthetic distinction and reductionism undermining the then popular logical positivism advocating instead a form of semantic holism. Moore was Professor of Philosophy at the University of Cambridge highly influential among though not a member of the Bloomsbury Group and the editor of the influential journal Mind. Marx https upload. He is widely considered the pivotal figure in the history of Ancient Greek and Western philosophy along with his teacher Socrates and his most famous student Aristotle. However he was the main proponent of the view that philosophy is not conceptual analysis but continuous with science the abstract branch of the empirical sciences. In addition to being an economist Keynes was also a civil servant a director of the Bank of England and a part of the Bloomsbury Group of intellectuals. His ideas are the basis for the school of thought known as Keynesian economics and its various offshoots. jpg Adam Smith FRSA 16 June 1723 17 July 1790 was a Scottish economist philosopher as well as a moral philosopher a pioneer of political economy and a key figure during the Scottish Enlightenment also known as The Father of Economics or The Father of Capitalism. Hume argued against the existence of innate ideas positing that all human knowledge derives solely from experience. Popper was opposed to the classical justificationist account of knowledge which he replaced with critical rationalism namely the first non justificational philosophy of criticism in the history of philosophy. ", "id": "vanvalkenberg/nlp-what-the-philosopher-said", "size": "56153", "language": "python", "html_url": "https://www.kaggle.com/code/vanvalkenberg/nlp-what-the-philosopher-said", "git_url": "https://www.kaggle.com/code/vanvalkenberg/nlp-what-the-philosopher-said", "script": "__init__ CalSentScore nltk.sentiment.vader perf_counter PrintCorpus WordFreqNormalizer spacy.lang.en.stop_words seaborn numpy STOP_WORDS nlargest time SummarizeMyText heapq SentimentAnlysis matplotlib.pyplot WordCloud pandas wordcloud WordCloudForSentiments SentimentIntensityAnalyzer punctuation Summarizer() Analyzer WordFrequencyCalculator string STOPWORDS ", "entities": "(('who', 'him'), 'set') (('Fichte', 'subjectivity'), 'like') (('Schizophrenia Anti Thousand 1972 1980 both', 'psychoanalyst Félix Guattari'), 'be') (('books', 'Forbidden Books'), 'add') (('He', 'analytic philosophy'), 'be') (('she', 'following virtues'), 'be') (('historical dialectical thought', 'more profoundly other structural analysis'), 'write') (('August 1638 13 October', 'jpg Nicolas Malebranche Jesus'), 'Oratory') (('org wikipedia commons', 'Wvq 6 62 passport 1975 crop'), 'thumb') (('he', 'arithmometer'), 'be') (('Plato', 'also ambiguously Platonic realism'), 'be') (('where father', 'Macedonia'), 'e') (('Foucault', 'Knowledge'), 'publish') (('He', 'also Platonic love'), 'be') (('Adam Smith', 'absolute advantage'), 'introduce') (('contributions', 'unpublished manuscripts'), 'scatter') (('General Theory', '1936'), 'detail') (('writings', 'Voltaire'), 'influence') (('it', 'metaphysical inquiry'), 'develop') (('general approach', 'Horace such Walpole'), 'be') (('further Hegel', 'most powerful modern times'), 'state') (('hand', 'fire'), 'state') (('Much', 'tape only recordings'), 'remain') (('He', '1978'), 'fill') (('It', 'descriptions'), 'introduce') (('knowledge', 'now empiricism'), 'maintain') (('most influential philosophers', 'empirical falsification'), 's') (('philosophy', 'abstract empirical sciences'), 'be') (('how they', 'societal institutions'), 'address') (('death', 'philosophy literature film'), 'Deleuze') (('it', 'Johann Gottlieb Fichte'), 'see') (('months', 'Deutsche later Akademie'), 'in') (('where he', 'day'), 'take') (('abroad he', 'Madness'), 'return') (('he', 'phenomenology'), 'be') (('He', 'sudden dramatic revelation'), 'introduce') (('Merleau Ponty', 'art literature linguistics'), 'express') (('Lewis', 'science'), 'make') (('Smith', 'Moral Sentiments'), 'obtain') (('He', 'Hobbes Locke Berkeley'), 'lay') (('philosophy', 'state history art conceptually religion'), 'integrate') (('Almost all capitalist governments', '1946'), 'do') (('treatise metaphysical Difference', '1968 many scholars'), 'consider') (('Leibniz', 'library science'), 'contribute') (('philosophical accomplishments', 'philosophers'), 'prompt') (('who', 'history'), 'be') (('Ethics', 'death'), 'publish') (('human societies', 'class conflict'), 'understand') (('work', 'existentialism post structuralism'), 'consider') (('world', 'many equally real possible ones'), 'defend') (('Hume', 'philosophy science'), 'influence') (('he', 'philosophy'), 'be') (('He', 'thought'), 'regard') (('inadequate aggregate demand', 'high unemployment'), 'argue') (('Smith', 'classical free market economic theory'), 'lay') (('wherever it', 'Hegelian dialectical synthesis'), 'determine') (('him', 'notorious work'), 'become') (('delay so further lets', '30 given data'), 'be') (('humans', 'specific type'), 'approach') (('membership he', 'death'), 'admit') (('JPG Saul Aaron Kripke', 'November 13 1940 American analytic tradition'), 'bear') (('It', 'logic'), 'observe') (('necessary that', 'such water'), 'be') (('self how rational interest', 'economic prosperity'), 'develop') (('which', 'Immanuel Kant'), 'Fichte') (('Leibniz Spinoza', 'all well mathematics'), 'be') (('Leibniz', 'most optimism'), 'note') (('He', 'Princeton emeritus University'), 'be') (('notably conclusions', 'prior rather empirical evidence'), 'anticipate') (('he', 'Scottish Enlightenment'), 'deliver') (('he', 'disease'), 'die') (('famously Reason', 'only passions'), 'hold') (('jpg Immanuel 22 April', 'Enlightenment 1724 12 1804 German central thinkers'), 'Kant') (('Derrida', 'work'), 'address') (('human knowledge', 'solely experience'), 'argue') (('you', 'it'), 'writte') (('Moore', 'greatest philosophers'), 'rank') (('important part', 'Spinoza'), 'be') (('intellectuals labour unions Many artists', 'ideas'), 'influence') (('he', 'ethics epistemology'), 'lead') (('book', 'meaning'), 'contain') (('He', 'Logic'), 'receive') (('It', 'Bertrand descriptions'), 'contain') (('philosopher 1650 French born who', 'United Provinces'), 'Descartes') (('so called Neoplatonism', 'such Augustine'), 'influence') (('However advent', 'Keynesian thought'), 'spark') (('he', 'almost annually more than 30 years'), 'associate') (('that', 'largest libraries'), 'devise') (('jpg Gottfried von 1 1646 14 November', 'natural Enlightenment'), 'Wilhelm') (('historical manifestation', 'immanence'), 'be') (('influence', 'Yale'), 'feel') (('org wikipedia commons', 'Maurice_Merleau 9 98 Ponty'), 'thumb') (('itself', 'prior experience'), 'mean') (('second he', 'divine natural phenomena'), 'reject') (('he', 'most well known works'), 'write') (('one', 'matters'), 'go') (('phenomenologists', 'psychology'), 'be') (('master slave dialectic', 'century especially 20th France'), 'be') (('he', 'so called phenomenological reduction'), 'seek') (('ethics', 'emotion'), 'be') (('where he', 'philosophy'), 'educate') (('This', 'George British Empiricist'), 'place') (('him', 'modern Western philosophy'), 's') (('Kripke', 'mathematics metaphysics recursion epistemology theory'), 'be') (('crisis prone nature', 'producers'), 'eventuate') (('writings', 'various activists'), 'influence') (('Lewis', 'death'), 'teach') (('jpg Maurice Jacques Merleau 1908 3 May', 'Edmund 1961 French phenomenological strongly Husserl'), 'Jean') (('He', 'deconstructivism music art'), 'influence') (('org wikipedia commons', 'ae Aristotle_Altemps_Inv8575'), 'thumb') (('He', 'Great Britain'), 'be') (('who', 'namely Cartesianism'), 'exert') (('org wikipedia commons', '8 8d'), 'thumb') (('compatibilist theory', 'fully compatible human freedom'), 'take') (('postmodernist Foucault', 'labels'), 'cite') (('24 November 1632 21 February', 'Sephardi 1677 Dutch Portuguese origin'), 'bear') (('that', 'such Voltaire'), 'conclusion') (('that', 'wages'), 'manifest') (('who', 'dogmatic slumbers'), 'credit') (('He', 'linguistics sociolinguistics psychoanalysis'), 'have') (('views', 'especially time'), 'be') (('jpg David 18 April 1772 11 September', 'Thomas Malthus Adam Smith'), 'Ricardo') (('French Je pense donc je suis', '1644 Latin'), 'be') (('Jewish religious authorities', 'herem'), 'issue') (('Marx', 'human history'), 'describe') (('he', 'century 17th philosophy'), 'one') (('He', 'Duhem Quine thesis'), 'advocate') (('how we', 'world'), 'be') (('that', 'philosophy probability theory biology medicine geology psychology much later linguistics'), 'make') (('Kant', 'merely sophisticated traditional Christian faith'), 'continue') (('Leibniz', 'Isaac independently contemporaneous developments'), 'develop') (('Descartes', '17th century'), 'call') (('metaphysics', 'counterpart theory counterfactual causation'), 'incorporate') (('He', 'rights human penal reform'), 'become') (('Spinoza', 'Amsterdam'), 'raise') (('one', 'contract equally social theory'), 'consider') (('self', 'causally connected perceptions'), 'deny') (('where he', 'British Museum'), 'become') (('he', '1938'), 'follow') (('main he', 'perception art politics religion psychology psychoanalysis language nature'), 'be') (('work', 'capital'), 'lay') (('other 6 who', 'fiscal policy'), 'start') (('he', 'later himself'), 'after') (('He', '1918'), 'elect') (('principal contribution', 'possible worlds'), 'be') (('order first logic', 'New Foundations'), 'be') (('how we', 'meager sensory input'), 'lead') (('Plato', 'Western religion'), 'cite') (('He', 'post structuralism'), 'be') (('mind', 'birth'), 'postulate') (('Mathematical works', 'calculus'), 'favor') (('really You', 'modern philosophy'), 'say') (('law', 'non standard analysis'), 'be') (('jpg Plato 428 427 423 348 347 BC', 'Western world'), 'be') (('Europe South other where continental philosophy', 'language'), 'retain') (('he', 'St.'), 'seek') (('century profoundly influenced 20th he', 'notable contemporary philosophy'), 'think') (('which', 'different languages'), 'give') (('FBA 4 November 1873 24 October', '1958 usually G.'), 'OM') (('Locke', 'consciousness'), 'be') (('Berkeley', 'immaterialism'), 'know') (('org wikipedia commons', 'Frans_Hals _ _ Portret_van_Ren C3 7 73 A9_Descartes'), 'thumb') (('they', 'what'), 'like') (('he', 'revolution'), 'publish') (('he', '1936'), 'humanist') (('they', 'capitalism'), 'state') (('he', 'intentionality'), 'elaborate') (('org wikipedia commons', 'a6'), 'thumb') (('perceived', 'other'), 'emphasize') (('Kripke', 'Rules'), 'give') (('we', 'others'), 'want') (('those', 'production'), 'predict') (('One', 'modern philosophy'), 'regard') (('he', 'which'), 'teach') (('Philosophy A who', 'Philosopy'), '3Ffit') (('du monde', 'final work'), 'lead') (('aspects', 'February'), 'png') (('it', 'industrial inventory'), 's') (('he', '20th century'), 'train') (('beings', 'beings'), 'address') (('Others', '1967 1967 Philosophy'), 'cite') (('Derrida', 'essays'), 'publish') (('he', 'German nationalism'), 'write') (('views', 'modern aesthetics'), 'continue') (('coining', 'centyary 6th B.'), 'term') (('Scottish Enlightenment philosopher historian economist 1776 who', 'empiricism philosophical skepticism'), 'Hume') (('we', 'today Plato'), 'think') (('Quine', 'theory'), 'be') (('books', 'Worlds'), 'be') (('where he', 'Scot John fellow Snell'), 'study') (('later essentialism', 'system'), 'refer') (('Plato', 'also Western political philosophy'), 'consider') (('self', 'Jean Jacques Rousseau David such Hume'), 'cite') (('jpg Willard Van Orman', 'twentieth century'), 'be') (('Main Function', 'wordCloud Extractive Text summarization Benchmarks'), 'import') (('philosophy', 'science'), 'lead') (('Keynesian economics', 'other governments'), 'provide') (('He', 'phenomenology hermeneutics'), 'know') (('political philosophy', 'classical them'), 'embrace') (('Keynes', 'several aspects'), 'participate') (('Hegel', 'developed fullness'), 'see') (('he', 'such Hume'), 'want') (('16 work', 'post literary as well such structuralism'), 'influence') (('Recently philosophers', 'self consciousness'), 'begin') (('Such', 'empiricism'), 'be') (('we', 'senses'), 'draw') (('what', 'normative conclusion'), 'maintain') (('org wikipedia commons', '9c 9 Derrida_Dibujo'), 'thumb') (('actually one event', 'events'), 'perceive') (('he', 'Perpetual Peace European A'), 'be') (('he', 'Latin Benedictus de Spinoza'), 'use') (('where individual', 'fun'), 'be') (('where everyone', 'one'), 'one') (('1976 German who', '20th century'), 'Heidegger') (('ideas', 'Keynesian economics'), 'be') (('leading Western economies', 'policy recommendations'), 'begin') (('1938 German who', 'phenomenology'), 'Gustav') (('influence', 'analytic tradition'), 'consider') (('it', 'decisive experiments'), 'prove') (('they', 'time'), 'be') (('Spinoza', 'Constantijn'), 'live') (('work', 'intact over 2 400 years'), 'believe') (('He', 'Divine'), 'develop') (('where he', 'VIII'), 'lecture') (('he', 'also Alexander'), 'grow') (('that', 'that'), 'be') (('org wikipedia commons', '4 43 Adam_Smith_The_Muir_portrait'), 'thumb') (('power', 'society'), 'publish') (('it', 'Plato'), 'note') (('own positions', 'many thinkers'), 'influence') (('Art', 'great plays'), 'write') (('15 1926 25 June', 'philosopher 1984 French ideas writer political activist'), 'Foucault') (('dualisms', 'instance mind'), 'be') (('refined conceptions', 'finally themselves'), 'write') (('they', 'experience'), 'argue') (('work', 'epistemology'), 'affect') (('he', 'logos'), 'write') (('instead familiar objects', 'result'), 'deny') (('He', 'English also Italian'), 'write') (('Keynes', 'economic recessions'), 'advocate') (('therefore I', 'Cogito ergo most basically sum'), 'be') (('1951 which', 'semantic holism'), 'include') (('He', 'Western teacher'), 'consider') (('international perhaps this', 'world culminating history'), 'be') (('him', '23 own family'), 'cause') (('Husserl', 'idealist transcendental philosophy'), 'argue') (('Malebranche', 'God occasionalism'), 'know') (('he', 'language'), 'award') (('1704 English physician', 'Liberalism'), 'FRS') (('He', 'Gestalt especially psychology'), 'be') (('which', '21st'), 'refine') (('contributions', 'Independence'), 'reflect') (('Marx', 'modern social science'), 'cite') (('Stalnaker Lewis together theory', 'philosophical literature'), 'use') (('attention short spans', 'other person'), 'cut') (('he', 'creation'), 'insist') (('Leibniz', 'rationalism'), 'be') (('he', 'mathematical entities'), 'develop') (('1960 which', 'meaning'), 'include') (('they', 'consequently us'), 'follow') (('influential contributions', 'especially modal logic'), 'make') (('he', 'Portuguese name'), 'use') (('Many elements', 'Augustine'), 'have') (('political thought', 'subsequent intellectual economic history'), 'have') (('He', 'knowledge'), 'win') (('that', 'human nature'), 'strove') (('that', 'often erroneously Hegel'), 'be') (('he', 'recent decades'), 'consider') (('working class', 'socio economic emancipation'), 'press') (('Kant', 'Man'), 'criticize') (('Naming', '20th century'), 'consider') (('These', 'Morals'), 'include') (('He', 'Hague'), 'bury') (('Husserl', 'Leo Franz Brentano'), 'studied') (('flourishing open society', 'social criticism'), 'know') (('16 June 1723 17 July', 'Capitalism'), 'FRSA') (('Plato', 'dialectic philosophy'), 'be') (('1946 English ideas', 'economic governments'), 'FBA') (('he', 'others'), 'Berkeley') (('aesthetics', 'disinterested judgment'), 'believe') (('He', '1944'), 'be') (('jpg Georg Wilhelm Friedrich 27 1770 14 November', '1831 German most important German idealism'), 'Hegel') (('He', 'mechanical calculators'), 'become') (('as long workers', 'wage demands'), 'spearhead') (('latter', 'magnum first modern economics'), 'consider') (('Smith', 'Nations'), 'write') (('leftist he', 'Simone de 1945'), 'be') (('He', 'lenses'), 'die') (('name', 'social theory'), 'use') (('partner', 'memory'), 'found') (('rationally instead they', 'custom habit'), 'argue') (('Wealth', 'economics'), 'be') (('he', 'traditional philosophy'), 'attempt') (('he', 'Western Marxism'), 'support') (('He', 'philosophy politics law ethics theology history'), 'write') (('70 years later Quine', 'then professor'), 'affiliate') (('philosophies', 'Hegel'), 'describe') (('Kant', 'lifetime'), 'publish') (('roots', 'prior structuralism'), 'lie') (('Spinoza', 'God'), 'call') (('thought', 'communication working studies'), 'influence') (('work', 'most important thinkers'), 'oppose') (('He', 'teaching prestigious positions'), 'turn') (('Economist', 'century most famous 20th economist'), '9') (('September 28 1941 October 14 2001 American who', '20th century'), 'be') (('Moore', 'influential journal'), 'be') ", "extra": "['disease', 'test', 'lung']"}