{"name": "panda deeper eda and visualization v2 ", "full_name": " h1 Deeper Exploratory Data Analysis of PANDA h2 About the notebook h2 Domain Knowledge h3 Question 1 What is Prostate Cancer h3 Question 2 How is Prostate Cancer tested and detected h3 Question 3 What is Gleason score and how does it fit into all this h3 Question 4 What is ISUP grade and how is it related to Gleason score h3 Question 5 How have Gleason scores been generated in the dataset h1 Now Let s Get Started with PANDA Dataset h2 Loading of the Required Dependencies h2 Loading of the Data h3 Directories Exploration h3 Load the Data and Check the Content h4 Checking for the Training Samples h4 Inference h4 About the Output Variables h4 Checking Missing Information h4 Checking of test csv File Content h1 Performing of Some Basic EDA h2 Checking of the Size of Training label masks and Samples and h3 Inference h2 Checking of the Distribution of Data Provider ISUP Grade and Gleason Score h3 Auxilary Function h3 Summary of Counts h3 Visualization h3 Inferences on the Distributions h4 About the Distribution of ISUP Grade h4 About the Distribution of Gleason Socre h2 Checking for the Relative Distributions RDs h3 Inferences on the Relative Distributions h4 About ISUP Score and Data Provider h4 AboutGleason Score and Data Provider h1 Some Advanced EDA h2 Loading and Quickly Displaying of some few WSIs h3 Checking of some Generalizable Properties on the Data h3 Some Few Insights h3 Let s Resize and Visualize the 9 Randomly Selected Biopsy Images h3 Exploration and Analysis of the Training Label Masks h4 Overview h4 Loading of label masks and Visualization h4 Prepare the Training Sample Images with their Corresponding Masks h4 Plotting of some Image and Masks According to sup grade Category h4 Visualization h3 Overlaying of Training Label Masks on their Corresponding Whole Slide Images h4 Auxiliary functions for this tasks h4 Visualization h4 Some Few Insights h3 Let s Explore few of these Images with Pen Markers h2 Distributions of the Dimensions width hight of Training Samples h3 Extraction of Dimensions width hight and Merging with the Train Data h3 Visualization of some Insighful Distributions h4 Auxiliary Function h4 Inferences on the Distributions h2 Inspirational References ", "stargazers_count": 0, "forks_count": 0, "description": "More precisely he feels the back wall of the prostate gland for enlargement tenderness lumps or hard spots. On the other hand radbound is major data provider for 4 4 4 3 4 5 5 4 5 5 5 3 3 5. Now Let s Get Started with PANDA DatasetThis notebook shows few methods to load and preprocess WSIs from PANDA challenge dataset. Question 3 What is Gleason score and how does it fit into all this When a biopsy confirms the presence of cancer the next step is to determine the level of aggressiveness grade of the cancer cells. Each epithelial unit is separate and has a lumen. Usually it grows slowly and is initially confined to the prostate gland where it may not cause serious harm. The label information is stored in the red R channel the other channels are set to zero and can be ignored. split function that will split the image mask into individual bands channels. So intermediate levels can be created by simply downsampling a higher resolution level. com kaggle docker python In the cell below we enable the several different and helpful packages modules libraries that I think are required for this project. Checking for the Relative Distributions RDs 1. The probe uses sound waves to create a picture of your prostate gland. Let s Explore few of these Images with Pen Markers Distributions of the Dimensions width hight of Training Samples Extraction of Dimensions width hight and Merging with the Train Data Visualization of some Insighful Distributions Auxiliary Function Inferences on the DistributionsWe can see that overall as well as at ISUP Grade and Gleason Socre levels width and height have almost similar distribution. D Prostatic adenocarcinoma Gleason Pattern 5 has an almost complete loss of glandular differentiation. This microphotograph shows irregular cribriform cancer i. As the competition organizers described slightly different procedures were in place for the images used in the test set than the training set. However while some types of Prostate Cancer grow slowly and may need minimal or even no treatment other types are aggressive and can spread quickly. This is a standard way of staining the originally transparent tissue to produce some contrast. C Prostatic adenocarcinoma Gleason Pattern 4 has partial loss of glandular differentiation. You can also write temporary files to kaggle temp but they won t be saved outside of the current session. A laboratory pathologist examines a sample of your cancer to determine how much cancer cells differ from the healthy cells. All microphotographs show hematoxylin and eosin stains at 20x lens magnification. Dataset is not balanced in terms of gleason_score. Recall we showed early that there are exactly 100 training sample images whose the training label masks are not available in the mask directory. nl en research and the Karolinska Institute https ki. epithelial sheets with multiple lumina. com c prostate cancer grade assessment data https zenodo. OnpenSlide and merge them using PIL. Collecting a sample of prostate tissue If initial test results suggest prostate cancer your doctor may recommend a procedure to collect a sample of cells from your prostate prostate biopsy. There are also some poorly formed small glands and some fused glands. The glands are grouped together. About the Output VariablesThe whole experiment of testing and detecting the Prostate Cancer outputs two varaibles that are isup_grade which is the target variable representing the severity of the cancer on a 0 5 scale. Rest of the data samples have associated ISUP grades from 2 to 5 with all ranging in the 11 12 each. Examples of patterns used for grading. B D Gleason pattern 3 to 5 respectively. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory Full file directory Openining without reading the image into memory Full file directory Openining without reading the image into memory Full file directory Openining without reading the image into memory Creation of the patch to plot Get the last level slide Get the dimension corresponding of the last level Plot the patch Full file directory Openining without reading the image into memory Creation of the patch to plot Get the last level slide Get the dimension corresponding of the last level Resize the image patch Plot the resized image patch Full file directory Openining without reading the image into memory Creation of the patch to plot Get the last level slide Get the dimension corresponding of the last level Plot In train_ids I set index to image_id Recall mask_id image_id _mask. tiff Full file directory Openining without reading the image into memory Creation of the patch to plot Get the last level slide Get the dimension corresponding of the last level Resize the image patch Full file directory Openining without reading the image into memory Creation of the patch to plot Get the last level slide Get the dimension corresponding of the last level Resize the mask patch cmap mpl. Biopsies not containing cancer are represented by an ISUP grade of 0 in this challenge. ListedColormap black gray green yellow orange red Open a slide wsi Full file directory Openining without reading the image into memory Open the corresponding mask Creation of the patch to visualize Get the last level slide Get the dimension corresponding of the last level Split the patch mask into channels Create alpha mask Mapping 0 background 1 stroma 2 benign epithelium 3 Gleason 3 4 Gleason 4 5 Gleason 5 Mapping 0 background 1 benign 2 cancer Overlay the mask on its corresponding slide Plot the overlayed image Open a slide wsi Full file directory Openining without reading the image into memory. To do this we load both the mask and the biopsy with OS. XxR 85MzZQL https emedicine. The grading system recognizes three categories 3 4 and 5. This rotation has no clinical value and is only dependent on how the biopsy was collected in the lab. OpenSlide and cv2. Question 4 What is ISUP grade and how is it related to Gleason score According to current guidelines by the International Society of Urological Pathology ISUP the Gleason scores are summarized into an ISUP grade on a scale from 1 to 5 according to the following rule Gleason score 6 ISUP grade 1 Gleason score 7 3 4 ISUP grade 2 Gleason score 7 4 3 ISUP grade 3 Gleason score 8 ISUP grade 4 Gleason score 9 10 ISUP grade 5If there is no cancer in the sample we use the label ISUP grade 0 in this competition. Small glands infiltrate between benign glands. This means there are exactly 100 training samples without that do not have a mask. However the information in the masks differ from the two centers. Prostate Cancer is one of the most common types of cancer in men. Gleason scoring combines two numbers and can range from 1 10 and describes how much the cancer from a biopsy looks like healthy tissue lower score or less aggressive or abnormal tissue higher score or very aggressive. though the lower part of the range isn t used as often. The most common scale used to evaluate the grade of prostate cancer cells is called a Gleason score. ISUP Grade and Data Provider 1. resize but the former currently fails fails on the latest version of the Kaggle Docker image to the following packages imagecodecs and tifffile. Let s recall this is provided on training data only. Auxiliary functions for this tasksAfter creating the mask patch to visualize we will apply mask. Question 5 How have Gleason scores been generated in the dataset Each whole slide Image WSI in this challenge contains one or in some cases two thin tissue sections cut from a single biopsy sample. Exploration and Analysis of the Training Label Masks OverviewApart from the slide level label present in the csv file almost all slides in the training set have an associated mask with additional label information. The main domain knowledge info has been taken from the following sources https www. Plotting of some Image and Masks According to sup_grade Category Auxiliary functions for this task Visualization Overlaying of Training Label Masks on their Corresponding Whole Slide ImagesGiven the knowledge of the importance of masks and also the fact that they have the same dimension as their corresponding slides we can overlay them on the tissue to directly see areas which are cancerous. B Prostatic adenocarcinoma Gleason Pattern 3 has no loss of glandular differentiation. It is defined by the kaggle python Docker image https github. Click on OpenSlide Python Documentation https openslide. Domain Knowledge In this section we are interested in covering the knowledge around the Prostate Cancer in order to have a deeper understanding of the problem. In isup_grade category 3 4 and 5 most of the data is provided by radbound. All the training images do not have masks as we can see that the size of the training samples is 10616 whereas the sample mask size is only 10516. The tissue sample is analyzed in a lab to determine whether cancer cells are present. Gleason Pattern 5 may also contain solid sheets or strands of cancer cells. The most common blue outline Gleason pattern 3 and second most common red outline Gleason pattern 4 cancer growth patterns present in the biopsy dictate the Gleason score 3 4 for this biopsy which in turn is converted into an ISUP grade 2 for this biopsy following guidelines of the International Society of Urological Pathology. org api python to read more about the OpenSlide Python. However to get started we will first begin with a deep explanation of some key concepts related to Prostate Cancer and its detection and that we are worth knowing. All of these are included in Gleason Pattern 4. com c prostate cancer grade assessment overview https www. Biopsies can be in different rotations. Prostate specific antigen PSA test Here a blood sample is drawn from a vein in your arm and analyzed for PSA a substance that s naturally produced by your prostate gland. However if a higher than normal level is found it may indicate prostate infection inflammation enlargement or cancer. Loading of the Required DependenciesThis Python 3 environment associated with this notebook comes with many helpful analytics libraries installed. So we are going rearrange each training sample with its corresponding mask. For example splitting an RGB image creates three new images each containing a copy of one of the original bands channels red green blue. Base on the challenge description the dataset consists of about 11 000 data samples for which each sample represents a whole slide image WSI of prostate biopsies from two sources Radboud University Medical Center https www. Question 2 How is Prostate Cancer tested and detected Prostate Cancer is tested through some prostate screening tests that might include Digital rectal exam DRE During a DRE your doctor inserts a gloved lubricated finger into your rectum During a DRE your doctor inserts a gloved lubricated finger into your rectum to examine your prostate which is adjacent to the rectum as depicted in the figure below. About the Distribution of Gleason Socre From above graph it is clear that gleason_score distribution is not uniform. The prostate is nothing but a small walnut shaped gland in men that produces the seminal fluid that nourishes and transports sperm as depicted in the figure below. This overlay can help you identifying the different growth patterns. Let s Resize and Visualize the 9 Randomly Selected Biopsy Images skimage. read_csv Plotly for the interactive viewer see last section fontsize of the figure title fontsize of the axes title fontsize of the x and y labels fontsize of the tick labels fontsize of the tick labels legend fontsize Input data files are available in the read only. Also in gleason_score category 3 3 karolinska is major data provider. Few gleason_score like 3 3 and 0 0 are more frequent while others like 3 5 and 5 3 are very rare in this dataset. Loading of the Data Directories Exploration Note We can write up to 5GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All. And as you can observe on the figure below starting from x y 1024 1024 on some images a zomm of 512 times 512 doesn t capture the biopsy. The appearance of the glands forms the basis of the Gleason grading system. Loading of label masks and Visualization Prepare the Training Sample Images with their Corresponding Masks. An illustration of the Gleason grading process for an example biopsy containing prostate cancer. The PANDA dataset are whole slide images WSIs stored in Tag Image File Format. In gleason_score category negative all the data is provided by radbound. Gleason Score and Data Provider Inferences on the Relative Distributions About ISUP Score and Data Provider In isup_grade category 0 and 1 most of the data is provided by karolinska. A small probe about the size and shape of a cigar is inserted into your rectum. The samples are made up of glandular tissue and connective tissue. Both libraries have some amazing and independent functions to process WSIs for example one of the key benefits of openslide is that we can load arbitrary regions of the slide without having to load the whole image into memory. MultiImage and cv2. The label masks provided by Karolinska center were semi autotomatically generated based on annotations by a pathologist. Visualization Some Few InsightsAs you can observe on the outputs of the cell above overlaying mask on slide there are some few pen markings on the slide dark green smudges. As with the slides itself the label masks can be opened using OpenSlide. A higher grade indicates a more aggressive cancer that is more likely to spread quickly. Checking of some Generalizable Properties on the Data Some Few InsightsThe outputs of the cell above show the properties of two WSIs from the 9 randomly selected training images from different data provider. Checking of the Distribution of Data Provider ISUP Grade and Gleason Score Auxilary Function Summary of Counts Visualization Inferences on the Distributions About the Distribution of ISUP Grade Majority of data samples in train set have ISUP grade values 0 or 1 total 50. Some Advanced EDAIn this section we are going to load some few images samples from the training image directory and learn some of their properties. The cytoplasm is often dark and the nuclei enlarged with dark chromatin and some prominent nucleoli. Prior to scanning the tissue is stained with haematoxylin eosin H E. There is an attempt to form lumina but the tumor fails to form complete well developed glands. com iamleonie panda eda visualizations suspicious data linear algebra data processing CSV file I O e. If a DRE or PSA test detects an abnormality your doctor may recommend further tests to determine whether you have prostate cancer. Dataset is not balanced in terms of isup_grade. csv File Content Performing of Some Basic EDA Checking of the Size of Training label masks and Samples and InferenceAs we also highlighted early in the previous section the outputs of the cell above show that All the training images do not have masks as we can see that the training samples size is 10616 whereas the sample mask size is only 10516. Each WSI has 3 levels that can be loaded corresponding to a downsampling of about 1 4 and 16 as shown in the output cell above. As explained in the overview on competition these markings are not part of the tissue but were made by the pathologists who originally checked this case. Prostate biopsy is often done using a thin needle that s inserted into the prostate to collect tissue. The glandular structure characteristic of healthy prostate tissue is progressively lost with increasing grade. tiff is a common format for exchanging raster graphics bitmap images between application programs including especially those used for scanner images. com gpreda panda challenge starting eda1. What we learned from these outputs are the following The image dimensions are quite large ranging typically between about 4 000 and 40 000 pixels in both x and y. To do this we are going to start by trying to successively address these five key questions what is Prostate Cancer How is it tested and detected What is Gleason score and how does it fit into all this What is ISUP grade and how is it related to Gleason score How have Gleason scores been generated So let us start looking into these questions Question 1 What is Prostate Cancer Prostate Cancer is a cancer that occurs in the prostate. The importance of these masks is they directly indicate which parts of the tissue are healthy and which are cancerous. Checking Missing Information Checking of test. Deeper Exploratory Data Analysis of PANDA About the notebookIn this notebook we are basically going to dive deeper into the dataset explanation and build on that to perform an extensive EDA. About Gleason Score and Data Provider In gleason_score category 0 0 all the data is provided by karolinska. Some of the training set images have stray pen marks on them but the test set slides are free of pen marks. Load the Data and Check the Content Checking for the Training Samples InferenceWe can notice from the outputs of the cell above that The training samples directory train_images contains exactly 10616 files that matches the number of samples in the train. Besside these WSI properties I associated a 512 times 512 zoomed part of the image around x y 1024 1024. Loading and Quickly Displaying of some few WSIsLet s randomly select some few WSIs from the training samples and play with them to get some few insights. The label masks are stored in an RGB format so that they can be easily opened by image readers. resize can be used as well instead of openslide. gleason_score which is an alternate cancer severity rating system with more levels than the ISUP scale as you can see in the figure below depicting how Gleason score and ISUP grade systems compare. If your doctor finds any abnormalities in the texture shape or size of the gland you may need further tests. The patterns are described in detail below and exemplified in the figure below A Benign prostate glands with folded epithelium The cytoplasm is pale and the nuclei small and regular. There are noticable color differences between the biopsies this is very common within pathology and is caused by different laboratory procedures. Here is how Radboudumc the prostate glands are individually labelled and the valid values are 0 background non tissue or unknown 1 stroma connective tissue non epithelium tissue 2 healthy benign epithelium 3 cancerous epithelium Gleason 3 4 cancerous epithelium Gleason 4 5 cancerous epithelium Gleason 5 Karolinska the regions are labelled and the valid values are 0 background non tissue or unknown 1 benign tissue stroma and epithelium combined 2 cancerous tissue stroma and epithelium combined The label masks provided by Radboudumc center were semi automatically generated by several deep learning algorithms contain noise and can be considered as weakly supervised labels. The glands are hollow structures which can be seen as white holes or branched cavities in the WSI. com article 1612022 overview1. Dispersed single cancer cells are seen in the stroma. Inspirational ReferencesThe following kernels were of great help in the creation of this notebook 1. these pen markings are available on some slides in the training set. Such tests can include Ultrasound If other tests raise concerns your doctor may use transrectal ultrasound to further evaluate your prostate. The loading and processing of these WSIs will be performed using both skimage and openslide libraries in Python. The dimensions of each level differ based on the dimensions of the original image. tiff files can be in any of several classes including gray scale color palette or RGB full color. This method returns a tuple of individual image bands from an image. It s normal for a small amount of PSA to be in your bloodstream. ", "id": "djeutsch/panda-deeper-eda-and-visualization-v2", "size": "20413", "language": "python", "html_url": "https://www.kaggle.com/code/djeutsch/panda-deeper-eda-and-visualization-v2", "git_url": "https://www.kaggle.com/code/djeutsch/panda-deeper-eda-and-visualization-v2", "script": "glob display plot_WSIs load_and_resize_biopsy_mask plot_resized_biopsy seaborn numpy plotly.graph_objs PIL distribution_plot HTML plot_biopsy_masks Image matplotlib.pyplot mask_on_slide_overlayer ImageOps plot_distribution_grouped pandas matplotlib load_and_resize_biopsy IPython.display openslide skimage.io ", "entities": "(('former', 'following packages'), 'resize') (('cancer how much cells', 'healthy cells'), 'examine') (('this', 'laboratory different procedures'), 'be') (('structure glandular characteristic', 'progressively increasing grade'), 'lose') (('label masks', 'pathologist'), 'generate') (('split that', 'bands individual channels'), 'function') (('0 1 most', 'karolinska'), 'Score') (('tiff', 'scanner images'), 'be') (('sample mask size', 'training samples'), 'have') (('image dimensions', 'x'), 'be') (('that', 'figure'), 'be') (('t', 'outside current session'), 'write') (('cancer cells', 'lab'), 'analyze') (('Dataset', 'gleason_score'), 'balance') (('label masks', 'OpenSlide'), 'open') (('loading', 'openslide Python'), 'perform') (('I', 'index'), 'list') (('score', 'figure'), 'gleason_score') (('that', 'prostate'), 'go') (('Gleason levels width', 'almost similar distribution'), 'let') (('which', 'directly areas'), 'plot') (('cytoplasm', 'folded epithelium'), 'describe') (('you', 'prostate cancer'), 'detect') (('So we', 'corresponding mask'), 'go') (('small probe', 'rectum'), 'insert') (('gleason_score distribution', 'graph'), 'be') (('cytoplasm', 'often dark chromatin'), 'be') (('other channels', 'zero'), 'store') (('doctor', 'further prostate'), 'include') (('each', 'bands original channels'), 'create') (('this', 'training data'), 'let') (('that', 'output cell'), 'have') (('that', 'more aggressive cancer'), 'indicate') (('almost slides', 'label additional information'), 'have') (('domain knowledge main info', 'sources https following www'), 'take') (('Dataset', 'isup_grade'), 'balance') (('competition organizers', 'training set'), 'be') (('you', 'pen some few slide dark green smudges'), 'visualization') (('appearance', 'Gleason grading system'), 'form') (('who', 'originally case'), 'be') (('It', 'kaggle python Docker image https github'), 'define') (('Loading', 'few insights'), 'select') (('more others', '5 very dataset'), 'be') (('slide whole WSIs', 'Tag Image File Format'), 'be') (('that', 'train'), 'notice') (('I', 'project'), 'python') (('Inspirational ReferencesThe following kernels', 'notebook'), 'be') (('grading system', 'three categories'), 'recognize') (('epithelial unit', 'lumen'), 'be') (('However information', 'two centers'), 'differ') (('More precisely he', 'enlargement tenderness lumps'), 'feel') (('notebook', 'PANDA challenge dataset'), 'let') (('which', 'figure'), 'question') (('Some InsightsThe outputs', 'data different provider'), 'check') (('This', 'contrast'), 'be') (('Checking', 'Relative Distributions'), 'RDs') (('This', 'mask'), 'mean') (('hollow which', 'branched WSI'), 'be') (('which', '0 5 scale'), 'about') (('data', 'radbound'), 'provide') (('which', 'tissue'), 'be') (('all', '11 12'), 'associate') (('tissue two thin sections', 'biopsy single sample'), 'question') (('Prostate Cancer', 'men'), 'be') (('only how biopsy', 'lab'), 'have') (('we', 'OS'), 'load') (('Biopsies', 'challenge'), 'represent') (('notebook we', 'extensive EDA'), 'Analysis') (('you', 'further tests'), 'need') (('method', 'image'), 'return') (('Loading', 'Corresponding Masks'), 'prepare') (('test set slides', 'pen marks'), 'have') (('Checking', 'ISUP grade values'), 'have') (('microphotograph', 'cribriform cancer irregular i.'), 'show') (('microphotographs', '20x lens magnification'), 'show') (('tumor', 'complete well developed glands'), 'be') (('how much cancer', 'healthy tissue lower score'), 'combine') (('4 most', 'radbound'), 'provide') (('C Prostatic adenocarcinoma', 'glandular differentiation'), 'have') (('doctor', 'prostate prostate biopsy'), 'recommend') (('probe', 'prostate gland'), 'use') (('small amount', 'bloodstream'), 's') (('I', 'image'), 'besside') (('we', 'problem'), 'knowledge') (('Input data files', 'read'), 'see') (('that', 'naturally prostate gland'), 'draw') (('training sample training label early exactly 100 masks', 'mask directory'), 'show') (('times 512 doesn', 'biopsy'), 'observe') (('it', 'prostate infection inflammation enlargement'), 'find') (('cancer Dispersed single cells', 'stroma'), 'see') (('Small glands', 'benign glands'), 'infiltrate') (('you', 'growth different patterns'), 'help') (('3 3 karolinska', 'gleason_score Also category'), 'be') (('grade', 'prostate cancer cells'), 'call') (('we', 'Prostate Cancer'), 'begin') (('level last slide', 'mask patch cmap mpl'), 'directory') (('D Prostatic adenocarcinoma', 'glandular differentiation'), 'have') (('sample', 'two sources'), 'consist') (('B', 'glandular differentiation'), 'have') (('we', 'mask'), 'apply') (('we', 'memory'), 'have') (('when you', 'Save Run'), 'write') (('next step', 'cancer cells'), 'question') (('they', 'image easily readers'), 'store') (('even other types', 'slowly minimal'), 'be') (('All', 'Gleason Pattern'), 'include') (('which', 'Urological Pathology'), 'pattern') (('So intermediate levels', 'resolution simply higher level'), 'create') (('where it', 'serious harm'), 'grow') (('pen markings', 'training set'), 'be') (('section we', 'properties'), 'go') (('samples', 'glandular tissue'), 'make') (('that', 'tissue'), 'do') (('overlayed image', 'memory'), 'Open') (('we', '0 competition'), 'question') (('dimensions', 'original image'), 'differ') (('Loading', 'analytics many helpful libraries'), 'come') (('tissue tissue label 0 background non tissue unknown 1 benign epithelium combined 2 cancerous masks', 'weakly supervised labels'), 'be') (('0 0 data', 'karolinska'), 'about') (('Gleason Pattern', 'cancer cells'), 'contain') (('sample mask size', 'masks'), 'Performing') (('tiff files', 'scale color gray palette'), 'be') ", "extra": "['annotation', 'biopsy', 'biopsy of the greater curvature', 'test', 'procedure']"}