{"name": "pneumonia detection using cnn ", "full_name": " h1 Dataset https www kaggle com paultimothymooney chest xray pneumonia h1 Description of the Pneumonia Dataset h1 Load the dataset h1 Data Visualization Preprocessing h1 Previewing the images of both the classes h1 Data Augmentation h1 Training the Model h1 Analysis after Model Training ", "stargazers_count": 0, "forks_count": 0, "description": "The idea is to alter the training data with small transformations to reproduce the variations. Reading and resizing the image using opencv Load the dataset Data Visualization PreprocessingThe data seems imbalanced. Data AugmentationIn order to avoid overfitting problem we need to expand artificially our dataset. input directory For example running this by clicking run or pressing Shift Enter will list all files under the input directory You can write up to 5GB to the current directory kaggle working that gets preserved as output when you create a version using Save Run All You can also write temporary files to kaggle temp but they won t be saved outside of the current session Reshaping images to preferred size Normalize the data resize data for deep learning With data augmentation to prevent overfitting and handling the imbalance in dataset set input mean to 0 over the dataset set each sample mean to 0 divide inputs by std of the dataset divide each input by its std apply ZCA whitening randomly rotate images in the range degrees 0 to 180 Randomly zoom image randomly shift images horizontally fraction of total width randomly shift images vertically fraction of total height randomly flip images randomly flip images. For the analysis of chest x ray images all chest radiographs were initially screened for quality control by removing all low quality or unreadable scans. There are 5 863 X Ray images JPEG and 2 categories Pneumonia Normal. All chest X ray imaging was performed as part of patients routine clinical care. com kaggle docker python For example here s several helpful packages to load linear algebra data processing CSV file I O e. In order to account for any grading errors the evaluation set was also checked by a third expert. Dataset https www. The diagnoses for the images were then graded by two expert physicians before being cleared for training the AI system. Moreover the CNN converges faster on 0. We can make your existing dataset even larger. Some popular augmentations people use are grayscales horizontal flips vertical flips random crops color jitters translations rotations and much more. com paultimothymooney chest xray pneumoniaImporting all the required libraries Description of the Pneumonia DatasetThe dataset is organized into 3 folders train test val and contains subfolders for each image category Pneumonia Normal. Training the Model Analysis after Model TrainingSome of the Correctly Predicted Classes This Python 3 environment comes with many helpful analytics libraries installed It is defined by the kaggle python Docker image https github. read_csv Input data files are available in the read only. of training examples we will use data augmentation Previewing the images of both the classesWe perform a grayscale normalization to reduce the effect of illumination s differences. By applying just a couple of these transformations to our training data we can easily double or triple the number of training examples and create a very robust model. Once our model is ready we fit the training dataset. Approaches that alter the training data in ways that change the array representation while keeping the label the same are known as data augmentation techniques. For the data augmentation i choosed to Randomly rotate some training images by 30 degreesRandomly Zoom by 20 some training imagesRandomly shift images horizontally by 10 of the widthRandomly shift images vertically by 10 of the heightRandomly flip images horizontally. Chest X ray images anterior posterior were selected from retrospective cohorts of pediatric patients of one to five years old from Guangzhou Women and Children s Medical Center Guangzhou. ", "id": "nageshsingh/pneumonia-detection-using-cnn", "size": "2547", "language": "python", "html_url": "https://www.kaggle.com/code/nageshsingh/pneumonia-detection-using-cnn", "git_url": "https://www.kaggle.com/code/nageshsingh/pneumonia-detection-using-cnn", "script": "Flatten sklearn.metrics keras.preprocessing.image keras.layers keras.callbacks Dropout Sequential MaxPool2D Conv2D seaborn numpy ReduceLROnPlateau get_training_data sklearn.model_selection ImageDataGenerator confusion_matrix matplotlib.pyplot Dense pandas classification_report BatchNormalization keras.models train_test_split ", "entities": "(('grayscales horizontal vertical flips', 'crops color jitters translations rotations'), 'be') (('Chest X ray images anterior posterior', 'Guangzhou one to five years old Women'), 'select') (('It', 'kaggle python Docker image https github'), 'train') (('we', 'artificially dataset'), 'order') (('we', 'training dataset'), 'be') (('that', 'data augmentation techniques'), 'approach') (('i', 'flip heightRandomly images'), 'choose') (('diagnoses', 'AI system'), 'grade') (('idea', 'variations'), 'be') (('evaluation set', 'also third expert'), 'in') (('vertically fraction', 'randomly images'), 'list') (('read_csv Input data files', 'read'), 'be') (('we', 'very robust model'), 'double') (('opencv Data Visualization PreprocessingThe dataset data', 'image'), 'read') (('chest radiographs', 'low quality'), 'screen') (('DatasetThe dataset', 'image category'), 'xray') (('we', 'differences'), 'use') (('chest X ray imaging', 'clinical care'), 'perform') ", "extra": "['patient', 'test']"}