{"name": "read all kind of files using python ", "full_name": " h1 Read all the files available in this kernel h2 If you want to know when the files were last modified h1 1 txt File h1 2 csv File h1 3 xlsx File h1 4 sqlite File db h1 5 image Files jpeg jpg png etc h1 6 tiff File h1 7 mat File h1 8 mp3 File h1 9 pdf files h1 10 html File h1 11 nii File h1 12 json File h1 13 mp4 File h1 If you find this notebook helpful please upvote ", "stargazers_count": 0, "forks_count": 0, "description": "html could be used 8. jpg Read all the files available in this kernel If you want to know when the files were last modified https www. https data flair. training blogs wp content uploads sites 2 2018 02 File Handling In python 01. tiff File this piece of code is taken from https www. linear algebra data processing CSV file I O e. com robikscube kaggle deepfake detection introduction Can you detect the deepfake video_file train_video_files 30. mat File Having MATLAB 2014b or newer installed the MATLAB engine for Python https www. mp4 File If you find this notebook helpful please upvoteAlso If there is any other kind of file that can be openned using python please let me know. read_csv find your sheet name at the bottom left of your excel file and assign it to my_sheet change it to your sheet name change it to the name of your excel file shows headers with top 5 rows connecting to the database Save image in set directory Read RGB image Output img read To plot the image There are two ways to load the data from the PANDA dataset Option 1 Load images using openslide Option 2 Load images using skimage requires that tifffile is installed General packages image and mask directories Location of training labels pdf to text Fetch the html file Parse the html file Format the parsed html file Print the first few characters Get nibabel image object Get data from nibabel image object returns numpy memmap object Convert to numpy ndarray dtype uint16 Opening JSON file returns JSON object as a dictionary Iterating through the json list Closing file this code snippet is taken from https www. org news content images 2020 05 Python File Handling 1. image Files jpeg jpg png etc. com rohitsingh9990 panda eda better visualization simple baseline notebook 7. com help matlab matlab engine for python. ", "id": "soham1024/read-all-kind-of-files-using-python", "size": "949", "language": "python", "html_url": "https://www.kaggle.com/code/soham1024/read-all-kind-of-files-using-python", "git_url": "https://www.kaggle.com/code/soham1024/read-all-kind-of-files-using-python", "script": "mat4py loadmat nibabel PDFResourceManager PDFPage LAParams PDFPageInterpreter pydub TextConverter seaborn numpy BeautifulSoup matplotlib.pylab convert_pdf_to_txt pydub.playback AudioSegment PIL playsound HTML StringIO bs4 display_images convert_date IPython.display pdfminer.pdfpage Image matplotlib.pyplot cStringIO os pandas scandir read_excel pdfminer.layout pdfminer.pdfinterp Tkinter pdfminer.converter play get_files matplotlib.image datetime cv2 ", "entities": "(('me', 'python'), 'File') (('when files', 'available kernel'), 'read') (('com', 'python'), 'help') (('tiff piece', 'https www'), 'file') (('rohitsingh9990 panda com eda', 'baseline better simple notebook'), 'visualization') (('you', 'deepfake'), 'com') (('Having', 'Python https www'), 'instal') (('code snippet', 'https www'), 'find') ", "extra": "[]"}