{"name": "rsna super cool eda and pytorch baseline train ", "full_name": " h2 RSNA STR Plumonary Embolism Detection h3 What is plumonary Embolism h3 What causes Plumonary Embolism h3 Reason for blood clots h3 symptoms of plumonary embolism h2 1 What is the competition about h2 2 Metrics Weighted Log loss h3 2 1 Exam Study level weighted log loss h3 2 2 Image level weighted log loss h3 2 3 All the labels must be logically consistent h3 Importing Libraries h3 Getting data h3 Basic Physics Behind CT scan h3 Hounsfield Unit h3 window and level h3 voxel size h3 Metadata of Image h2 3 EDA h3 3 1 Check Row and Columns range h3 3 2 Distribution of Pixel Spacing Columns and Rows h3 3 3 Distribution of Pixel Area h3 3 4 Distribution of Window width h3 3 5 Distribution of KVP h3 3 6 Distribution of TableHeight h3 3 7 Distribution of XRay h3 3 8 countplot of modality and rotation direction h3 3 9 Distribution of Image Raw and Rescaled values h2 4 Visulizing Images h4 What is DICOM image h3 4 1 Single Image h3 4 2 Grid of sorted images of some random patient h3 4 3 Animation h3 4 4 3d Reconstruction h2 Pytorch Baseline Model ", "stargazers_count": 0, "forks_count": 0, "description": "where i is exam number and k is image number. Let me know if any information or code is incorrect i will correct it and if you find this notebook usefull please UPVOTE 2. To get the average of all rows weights sum the weights of all images and all exam level labels and divide by number of rows. Negative Indeterminate Positive and it can only be one of these. Reason for blood clots. What is the competition about Here we are provided with the CT Plumonary angiography CTPA which is common type of medical imaging. com anthracene host confirmed label consistency check which will be used in this notebook Importing Libraries Getting data There are four labels in training set which are just for information and requires no predictions OA Constrast QA Motion True filling defect not PE and Flow artifact. DICOM is very good protocol and intresting to read further click here https en. 09202453988 Chronic 0. Data Contains hundereds of such images and we have to use our model to predict wether the image has PE or Not. anxiety clammy or bluish skin chest pain that may extend into your arm jaw neck and shoulder fainting irregular heartbeat lightheadedness rapid breathing rapid heartbeat restlessness spitting up blood weak pulseRead more about Plumonary Embolism here https www. Now if that was not confusing enough for you there is another catch. Code for checking consitency of the submission is provided here https www. 1042944785 Acute Chronic 0. Normally body parts lies in the range 1000 ex air in lungs to 1000. 5 then at least one of these labels must be assigned p 0. Hounsfield Unit is calculated by considering density of water as 0 unit and air as 1000 unit and all other density are transformed accordingly. smaller voxel sizes give better image. window and level Gray scale has 256 different units to represent colours but our eyes are not able to see small changes in colour in gray images. so instead of spreading whole Hounsfield Range to a gray image we select window of Hounsfield and spread 256 values between these Hounsfield values everything below this range is black and above the range is white. 6 Distribution of TableHeight 3. evaluation https www. exam_log_loss wj yij log pij 1 yij log 1 pij Then mean is taken over the log_loss for all such labels j. 2 Image level weighted log lossyik 1 if PE is present in the image else 0. com health deep venous thrombosis The blood clot which causes plumonary embolism are formed in legs or pelvis. 0736196319 Negative for PE. 8 countplot of modality and rotation directionIt means all the Modality are CT and rotation direction are CW 3. But immediate treatment could help prevent permenant lung damage. It can be only one of these and it must be present if at least one image is positive. org wiki Godfrey_Hounsfield got Nobel Price for his part in making CT scanners Task of CT scanner is to find density of different tissues in our body now to convert this density to gray scale image Hounsfield came up with a way of linear transforming the density to gray scale image. 5 nor can there be a predicted probability of Indeterminate 0. 06257668712 RV LV Ratio 1 0. Visulizing Images What is DICOM image DICOM Digital Image and Communication in Medecine is a standard developed andmaintained by National Electrical Manufacturers Association NEMA for storingand transfering the medical images like CT computerised Tomography Magnetic resonanse image MRI and other types of medical images. 4 3d Reconstructionwell I though it would work Pytorch Baseline Model supress warnings get all StudyInstanceUID get all SeriesInstanceUID get all SOPInstanceUID removing the extention vtk is used because dicom is giving some error. Acute Chronic Acute Chronic it cannot be both chronic acute and chronic so only one can have p 0. Similarly if no image is positive p 0. jpg Plumonary Embolism is the blood clot that is formed in the artery of the lungs. 5 more than one of these labels may be assigned p 0. As different body parts have different attenuation factor it helps to seprate those parts easily. image_log_loss w qi yik log pik 1 yik log 1 pik The total loss is the average of all image and exam loss divided by the average of all row weights. 4 Distribution of Window width 3. symptoms of plumonary embolism. weight of the label j be wj. All the labels in the submission file must be logically consistent or your submission will be disqualified. so the weighted log loss is given by. 5 in other words it is inconsistent to say chronic has p 0. When no images are predicted positive then none of these labels may be assigned p 0. jpg 3Fh 3D400 26la 3Den us 26w 3D700 26v 3D1 201710231815 h 400 la en US w 700 Metadata of Image 3 EDA 3. 1042944785 Central PE 0. RSNA STR Plumonary Embolism Detection What is plumonary Embolism image. yij 1 if present else 0 and pijis the predicted probability. 5 is considered as being positive for PE will count as a positive imageAt the exam level we have1. com c rsna str pulmonary embolism detection overview evaluation page. com mtree image upload f_auto q_auto f_jpg fl_attachment ce531 fig07 voxel dentalcare 2F 2Fmedia 2Fdentalcareus 2Fprofessional education 2Fce courses 2Fcourse0501 0600 2Fce531 2Fimages 2Fce531 fig07 voxel. 5 and acute chronic has p 0. If any image is predicted positive there cannot also be a predicted probability of Negative 0. Label Weight Negative for PE 0. Main reason for the blood clot is deep vein thrombosis https www. Main symptoms is shortness of breath which can be gradual or sudden. 5 it is also possible that neither has p 0. so submission file should have number of rows equal to number of images number of exam study label number of exam study labels for exam study level. attenuation factor is a measure of by how much strength of the beam is reduced when it is passed through certain material. 7 Distribution of XRay 3. 3 Distribution of Pixel Area 3. here it means pixelspacing in x and y direction and slice thickness in z direction There are two type of voxel isotropic in which step in all sides are same and non isotropic steps are different. It is a very serious disease which causes death of one third people who go undiagnosed or undetectedwith the disease. What is meant by logically consistent. Medical Condition There are some medical condition which can cause blood clot to form in our body. 1 Check Row and Columns rangeThere are 512 rows and columns in all 10000 images so it might be safe to assume that all the images follows same. As the values spectral composition of the x ray depands on various parameters and voltage Hounsfield unit makes it easier to compare CT scans from different machines. 1877300613 Left PE 0. watch this https www. png https a360 rtmagazine. 1 Exam Study level weighted log lossyij be the label for the exam i and label j. be video for more info voxel size voxel is basically 3d version of pixel as pixel is representation of image in 2d voxel is a 3d representation. 5 Distribution of KVP 3. We have to predict total 10 labels 9 for exam study level and 1 for image level. 0736196319 Indeterminate 0. This 1000 to 1000 range is adjueste for 256 gray values to come up with image. What causes Plumonary Embolism Plumonary Embolism is caused due to the blood clot formed deep in the vein of our body. 2 Distribution of Pixel Spacing Columns and Rows 3. 5 then there must be one and only one negative or indeterminate with p 0. 1 Single Image 4. 2 Grid of sorted images of some random patient 4. Right left central if any image is predicted positive p 0. In 1979 Godfrey Hounsfield https en. The symptoms of plumonary embolism depends on the size of blood clot. Injury Damage bone fracture tissue damage etc. Metrics Weighted Log loss The metrics used by the competion is weighte log loss which is weighted over some labels. if any image on the exam is positive one of these must have p 0. We can adjust this window size according to our need to get better view of particular tissue we want to observer. 5 both cannot have p 0. org articles attenuation coefficient lang us of tissue is calculated. com wp content uploads 2019 10 lung pulmo embolism 1500 1280x640. 9 Distribution of Image Raw and Rescaled values 4. So Idea behind CT computed tomography scan is that when a x ray beam is passed through a tissue attenuation factor https radiopaedia. qi be the ratio of positive images to total images. Level is center of this window. At the image level any image with predicted probability 0. com health pulmonary embolus. com watch v KZld 5W99cI feature youtu. Now the weigtage of the label PE present or not is w 0. Inactivity sitting for long period of time or lyinig on bed because of illness. 2346625767 RV LV Ratio 1 0. 3 All the labels must be logically consistent. Location of each image is as StudyInstanceUID SeriesInstanceUID SOPInstanceUID. 06257668712 Right PE 0. dcm let us perform sanity check wether StudyInstanceUID SeriesInstanceUID and SOP instance UID in data match with actual folders Basic Physics Behind CT scan. ", "id": "maunish/rsna-super-cool-eda-and-pytorch-baseline-train", "size": "9812", "language": "python", "html_url": "https://www.kaggle.com/code/maunish/rsna-super-cool-eda-and-pytorch-baseline-train", "git_url": "https://www.kaggle.com/code/maunish/rsna-super-cool-eda-and-pytorch-baseline-train", "script": "torch.optim torch.utils.data albumentations __init__ valid_loop reconstruct train_loop plotly.offline tqdm.auto highlight_cols vtk.util DataLoader joblib dist Dict torch.nn ToTensorV2 collections iplot seaborn numpy models RsnaDataset(Dataset) plotly.graph_objs Back __getitem__ Parallel torchvision plotly.express typing get_meta_features plotly.figure_factory sklearn.model_selection seed_everything get_value KFold run matplotlib.pyplot convert_to_rgb pandas torch.functional get_x_y_cordinate albumentations.pytorch.transforms Dataset __len__ sanity_check Counter show_animation tqdm get_img distribution_of_image_values show_image Style show_grid colorama numpy_support matplotlib.animation delayed Fore pydicom IPython.display HTML ", "entities": "(('total loss', 'row weights'), 'image_log_loss') (('images', '512 10000 images'), 'be') (('basically 3d version', '2d voxel'), 'be') (('who', 'disease'), 'be') (('immediate treatment', 'lung permenant damage'), 'help') (('which', 'PE'), 'confirm') (('logically submission', 'submission file'), 'be') (('x ray when beam', 'tissue attenuation factor https radiopaedia'), 'compute') (('2Fdentalcareus 2F 2Fmedia 2Fprofessional education', '2Fcourse0501'), 'upload') (('image', 'p'), 'have') (('blood that', 'lungs'), 'be') (('image', 'PE'), 'hundered') (('notebook', 'it'), 'let') (('body Normally parts', '1000'), 'lie') (('5 more than one', 'labels'), 'assign') (('Main reason', 'blood clot'), 'be') (('Right central image', 'positive p 0'), 'leave') (('we', 'particular tissue'), 'adjust') (('average', 'rows'), 'get') (('which', 'common medical imaging'), 'be') (('then at least one', 'labels'), '5') (('Now that', 'you'), 'be') (('What', 'other medical images'), 'be') (('at least one image', 'only these'), 'be') (('we', 'exam level'), 'consider') (('us', 'tissue'), 'lang') (('9 Distribution', 'Image Raw'), 'value') (('Plumonary Embolism Plumonary Embolism', 'body'), 'cause') (('We', 'image level'), 'have') (('qi', 'total images'), 'be') (('dicom', 'error'), '3d') (('weighte log which', 'labels'), 'weight') (('here it', 'sides'), 'mean') (('it', 'only these'), 'be') (('symptoms', 'blood clot'), 'depend') (('voltage Hounsfield it', 'different machines'), 'make') (('then none', 'labels'), 'assign') (('chronic', '0'), 'be') (('everything', 'range'), 'value') (('Hounsfield Unit', '1000 unit'), 'calculate') (('pij 1 yij', 'such labels'), 'log') (('Location', 'image'), 'be') (('scale image gray Hounsfield', 'scale gray image'), 'get') (('which', 'breath'), 'be') (('rotation direction', 'modality'), 'mean') (('also neither', '0'), 'be') (('submission so file', 'exam study level'), 'have') (('image', 'also predicted Negative'), 'be') (('anxiety skin chest bluish that', 'blood Plumonary pulseRead more Embolism'), 'clammy') (('us', 'folders Basic CT actual Physics scan'), 'let') (('Medical medical which', 'body'), 'Condition') (('eyes', 'gray images'), 'have') (('Code', 'submission'), 'provide') (('when it', 'certain material'), 'be') (('chronic only one', 'p'), 'chronic') (('plumonary embolism', 'legs'), 'thrombosis') (('DICOM', 'very good further click'), 'be') (('lossyik 1 PE', 'image'), 'weight') (('log weighted lossyij', 'j.'), 'be') (('256 gray values', 'image'), 'be') (('it', 'parts'), 'help') ", "extra": "['biopsy of the greater curvature', 'disease', 'patient', 'lung']"}