{"name": "seismic data exploration ", "full_name": " h2 1 Overview h2 2 Training data h3 2 1 Acoustic Data h3 2 2 Time to Failure h3 2 3 Timeseries h3 2 4 Time between measurements h2 3 Test data h2 4 Statistics for chunks h3 4 1 Rolling mean h3 4 2 Standard deviation ", "stargazers_count": 0, "forks_count": 0, "description": "The standard deviation is also higher for chunks that are closer to an earthquake in general. The data within each test file is continuous but the test files do not represent a continuous segment of the experiment. 5 seconds for the first earthquake and 6s to the 7º while the longest is around 16 seconds. Training data single continuous segment of experimental data. Within those bins seismic data is recorded at 4MHz but there is a 12 microseconds 1e 6 gap between each bin an artifact of the recording device. 1 Acoustic DataOur single feature are integers in the range 5515 5444 with mean 4. 1 Rolling meanMost kernels are grouping the training data every 150 000 rows and calculating statistics about that chunk. I m using a numba function to find each unique difference with a given threshold and ploting the values I m not sure if the different values are due to numeric precision but we can see two main ranges the first around 0. The former should be the 12 microseconds between each bin but it s actually much higher from 1. There is only one huge change in TTF which is exactly when an earthquake occured and the time goes from almost zero to eleven seconds. Now it s possible to see a peak in acoustic data before each earthquake This is not a perfect rule though there are some peaks far from earthquakes e. The next plot shows the mean absolute value for every 150 000 data points and the time to failure for the last point within each chunk. Removing high values mean value less than 8 We can see that the mean absolute value is increasing as we get closer to an earthquake. However when looking at ten thousand rows it s possible to see some jumps According to this discussion https www. Finally let s plot all the data 629. There are a lot of files in this competition so let s start with the folders structure The test folder has many csv files There is one file in the test folder for each prediction seg_id in sample_submission 2. 2 Time to FailureThe target variable is given in seconds with a max value of 16 seconds and minimun value close to zero 1e 5. Another interesting thing to check is the time between these high levels of seismic signal and the earthquakes. Statistics for chunks4. The only feature we have is the seismic signal acoustic data which is recorded using a piezoceramic sensor and corresponds to the voltage upon deformation in integers. between the 14º and 15º. 3 TimeseriesLet s see how both variables change over time. com c LANL Earthquake Prediction discussion 77526 The data is recorded in bins of 4096 samples. 001 and the other very close to zero. print first 10 show more decimals 629M 150k 4194 plot rolling mean plot rolling mean remove one outlier. 145 million rows There are 16 earthquakes in the training data. In the plot below I just changed the time_to_failure color to white. There is no overlap between the training and testing sets. 52The plot below is using a 1 random sample 6M rows There are outliers in both directions let s try to plot the same distribution with the range 25 to 25. 31 seconds before an earthquake 2. The following distribution is for the first test file Now the distribution for 10 files choosen at random Timeseries index as x axis for the same ten files 4. The shortest time to failure is 1. Training dataOne huge csv file has all the training data which is a single continuous experiment. Therefore the jumps have 12 microseconds and occur every 4096 measurements. The next plot has the first thousand rows of data the orange line is the acoustic data and the blue one is the time to failure The time to failure TTF is linearly decreasing at a very slow rate. There are only two columns in this file Acoustic data int16 the seismic signal Time to failure float64 the time until the next laboratory earthquake in seconds No missing values for both columns 2. 4 Time between measurementsLet s have a closer look at the TTF difference between each measurament. Test data consists of a folder containing many small segments. Both the training and the testing set come from the same experiment. Our goal is to predict the time remaining before the next laboratory earthquake. 2 Standard deviationIn the next chart the standard deviation for each chunk was grouped by the time to failure which in turn was rounded to the first decimal place. The next plot has ten million rows but we are plotting only every 10 data points We can t see the jumps anymore it s as if we have stretched the line and the steps disappeared. I m considering any acoustic data with absolute value greater than 500 as a high level More than 80 of high acoustic values are around 0. The black line is the closest normal distribution gaussian possible. Test dataEach file is a segment with 150 000 values for acoustic data single column. Distribution for the random sample 2. OverviewAs stated in the description the data for this competition comes from a experimental set up used to study earthquake physics. ", "id": "jsaguiar/seismic-data-exploration", "size": "5119", "language": "python", "html_url": "https://www.kaggle.com/code/jsaguiar/seismic-data-exploration", "git_url": "https://www.kaggle.com/code/jsaguiar/seismic-data-exploration", "script": "shuffle scipy get_stats seaborn numpy matplotlib.pyplot stats pandas single_timeseries random get_diff double_timeseries ", "entities": "(('following distribution', 'same ten files'), 'be') (('test folder', 'sample_submission'), 'let') (('Therefore jumps', '4096 measurements'), 'have') (('acoustic data', 'linearly very slow rate'), 'have') (('I', 'white'), 'change') (('which', 'first decimal place'), 'deviationin') (('Test file', 'acoustic data single column'), 'be') (('training', 'testing same experiment'), 'come') (('target variable', 'minimun close zero 1e'), 'give') (('seismic signal acoustic which', 'integers'), 'be') (('that', 'earthquake'), 'be') (('time', 'eleven seconds'), 'be') (('interesting thing', 'seismic signal'), 'be') (('1 Acoustic DataOur single feature', '5515 5444 mean'), 'be') (('com c LANL Earthquake Prediction 77526 data', '4096 samples'), 'discussion') (('steps', 'line'), 'have') (('which', 'training data'), 'have') (('it', 'actually much 1'), 'be') (('4 Time', 'measurament'), 'have') (('goal', 'laboratory next earthquake'), 'be') (('Test data', 'many small segments'), 'consist') (('M plot rolling 629 150k 4194 plot rolling mean mean', 'first 10 more decimals'), 'show') (('test files', 'experiment'), 'be') (('1 Rolling meanMost kernels', 'chunk'), 'group') (('next plot', 'chunk'), 'show') (('This', 'e.'), 's') (('longest', '7º'), 'second') (('More than 80', 'high acoustic values'), 'm') (('we', 'earthquake'), 'mean') (('s', '25 25'), 'use') (('we', 'two main ranges'), 'm') (('data', 'earthquake physics'), 'state') (('seismic data', 'recording device'), 'record') (('it', 'discussion https www'), 'however') (('how variables', 'time'), 'see') ", "extra": "['test']"}