{"name": "simple helmet mapping visualized ", "full_name": " h1 Video with Predictions h2 Process prediction videos h1 Display example videos ", "stargazers_count": 0, "forks_count": 0, "description": "csv index False copied from https www. calculate the area of inters 3. Only one label allowed per frame. unique 3 submission_df. sample list tracking gameKey. calculate the area of union print uni 4. com robikscube nfl helmet assignment getting started guide Estimated video frame sample_keys random. get the coordinate of inters 2. Correct preidctions have green boxes Impact helmet boxes are red if incorrect and yellow if correct note these predictions are weighted 1000x compared to a non impact helmet box prediction Video with Predictions Process prediction videos Display example videos copied from https www. Check for unique boxes 1. 33 Black Red Yellow Green White White Add frame and video columns Get stats about current state in frame CORRECT Ground Truth Box Prediction Box Freeze for 60 frames on impacts Not all browsers support the codec we will re load the file at tmp_output_path and convert to a codec that is more broadly readable using ffmpeg Add video column to sub_labels scaling factor for display. In this notebook I provide a function video_with_predictions. calculate the overlaps between pred_box and gt_box Keep sub_labels for review this would be 0. The predictions I m modeling come from the great baseline here https www. This function combines a model s validation predictions with the assoicated video. com robikscube nfl helmet assignment getting started guide Read label from CSV Maximum of 22 boxes per frame. com its7171 nfl baseline simple helmet mappingNote in the output videos If incorrect the ground truth box helmet boxes are black and predictions are white. I often find inspiration about how a model can be improved by visualizing it s predictions. ", "id": "robikscube/simple-helmet-mapping-visualized", "size": "767", "language": "python", "html_url": "https://www.kaggle.com/code/robikscube/simple-helmet-mapping-visualized", "git_url": "https://www.kaggle.com/code/robikscube/simple-helmet-mapping-visualized", "script": "sklearn.metrics __init__ rotate_arr merge_sub_labels multiprocessing calculate_metric_weighted display tqdm.auto sklearn.cluster dist_rot filter_to_top_label_match KMeans pyplot as plt get_iou_df Video video_with_predictions dist add_xy pyplot numpy dist_for_different_len norm_arr check_submission pandas find_nearest add_isCorrect_col accuracy_score tqdm score Pool NFLAssignmentScorer matplotlib add_track_features mapping_df IPython.display ", "entities": "(('it', 'often inspiration'), 'find') (('I', 'm great baseline'), 'come') (('Display example videos', 'https www'), 'have') (('this', 'gt_box Keep review'), 'calculate') (('sample_keys', 'video Estimated frame'), 'guide') (('function', 'assoicated video'), 'combine') (('com robikscube nfl helmet assignment', 'frame'), 'start') (('predictions', 'com its7171 output nfl baseline simple videos'), 'helmet') (('I', 'function video_with_predictions'), 'provide') (('that', 'display'), 'get') ", "extra": "[]"}