{"name": "the plasticc astronomy starter kit ", "full_name": " h1 The PLAsTiCC Astronomy Starter Kit h3 Gautham Narayan 20180831 h2 Contents h2 1 LSST PLAsTiCC and You h3 1a The Large Synoptic Survey Telescope h4 Figure 1 The LSST Telescope Credit LSST NSF AURA Todd Mason Productions Inc h4 Figure 2 The LSST Field of View compared to a camera on a similar telescope and the Moon Credit Zelko Ivezic LSST h4 Figure 3 The Hubble Space Telescope s field of view compared to the Moon h3 1b Light Curves Time series of Brightness of Astronomical Sources h4 Figure 4 The light curve of supernova 1998bu Credit Peter Challis Harvard CfA h4 Figure 5 The hierarchy of variable and transient sources Credit Laurent Eyer and Nami Mowlawi Université de Genève h4 It ll likely answers questions we don t even know to ask yet h3 1c How Astronomers have Studied Astronomical Sources Thus Far h4 Figure 6 A prism dispersing light creating a spectrum open access jpeg h4 Figure 7 Spectra of different kinds of supernovae with their atomic signatures labeled Credit Daniel Kasen UC Berkeley h3 1d The PLAsTiCC Challenge Classifying Astronomical Sources with Light Curves h4 Figure 8 The diversity of Supernovae Light Curves Credit Stephen J Smartt Queen s University Belfast https www nature com articles nature11643 h4 Figure 9 The light curves of an eclipsing binary system Credit AstroLab Durham University https community dur ac uk physics astrolab eclipsing html h4 Figure 10 The Atlas of Variable Stars Credit Popular Science Monthly from 1906 h4 Figure 11 LSST Filter Exchanger Credit LSST NSF AURA Todd Mason Productions Inc h4 Figure 12 The throughput of the LSST passbands with wavelength Your eyes are sensitive to just the g and r bands h4 Figure 13 The LSST telescope under construction on Cerro Pachon in Chile Credit Gianluca Lombardi Gemini Observatory h2 2 A Primer on the Dataset Light Curves h3 2a Time h3 2b Passband h3 2c Flux and Flux Error h4 Figure 14 Difference Imaging Postage Stamps Reference Image Difference h2 3 Exploring the Light Curves h4 Figure 15 The light curve of FAKE010 a supernova Credit Richard Kessler University of Chicago SNPhotCC h4 Figure 16 The ligt curve of FAKE030 looks a bit more messy Credit Abhijit Saha NOAO h4 Figure 17 The folded light curve of FAKE030 after determining a period using the Lomb Scargle algorithm h2 4 Primer cont d Metadata Provided with Light Curves h3 4a Coordinates on the Sky h4 Figure 18 Equatorial coordinates Credit https en wikipedia org wiki Right ascension h4 Figure 19 The sky in equatorial coordinates with a galactic coordinate grid overlaid h4 Figure 20 The LSST minion 1016 exposure map in celestial coordinates Credit LSST Corporation h3 4b Galactic Coordinates h4 Figure 21 The sky in galactic coordinates with a equatorial coordinate grid overlaid h3 4c Redshift h4 Figure 22 Redshift is a measure of how fast a distant source with more distant on the top is moving relative to us along the line of sight and is determined from how much the wavelength or alternately the frequency of the absorption and emission lines of atoms change relative to what we see here on Earth bottom panel h2 AN IMPORTANT NOTE h2 ANOTHER IMPORTANT NOTE h3 4d A view of our cosmic neighborhood h4 Figure 23 The GAIA view of our Galaxy Credit ESA GAIA h4 Figure 24 The low redshift Universe Credit Tom Jarrett IPAC Caltech h3 4e Cosmology h4 Figure 25 Hubble s Glass Plate notice the Var in the corner Hubble was using visual inspection for classification Credit Carnegie Observatories h4 Figure 26 Hubble s Hubble Diagram showing the Universe expanding Credit Edwin Hubble h4 Something is pushing distant galaxies away from us at an ever increasing rate h4 Figure 27 The JLA Hubble Diagram Credit Marc Betoule Paris Center for Cosmological Physics h4 Figure 28 A Timeline of our Universe Credit BBC Two Stargazing Live Public access NASA images h3 4f Dust h4 Figure 29 A dust map of the Milky Way from Planck Credit ESA NASA JPL Caltech h4 Figure 30 A Fly Through of our Galaxy s Dust Credit Gregory Green Stanford KIPAC ", "stargazers_count": 0, "forks_count": 0, "description": "_Figure 7 Spectra of different kinds of supernovae with their atomic signatures labeled Credit Daniel Kasen UC Berkeley. We use optical filters elements that only permit a certain range of wavelengths to pass through to measure the brightness in different passbands. CosmologyIn fact you might notice that all of the redshifts are positive almost everything is moving away from us In 1927 Georges Lemaître proposed that this meant the Universe was expanding. Historical parenthetical The original Julian Date which began counting up from zero on noon on Jan 1 4713 BC. Credit Abhijit Saha NOAO _This object for instance is something very different it s a variable star. PassbandThe next column labeled passband tells you the passband that the observation at time mjd was taken. Exploring the Light CurvesTo get a better sense of what the flux and flux_err look like let s take a look at some of their light curves. Galactic Coordinates section4b 4c. That s a data rate of 20 40 terabytes or about 1 US Library of Congress every night. TimeThe second column labeled mjd is the time that LSST took an image. Also the training set is not perfectly representative we can usually only classify the brightest objects we find with spectroscopy. That s about 163 miles second or 262 km s fast but less than a thousandth of the speed of light. This is also one of the reasons why LSST is being built on top of a mountain high in the Atacama desert of Chile it s far away from bright city lights and the sky background is lower allowing us to detect fainter sources. A Primer on the Data Light Curves section2 2a. Consequently each and every week LSST will find more sources that vary with time than Hubble has ever seen. For some objects the contribution from the source will fade over time leaving just the background which is about the same level as the flux in the template so some flux entries will be consistent with zero. Because the characteristic times that we conduct our observations on is a day we can t observe when the sun is up after all we measure time in units of decimal day. This view from ESA s Planck satellite really drives that home _Figure 29 A dust map of the Milky Way from Planck Credit ESA NASA JPL Caltech_Of course the dust isn t a single layer and has 3D structure. Take for instance the eclipsing binary system Y Piscium. Each object has observations in every passband. This is followed by a gap of 30 minutes 2 hours the results from PLAsTiCC might help decide this too where the telescope looks at other patches of sky before coming back to the original patch of sky. LSST PLAsTiCC and You 1a. Most astronomers only specialize in a few kinds of objects though so even their domain knowledge isn t complete. 5 so you d use textrm UNIX time textrm MJD 40587 times 86400 where 86400 is the number of seconds in 24 hours. You ll notice the map in the video is higher resolution towards the center of the galaxy where there are more stars and lower resolution in the opposite direction for instance. Be warned though that the actual photometric redshift distribution is asymmetric and the redshift is not likely to be less than zero so you might want to treat it as just a weight. LSST presents us with a great opportunity here because it will find an order of magnitude or more of these kinds of events than astronomers have ever observed. 2 gigapixel camera that s about the size of an adult human to take images of the night sky. Astrophysics is interesting stuff though and if you are curious and want to know more about something or how to do something that isn t covered here then just ask You ll find us on the Kaggle forum for this challenge Contents 1. This example data is simpler than the real data it has only four of the six passbands and different properties from the full sample so that the signal is more obvious and only a few classes. _Figure 8 The diversity of Supernovae Light Curves Credit Stephen J. That said we re being deliberately vague about exactly what sorts of astrophysical sources you ll find in the data and even what target number in the data corresponds to what astrophysical class. Figure 15 The light curve of FAKE010 a supernova Credit Richard Kessler University of Chicago SNPhotCC You might look at something like this light curve and try to estimate something like a full width at half maximum to determine a time scale. And the data at the time suggested that this increase was linear. 5 because the VAX reference starts at midnight while the Julian Date starts from noon. Why is the redshift unlikely to be less than 0. You can convert the change in frequency or wavelength into a speed using z frac lambda_ text Source lambda_ text Earth lambda_ text Earth frac Delta lambda lambda sim frac v_r c where z is the redshift lambda_ text Earth is the original wavelength we measure on Earth and Delta lambda is the change in wavelength v_r is the recession velocity and c is the speed of light. Note that there s been exactly one kilonova event ever seen we hope this will be out of date by the time LSST turns on though so it s not really possible to provide multiple examples in some cases 1c. 5 meter effective aperture and a focal ratio of f of 1. The same event rate also presents a new challenge supernovae aren t the only sorts of variable and transient events in the night sky. _ AN IMPORTANT NOTE _For historic reasons redshift is denoted with the letter z. The Large Synoptic Survey Telescope section1a 1b. All said then you should expect to find that Galactic sources have a different sort of distribution of dust along the line of sight to them than extragalactic sources. We ll give you a few external resources for these events in a companion Kernel if you are determined to augment the training set. hostgal_photoz_err. There s less detailed information available but you can still use it to identify people you see and categorize them into family friends co workers strangers etc. _Figure 12 The throughput of the LSST passbands with wavelength. LSST data will be useful for many different scientific studies by different groups from studying stars in our Galaxy to understand how solar systems like ours formed probing nuclear physics with brief burps before stars explode how galaxies themselves formed and the role massive stars play in shaping their chemistry to measuring how much matter there is in our Universe and everything in between. It s not a measured distance to each source actually measuring distances is complicated. A Timeline of our Universe Credit BBC Two Stargazing Live Public access NASA images_Now looking at Figure 25 and the equation above it you might notice that sources can have a redshift of greater than one i. A view of our cosmic neighborhoodYou might already have noticed the fuzzy blob in the Southern hemisphere below and to the right of center of our galaxy in galactic coordinates. We refer to the total transmission of each filter as the passband and often use the terms interchangeably. The SAO needed a way to keep track of Sputnik s orbits but the reference for the Julian date was so far in the past that the numbers were too large for their VAX VMS system to handle. We can t really simulate it from previous surveys because none of them achieve the same sort of signal to noise that LSST will one of the big motivations for building LSST in the first place. And you d be right But there s another astrophysical effect that affects the determination of time scales and colors and this one has nothing to do with the nature of the object what it is but rather where it is. 4 meter primary mirror diameter being built high up in Atacama desert of Chile on a mountain called Cerro Pachon. With a spectrum you can distinguish absorption and emission lines of atomic lines that are a few Angstroms across the symbol for it is an A with the circle on top very approximately 10 000 times smaller than the width of an average strange of human hair. Additionally extragalactic sources can also suffer from extinction _in their own host galaxies. Primer cont d Metadata Provided with Light CurvesReal astrophysical data is from sources on the sky which means that we normally have contextual information in addition to the light curve to help with classification if a source is near a galaxy or if it is isolated for instance. If you prefer to work with galactic coordinates instead of equatorial coordinates ra and decl these are provided in the header in the columns gall and galb. Cosmology section4e 4f. Different rise and fall times different absolute energies a different structure of bumps and wiggles. Time section2a 2b. LSST will then come back to the same patch of sky the next night but it will take the picture in a different passband. and would be useful for classification. The correction we applied to the light curves can be described by a single number for our Milky Way. Many of the redshifts of these nearby galaxies was first measured by Vesto Slipher back in 1917. This is because our telescope detectors are sensitive to wavelengths of light well beyond the range our eyes can see. Additionally if you remember the video of the supernova you saw it getting brighter initially and then getting fainter. As the sun gets near the horizon and the light from it has to pass through more of the Earth s atmosphere to reach us it appears even redder than when it is high in the sky. How much light gets through each filter depends not only on the properties of the filter but really the transmission of everything between the camera and the source the atmosphere dust in our galaxy dust in the galaxy of the source. Something is _pushing_ distant galaxies away from us at an ever increasing rate This is one of the best current map of that expansion using type Ia supernovae _Figure 27. When scientists used type Ia supernovae to do this for the first time in 1998 they discovered something remarkable that the Universe wasn t just expanding but the expansion was accelerating. You also don t need this but it is cool to get a sense for the history of our Universe. There s a problem though to measure this accurately we need _spectroscopy_. A Primer on the Dataset Light CurvesWe ve included some example light curve data along with this Kernel to illustrate some of the astrophysical effects you ll encounter in the full data set. Astronomers can map this structure using careful observations of lots of stars. Here s the filter exchanger for the LSST camera adult human for scale _Figure 11 LSST Filter Exchanger Credit LSST NSF AURA Todd Mason Productions Inc_This is a bit like taking a low resolution spectrum the light is still being split up and we re getting information about different colors but it s not as detailed. Each image then includes a contribution from the source and the background. If you have more questions you can find the PLAsTiCC dev team on the Kaggle forums and we ll do our best to answer your questions if we can. Consequently we also give you an estimate of the 68 uncertainty on the photometric redshift which itself might be inaccurate. You ll notice quickly that they don t always agree with the photometric redshift. Primer cont d Metadata Provided with Light Curves section4 4a. Here s a hand drawn illustration of some of the different known types of variable stars from Popular Science Monthly in 1906 page 179. Smartt Queen s University Belfast https www. The LSST illustrated below is a telescope with an 8. Wiki has a good illustration of this coordinate system Figure 18 Equatorial coordinates Credit https en. If you like photography LSST has a 6. Unfortunately spectroscopy takes a tremendous amount of telescope time and there aren t enough telescopes in the world _combined_ to keep up with the LSST event rate. These sources even closely related classes can have light curves that look quite different from each other. Because the speed of light is fixed and the distance to sources is increasing you can also compute a how long it took for light from a source at some redshift took to reach up. DustDepending on where you are looking on the sky there s a lot of structure in our Milky Way lanes of gas and dust obscure the view of stars and galaxies behind it. The test set is a version what we expect to have after 3 years of LSST operations. As the source flux changes with time some sources can have some flux entries as positive and others that are negative. in its entire 28 year life. More on why it is called this later. There s a much higher background in the bottom row thanks to a bright source off to the top right. We could move to any other point in the Universe and we d see the same behavior. While the light curves we ve provided are corrected for the dimming and reddening called the extinction along the line of sight in our Galaxy this correction isn t perfect because we ve not got perfect knowledge of how much dust there is along any line of sight. Let s start by taking a look at the metadata table a stub of which is provided with the starter kit That s a fair number of fields. It s worth noting that while astrophysical sources have to emit enough light to be brighter than the background sky more or less the definition of what a source is the flux can be positive or negative. That said redshift is a great feature We know how to separate extragalactic and galactic sources pretty well so we simulate this ability by setting the redshifts of galactic sources to exactly 0. For galactic objects with hostgal_photoz 0 the distmod is reported as NaN the distance would be 0 and taking the logarithm of 0 is a bad idea. _ Galactic sources are nearer us and brighter and because they are _in_ our Galaxy they are likely to be in the plane. Hubble s Hubble Diagram showing the Universe expanding Credit Edwin Hubble_We call this the Hubble Law and this kind of plot a Hubble Diagram well Hubble didn t he called it Figure 1. Also some classes of objects exhibit stochastic variability they don t repeat periodically but they do change more on some time scales than others. _Figure 4 The light curve of supernova 1998bu. org wiki Right_ascension If we unroll the sky into a flat Aitoff projection we can get a view of the entire sky _Figure 19 The sky in equatorial coordinates with a galactic coordinate grid overlaid_Splitting the sky into two hemispheres by extending the Earth s equator outwards the Milky Way forms a graceful arc. We ll begin by defining a class to handle this example with a few illustrative features you can use for classification Some of the light curves in the training set should already look familiar this is a type Ia supernova like SN1998bu in the animation. And of course depending on the period the time scale of the variability can be anything from hours to years Other variable stars have very different light curve shapes from eclipsing binaries. How Astronomers have Studied Astronomical Sources Thus FarTo determine the class of any particular astrophysical source we currently need lots of observational data. Objects for which the total flux from source and background is higher than that of the template have positive flux and when the total flux is lower than the template flux they have have negative flux. This coordinate system makes sense if you are building a telescope on Earth in the southern hemisphere and have to decide how you want to observe the sky. There s a few because we simulate occasionally getting lucky and finding a new source in a galaxy which already had spectroscopy but the vast majority of them will be NaN. Lines of constant Right Ascension and Declination are in grey while the green lines indicate a coordinate transform where the plane of the galaxy defines the equatorial plane instead of the Earth s equator a galactic coordinate system. This is called text MW E B V MW Milky Way E Extinction between the Blue and Visual or B V and reported in the header in the column named mwebv. The JLA Hubble Diagram Credit Marc Betoule Paris Center for Cosmological Physics _Hubble s data covers such a small range that it doesn t even show up on this plot. The PLAsTiCC Challenge Classifying Astronomical Sources with Light CurvesPLAsTiCC is based on a simulation of the light curves that LSST can expect to collect it doesn t exist yet so we can t give you real LSST data. Whether or not they were detected with respect to the template is reported as detected_bool. _Figure 1 The LSST Telescope Credit LSST NSF AURA Todd Mason Productions Inc_The telescope is going to have a 3. Hubble s Glass Plate notice the Var in the corner. This is how the cosmological redshift differs from the Doppler effect. If everything seems to be moving away with respect to us on Earth you might also be tempted to think we re the center of the expansion of the Universe. _Figure 10 The Atlas of Variable Stars Credit Popular Science Monthly from 1906_The variables here from left to right top to bottom are a Mira an eclipsing binary and RR Lyrae of type AB and an RR Lyrae of type C. Redshift section4c 4d. First you should get a sense for what the pattern of LSST observations is. Still you might look at the RR Lyrae and supernova light curve and conclude that extracting information about shape and the relative strengths of the signal in different passbands is a promising way to encode the information on each object. appear to be moving faster than the speed of light And you might have heard that it isn t possible to go faster than the speed of light. As we look farther our we look further back in time. The specific time format we will use in PLAsTiCC is called the Modified Julian Date MJD simply the number of decimal days from midnight on November 17 1858. and the Declination often just Dec. This should help reduce astronomer s advantage of domain knowledge astronomers will have to identify which class corresponds to which integers before they can take advantage of their understanding of the properties of different classes. The third panel has the difference between the two and you can see there s some light left over near the fuzzy galaxy. Here s how that looks _Figure 14 Difference Imaging Postage Stamps Reference Image Difference _The template image in the left panels is from 2004 while the current images are from 2007. This is a purely computed quantity and is provided for convenience. Each image it takes of a particular region is differenced with the template. Credit LSST Corporation_PLAsTiCC simulates the Wide Fast Deep Survey the main LSST program and the Deep Drilling Fields a few small regions where LSST will get more observations for specialized scientific studies. With PLAsTiCC since we re simulating the time series we don t have the full breadth of this contextual information. The Hubble Space Telescope only has a 2. The sources in the training set are from a mixture of these different astrophysical classes including Secular Pulsating and Eruptive Variable Stars Tidal Disruption Events Kilonovae Supernovae of different types Active Galactic Nucleii Microlensing Events Eclipsing BinariesThe diversity of these sources is important. compute the features and save the features we can also construct features between passbands this is a simple routine to visualize a light curve it can plot vs the MJD array of the light curve or vs an optional phase array that you pass we ll window the search range by setting minimums and maximums here but in general the search range you want to evaluate will depend on the data and you will not be able to window like this unless you know something about the class of the object a priori. This date is conveniently 2400000. This Kaggle Kernel provides an introduction to some of the astrophysics that might be relevant for the Photometric LSST Astronomical Time series Classification Challenge PLAsTiCC on Kaggle. We re all used to this effect we see it with our Sun and Moon everyday. html_The exact details of each eclipsing binary system determine the properties of the light curve how bright each star is their relative sizes how fast they orbit each other but all of these events have the same general light curve shape. The other fuzzy blob near it is called the Small Magellanic Cloud. Exploring the Light Curves section3 4. This becomes even more apparent if we look with a different instrument and in a different passband more sensitive to only the dust. Note that you can also get this information from the object_id column object_id 1 000 000 are in DDF. We ve mapped the passband names to integers but the mapping is straightforward u rightarrow 0 g rightarrow 1 r rightarrow 2 i rightarrow 3 z rightarrow 4 y rightarrow 5 You probably guessed as much looking at Figure 10 but u covers the ultraviolet g covers what your eye perceives as blue green r covers red i covers the infrared. Here s a visual timeline of the history of our Universe _Figure 28. We need to invent new techniques to classify astrophysical sources without using the detailed DNA sample that you d get from spectroscopy but using the less detailed information in their light curves their photometry. The data from these two images on the same night are combined to remove spurious glitches like cosmic rays asteroids airplane contrails etc. The PLAsTiCC Challenge Classifying Astronomical Sources with Light Curves section1d 2. If the source is moving towards us things are shifted to the blue or higher frequencies while if the source is moving away from us things are shifted to the red or lower frequencies. This means that LSST can make a map of the entire southern sky resolving details that are smaller than the width of a human hair held at arm s length. RedshiftThe position of a source on the sky is a tuple of two numbers in either equatorial or galactic coordinates but we live in a Universe with at least 3 spatial dimensions. Measure how bright they appear and compare the two and you ve got yourself a measurement of the distance. Passband section2b 2c. Come help us explore the Universe cheesy You can edit the font size here to make rendered text more comfortable to read It was built on a 13 retina screen with 18px we ll also use this package to read tables it s generally useful for astrophysics work including this challenge so we d suggest installing it even if you elect to work with pandas this is some simple code to demonstrate how to calculate features on these multiband light curves we re not suggesting using these features specifically there also might be additional pre processing you do before computing anything it s purely for illustration in this example we ll use the weighted mean to normalize the features define some functions to compute simple descriptive statistics we ll save the measurements in each passband to simplify access. While we can t give you all the contextual information we do provide some metadata a few essential elements that you _may_ want to use to augment the features extracted directly from the light curves this has pluses and minuses. So we ve got to identify such type Ia supernovae among all of the ones that LSST will find. There s only one filter in front of the camera at any time. Largely we use facial recognition. _Figure 30 A Fly Through of our Galaxy s Dust Credit Gregory Green Stanford KIPAC _Dust like increasing luminosity distance and therefore redshift in our Universe makes things fainter and redder. This is a counterintuitive consequence of Einstein s General Theory of Relativity and living in a Universe that is homogeneous same from all positions and isotropic same in all directions. We can rotate the sky so that the plane of our galaxy defines the equator like so _Figure 21 The sky in galactic coordinates with a equatorial coordinate grid overlaid_where I m leaving the celestial coordinate grid in yellow notice how they no longer correspond to the North and South relative to the plane of our Galaxy. Our atmosphere scatters blue light more than the red light making the sun and the moon appear more red than if we could see them from space. Active galactic nucleii massive black holes surrounded by hot dust and gas at the centers of galaxies exhibit this kind of behavior. I m not even going to pretend that z and Y have good reasons to be named what they are. This is an eclipsing binary system a name which the animation below should help explain with a light curve that looks like this _Figure 9 The light curves of an eclipsing binary system Credit AstroLab Durham University https community. For your convenience this is provided in the header as a column named distmod. Your eyes are sensitive to just the g and r bands_The training sample is what the entire astronomical community can expect to have before LSST turns on except where astronomers have a mishmash of observations from different telescopes something you ll have to deal with if you decide and try to augment it from the literature you get a nice homogeneous training set. This 3D map was made with the Pan STARRS telescope which has a 1. v_r H_0 cdot D sim c cdot z where D is the luminosity distance to the object and the dot cdot operator is a shorthand for the multiplication times operator. This particular source was a supernova but the same technique can be used to identify all manner of variable and transient sources in astronomical images. How Astronomers have Studied Astronomical Sources Thus Far section1c 1d. Credit Zelko Ivezic LSST_This large FoV is what makes LSST so revolutionary. It will then take another 15 30 second picture. _Figure 23 The GAIA view of our Galaxy Credit ESA GAIA_This fuzzy blob below and to the right of center is called the Large Magellanic cloud a companion galaxy to our Milky Way. 2m telescope at the Fred Lawrence Whipple Observatory. In the real data you ll get many objects in the same CSV and you ll need some way of getting all the observations for one object. When the Soviet Sputnik launched the Smithsonian Astrophysical Observatory decided to make this zero reference date a little more current. 4 meter mirror and here s it s FoV. This also means that they ll have different light curves. In other words each object has six time series you can use for classification. The advantage of LSST and its giant camera is that it can take an image of several 100 000 astrophysical sources through a single filter at the same time. Some sources vary periodically while others show random or stochastic behavior. Credit Laurent Eyer and Nami Mowlawi Université de Genève_Some sources are intrinsically variable while others are extrinsic they vary not because they the source itself has some fundamental physical property that causes them to vary but rather because of extra attributes e. _Figure 6 A prism dispersing light creating a spectrum open access jpeg. corresponding to longitude and latitude on the Earth. Light Curves Time series of Brightness of Astronomical Sources section1b 1c. Because of this difference imaging techniques objects have to have changed significantly with respect to the template to be detected by LSST. As we look to farther horizons to determine the expansion history of the Universe takes the equations of Einstein s General Theory of Relativity. The original version of this kernel is available as a Jupyter Notebook on LSST DESC GitHub. But just as with this challenge there s a solution that involves getting images through broad passbands and extracting ratios of brightness in different passbands to get an estimator of the redshift. _It ll likely answers questions we don t even know to ask yet. 2 gigapixel camera and a similar field of view to LSST but is a much smaller telescope. You can see the properties of the two sets of images are different. Eclipsing binaries are still called Algol type stars some times but note that they look really different from the bottom two panels and if you look at the x axis on the horizontal panel you ll notice that the characteristic time scale there is much different from the rest of them And you have more information than just the one time series. LSST will repeat this cycle returning to the original filter on the original patch of sky 1 2 weeks later. The two rows correspond to roughly the r filter and the i filter. rotation or forming part of a binary system that just happens to eclipse along our line of sight from Earth. While there s no practical way to cover all of the background astrophysics in a single Kernel there should be enough relevant material to tackle the challenge. These coordinates are supplied in the ra and decl columns of the metadata table. Even the biggest spectrographs with optical fibers dedicated to each sources can only manage a few thousand sources at most. Galactic CoordinatesRA and Dec are equatorial coordinates a coordinate system where the Earth s equator is extended outwards into infinity and splits space into an imaginary north and south hemisphere. In a companion Kernel plasticc_classification_demo we ll build a toy classifier on the challenge data and introduce some of the useful packages astronomers use to tackle this problem. The difference is even more stark when compared against telescopes that are both smaller and have smaller FoVs like most everything astronomers have access to now. Hubble did this by measuring the distances to these galaxies using a special class of variable stars called Cepheids see that figure from Popular Science Monthly again for an example that have a relation between their period and how intrinsically bright they are. You can watch a video about how we do it here. You can learn more about it here. _There s a lot that we can get out of understanding the time domain of our Universe. LSST based on Chile views the southern sky. we ll get to that in a bit. Still it s a fairly reliable way to extract a period from an irregularly sampled recurring time series. You will not need to correct the light curves anymore but you might be able to use this piece of metadata to distinguish some populations from others using clustering techniques for instance. _Figure 16 The ligt curve of FAKE030 looks a bit more messy. To do well in PLAsTiCC though you ll have to classify everythingYou can even expect sources in the test set that aren t in the training set we expect to find new classes of objects with LSST that we ve never seen before and we ve simulated light curves based on theoretical predictions of how they ought to look Your mission should you choose to accept it is to classify the things that go bump in the night. Historical parenthetical See Milone and Young 2008 Sec. If you want another time format like UNIX time which counts decimal seconds from a reference date of Jan 1st 1970 then it s easy to convert between the two. The third number we use to locate objects in 3D space isn t even a distance from the origin it s a speed We call it the redshift. Credit Peter Challis Harvard CfA_ The left panel shows you how the supernova event looked while the right panel shows a plot of the brightness of the supernova measured using a process called photometry used to determine the light curve. That tells you they are within the galaxy and reduces the size of the possible models they might be but doesn t identify which is which that s still your challenge Most machine learning techniques will pick this feature of redshift up easily but you might use it to build separate classifiers for extragalactic and galactic sources if you like. The light from the supernova explosion changes with time and therefore so do the spectra. If we color the galaxies in the nearby Universe that we can see from Earth by redshift with a small telescope there are many sources that we can see with higher redshifts. We use a spherical coordinate system on the sky with the positions of stars indexed by a two tuple that describes where they were on the 1st of January in the year 2000. Comparing how the galaxy looks in this projection should help make sense of the otherwise weird looking pattern of observations that LSST plans to obtain _Figure 20 The LSST minion 1016 exposure map in celestial coordinates. Measuring this expansion history takes bright sources that we can determine the distance to like those type Ia supernovae like SN1998bu. We ve done a lot in 80 years The teams that discovered this won the Nobel prize for their work in 2011. _ ANOTHER IMPORTANT NOTE _The training set has spectroscopic redshifts for all sources. This pattern of how a telescope observes the night sky is called the cadence and it has a large effect on how well the light curve of an astrophysical source is sampled. A view of our cosmic neighborhood section4d 4e. _Figure 22 Redshift is a measure of how fast a distant source with more distant on the top is moving relative to us along the line of sight and is determined from how much the wavelength or alternately the frequency of the absorption and emission lines of atoms change relative to what we see here on Earth bottom panel _Redshift is so named because if you take the light from distance astrophysical sources and pass it through a prism you see the same atomic fingerprint of elements and molecules you find here on Earth. We use spectrographs instruments that much like a prism disperse a beam of light spreading different colors over position to study astrophysical sources. You can see it with your own eyes from a dark site in the southern hemisphere. Light Curves Time series of Brightness of Astronomical SourcesScanning the entire sky repeatedly means we can identify astrophysical sources in the night sky that change in brightness over time and we can create a plot of the the brightness vs time. Coordinates on the Sky section4a 4b. object_id gives you that index. These simplifications will make it easier to work with and highlight some of the issues you ll encounter will the full dataset. The UNIX epoch in MJD is 40587 or JD 2440587. Here s an incomplete tree diagram of the various kinds of variable sources in the night sky _Figure 5 The hierarchy of variable and transient sources. On any given night LSST will begin by taking a picture of one patch for 15 30 seconds long the results from PLAsTiCC might help decide the exposure time. That wouldn t be a bad idea for type Ia supernovae but of course not everything in the dataset is a supernova. the wavelength of light hasn t exactly changed much. At present we classify the sources not using just their light curves but using more detailed follow up with other telescopes. The Large Synoptic Survey TelescopePLAsTiCC is intended to simulate sources that vary with time in the night sky as seen during the first three years of operation of the Large Synoptic Survey Telescope LSST. Those pixel numbers may not seem all that meaningful without a reference so here is the LSST field of view FoV compared against the full moon and a similar class telescope _Figure 2 The LSST Field of View compared to a camera on a similar telescope and the Moon. If you watched that video of the supernova video carefully you ll have noticed that there s actually two traces of the brightness one that covers the optical and one that covers the infrared. Flux and Flux ErrorThe last two columns in this file are named flux contains the actual photometry the measurements of brightness of this source as a function of time. The first widely known measurement of this expansion rate came two years later from Edwin Hubble who showed definitely that the further galaxies were from our own the faster they were moving away. Flux and Flux Error section2c 3. You saw that different kinds of supernovae have different spectra. This linear relation between redshift and distance is approximate hence the sim sign. This is Hubble s plot of his measurements _Figure 26. Coordinates on the SkyThe next few columns of metadata are related to an object s position in our three spatial dimensions. Unlike other multi channel time series data you do not get all the other channels or passbands at once. If you look at the light curve below and compare it to the hand drawn diagram of variable stars from 1906 bearing in mind that it s period is a bit less than 12 hours you should be able to classify it pretty easily. Dust section4f 1. LSST will have a reference image for each position on the sky called a template. If you find this stuff fascinating you might want to read this. The same spectroscopy that is expensive and hard to get to classify transients which is the raison d être for PLAsTiCC in the first place. which is what you want to determine. LSST PLAsTiCC and You section1 1a. The DDFs will have more observations but cover a much smaller chunk of sky. These light curves have realistic time sampling and noise properties as well as realistic astrophysical effects for a variety of the sources in the variability tree. Which objects are in the WFD vs the DDF are specified by the ddf_bool column in the header 1 if in DDF 0 otherwise. This is entirely up to you and the two sets of objects are weighted exactly the same irrespective of which field they originated from. We call these time series light curves. Lets begin by looking at the format of the light curve and explaining what the columns are we ll get to the header in Section 3 The first of the columns is just the object_id. This is because of how we actually detect these sources against the background sky. You can get a clearer view of it from ESA s GAIA satellite without a coordinate grid on top. Here s an illustration of one of these source supernova 1998bu imaged with the 1. We don t provide another column for distance modulus that was derived from hostgal_specz but there s a lookup table included with the dataset if you need to compute this you probably don t. Here s a construction picture from August 2018 and it is looking a lot like the render at the top of this page _Figure 13 The LSST telescope under construction on Cerro Pachon in Chile Credit Gianluca Lombardi Gemini Observatory_ 2. That s it Phew It s the minimal bits of the astrophysics you may need to make sense of the data and start to tackle this challenge. If you can t see the stars on a cloudy night then it s probably not good conditions to try and get a spectrum. General relativity in the expanding Universe gives us a time machine. Yet others like supernovae typically explode once and fade away. The test set does not have spectroscopic redshifts for all sources. It s got a characteristic time scale but you wouldn t know it from a simple light curve plot. You might even be able to spot some galaxies in the northern hemisphere but remember the sky in galactic coordinates doesn t look like the sky you d see from Earth The redshift of the Large Magellanic Cloud is a whopping 0. We can use a Fourier technique known as the Lomb Scargle Periodogram to estimate the characteristic scale at least given some search range. It is for want of a better word ginormous. Indeed variable stars were the first example of astronomers using light curve shapes for classification. The 68 confidence interval of the measurement is in the flux_err column. This Kernel does not need the actual challenge data. you could narrow the search range a bit if you knew something about the astrophysical class of the object of interest. You may wish to treat the DDF and WFD objects separately and build different sorts of classifiers for them. The photometric redshift is sometimes wrong. This is also the same character as the z passband in LSST and other surveys but the two aren t related. We hope you have fun and we look forward to your submissions remember your work will influence the entire LSST project. _Figure 24 The low redshift Universe Credit Tom Jarrett IPAC Caltech_Our spectrographs are sensitive enough for it to have been possible to measure these redshifts even a century ago. This is where PLAsTiCC and you come in. But if we re talking about objects in the distant Universe it makes sense to not make the Earth the center of it. Each filter is a summing the total amount of light in one small region of the spectrum so you can t measure narrow atomic lines anymore but you can get many more light curves in the time it takes to get one spectrum. Folding the observations to this period takes that noisy time series and shows you some of the structure in the data. You can win prizes eternal glory and the satisfaction of knowing that you made a real impact and a valuable contribution to the biggest astrophysical experiment to ever be attempted There s not much time too LSST is coming up fast. Other fields have similar issues if we wanted to uniquely identify a human being for instance we could test a DNA sample but that d be completely impractical given the number of people we encounter. It s much much bigger than the training set. You ll have to design your algorithm with speed as a consideration. in addition to taking much longer to collect enough photons to have a statistically significant measurement. These two angles are called the Right Ascension R. Therefore in the header you get two redshifts hostgal_specz is the spectroscopic redshift of the host galaxy of an event while hostgal_photoz is the photometric redshift of the host galaxy. You could potentially try to use the training set together with the subset of the test data that does have both spectroscopic and photometric redshifts to make a better redshift predictor if you like or you could ignore it altogether. Consequently the light curves will have better sampling and potentially be found farther away in our Universe but there s fewer objects. We try to obtain a spectrum close to when the object is brightest but often we can t schedule a telescope in advance exactly then and even when we do the weather might not cooperate. hopefully things are beginning to fit together and this is giving you a sense for the big picture You might prefer to have the y axis called the distance modulus related to the base 10 logarithm of the luminosity distance rather than the redshift provided in hostgal_photoz. com articles nature11643_The light curves of these explosive transients can look radically different from the light curves of periodic variables. This is also in the lookup table. relative to one of those full moons _Figure 3 The Hubble Space Telescope s field of view compared to the Moon_Hubble isn t just looking at a smaller piece of sky it is also collecting light from this region much more slowly than LSST. It s intended to provide some domain knowledge to data scientists taking part in the challenge and may even prove useful to some of the astronomers competing. The PLAsTiCC Astronomy Starter Kit Gautham Narayan 20180831This kernel was developed for PLAsTiCC on Kaggle. The passbands that LSST will use are called u g r i z and y. The time series of these change in brightness. So they did the simple thing and made the reference date of the VAX VMS system the same as the reference date for their new time system creatively named the Modified Julian date and consequently most of astronomy. You can also safely ignore it and dive right in and do things your own way. The other reason why this is using example data and not the training data supplied with the challenge is that we ve identified the target classes in the challenge with random integers. _Figure 17 The folded light curve of FAKE030 after determining a period using the Lomb Scargle algorithm_This folded curve is suitable for feature extraction but we don t a priori know what objects have periodic structure and which ones don t. It s not the physical motion of the sources that is causing the change in frequency but rather the expansion of the Universe itself that the space between us and the source is stretching Your PLAsTiCC dataset will include objects up to a redshift of 3. _This is the most reliable method for determining what a point of light in the night sky actually is and there s a ton of information you can get from it. _Dispersing the light like this is called spectroscopy and allows us to look for characteristic atomic signatures from astrophysical sources. Hubble was using visual inspection for classification Credit Carnegie Observatories_Measure the period of a Cepheid and you figure out how bright they are supposed to be. This isn t all that different from the Doppler shift of the sound of an ambulance or police siren moving across you it ll increase in frequency as the vehicle approaches you and decrease in frequency as it moves away. object_id is a simple integer ID number that uniquely identifies each object and corresponds to the object s ID in the light curve files but the rest might not be familiar. ", "id": "michaelapers/the-plasticc-astronomy-starter-kit", "size": "47594", "language": "python", "html_url": "https://www.kaggle.com/code/michaelapers/the-plasticc-astronomy-starter-kit", "git_url": "https://www.kaggle.com/code/michaelapers/the-plasticc-astronomy-starter-kit", "script": "__init__ display LightCurve(object) displayimage OrderedDict collections numpy scipy.stats PIL displayimageconverted get_features IPython.core.display Image matplotlib.pyplot _finalize plot_multicolor_lc astropy.table gatspy.periodic LombScargleMultiband HTML Table ", "entities": "(('how they', 'Galaxy'), 'rotate') (('gigapixel 2 that', 'night sky'), 'camera') (('Consequently light curves', 'potentially farther away Universe'), 'have') (('it', 'frequency'), 't') (('com articles', 'periodic variables'), 'look') (('pattern', 'LSST observations'), 'get') (('LSST', 'sky'), 'have') (('too where telescope', 'sky'), 'follow') (('increase', 'time'), 'suggest') (('we', 'Sun'), 'use') (('it', 'much more slowly LSST'), 'relative') (('where D', 'dot cdot multiplication times operator'), 'H_0') (('others', 'supernovae'), 'explode') (('Astronomers', 'stars'), 'map') (('we', 'Relativity'), 'take') (('it', 'initially then fainter'), 'see') (('You', 'time scale'), 'figure') (('Milky Way', 'graceful arc'), 'right_ascension') (('it', 'different colors'), 's') (('you', 'classification'), 'have') (('you', 'time just one series'), 'call') (('light', 'therefore so spectra'), 'change') (('us', 'astrophysical sources'), 'call') (('_', 'LSST event rate'), 'take') (('We', 'often terms'), 'refer') (('where plane', 'equatorial plane'), 'be') (('view', '4e'), 'section4d') (('you', 'training set'), 'give') (('we', 'Universe'), 's') (('1970 then it', 'two'), 'want') (('_ IMPORTANT training set', 'sources'), 'another') (('techniques imaging objects', 'LSST'), 'have') (('linear relation', 'redshift'), 'be') (('we', 'Milky Way'), 'describe') (('that', 'infrared'), 'notice') (('though so it', 'cases'), 'note') (('it', 'one spectrum'), 'be') (('same technique', 'astronomical images'), 'be') (('eyes', 'well range'), 'be') (('already this', 'animation'), 'begin') (('that', 'Earth'), 'rotation') (('map', 'instance'), 'notice') (('that', 'different passbands'), 'use') (('much prism', 'astrophysical sources'), 'use') (('view', 'galactic coordinates'), 'notice') (('Wiki', 'Credit 18 Equatorial https'), 'have') (('right panel', 'light curve'), '_') (('t', 'likely questions'), '_') (('flux', 'more definition'), 's') (('LSST', 'exposure time'), 'begin') (('this', 'column'), 'provide') (('It', 'actually distances'), 's') (('we', 'time'), 'series') (('i', 'roughly r filter'), 'correspond') (('2018 it', 'Chile Credit Gianluca Lombardi Gemini Observatory'), 's') (('we', 'decimal day'), 'be') (('40587 times 86400 where 86400', '24 hours'), '5') (('hostgal_photoz', 'host photometric galaxy'), 'get') (('we', 'spectroscopy'), 'classify') (('Universe', '1927'), 'notice') (('astronomers', 'events'), 'present') (('coordinates instead equatorial these', 'columns gall'), 'prefer') (('that', 'isotropic directions'), 'be') (('General relativity', 'time machine'), 'give') (('objects', 'don t.'), 'Figure') (('gets', 'source'), 'depend') (('_ Figure', 'Credit Daniel Kasen UC Berkeley'), 'label') (('This', 'column'), 'call') (('you', 'priori'), 'depend') (('We', 'we same behavior'), 'move') (('Julian Date', 'noon'), '5') (('we', 'access'), 'come') (('how well light curve', 'astrophysical source'), 'pattern') (('s', 'light curves'), 'get') (('v_r', 'recession light'), 'convert') (('things', 'therefore Universe'), 'Figure') (('that', 'redshift'), 's') (('You', 'rather hostgal_photoz'), 'begin') (('astronomers', 'problem'), 'build') (('confidence 68 interval', 'flux_err column'), 'be') (('you', 'data full set'), 'include') (('yet so we', 'LSST t real data'), 'base') (('more we', 'space'), 'scatter') (('that', '2011'), 'do') (('current images', '2007'), 's') (('that', 'human hair'), 'distinguish') (('faster they', 'own'), 'come') (('how long it', 'took'), 'fix') (('Here visual timeline', 'Universe _ Figure'), 's') (('just expansion', 'something'), 'discover') (('Most astronomers', 'objects'), 'specialize') (('properties', 'images'), 'see') (('redshift', 'letter z.'), '_') (('Here illustration', '1'), 's') (('It', 'better word'), 'be') (('work', 'LSST entire project'), 'hope') (('how they', 'Cepheid'), 'use') (('taking', '0'), 'report') (('object', 'passband'), 'have') (('how we', 'it'), 'watch') (('LSST', 'LSST exposure 20 minion 1016 celestial coordinates'), 'help') (('Indeed variable stars', 'classification'), 'be') (('that', 'Large Synoptic Survey Telescope LSST'), 'intend') (('you', 'here Earth'), 'be') (('correction isn t we', 'sight'), 'call') (('VAX VMS too system', 'so far past'), 'need') (('less than so you', 'just weight'), 'warn') (('vast majority', 'them'), 's') (('us', 'fainter sources'), 'be') (('This', 'expansion'), 'be') (('you', 'this'), 'want') (('You', 'top'), 'get') (('we', 'random integers'), 'be') (('Flux last two columns', 'time'), 'Flux') (('farther we', 'further back time'), 'look') (('they', 'different classes'), 'help') (('rest', 'curve light files'), 'be') (('isn t', 'challenge'), 'be') (('we', 'contextual information'), 'have') (('_ ligt 16 curve', 'FAKE030'), 'Figure') (('it', 'Universe'), 'don') (('that', 'similar telescope'), 'seem') (('we', 'people'), 'have') (('where you', 'it'), 'obscure') (('UNIX epoch', 'MJD'), 'be') (('Julian Historical original which', 'Jan'), 'parenthetical') (('that', 'night'), 'expect') (('very it', 'instance'), '_') (('Even biggest spectrographs', 'only a few thousand sources'), 'manage') (('JPL Caltech_Of course', 'dust isn t single 3D structure'), 'drive') (('wavelength', 'hasn light t'), 'change') (('where they', 'year'), 'use') (('that', 'quite other'), 'have') (('next few columns', 'three spatial dimensions'), 'coordinate') (('How Astronomers', 'Astronomical Sources Thus Far 1d'), 'study') (('everything', 'dataset'), 'be') (('how cosmological redshift', 'Doppler effect'), 'be') (('LSST', 'that'), 'call') (('coordinates', 'metadata table'), 'supply') (('Still it', 'recurring time irregularly sampled series'), 's') (('we', 'other telescopes'), 'classify') (('We', 'search at least range'), 'use') (('image', 'source'), 'include') (('rather where it', 'object'), 'be') (('LSST', 'first place'), 'simulate') (('data', 'rays asteroids airplane cosmic contrails'), 'combine') (('Hubble', 'time'), 'find') (('giant it', 'same time'), 'be') (('how you', 'sky'), 'make') (('you', 'other channels'), 'get') (('redshift', 'Large Magellanic Cloud'), 'be') (('they', 'good reasons'), 'go') (('challenge supernovae also new aren', 'night sky'), 'present') (('even more we', 'more sensitive only dust'), 'become') (('This', 'LSST'), 'be') (('then it', 'probably good spectrum'), 'see') (('it', 'light'), 'appear') (('they', 'plane'), 'be') (('It', '15 then another 30 second picture'), 'take') (('It', 'training much much set'), 's') (('they', 'negative flux'), 'have') (('BinariesThe diversity', 'sources'), 'be') (('you', 'one object'), 'get') (('t', 'always photometric redshift'), 'notice') (('also they', 'different light curves'), 'mean') (('You', 'right in things'), 'ignore') (('target number', 'astrophysical class'), 'say') (('periodically others', 'random behavior'), 'vary') (('ever much time too LSST', 'valuable biggest astrophysical experiment'), 'win') (('that', 'length'), 'mean') (('Additionally extragalactic sources', 'host own galaxies'), 'suffer') (('gigapixel 2 camera', 'LSST'), 'be') (('AURA Todd Mason Productions Inc_The telescope', '3'), 'Figure') (('you', 'fuzzy galaxy'), 'have') (('it', 'template'), 'difference') (('that LSST', 'image'), 'be') (('LSST', 'sky'), 'repeat') (('Still you', 'object'), 'look') (('Earth', 'it'), 'make') (('even when it', 'sky'), 'have') (('Here hand drawn illustration', '1906 page'), 's') (('different kinds', 'different spectra'), 'see') (('IPAC Caltech_Our enough it', 'redshifts'), 'Figure') (('you', 'challenge'), 's') (('he', 'it'), 'call') (('periodically they', 'others'), 'exhibit') (('bit you', 'interest'), 'narrow') (('_ 10 Atlas', 'C.'), 'Figure') (('LSST Deep Drilling main few small where LSST', 'specialized scientific studies'), 'simulate') (('about 163 miles 262 km', 'light'), 's') (('This', 'purely computed convenience'), 'be') (('you', 'issues'), 'make') (('which', 'photometric redshift'), 'give') (('We', 'it'), 'number') (('observation', 'mjd'), 'tell') (('Active galactic nucleii massive black holes', 'behavior'), 'exhibit') (('you', 'extragalactic sources'), 'tell') (('next night it', 'different passband'), 'come') (('LSST', 'below 8'), 'be') (('Many', 'back 1917'), 'measure') (('Folding', 'data'), 'take') (('them', 'attributes rather extra e.'), 'vary') (('so flux entries', 'zero'), 'fade') (('how we', 'background sky'), 'be') (('we', 'questions'), 'have') (('you', 'curve simple light plot'), 'get') (('So they', 'consequently astronomy'), 'do') (('things', 'red frequencies'), 'shift') (('Historical parenthetical', 'Milone'), 'See') (('You', 'consideration'), 'have') (('where equator', 'imaginary north hemisphere'), 'be') (('That', 'fair fields'), 'let') (('light curves', 'variability tree'), 'have') (('you', 'it'), '_') (('accurately we', '_ spectroscopy _'), 'need') (('we', 'observational data'), 'study') (('do', 'weather'), 'try') (('it', 'even plot'), 'cover') (('you', 'family friends'), 's') (('test set', 'sources'), 'have') (('you', 'probably t.'), 'don') (('detected', 'detected_bool'), 'report') (('blob below right', 'Magellanic companion Milky Large Way'), 'Figure') (('which', 'first place'), 'spectroscopy') (('Other variable stars', 'binaries'), 'be') (('space', '3'), 's') (('anymore you', 'instance'), 'need') (('we', 'LSST operations'), 'be') (('LSST', 'southern sky'), 'view') (('It', 'astronomers'), 'intend') (('also we', 'Universe'), 'tempt') (('this', 'pluses'), 'give') (('bit less than 12 you', 'it'), 'be') (('signal', 'different full sample'), 'be') (('i', 'infrared'), 'map') (('Galactic sources', 'extragalactic sources'), 'say') (('all', 'curve same general light shape'), 'determine') (('how intrinsically they', 'period'), 'do') (('LSST', 'that'), 'get') (('This', 'measurements'), 'be') (('we', 'November'), 'call') (('3 first', 'columns'), 'begin') (('Kernel', 'challenge actual data'), 'need') (('you', 'it'), 'try') (('that', 'Classification Challenge Kaggle'), 'provide') (('pretty well so we', 'exactly 0'), 'say') (('you', 'distance'), 'measure') (('You', 'them'), 'wish') (('positive that', 'flux entries'), 'have') (('which', '1'), 'make') (('DDFs', 'sky'), 'have') (('Glass Hubble Plate', 'corner'), 'notice') (('1 000 object_id 000', 'DDF'), 'note') (('mirror 4 meter primary diameter', 'mountain'), 'build') (('astronomers', 'access'), 'be') (('they', 'exactly same field'), 'be') (('are', '1 DDF'), 'specify') (('we', 'at least 3 spatial dimensions'), 'be') (('sources', 'greater than one i.'), 'timeline') (('you', 'training nice homogeneous set'), 'be') (('you', 'photometry'), 'need') (('original version', 'LSST DESC GitHub'), 'be') (('that', '9 light eclipsing binary system'), 'be') (('tree Here incomplete diagram', '_ 5 variable sources'), 's') (('You', 'southern hemisphere'), 'see') (('That', 'US about 1 Congress'), 's') (('we', 'higher redshifts'), 'be') (('we', 'SN1998bu'), 'take') (('it', 'instance'), 'be') (('massive stars', 'how much Universe'), 'be') (('PLAsTiCC Astronomy Starter Kit Narayan 20180831This kernel', 'Kaggle'), 'the') ", "extra": "['test']"}