{"name": "vinbigdata 2 class classifier complete pipeline ", "full_name": " h1 VinBigData 2 class classifier complete pipeline h1 Table of Contents h1 Dataset preparation h1 Installation h1 EDA distribution between normal abnormal class h1 Image visualizaion augmentation with albumentations h1 Defining CNN models h1 Training utils h1 Training scripts h2 Preparing data by 5 fold cross validation h2 Write training code h1 Prediction on validation test dataset h1 Apply 2 class filter on detection prediction h3 If this kernel helps you please upvote to keep me motivated Thanks h1 Next step h2 Using other datasets h1 Next to read ", "stargazers_count": 0, "forks_count": 0, "description": "This Flags class summarizes all the configuratoin available during the training. org tutorials beginner finetuning_torchvision_models_tutorial. At first I will define pytorch Dataset class for this competition which can be also used later in the training. Prediction on validation test dataset Apply 2 class filter on detection predictionI will use detection prediction from the kernel VinBigData detectron2 train https www. com c vinbigdata chest xray abnormalities detection discussion 208837 1139712 using multi label stratified kfold https github. However it is mentioned that training 2 class classifier to understand which is the normal image is important to get high score. com corochann vinbigdata detectron2 train currently only uses abnormal image during training and model tend to produce more abnormal boxes. You can try changing training configurations by just changing Flags flags_dict configuration. pt every epoch Check Save best validation predictor. 95 You can load from another submission. com pytorch ignite Traning Evaluation abstraction framework on top of pytorch. Write training codepytorch ignite pytorch pfn extras are used here. pt every epoch manager. However you need to be careful that 3 radiologists annotated for each image so you can find 3 annotations as you can see below. com c vinbigdata chest xray abnormalities detection discussion 207955. read_csv imgdir test_meta. You can obtrain training history results really easily by just accessing LogReport class which is useful for managing a lot of experiments during kaggle competitions. even if it is generated from the same image Extend to more general form Augmentation is very important hyperparameter to improve model s performance and you want to experiment with various configurations. Also further improvement using ChExpert dataset is mentioned at Next step section Note Actually there is on going discussion 1 step training prediction https www. com corochann vinbigdata detectron2 prediction kernel explains how to use trained model for the prediction and submisssion for this competition. parameters lr 1e 3 Train setup HACKING report ema value with prefix. 221 So the score improved by about 0. io pytorch image models feature_extraction Assumes first argument is image NOQA Flag to manage which parameter is assigned. bbox_original int row x_min int row y_min int row x_max int row y_max test_meta pd. com pfnet pytorch pfn extras It is used to add more feature rich functionality on Ignite. org stable modules generated sklearn. Kernel VinBigData 2 Class Filter https www. 15 rotate_limit 10 p 0. Note Why training abstraction library is used You may feel understanding training abstraction code below is a bit unintuitive compared to writing raw training loop. Overwrite by param_dict Change to True for fast debug run Data Model Training 15000 15 epoch batchsize 8 args parse Read data Read in the data CSV files sample_submission pd. We could confirm that always 3 radiologists opinions match for normal abnormal diagnosis. 141 Just replace by threshold version3 https www. snapshot_freq iteration lr scheduler Exponential moving average Prediction valid data test data Test dataset prediction result pred_2class pd. Training epoch batch_size scheduler_type etc Try changing these hyperparamters to see the difference Augmentation Please modify Transform class to add your augmentation it s easy to support more augmentations with albumentations library. com corochann vinbigdata detectron2 train. The paper of this competition dataset VinDr CXR An open dataset of chest X rays with radiologist s annotations. com corochann vinbigdata detectron2 prediction scriptVersionId 52412540 score 0. As I will show later you can change various hyperparameters to experiment improving your models EDA distribution between normal abnormal classAt first let s check how many normal class exist in the training data. com corochann vinbigdata detectron2 train kernel explains how to run object detection training using detectron2 library. 0 which means always add No finding prediction with the predicted probability. What kind of models are supported in the timm library Wow more than 300 models are supported It of course includes resnet related models efficientnet etc. You can just copy these to use in other projects. We can usually obtrain more stable models with EMA. 155 baseline solution https www. UPDATE 2021 2 6 I added submission procedure using 2 class classification prediction result. no need to explain detail albumentations https github. 5 Blur blur_limit 3 7 p 0. Run evaluation for valid dataset in each epoch. According to this discussion https www. You may wonder which model should be used I will go with resnet18 as a baseline at first and try using more deeper latest models in the experiment. Useful for logging printing evaluating saving the model scheduling the learning rate during training. report see LyftMultiRegressor for reporting point method and save to log file. html normal configuration. You can focus on more about looking data and try experiment now. VinBigData detectron2 prediction https www. Below updated Transform function is written to support all the augmentations implemented in albumentations. Model model_name You can try various kinds of models timm library support by just changing model_name. You don t need to write code for saving models logging training loss metric show progressbar etc. Training utilsHere are training util methods. pytorch ignite https github. Apply mixup augmentation when positive value is set. Using other datasets There are several other X ray images in this research field. read_csv datadir sample_submission. io competitions chexpert is one of the biggest dataset in this area. Add keep det preds and add normal pred. com awsaf49 vinbigdata 2 class filter Discussion LB0. com c vinbigdata chest xray abnormalities detection discussion 211971 Here I will propose new post processing similar to this https www. com pytorch pytorch Deep learning framework it s popular among researchers for its flexible usage. When False original model s parameter is used. com c vinbigdata chest xray abnormalities detection discussion 208837 Here I will introduce complete EDA Training with 5 fold cross validation and Prediction pipeline for training 2 class classifier. It makes interpolation of 2 images with the label is also modified according to the mix ratio. Only 30 of the images need thoracic abnormality location detection. We can follow installation instruction https github. PrintReport PrintReportNotebook Prints the value which LogReport collected in formatted style. Here I will just use the dataset VinBigData Chest X ray Resized PNG 256x256 https www. 5 CoarseDropout max_holes 8 max_height 25 max_width 25 p 0. That s all If this kernel helps you please upvote to keep me motivated Thanks Next stepI explained EDA Training Prediction pipeline for 2 class image classification in this kernel. 6 Defining CNN modelsRecently several libraries of CNN collection are available on public. Because it can make combination of any 2 images instead of just using 1 image. p Do nothing Keep det prediction. You can try more deeper models decrease data augmentation or using more rich data high resolution image. Load 1 image to get image size. get_n_splits None None 0th fold optimizer optim. 5 ShiftScaleRotate scale_limit 0. com trent b iterative stratification may be more stable. ProgressBar update_interval 10 if debug else 100 Show progress bar during training E. Even if local label for detection is not available it helps to create more accurate model by combining to use this dataset. Here I will use StratifiedKFold https scikit learn. com corochann vinbigdata detectron2 train VinBigData detectron2 prediction https www. 0 high_threshold 0. pytorch pfn extras https github. LogReport Logging metrics reported by ppe. observe_lr LogReport will check optimizer s learning rate using this extension. p Keep Do nothing Keep det prediction. So it may be okay to set low_threshold 0. Check training loss validation loss difference If validation loss is very high compared to training loss it is a sign of overfitting. html to keep the balance between normal abnormal ratio same for the train validation dataset. 5 Downscale scale_min 0. Here cosine annealing is applied configured by Flags by calling scheduler. PrintReport Print log to terminal Stop training when nan is detected. md we need to know CUDA and pytorch version to install correct detectron2. You can specify aug_kwargs from external configuration inside flag as follows aug_kwargs HorizontalFlip p 0. I explained how to train detection model in the kernel VinBigData detectron2 train https www. It is classified as class_name No finding and class_id 14. Now creating the dataset is just easy as following You can access each image and its label 0 Normal 1 Abnormal by just access dataset with index. com facebookresearch detectron2 blob master INSTALL. To run augmentation on this image I will define Transform class which is applied each time the data is accessed. com corochann vinbigdata detectron2 prediction And 2class prediction is updated as dataset vinbigdata 2class pred https www. This may be because my training kernel https www. com albumentations team albumentations Image augmentation library developed by famous kagglers timm https github. com c vinbigdata chest xray abnormalities detection discussion 207955 by xhlulu. train all parameters. 230 low_threshold 0. com c vinbigdata chest xray abnormalities detection discussion 211971 1157809 by pestipeti Here p is the normal probability. 5 RandomBrightnessContrast p 0. record image_id index objs record annotations objs 0 normal 1 abnormal Only return img Only return img Each time the data is accessed the result is different due to random augmentation We do not learn CNN parameters. As mentioned in VinBigData 2 Class Filter https www. Note I noticed that it does not apply for the other classes. It automatically collects reported value in each iteration and saves the mean of reported value for regular frequency for example every 1 epoch. Even you quit training using Ctrl C without finishing all the epoch the intermediate trained model is saved and you can use it for inference. snapshot_object predictor best_predictor. com xhlulu vinbigdata chest xray resized png 256x256 to skip the preprocessing and focus on modeling part. UPDATE 2021 2 10 I added mixup augmentation and label smoothing explanation. Label smoothing changes its label 0 0. print row print row class_name class_name row class_name It is No finding This annotator does not find anything skip. low_threshold Just Add Normal prediction keep detection prediction. 053 just adding 14 1 0 0 1 1 https www. 8 which is significant In more detail I tried to change several low_threshold value and lower low_threshold achieved better results. 3 RandomGamma gamma_limit 80 120 p 0. 0 remove all detection predictoin. com awsaf49 vinbigdata 2 class filter by awsaf49 applying 2 class filter improves LB score significantly. You don t need to impelment deep CNN models by yourself you can just re use latest research results without hustle. read_csv inputdir vinbigdata 2class prediction 2 cls test pred. You can register your name and E mail address to Download this Dataset Next to read VinBigData detectron2 train https www. When True assign method is called shadow parameter ema param is used. com corochann vinbigdata 2 class classifier complete pipeline to train these 2 class classifier model In my experiment The baseline submission score 0. The advantage of abstracting the code is that we can re use implemented handler class for other training other competition. pt trigger MinValueTrigger validation module nll trigger flags. com c vinbigdata chest xray abnormalities detection discussion 219672 which suggests the way only using detection model while keeping performance almost same with this kernel. normal configuration. I ll show examples to use Albumentations to run image augmentation very easily. So the question arises is there an image that the 3 radiologists opinions differ Let s check number of No finding annotations for each image if the opinions are in complete agreement the number of No finding annotations should be 0 Abnormal all radiologists does not think this is normal or 1 Normal all radiologists think this is normal. com ja jp photo 4989186 VinBigData 2 class classifier complete pipelineThis competition is object detection task to find a class and location of thoracic abnormalities from chest x ray image radiographs. You can learn the usage of following tools to accelerate deep learning tasks in computer vision pytorch https github. com corochann vinbigdata2classpred. pdf summarizes the existing public datasets. I will use timm this time. Please upvote the dataset as well Installationdetectron2 is not pre installed in this kaggle docker so let s install it. By smoothing the label the loss surface becomes more soft and sometimes model can learn well. You can see each image looks different rotated brightness is different etc. I also added label smoothing feature. step every iteration. Update Here I mixup augmentation in the dataset. png CheXpert https stanfordmlgroup. Note I also wrote another kernel to train 2 class model VinBigData 2 class classifier complete pipeline https www. com download storage v1 b kaggle forum message attachments o inbox 2F518134 2F68421364ae2731375c0f59fd1749c845 2Fpexels ivan samkov 4989186. com albumentations team albumentations page that various kinds of augmentation is already implemented and can be used very easily To use augmentation you can just define dataset with the Transform function. pfnet pytorch pfn extras https github. So you can follow how the learning rate changed through the training. low_threshold Add Just Add Normal prediction 3. Let s visualize looks good. Training scripts Preparing data by 5 fold cross validationWhen we have few data running stable evaluation is very important. mixup augmentation is expecially useful when the number of data is limited. 206 This post process combine replace add 0. For example you can change these paramters Data imgdir_name You can use different preprocessed image introduced in Multiple preprocessed datasets 256 512 1024px PNG and JPG modified and original ratio https www. So almost 70 of the data is actually Normal X ray images. You can refer albumentations https github. log_trigger 10 if debug else 1000 iteration Show progress bar during training Show log on jupyter notebook E. Image visualizaion augmentation with albumentationsWhen you train CNN models image augmentation is important to avoid model to overfit. Replace remove all det preds. Try using smaller models increase data augmentation or apply regularization dropout etc. jpg generation 1611197793386796 alt media Image from https www. My basic strategy is as follows Check training loss training accuracy If it is almost same with validation loss accuracy and it is not accurate enough model s representation power may be not enough or data augmentation is too strong. Sometimes it is difficult to learn label is 0 1. com pfnet pytorch pfn extras It provides several extensions useful for training. Please upvote his kernel as well Also it is mentioned that we can submit 14 prob 1 1 0 0 where the prob is the normal probability in the discussion Scoring bug Improve your LB score by 0. com pytorch ignite It provides abstraction for writing training loop. com corochann bengali seresnext training with pytorch Lyft Training with multi mode confidence https www. Such many functionalities can be added easily using extensions Also Exponential Moving Average of model weights is calculated by EMA class during training together with showing its validation loss. https rwightman. Table of Contents Dataset preparation dataset Installation installation EDA distribution between normal abnormal class eda Image visualizaion augmentation with albumentations aug Defining CNN models model Training utils trainutil Training scripts trainscript Prediction on validation test dataset prediction Next step nextstep Dataset preparationPreprocessing x ray image format dicom into normal png image format is already done by xhlulu in the below discussion Multiple preprocessed datasets 256 512 1024px PNG and JPG modified and original ratio https www. com corochann lyft training with multi mode confidence So what is happening in above training abstraction Let s understand what each extension did. LRScheduler You can insert learning rate scheduling with this extension together with the regular interval call specified by trigger. png attachment image. Also I think it s nice to try including No finding class during detection training by adding virtual No finding boxes or by adding global classifier together with the detection. 3 radiologists opinions sometimes do not match for the other class of thoracic abnormalities. These are done by provided util classes in pytorch pfn extras library You may refer my other kernel in previous competition too Bengali SEResNeXt training with pytorch https www. Extensions Each role ProgressBar ProgressBarNotebook Shows training progress in formatted style. I also noticed that setting high_threshold value less than 1 is important which means we have a benefit to remove abnormality predictions for the images which is highly likely to be normal. I m now thinking that it s better to include normal images for training to learn where there is no abnormality. high_threshold Replace Replace with Normal prediction Keep do nothing. plotly models setup General Data config split_mode str all_train all_train or valid20 0 4 Model config normal cnn_fixed supported Training config negative value is to inactivate ema. Register model parameters alias skf. high_threshold Replace with Normal prediction with normal score 1. com rwightman pytorch image models pytorch image models it provides a lot of popular SoTA CNN models with pretrained weights. We can use cross validation to reduce validation error standard deviation. Here the model is saved in regular interval flags. snapshot_object Saves the object. Evaluator Evaluate on validation dataset. ", "id": "corochann/vinbigdata-2-class-classifier-complete-pipeline", "size": "17800", "language": "python", "html_url": "https://www.kaggle.com/code/corochann/vinbigdata-2-class-classifier-complete-pipeline", "git_url": "https://www.kaggle.com/code/corochann/vinbigdata-2-class-classifier-complete-pipeline", "script": "ignite.engine albumentations VinbigdataTwoClassDataset(DatasetMixin) EMA(object) optim BoxMode torch.nn plotly.graph_objs DatasetMixin(Dataset) pytorch_pfn_extras predict_proba field get_vinbigdata_dicts plotly.express typing sklearn.model_selection KFold pytorch_pfn_extras.training.manager save_yaml get_example Union __len__ __call__ Mapping get_vinbigdata_dicts_test load_state_dict detectron2.structures dataclasses torch.utils.data.dataloader seaborn numpy torch.utils.data.dataset logging tools build_predictor nn IPython.core.display CNNFixedPredictor(nn.Module) getLogger tqdm.notebook pandas Dataset PRIORITY_READER IgniteExtensionsManager create_trainer update plotly.figure_factory Classifier(nn.Module) HTML preprocessing display step plotly.offline eval_func pytorch_pfn_extras.training.extensions forward Flags Transform pytorch_pfn_extras.training.extension update_fn LRScheduler(Extension) plotly.io scipy pytorch_pfn_extras.training ExtensionsManager resume cross_entropy_with_logits dataclass __init__ torch lightgbm List Optional Engine _get_single_example predict accuracy Any Path DataLoader Linear Dict save_ema_model get_example_wrapper __getitem__ pathlib state_dict Events plotly Tuple sklearn assign matplotlib.pyplot Extension accuracy_with_logits tqdm subplots torch.nn.functional StratifiedKFold catboost xgboost ", "entities": "(('time data', 'Transform class'), 'define') (('com pfnet pytorch pfn It', 'Ignite'), 'extras') (('So it', 'low_threshold'), 'be') (('modelsRecently several libraries', 'public'), 'be') (('few data', 'stable evaluation'), 'script') (('2021 2 10 I', 'mixup augmentation'), 'UPDATE') (('You', 'Flags flags_dict just changing configuration'), 'try') (('LogReport Logging metrics', 'ppe'), 'report') (('you', 'hustle'), 'need') (('observe_lr LogReport', 'extension'), 'check') (('paper', 's radiologist annotations'), 'dataset') (('I', 'image augmentation'), 'show') (('Also further improvement', 'step training prediction https Actually discussion 1 www'), 'mention') (('1024px preprocessed 256 512 PNG', 'Multiple'), 'change') (('read_csv inputdir', 'cls 2class prediction 2 test'), 'vinbigdata') (('2021 2 6 I', 'submission procedure'), 'UPDATE') (('report', 'log file'), 'see') (('Flags class', 'available training'), 'summarize') (('You', 'computer vision pytorch https github'), 'learn') (('Next stepI', 'kernel'), 's') (('you', 'various configurations'), 'be') (('LogReport', 'formatted style'), 'Prints') (('ProgressBar ProgressBarNotebook Shows', 'formatted style'), 'extension') (('pdf', 'existing public datasets'), 'summarize') (('LRScheduler You', 'trigger'), 'insert') (('normal image', 'high score'), 'mention') (('you', '3 annotations'), 'need') (('Only 30', 'thoracic abnormality location detection'), 'need') (('learning how rate', 'training'), 'follow') (('I', 'class VinBigData class classifier complete pipeline https 2 model 2 www'), 'note') (('you', 'Transform function'), 'page') (('This', 'training kernel https www'), 'be') (('We', 'CNN parameters'), 'image_id') (('cosine Here annealing', 'scheduler'), 'apply') (('which', 'images'), 'notice') (('We', 'EMA'), 'obtrain') (('It', 'models efficientnet resnet related etc'), 'support') (('aug_kwargs HorizontalFlip', 'flag'), 'specify') (('class_name', 'finding'), 'classify') (('class Apply 2 filter', 'detectron2 train https VinBigData www'), 'prediction') (('epoch Check', 'validation best predictor'), 'pt') (('now it', 'training'), 'think') (('15000 15 epoch', 'Read data CSV 8 args files'), 'run') (('You', 'resolution more rich data high image'), 'try') (('it', 'overfitting'), 'check') (('this', 'finding annotations'), 'be') (('Here I', 'https StratifiedKFold scikit'), 'use') (('when positive value', 'mixup augmentation'), 'apply') (('com xhlulu vinbigdata chest xray', 'part'), 'resize') (('post process', '0'), '206') (('It', '1 epoch'), 'collect') (('com corochann vinbigdata detectron2 prediction kernel', 'competition'), 'explain') (('you', 'inference'), 'quit') (('expecially when number', 'data'), 'be') (('com rwightman pytorch image models pytorch image it', 'pretrained weights'), 'model') (('You', 'experiment'), 'focus') (('Transform updated function', 'albumentations'), 'write') (('CNN models image augmentation', 'overfit'), 'be') (('high_threshold Replace Replace', 'nothing'), 'do') (('low_threshold', 'Just Normal prediction'), 'add') (('it', 'together detection'), 'think') (('com corochann vinbigdata detectron2 train kernel', 'detectron2 library'), 'explain') (('None None 0th', 'optimizer optim'), 'fold') (('com corochann bengali seresnext', 'Lyft mode confidence https multi www'), 'training') (('how many normal class', 'training data'), 'change') (('understanding', 'training below bit raw loop'), 'note') (('ProgressBar 10 debug', 'Show progress else 100 E.'), 'update_interval') (('com c vinbigdata chest xray abnormalities detection 211971 Here I', 'https similar www'), 'discussion') (('I', 'detectron2 train https VinBigData www'), 'explain') (('which', 'predicted probability'), 'add') (('Just Normal prediction', 'detection prediction'), 'add') (('com pytorch It', 'training loop'), 'ignite') (('Sometimes it', 'label'), 'be') (('which', 'also later training'), 'define') (('You', 'albumentations https github'), 'refer') (('extension', 'what'), 'training') (('Training config negative value', 'ema'), 'model') (('You', 'training loss show progressbar metric etc'), 'need') (('Training', 'utilsHere methods'), 'train') (('just You', 'index'), 'be') (('10 debug', 'jupyter notebook E.'), 'log_trigger') (('com c vinbigdata chest xray abnormalities detection 219672 which', 'almost kernel'), 'discussion') (('com corochann vinbigdata detectron2 train', 'more abnormal boxes'), 'use') (('it', 'albumentations library'), 'epoch') (('1024px 256 512 PNG', 'below discussion'), 'dataset') (('So almost 70', 'data'), 'be') (('Train setup HACKING 3 report', 'prefix'), 'parameters') (('image NOQA parameter', 'pytorch image models'), 'io') (('radiologists always 3 opinions', 'normal abnormal diagnosis'), 'confirm') (('I', 'experiment'), 'wonder') (('We', 'installation instruction https github'), 'follow') (('com corochann vinbigdata detectron2 2class prediction', 'dataset vinbigdata https 2class pred www'), 'prediction') (('pipelineThis competition', 'chest ray image radiographs'), 'com') (('Exponential Moving Also Average', 'validation together loss'), 'add') (('Here I', 'dataset'), 'update') (('You', 'train https detectron2 www'), 'register') (('vinbigdata class com awsaf49 2 filter', 'LB score'), 'improve') (('md we', 'pytorch correct detectron2'), 'need') (('You', 'pytorch https www'), 'do') (('Model You', 'just model_name'), 'model_name') (('com pfnet pytorch pfn It', 'useful training'), 'extras') (('interpolation', 'mix also ratio'), 'make') (('more soft sometimes model', 'label'), 'become') (('it', 'other classes'), 'notice') (('lower low_threshold', 'better results'), '8') (('we', 'handler implemented other training other competition'), 'be') (('Here I', 'just dataset'), 'use') (('so s', 'it'), 'upvote') (('Try', 'regularization dropout etc'), 'increase') (('it', 'instead just 1 image'), 'make') (('radiologists 3 opinions', 'thoracic abnormalities'), 'match') (('com pytorch learning Deep framework it', 'flexible usage'), 'pytorch') (('We', 'validation error standard deviation'), 'use') (('which', 'kaggle competitions'), 'obtrain') (('com c vinbigdata chest xray abnormalities detection 208837 Here I', 'Prediction class 2 classifier'), 'discussion') (('io competitions chexpert', 'area'), 'be') (('Here p', 'com c vinbigdata chest xray abnormalities detection 211971 1157809 pestipeti'), 'discussion') (('it', 'dataset'), 'help') (('You', 'other projects'), 'copy') (('Here model', 'regular interval flags'), 'save') (('Scoring bug', '0'), 'upvote') (('data enough augmentation', 'validation loss almost accuracy'), 'be') (('com albumentations team albumentations Image augmentation library', 'https github'), 'timm') ", "extra": "['annotation', 'test', 'diagnosis', 'procedure']"}