{"name": "visualize bounding boxes interactively ", "full_name": " h3 Credits h1 Imports and Setups h1 Hyperparams h1 Load Dataset h2 Visualize Bounding Boxes h1 Better Data Understanding using W B Tables h2 Check out the Table rightarrow h1 Work In Progress ", "stargazers_count": 0, "forks_count": 0, "description": "ai ayush thakur kaggle covid runs 3vxougc9 workspace user ayush thakur to interactively play with the bounding box coordinates. The steps below can be used as it is with a training pipeline with littleeee modification. In this kernel we will try to understand the relationship better. The uploaded 256x256 Kaggle dataset is here https www. This kernel can be considered a simple EDA kernel with the focus on deriving insights by interactively playing with the bounding boxes for each images. In this competition the task is to provide image level predictions none vs opacity as well as study level predictions negative typical atypical indeterminate. Then when bounding boxes or localization For images with opacity label i. log radiogram_eda table. This kernel can be used to visualize the bounding boxes interactively using W B and will walk you through the process of logging bounding boxes. Load image Get bboxes Scale bounding boxes Get ground truth label W B image create an artifact for all the raw data Load image Get bboxes Scale bounding boxes Get ground truth label Get image with bounding boxes Add info in the table as new row wandb. train_study_level. Check out his amazing kernel https www. csv Image level labels. Thus we will build two separate classifiers one for study level prediction and another for image level prediction. Visualize Bounding BoxesThis section will walk you through the steps required to use W B to log bounding boxes. Note Even though the true_label is opacity or none but I have logged the study level labels for more insight. Better Data Understanding using W B Tables Check out the Table rightarrow https wandb. Notes Since some of the images don t have bounding box coordinates we will drop those rows. This means that in some study directory there are more than one images. com yujiariyasu plot 3positive classes Scale the bounding boxes. e image level label we need to train an object detector for localization. com xhlulu siim covid19 resized to 256px jpg. The DICOM formatted radiograms of chest scans are available in this directory structure study series images. Get the raw bounding box Ref https www. csv file Since there are over 2000 rows without bounding box coordinates. gif Credits I am using xhlulu s https www. Click on the run page https wandb. Load image level csv file Load study level csv file Modify values in the id column Add absolute path Get image level labels Modify values in the id column Rename the column id with StudyInstanceUID Merge both dataframes Label encode study level labels Load meta. What s study and image There are 6334 unique chest scans or images while 6054 unique study directories. Get scaling factor xmin ymin xmax ymax To log a bounding box you ll need to provide a dictionary with the following keys and values to the boxes keyword argument of wandb. Click on the icon to interact with the UI. gif Work In ProgressUpcoming Visualize the entire training dataset using W B Tables. ai ayush thakur kaggle covid artifacts basic eda eda c17893f765f142a4acbf files Radiogram 20EDA. csv Study level labels. Visualize Metadata. Every image with bounding box coordinates belong to opacity label. com xhlulu siim covid 19 convert to jpg 256px that can be used to generate resized images with different resolution. json img https i. com xhlulu resized dataset. Get insight from the tables. Imports and Setups Hyperparams Load DatasetThis competition is unique because of how the data is presented and thus the problem statement. ", "id": "ayuraj/visualize-bounding-boxes-interactively", "size": "2871", "language": "python", "html_url": "https://www.kaggle.com/code/ayuraj/visualize-bounding-boxes-interactively", "git_url": "https://www.kaggle.com/code/ayuraj/visualize-bounding-boxes-interactively", "script": "scale_bbox wandb_bbox get_bbox numpy matplotlib.pyplot pandas tqdm ", "entities": "(('bboxes Scale bounding boxes', 'row new wandb'), 'get') (('c17893f765f142a4acbf', 'Radiogram 20EDA'), 'ai') (('Thus we', 'image level prediction'), 'build') (('we', 'rows'), 'Notes') (('Data Better Understanding', 'https wandb'), 'rightarrow') (('com yujiariyasu plot 3positive classes', 'bounding boxes'), 'scale') (('below it', 'littleeee modification'), 'use') (('kernel', 'bounding boxes'), 'use') (('Label encode study level labels', 'StudyInstanceUID i Merge'), 'add') (('task', 'study level as well negative typical atypical indeterminate'), 'be') (('formatted radiograms', 'directory structure study series images'), 'be') (('gif I', 'https www'), 'Credits') (('kernel', 'images'), 'consider') (('Visualize Bounding BoxesThis section', 'bounding boxes'), 'walk') (('I', 'more insight'), 'note') (('image', 'opacity label'), 'belong') (('e image level we', 'localization'), 'label') (('This', 'study directory'), 'mean') (('you', 'keyword wandb'), 'get') (('com xhlulu siim', '256px covid19 jpg'), 'resize') (('we', 'relationship'), 'try') (('that', 'different resolution'), 'convert') ", "extra": "[]"}