{"name": "yolov5 1st place world championships robocup 2021 ", "full_name": " h1 Object recognition on a robot soccer fied with YoloV5 h2 Object detection with Yolo V5 h2 The results h1 Continuous digital feedback loop h2 1 Collect label images h3 Labeling tool h3 Labeling Best Practices h3 LabelImg Shortcuts to label efficiently h2 2 Training Yolo model in the cloud h3 Kaggle dataset h3 Yolo V5 setup h3 Prepare training data h3 Conversion VOCXML to YOLO annotation format h3 Prepare training data h3 Preparing Yolo V5 training h3 Statistics h3 Yolo v5 training h2 3 Deploying the model to the robots h2 4 Real time inference on a Jetson Nano on the robot ", "stargazers_count": 0, "forks_count": 0, "description": "In our case we use the small model for best performance on a low cost Jetson nano. One of the latest releases is YoloV5 with very promising results in terms of accuracy vs speed high Frames Per Second FPS and low latency with a small SW footprint suitable for mobile devices. Below I printed an example file the one we used for the training. Collect label images sec1 New images are captured during every game providing new training material. Yolo V5 setupClone the yolo V5 repository from GitHub install dependencies and check PyTorch and GPU. For occluded objects label them entirely. Yolo and other well known algorithms like SSD Single Shot Detector Mobilenet support multiple image sizes. Let s create the directory structure needed for Yolo V5 training Yolov5. Your model will understand edges far better this way. Training Yolo model in the cloud sec2 The Yolo set up loading of the images and the YoloV5 training3. Deploying the model to the robots sec3 The Yolo V5 model is exported as an ONNX exchange standard 4. mAP is the Mean Average Precision. The files are available in the models directory. Object recognition on a robot soccer fied with YoloV5Image from Robocup This is a notebook about low cost fast mobile object detection for robot soccer. Wait robot soccer Yes complete leagues are playing world championships with the objective By the middle of the 21st century a team of fully autonomous humanoid robot soccer players shall win a soccer game complying with the official rules of FIFA against the winner of the most recent World Cup Welcome to the world of really cool tech This work did win the first place in the scientific challenge in the world championships robotic soccer 2021 middle size league MSL. Training Yolo model in the cloud Kaggle datasetThe annotated training images have been made available in a Kaggle dataset which is loaded in this notebook. matplot to display images clone repo install dependencies Showcase a typical training image Showcase VocXML annotation author Noah van der Meer brief VOC XML to YOLO annotation converter date 28 01 2021 for Python type hinting static typing listing and reading files parsing XML in DOM Determine image size Iterate through objects Look up class Interpret bounding box check file extension write to file Showcase Yolo annotation Percentage of images to be used for the validation set Populate the folders Read the image hub directories and load the images annotations in the YOLO training directories count the amount of training images Copy the 2 prepared yaml dataset from the robocup images dataset change epochs to 300 for a full run Show the predictions Show the predictions. We have used labelImg https github. This architecture has been adapted for use on the robots as shown in Figure below. com ultralytics yolov5 ultralytics Yolo v5 Object Detection Tutorial https towardsdatascience. The default img size is 640. Where True Positive is a correct detection a detection with IOU Intersection Over Union threshold Recall is the ability of a model to find recall all the relevant cases all ground truth bounding boxes. For objects partially out of frame generally label them. One yaml file specifying the model small medium large Xlarge. This optimization step is performed once which leads to an engine that can be used repeatedly for real time object detection on the robot. You need to create the file dataset. See here https github. Deploying the model to the robots Once training is complete the resulting network is deployed on the robots. In general even a partial object is still an object to be labeled. The MSL can always enjoy lots of public attention video https youtu. com how to train yolov5 on a custom dataset YOLOv5 is Here https towardsdatascience. Use the default VOC XML format for creating labels is a more universal standard. org leagues 6 for more information about the competitions of the different leagues. The good old fashioned garbage in garbage out applies. Continuous digital feedback loopThe continuous digital feedback loop is a model used by Tesla in its fleet of cars. There are a few model sizes of YoloV5 available basically predefined models from small to XXL see table https github. com zylapp review of deep learning algorithms for object detection c1f3d437b852 to give an overview. com yolo v5 object detection tutorial 2e607b9013ef How to Train YOLOv5 On a Custom Dataset https blog. Prepare training data Preparing Yolo V5 trainingYolo needs 2 yaml files set up properly in your training directory. Labeling toolyou need a toolset to label images. The ONNX format is imported and fully optimized for inference on the specific device. Using this approach inference can be performed within 40 ms on the Jetson Nano resulting in a processing framerate of 25 fps. It is the percentage of correct positive predictions and is given by frac True Positive True Positive False Positive frac True Positive All detections. It is best to include a little bit of non object buffer than it is to exclude a portion of the object with a rectangular label. Real time inference on a Jetson Nano on the robot sec4 using video images coming from the Zed2 real time camera stream on the robot The ONNX model is imported and run on a tensortRT Nvidia GPU network optimization for low cost HW 1. LabelImg supports labeling in VOC XML or YOLO text file format. Real time inference on a Jetson Nano on the robotThe ONNX model is imported and run on a tensortRT Nvidia GPU network optimization for low cost HW. StatisticsThe main statistics to watch are Precision is the ability of a model to identify only the relevant objects. Your model will begin to understand the true bounds of objects this way. ipynb scrollTo wbvMlHd_QwMG Kaggle tutorial https www. The Yolo V5 model along with the trained weights is exported as an Open Neural Network Exchange ONNX exchange standard. Also Yolo has developed over time and successive versions have been released since its first inception in May 2016. It is the percentage of true positive detected among all relevant ground truths and is given by frac True Positive True Positive False Negative frac True Positive All ground truths where False negative A ground truth not detected. It can be best summarized in the picture below. be MXztr3BxY5w t 1363. Each image will have one. So aim to have boxes that tightly mirror the objects you want to label but do not cut off part of the objects. It is free and is a popular choice. Train and detect at the same img size for best results. com tzutalin labelImg. xml file will include them all. For this step the open source YOLOv5 TensorRT library https github. Image annotation will be done in VOC XML file format is a more universal standard and not proprietary Yolo format. Labeling Best PracticesSome of the good advices I did find in the various tutorials Label around the entirety of an object. ONNX facilitates open interoperability between AI platforms and is supported by many popular AI frameworks such as TensorFlow MXNet and PyTorch. py img 640 means that the mosaic dataloader pulls up the selected image along with 3 random images resizes them all to 640 joins all 4 at the seams into a 1280x1280 mosaic augments them and then crops a center 640x640 area for placement as 1 image into the batch. com rafaelpadilla Object Detection Metrics for some good explanation. xml file that has its labels. See the Robocup webiste https www. The imagehub will contain all the original images grouped by certain categories events or places e. com ultralytics yolov5 pretrained checkpoints for details To get the inferencing as fast as possible the small model has been selected. The complete deployment workflow can be seen in the picture below 4. jpg Object detection with Yolo V5The field of AI produced a number of ever improving deep Learning Algorithms for Object Detection. Ctrl u Load all of the images from a directoryCtrl r Change the default annotation target dirCtrl s Savew Create a rect boxd Next imagea Previous imagedel Delete the selected rect boxCtrl Zoom inCtrl Zoom outCtrl d Copy the current label and rect boxSpace Flag the current image as verified Keyboard arrows to move selected rect box 2. The objects we want to recognize are ball robot goalpost human goalYOLO resources used Github https github. This is also necessary for the next step since training is done in the cloud using the PyTorch based YOLOv5 while the inference hardware on the robots is running the NVIDIA TensorRT framework. LabelImg Shortcuts to label efficiently. It will create a folder called yolov5. For instance the entry level Jetson Nano can be obtained for as little as 60 Eur and possesses enough computing power to run the YOLOv5 models in real time. One of the best known algorithms for object detection is Yolo You Only Look Once. If there is more than one class or one label in an image that. Collect label imagesThe data is the oil of machine learning the key to success. com github ultralytics yolov5 blob master tutorial. You can always easily convert from VOC XML to any other format using some conversion software see code below. Yolo v5 training 3. The training dataset structure will be organized as required for the specific ML platform in this case Yolo V5 Make sure all your images are in the jpg format Annotations need to be in the YOLO text file format YoloV5 trains on square images you only supply the longest dimension e. It contains all the images ever collected for training. The objective is real time recognition of objects on the soccer field. com ultralytics yolov5 colab tutorial https colab. It needs to be fast no need to recognize a ball after it already passed mobile recognition on the robot s local compute no real time connection to a large data center and low cost it needs to be affordable for all teams. yaml manually with the correct classes and class names. Hence good management of your data in this case annotated images is important. Here you find a nice article https medium. Also new images can be captured during set up day before the games so the model can be trained on game location with the specifics of that soccer field e. valid Prepare training data Conversion VOCXML to YOLO annotation formatThe code below converts whole directories for example by classes ball 0 robot 1 human 2 goalpost 3 goal 4 DIR Your image directory voc_xml_directory_to_yolo DIR VOCXML DIR YOLO classes The robocup images dataset already contains both the VOCXML and YOLO annotation labels so you can directly use them. The continuous digital feedback loop consists of the followingfour steps 1. Still we try to standardize all our training material and use the image format of the camera mounted on the robots Zed2 which is 672 376 pixels To avoid issues with different image types make sure all your images are in the jpg format The training dataset needed for a specific training which are selected images from the datahub. The goal of the model is to continuously improve the behavior and intelligence of the fleet by continually collecting data learning from new images and re deploying the re trained networks. 2020 France tournament. There are tools to translate from VOC XML to the simpler Yolo format. You need to make one change to the file and enter the correct number of classes parameter in our case 5 classes nc 5 number of classes One yaml file specifying the data. We organized the training data set up in a 2 stage approach. To perform object detection on the NVIDIA Jetson platform the TensorRT software is used which is specialized in inference on NVIDIA hardware. different lighting conditions 2. com noahmr yolov5 tensorrt has been developed. For our images training we use image size 672 the largest dimension of the image YoloV5 internal workings python train. For the latter the NVIDIA Jetson platform has been used It has a small form factor has desirable power characteristics and is low cost. com yolo v5 is here b668ce2a4908 How to Create an End to End Object Detector using Yolov5 https towardsdatascience. fi bitstream handle 10024 452552 Do_Thuan. com how to create an end to end object detector using yolov5 35fbb1a02810 thesis evolution of YOLO algorithm and YOLOV5 https www. If an object is out of view due to another object being in front of it label the object out of view as if you could see its entirety. pdf sequence 2 isAllowed y The resultsSee for yourself it needed only 2 hours of training on a cloud GPU and only 1000 annotated images. img 800 The rest is handled automatically. ", "id": "charel/yolov5-1st-place-world-championships-robocup-2021", "size": "13518", "language": "python", "html_url": "https://www.kaggle.com/code/charel/yolov5-1st-place-world-championships-robocup-2021", "git_url": "https://www.kaggle.com/code/charel/yolov5-1st-place-world-championships-robocup-2021", "script": "typing clear_output  # to display images Tuple IPython.display seaborn numpy matplotlib.pyplot Image save List Dict  # for Python type hinting/static typing voc_xml_to_yolo pandas voc_xml_directory_to_yolo read_directory_imagehub matplotlib.image load ", "entities": "(('Jetson Nano', 'real time'), 'obtain') (('annotated images', 'case'), 'be') (('Image annotation', 'VOC XML file format'), 'do') (('ONNX model', 'cost low HW'), 'inference') (('True ground ground where False negative truth', 'frac True True False Negative Positive Positive frac'), 'be') (('ONNX format', 'specific device'), 'import') (('It', 'best picture'), 'summarize') (('I', 'object'), 'label') (('imagehub', 'categories certain events'), 'contain') (('deployment complete workflow', '4'), 'see') (('inference based YOLOv5 hardware', 'NVIDIA TensorRT framework'), 'be') (('We', 'stage 2 approach'), 'organize') (('You', 'conversion software'), 'convert') (('you', 'directly them'), 'Prepare') (('feedback continuous digital loop', 'followingfour steps'), 'consist') (('LabelImg', 'VOC XML'), 'support') (('Use', 'labels'), 'be') (('ONNX', 'TensorFlow such MXNet'), 'facilitate') (('python', 'internal workings'), 'use') (('it', 'cloud'), 'sequence') (('s', 'Yolo V5 training Yolov5'), 'let') (('you', 'dimension only longest e.'), 'organize') (('all', 'boxes'), 'be') (('we', 'ball robot goalpost human goalYOLO Github https github'), 'be') (('we', 'cost Jetson low nano'), 'use') (('Using', '25 fps'), 'perform') (('com yolo v5', 'https Yolov5 towardsdatascience'), 'be') (('predictions', 'predictions'), 'showcase') (('One', 'suitable mobile devices'), 'be') (('It', 'ever training'), 'contain') (('com yolo v5', 'Custom Dataset https blog'), 'object') (('Here you', 'article https nice medium'), 'find') (('Yolo V5 model', 'Neural Network Exchange ONNX exchange Open standard'), 'export') (('as fast possible small model', 'inferencing'), 'select') (('New images', 'training new material'), 'sec1') (('it', 'rectangular label'), 'be') (('fi bitstream', '10024'), 'handle') (('MSL', 'attention video https public youtu'), 'enjoy') (('Yolo V5', 'PyTorch'), 'setupclone') (('open source', 'step'), 'github') (('mosaic 640 dataloader', 'batch'), 'mean') (('you', 'entirety'), 'label') (('model', 'objects'), 'begin') (('form small factor', 'power desirable characteristics'), 'use') (('model', 'edges'), 'understand') (('One', 'object detection'), 'be') (('which', 'notebook'), 'make') (('architecture', 'Figure'), 'adapt') (('feedback Continuous digital feedback loopThe continuous digital loop', 'cars'), 'be') (('Zoom inCtrl Zoom outCtrl selected d', 'rect selected box'), 'Load') (('Precision', 'only relevant objects'), 'be') (('goal', 'trained networks'), 'be') (('good old fashioned garbage', 'garbage'), 'applie') (('files', 'models directory'), 'be') (('low it', 'teams'), 'need') (('jpg detection', 'Object Detection'), 'object') (('You', 'yaml One data'), 'need') (('Yolo', 'images'), 'model') (('frac True Positive True Positive False Positive', 'frac True Positive detections'), 'be') (('toolyou', 'images'), 'need') (('work', 'size league robotic soccer 2021 middle MSL'), 'wait') (('imagesThe Collect data', 'success'), 'label') (('successive versions', 'May'), 'develop') (('time Real inference', 'cost low HW'), 'import') (('model', 'soccer field e.'), 'capture') (('you', 'objects'), 'aim') (('objective', 'soccer field'), 'be') (('we', 'training'), 'print') (('resulting network', 'robots'), 'deploy') (('which', 'NVIDIA hardware'), 'platform') (('Yolo V5 sec3 model', 'ONNX exchange standard'), 'deploy') (('that', 'robot'), 'perform') (('This', 'robot soccer'), 'recognition') (('which', 'datahub'), 'try') (('Preparing Yolo trainingYolo', 'training properly directory'), 'prepare') ", "extra": "['annotation', 'test', 'bag']"}