{"url": "https://www.funda.nl/koop/utrecht/huis-42601606-lombokstraat-94/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 2, "bathroom_facilities": "Douche", "number_of_floors": 2, "outdoor_space": "N/A", "facilities": "Dakraam, glasvezelkabel, natuurlijke ventilatie en TV kabel", "volume_in_cubic_meters": 308, "living_area": 77, "plot_size": 57, "external_storage_space": "N/A", "asking_price": 450000, "asking_price_per_square_meter": 5844, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nSfeervolle, compleet opgeknapte  tussenwoning  in de  leukste wijk  van Utrecht! De woning  is  gelegen in hartje Lombok in  een  rustige en gezellige zijstraat van de bruisende Kanaalstraat met al  zijn (vers)winkels en eet- en drinkgelegenheden. Vanuit de Lombokstraat fiets je binnen 5 minuten naar hartje centrum, het centraal station en ben je binnen 5 autominuten op de A2/A12. <br/> <br/>De woning is recent smaakvol gemoderniseerd, waarbij echt alles is vernieuwd! Zo is in 2021 o.a. de trap gedraaid, het toilet verplaatst, de wanden gestuct, het schilderwerk buiten gedaan, elektra vervangen en extra groepen geplaatst, overal dubbelglas geplaatst, de wanden en het dak geïsoleerd, een nieuwe vloer gelegd en een nieuwe keuken (inclusief nieuwe CV) geplaatst. De 1e verdieping heeft in 2019 een vergelijkbare make-over gehad.  <br/> <br/>Ben je op zoek naar een moderne woning met veel karakter? Dan is dit je kans! <br/> <br/>Indeling:  <br/> <br/>Begane grond: <br/>Je komt binnen in de hal met meterkast en toegang tot de toiletruimte met hangend toilet en fonteintje. Wat direct opvalt als je de heerlijke woonkamer betreedt is de ruimte en het licht! Grote raampartijen i.c.m. het hoge plafond (bijna 3 meter) en de moderne afwerking maken het een hele prettige ruimte. Doordat de aanbouw aan de achterzijde bij de laatste verbouwing is opengebroken is er meer dan voldoende ruimte voor een goede zithoek, grote eettafel en een volledig uitgeruste keuken (inductie) met meters werkbladruimte. Vanuit de keuken heb je toegang tot een knusse stadstuin. Ideaal voor een kopje koffie in de ochtendzon. <br/> <br/>1e verdieping: <br/>Deze verdieping beschikt over twee ruime en sfeervolle slaapkamers. De plafonds zijn bij een eerdere verbouwing in 2019 doorgebroken waardoor ook hier het gevoel van ruimte opvalt. De slaapkamer aan de voorzijde beschikt over een trap met toegang tot de vide. Door de vide heb je een gevoel van een extra kamer, waar je goed een plek kunt inrichten voor werken en/of ontspannen. Voor de fijne master bedroom aan de achterzijde zijn 2 kamers samengevoegd waarbij de oude balken nog in het zicht zijn gelaten. De badkamer uit 2017 is voorzien van een douche en wastafel.  <br/> <br/>Kortom: <br/>Een gemoderniseerde woning op een rustige plek, met al het bruisende van Lombok en de Utrechtse stad op loopafstand!  <br/> <br/>Interesse in deze woning? Neem je NVM-aankoopmakelaar mee!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/753/291_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "F ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Nefit (gas gestookt combiketel uit 2021, eigendom)", "location": "N/A", "garden": "Achtertuin", "back_garden": 6, "garden_location": "Gelegen op het oosten", "balcony": "N/A", "type_of_parking": "Betaald parkeren en parkeervergunningen", "garage": "N/A", "zipcode": "3531 RG", "street": "Lombokstraat 94", "house_number": "94", "city": "utrecht", "province": "utrecht", "lat": 52.09057, "lng": 5.100904, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "lombokoost", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}