{"url": "https://www.funda.nl/koop/volendam/huis-42683467-hyacintenstraat-10/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Douche en toilet", "number_of_floors": 3, "outdoor_space": "N/A", "facilities": "Buitenzonwering, dakraam, natuurlijke ventilatie, rolluiken en TV kabel", "volume_in_cubic_meters": 397, "living_area": 110, "plot_size": 131, "external_storage_space": "N/A", "asking_price": 359000, "asking_price_per_square_meter": 3264, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nWil je centraal  wonen  op loopafstand  van alle  denkbare voorzieningen? <br/>Kom dan  gezellig  langs bij deze fraaie woning  aan  de Hyacintenstraat 10 in Volendam. <br/> <br/>Een mooie  en uitstekend onderhouden  woning voorzien van betonnen begane grond en 1e verdiepingsvloer, achteraanbouw en 4 slaapkamers. Door grote raampartijen is de woning heerlijk licht en heerst er een zeer aangenaam leefklimaat. <br/> <br/>Het voor- en achtererf zijn netjes aangelegd en er is een gedeeltelijk betonnen achtererf. In de ommuurde achtertuin kun je heerlijk in alle privacy tot rust komen. De voortuin is daarnaast ook nog eens in eigendom, waardoor je geen jaarlijkse kosten meer betaald. <br/> <br/>Alle voorzieningen zijn op loopafstand gelegen. In de winkelstraat â\u0080\u0098van Baarstraatâ\u0080\u0099 vindt je een supermarkt, slager, slijterij en diverse andere speciaalzaken. Ook het centrum is op loopafstand gelegen voor een gezellig uitje op de dijk met de sfeervolle haven. <br/> <br/>INDELING <br/>Begane grond: Entree met trapopgang naar 1e verdieping en trapkast, meterkast (5 groepen, 3 aardlekautomaten en 1 aardlekschakelaar), nette betegelde toilet met wandcloset en fonteintje, doorzon woonkamer, open keuken in hoekopstelling voorzien van diverse inbouwapparatuur, bijkeuken voorzien van wasmachine aansluiting en deur naar het achtererf en een berging voorzien van plavuizen, schuifkastenwand, wasmachine aansluiting en geiser (Vaillant). <br/> <br/>1e verdieping: Overloop met vaste trap naar 2e verdieping, luxe betegelde badkamer voorzien van wastafel, wandcloset, douche en vloerverwarming, voorslaapkamer voorzien van elektrisch rolluik, achterslaapkamer voorzien van schuifkastenwand en handmatig rolluik en een achterslaapkamer voorzien van inbouwkast en handmatig rolluik. <br/> <br/>2e verdieping: Overloop met bergruimte in schuinte en bergkast voorzien van CV ketel (Ne?t Ecomline bouwjaar 2005) en een slaapkamer voorzien van schuifkastjes in schuinte. <br/> <br/>Zoek je een goed onderhouden woning op een fraaie locatie en in een gezellige buurt? Maak dan een afspraak voor een bezichtiging en we nemen je graag mee voor een rondleiding!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/106/431_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel en geiser", "boiler": "Nefit (gas gestookt combiketel uit 2005, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 32, "garden_location": "Gelegen op het zuidoosten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1131 HV", "street": "Hyacintenstraat 10", "house_number": "10", "city": "volendam", "province": "noordholland", "lat": 52.49989, "lng": 5.073781, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "volendamindustriegebied", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}