{"url": "https://www.funda.nl/koop/purmerend/huis-42600287-karpaten-20/", "offer_type": "koop", "number_of_rooms": 6, "number_of_bathrooms": 1, "number_of_bedrooms": 5, "bathroom_facilities": "Douche en toilet", "number_of_floors": 3, "outdoor_space": 16, "facilities": "Mechanische ventilatie", "volume_in_cubic_meters": 451, "living_area": 127, "plot_size": 119, "external_storage_space": 5, "asking_price": 495000, "asking_price_per_square_meter": 3898, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nWELKOM THUIS AAN  DE  KARPATEN 20!  <br/> <br/>Een  huis creëren dat je  omarmt  en geborgenheid biedt... hoe doe  je  dat? Nou, dat is in dit  huis  heel  goed gelukt! Het  antwoord ligt in een samensmelting van sfeer, warmte en het gevoel van thuiskomen; een huis dat jouw thuis wordt. <br/> <br/>Binnenshuis beschik je over 127 m² wooncomfort met een zeer lichte woonkamer met luxe open keuken, 5 prima slaapkamers en een luxe badkamer. Ook buiten is het hier genieten. Je beschikt namelijk over een fijne achtertuin op het westen met overkapping! Het mandelige vlonderterras aan de achterzijde van de woning maakt het geheel af. <br/> <br/>Het geheel is zeer smaakvol afgewerkt en goed onderhouden, waardoor je vrijwel direct kunt gaan wonen en starten met genieten! <br/> <br/>Indeling <br/>Begane grond <br/>Je komt de woning binnen via de entree aan de voorzijde van het huis. Hier kom je in de hal met de meterkast, het toilet en de trapopgang naar de eerste verdieping. <br/> <br/>Vanuit de hal kom je vervolgens in de tuingerichte woonkamer met schuifpui naar de tuin. Deze zorgen niet alleen voor een leuke verbinding tussen buiten en binnen, maar ook voor een zeer aangename lichtinval. Op de vloer ligt een eikenhouten vloer (parket) en de wanden en hoge plafonds zijn gestuct en voorzien van lichte kleuren, waardoor je hier met veel verschillende interieurstijlen uit de voeten kunt. In de woonkamer is voldoende ruimte voor een fijne zithoek bij de strakke houthaard en een gezellige eethoek, welke naadloos aansluit op de open keuken. <br/> <br/>De keuken is gesitueerd aan de voorzijde van het huis en deze is geplaatst in een praktische L-opstelling. De keuken is uitgevoerd met strakke, lichte fronten en een donker grijs aanrechtblad wat samen zorgt voor een moderne uitstraling. In de keuken beschik je over voldoende kast- en werkruimte en daarnaast is deze voorzien van de nodige inbouwapparatuur. Wij noemen: een 5 pits inductiekookplaat, afzuigkap, magnetron, bakoven, vaatwasser, koelkast, vriezer en een quooker.  <br/> <br/>Eerste verdieping <br/>Op de eerste verdieping vind je de eerste drie slaapkamers en de badkamer. De kamers zijn allemaal voorzien van laminaat vloerdelen en hebben een strakke wandafwerking in neutrale kleuren. Ook hebben de slaapkamers een fijne lichtinval. De ouder slaapkamer beslaat momenteel de volledige breedte van de woning.  <br/> <br/>De badkamer moet een plek zijn om prettig je dag te beginnen of juist ontspannen te eindigen. Elke centimeter optimaal benutten en daarbij een prettige sfeer creëren; dat is in deze badkamer zeker gelukt! De badkamer is vrijwel compleet en uitgerust met een inloopdouche, dubbele wastafelmeubel en toilet. <br/> <br/>Tweede verdieping <br/>Via een vaste trap kom je op de tweede verdieping. Hier bevindt zich een voorzolder welke toegang biedt tot nog eens 2 slaapkamers. Aan de voorzijde is de slaapkamer extra vergoot met een brede dakkapel. De slaapkamer aan de achterzijde heeft een tweetal grote dakramen en aansluitingen voor de was apparatuur.   <br/> <br/>Tuin <br/>Zowel vanuit de woonkamer als via een achterom is de zonnige achtertuin toegankelijk. Deze is gelegen op het westen en is onderhoudsvriendelijk aangelegd, waardoor je meer tijd overhoudt om te genieten van het buitenleven. De veranda (16 m²) direct achter de woning biedt een heerlijke plek om het gehele jaar door te genieten.  <br/> <br/>Verder is de tuin ingericht met bestrating, vaste beplanting en een handige, houten vrijstaande berging met elektra waarin je alle gebruikelijke spullen netjes op kunt bergen. <br/> <br/>De poort geeft toegang tot het achtergelegen steegje maar ook de ruime gezamenlijke (mandelige) binnentuin/ vlonderterras aan het water. Een privilege voor 16 woningen die uitkomen op dit unieke stukje van de Weidevenne. Voor de kinderen is er een speeltoestel. <br/> <br/>Wetenswaardigheden: <br/>- woonoppervlak 127 m²; <br/>- perceeloppervlak: 119 m²; <br/>- bouwjaar 2013; <br/>- eigen grond; <br/>- 5 slaapkamers; <br/>- stadsverwarming; <br/>- tuin op het westen; <br/>- overkapping van 16 m²; <br/>- mandelig vlonderterras; <br/>- oplevering in overleg. <br/> <br/>Kortom: Dit is het ideale gezinshuis! Door de ruime oppervlakte en de zonnige tuin zul je je hier direct thuis voelen!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/739/439_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Zadeldak bedekt met bitumineuze dakbedekking en pannen", "heating": "Stadsverwarming", "hot_water": "Stadsverwarming", "boiler": "N/A", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 40, "garden_location": "Gelegen op het westen bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1448 JA", "street": "Karpaten 20", "house_number": "20", "city": "purmerend", "province": "noordholland", "lat": 52.50142, "lng": 4.941127, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "europa", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}