{"url": "https://www.funda.nl/koop/aarle-rixtel/appartement-42658443-heindertweg-149/", "offer_type": "koop", "number_of_rooms": 3, "number_of_bathrooms": 2, "number_of_bedrooms": 2, "bathroom_facilities": "Ligbad en toilet", "number_of_floors": 5, "outdoor_space": 122, "facilities": "Glasvezelkabel, mechanische ventilatie, natuurlijke ventilatie, schuifpui en TV kabel", "volume_in_cubic_meters": 547, "living_area": 165, "plot_size": "N/A", "external_storage_space": 16, "asking_price": 725000, "asking_price_per_square_meter": 4394, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nIn 2012 werden  in  het centrum  van Aarle-Rixtel  negen luxe park appartementen  gebouwd.  Hiermee ontstond park \"Zonnetij\" als  openbare  tuin in een landelijke en groene omgeving. Met  genoegen bieden wij  het penthouse Heindertweg 149 te koop aan.  <br/> <br/>Via de algemene entree met bellentableau en brievenbussen betreedt u het complex. Vanaf daar kunt u met lift of trap naar het betreffende appartement.  <br/> <br/>Eenmaal op de bovenste verdieping betreedt u het appartement via een ruime entree/hal met garderobe, separate toiletruimte, technische ruimte, meterkast en separate wasruimte.  <br/> <br/>Aan de voorzijde van het appartement bevinden zich twee ruime en zeer lichte slaapkamers. De masterbedroom is voorzien van een ruime inloopkast met veel lichtinval. Beide slaapkamers beschikken over een eigen badkamer en toegang tot de terrassen.  <br/> <br/>De kleine badkamer is ingericht met een inloopdouche en een vaste wastafel. De grote badkamer is ingericht met een inloopdouche, een ligbad, een toilet, een urinoir en een vaste wastafel met verwarmde spiegel.  <br/> <br/>De grote woonkamer is makkelijk op te delen in een zitgedeelte en een eetgedeelte. Door de vele en grote raampartijen en maar liefst vier schuifpuien is de woonkamer voorzien van veel lichtinval.  <br/> <br/>De royale en modern ingerichte open leefkeuken beschikt over een inpandige bijkeuken.  <br/> <br/>Het grote dakterras van ruim 120 m² is via de schuifpuien in de woonkamer en slaapkamers te bereiken en is rondom het appartement gelegen. Hier is meer dan voldoende ruimte om een mooie tuinset te plaatsen en te genieten van de mooie dagen van het jaar. Er is desgewenst ruimte voor een jacuzzi.  <br/> <br/>Bijzonderheden <br/>- Vloerverwarming (en koeling) door middel van een lucht-/waterpomp met topkoeling voor warme zomerdagen; de Daalderop cool cube uit 2012 dient eveneens als warmwatervoorziening.  <br/>- De verdiepingsvloer is uitgevoerd in beton.  <br/>- De verwarming geschiedt door middel van vloerverwarming en designradiatoren in de badkamers. <br/>- De woning is aangesloten op het glasvezelnetwerk. <br/>- De kozijnen van de woning zijn uitgevoerd in aluminium en voorzien van isolerende beglazing.  <br/>- In de badkamers, de toiletruimte en de keuken is mechanische ventilatie aanwezig.  <br/>- Het appartement beschikt over een parkeerplaats in de parkeerkelder.  <br/>- Er is volop parkeerruimte op eigen terrein.  <br/>- Alle ramen en schuifdeuren zijn voorzien van elektrisch bedienbare screens.  <br/>- Het object is volledig geïsoleerd en beschikt over een energielabel A.  <br/> <br/>Locatie <br/>Het appartement is gelegen in het centrum van Aarle-Rixtel. Winkels, een basisschool en diverse andere voorzieningen zijn op loopafstand gelegen. U heeft een fijn en vrij uitzicht over een hertenkampje en weilanden. Uitvalswegen naar Helmond en Beek en Donk bereikt u binnen enkele minuten.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/152/942/577_1440x960.jpg", "kind_of_house": "N/A", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Plat dak bedekt met bitumineuze dakbedekking", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Gas gestookt combiketel uit 2012, eigendom", "location": "N/A", "garden": "N/A", "back_garden": "N/A", "garden_location": "N/A", "balcony": "Dakterras aanwezig", "type_of_parking": "Openbaar parkeren en parkeergarage", "garage": "N/A", "zipcode": "5735 CD", "street": "Heindertweg 149", "house_number": "149", "city": "aarlerixtel", "province": "noordbrabant", "lat": 51.51258, "lng": 5.638889, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "Penthouse", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "aarlerixtel", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}