{"url": "https://www.funda.nl/koop/purmerend/appartement-42681788-oostervenne-336/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Douche", "number_of_floors": 9, "outdoor_space": 16, "facilities": "Lift en TV kabel", "volume_in_cubic_meters": 325, "living_area": 100, "plot_size": "N/A", "external_storage_space": "N/A", "asking_price": 325000, "asking_price_per_square_meter": 3250, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nDirect online een  bezichtiging  inplannen? Ga  naar onze  website! <br/> <br/>Met dit  royale  5-kamer appartement op de 3e  verdieping  van een perfect gelegen appartementencomplex hebben  we weer een pareltje te  pakken! Ruimtelijk en licht, verzorgd afgewerkt en gelegen aan een doodlopende weg in de groene buurt Overwhere Noord is dit appartement geschikt voor talloze doelgroepen. <br/> <br/>Binnenshuis biedt het appartement een ruime woon-/eetkamer, moderne keuken en badkamer en maar liefst 4(!) slaapkamers. Het grote woningbrede balkon op het altijd zonnige zuidwesten maakt dat je deze woonkans niet aan je voorbij kunt laten gaan. <br/> <br/>Wil jij binnenkort de sleutels in ontvangst nemen? Aarzel niet en plan een bezichtiging! <br/> <br/>Indeling <br/> <br/>Begane grond <br/>Rondom het appartementencomplex is er meer dan voldoende parkeergelegenheid. Binnenkomst in de centrale hal met bellentableau, liften en trapopgang. Vervolgens vind je jouw appartement op de derde verdieping. <br/> <br/>Derde verdieping <br/>Je komt het appartement binnen in de hal met meterkast en toegang tot de woonkamer. <br/> <br/>Bij binnenkomst in de woonkamer ervaar je meteen doch ruimtelijke en lichte opzet. Dankzij de kamerbrede raampartij op het zonnige zuiden strijken de zonnestralen hier heerlijk neer. De nette laminaatvloer, spachtelputz wanden en rustige kleuren zorgen voor een uitstekende basis om op voort te borduren met jouw woonwensen. Vanuit de woonkamer stap je tevens zo het balkon op; heerlijk! <br/> <br/>Het balkon op het zonnige zuidwesten is natuurlijk een absolute uitnodiging voor de zomer. Al vanaf het vroege voorjaar tot het late najaar kun je hier uitgebreid van het mooie weer genieten. Het balkon biedt voldoende ruimte voor het plaatsen van een gezellig zitje en kijkt vrij uit over de groene woonomgeving. <br/> <br/>In de half open keuken staan een keukenblok in praktische hoekopstelling en een vrijstaande kastenwand. Het geheel is modern afgewerkt met hoogglans witte fronten en een donker hardstenen werkblad. En met diverse inbouwapparatuur, zoals een 5 pits gaskookplaat, afzuigkap, oven, vaatwasser en een koel-/vriescombinatie sta je hier dagelijks comfortabel te koken. <br/> <br/>Grenzend aan de woonkamer bevindt zich de tussenhal met toegang tot vier slaapkamers, de badkamer, het aparte toilet met fontein en de technische ruimte met cv-opstelling en aansluiting voor de wasapparatuur. <br/> <br/>De vier slaapkamers zijn stuk voor stuk van goed formaat, aangenaam licht en netjes afgewerkt in dezelfde stijl als de rest van het appartement. Eén van de vier slaapkamers verleent ook toegang tot het balkon. <br/> <br/>Ook de badkamer voldoet volledig aan de wensen van deze tijd. De ruimte is modern betegeld en ingericht met een wastafelmeubel met opbergruimte en spiegelkast en een royale inloopdouche. <br/> <br/>Locatie <br/>Het appartementencomplex is gelegen aan een doodlopende weg in de groene buurt Overwhere Noord. Een klein winkelcentrum met supermarkt vind je op loopafstand en naar het gezellige historische centrum van Purmerend met een ruime keuze aan winkels, restaurants, café's en koffietenten, fiets je in iets meer dan vijf minuten. Kinderopvang en een basisschool bevinden zich op loopafstand, terwijl voortgezet onderwijs met de fiets goed bereikbaar is. Dat laatste geldt ook voor de vele sportfaciliteiten die Purmerend te bieden heeft. De bushalte ligt om de hoek en het NS-station Purmerend Overwhere is met 5 tot 10 minuten fietsen te bereiken. Met de auto ben je in enkele minuten op de snelweg A7, welke in verbinding staat met de A8 en de A10, richting Amsterdam en Zaandam.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/042/770_1440x960.jpg", "kind_of_house": "N/A", "construction_year": "N/A", "energy_label": "E 2,16", "type_of_roof": "Plat dak bedekt met bitumineuze dakbedekking", "heating": "Stadsverwarming", "hot_water": "Stadsverwarming", "boiler": "N/A", "location": "N/A", "garden": "N/A", "back_garden": "N/A", "garden_location": "N/A", "balcony": "Balkon aanwezig", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1444 XR", "street": "Oostervenne 336", "house_number": "336", "city": "purmerend", "province": "noordholland", "lat": 52.52516, "lng": 4.966606, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "Galerijflat (appartement)", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "overwherenoord", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}