{"url": "https://www.funda.nl/koop/de-rijp/huis-42605503-wevershof-71/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Douche en toilet", "number_of_floors": 3, "outdoor_space": "N/A", "facilities": "Rookkanaal en TV kabel", "volume_in_cubic_meters": 368, "living_area": 106, "plot_size": 200, "external_storage_space": 8, "asking_price": 325000, "asking_price_per_square_meter": 3066, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nGoed onderhouden ruime  hoekwoning  op ruime  kavel van  200 m2. De woning  staat  er aan de buitenzijde piekfijn  bij  en mag aan de binnenzijde gemoderniseerd worden. De woning biedt  u tal van mogelijkheden en met beperkte investering zijn onder andere 5 slaapkamers mogelijk. <br/> <br/>De woning is gelegen in een kindvriendelijke buurt voor alleen bestemmingsverkeer en heeft een speelplaatsje voor de deur. Alle voorzieningen zoals: Basisscholen, winkelcentrum, supermarkt, openbaar vervoer, sportvoorzieningen zijn op korte fietsafstand. Heerlijk genieten van varen in het natuurgebied \"de Eilandspolder\"? Uw bootje kunt u op zeer korte afstand kwijt. Nieuwsgierig naar het totale plaatje? Bel ons! <br/> <br/>INDELING <br/>Begane grond: Entree, meterkast, riante woonkamer met open haard en half open keuken voorzien van vaatwasser, gaskookplaat, koel- vriescombinatie en afzuigkap. Vanuit de keuken heeft u toegang tot de bijkeuken/achter entree welke op haar beurt toegang geeft tot de toiletruimte voorzien van zwevend toilet en fonteintje. In de achtertuin bevindt zich de stenen berging voorzien van elektra. <br/> <br/>1e verdieping: Overloop, vaste kast, 2 (voorheen 3) slaapkamers en een nette badkamer voorzien van douche, designradiator, toilet en wastafelmeubel. <br/> <br/>2e verdieping: Grote slaapkamer met dakkapel aan de voorzijde en riante berging met opstelling cv-ketel, wasmachine en droger aan de achterzijde. <br/> <br/>BIJZONDERHEDEN <br/>- Verwarming en warmwatervoorziening d.m.v. cv-ketel, merk Nefit, bouwjaar 2020 (december); <br/>- Begane grond voorzien van vloerverwarming; <br/>- Elektra 5 groepen met aardlekschakelaar; <br/>- Achter- en voorgevel voorzien van kunststof gevelbekleding; <br/>- Voorzijde 1e verdieping voorzien van kunststof kozijnen; <br/>- Kunststof dakkapel op 2e verdieping, geplaatst in 2015; <br/>- Buitenschilderwerk voor het laatst gedaan in 2021; <br/>- Alle vloeren zijn van beton; <br/>- Gelegen nabij doorgaand vaarwater van beschermd natuurgebied â\u0080\u009cde Eilandspolderâ\u0080\u009d; <br/>- De Rijp is een gezellig historische dorp voorzien van diverse basisscholen, diverse restaurants, winkels, winkelcentrum, apotheek, huisartsen en openbaar vervoer; <br/>- De Rijp is gelegen tussen Purmerend, Alkmaar en Zaanstad allen op circa 15 minuten rijafstand. Er zijn goede busverbindingen met Alkmaar, Purmerend en Amsterdam.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/543/597_1440x960.jpg", "kind_of_house": "Eengezinswoning, hoekwoning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel, open haard en gedeeltelijke vloerverwarming", "hot_water": "Cv-ketel", "boiler": "Nefit (2020)", "location": "Buttondown Farm, Zionsville, Boone County, Indiana, United States", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": 79, "garden_location": "Gelegen op het noorden bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1483 XM", "street": "Wevershof 71", "house_number": "71", "city": "derijp", "province": "noordholland", "lat": 52.55364, "lng": 4.84195, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "derijp", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}