{"url": "https://www.funda.nl/koop/venray/huis-42489260-westsingel-4/", "offer_type": "koop", "number_of_rooms": 3, "number_of_bathrooms": 1, "number_of_bedrooms": 2, "bathroom_facilities": "Ligbad en douche", "number_of_floors": 1, "outdoor_space": 9, "facilities": "Airconditioning en schuifpui", "volume_in_cubic_meters": 480, "living_area": 89, "plot_size": 347, "external_storage_space": "N/A", "asking_price": 325000, "asking_price_per_square_meter": 3652, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nWONINGRUIL  <br/>Deze woning  is  alleen beschikbaar  voor kopers  die een woning in  te  ruilen hebben die voldoet aan  de  wensen van de verkopers. <br/>De verkopers  zijn  op zoek naar een  vrijstaande of 2-onder-1 kap woning in Venray of Leunen in de prijsklasse tot ca. â\u0082¬ 400.000,-- kosten koper. Heeft u een woning die voldoet aan bovenstaande en bent u geïnteresseerd in deze woning dan horen wij dat graag.  <br/> <br/>Binnen de singels van Venray gelegen verrassende, vrijstaande semi-bungalow met 2 slaapkamers en een ruime berging. De afgelopen jaren is deze woning geheel gemoderniseerd en aan de achterzijde flink uitgebouwd. Het perceelsoppervlak bedraagt 347 m2. <br/> <br/>Begane grond:  <br/>U betreedt de woning middels de royale oprit aan de voorzijde. De oprit biedt plaats voor meerdere auto's. <br/>Bij binnenkomst valt meteen op hoe verrassend deze woning is ingericht en afgewerkt.  <br/>Dit begint bij de keuken. Deze fraaie inbouwkeuken is van alle luxe voorzien waaronder een vaatwasser, een gaskookplaat, een afzuigkap, een koelkast, een combi-magnetron en een inbouwkoffiezetapparaat. De fronten zijn afwerkt met fraaie massieve planken. Vanuit de keuken is middels een fraaie trap en een open verbinding de zolder te bereiken. Deze zolder leent zich uitermate voor bergruimte. Hier bevindt zich ook de cv-ketel. <br/>Aan de voorzijde van de woning bevindt zich de woonkamer. De woonkamer heeft een comfortabele oppervlakte van ca. 29 m2 en is verdeeld in een zithoek aan de voorzijde en een eethoek aan de achterzijde. De woonkamer is voorzien van airconditioning. Vanuit de zithoek kijkt u fraai uit over de Westsingel.  <br/> <br/>Het toilet bevindt zich achter de eethoek en staat in verbinding met de badkamer. Zowel het toilet en de badkamer zijn luxe uitgevoerd met o.a. een wandcloset, een ligbad, een inloopdouche en een fraai badmeubel met verwarmde spiegel. <br/>Voorts de 2 ruime slaapkamers van ca. 14 en 15 m2. De grootste slaapkamer is thans in gebruik als ouderslaapkamer en is voorzien van televisie- en internetaansluiting,  een fraaie inbouwkast, aircoditioning en een schuifpui naar de achtertuin.  <br/>De kinderkamer is eveneens voorzien van televisie- en internetaansluiting. <br/>Tussen de keuken en de slaapkamers bevindt zich nog de wasruimte. Hier zijn de aansluitingen voor de droger en de wasmachine aanwezig welke heerlijk op hoogte geplaatst kunnen worden.  <br/>Vanuit de achtertuin is de berging te bereiken. Deze berging is gebouwd met als doel om eventueel later bij de woonruimte te betrekken. Dit betekent dat deze ruimte geheel geïsoleerd is en zelfs voorzien is van vloerverwarming. Momenteel wordt deze ruimte gebruikt als hobbyruimte. De berging is verder voorzien van een loopdeur en een elektrische sectionaldeur. <br/> <br/>De gehele begane grond is voorzien van een tegelvloer (m.u.v. de berging) met vloerverwarming. De wanden zijn afgewerkt met stucwerk en deels voorzien van fraaie hoogwaardige wandbekleding.  <br/> <br/>Tuin: <br/>De tuin is geheel onderhoudsarm ingericht. De voortuin is ingericht met een verharde oprit middels strakke betonnen platen. Deze betonnen platen lopen door tot onder de fraaie aluminium overkapping in de achtertuin. De tuin is verder voorzien van een buitenkraan, electrapunten, buitenverlichting en een kachel. <br/> <br/>â\u0080¢ Betreft een zeer verrassende woning, geheel gemoderniseerd en instapklaar.  <br/>â\u0080¢ In 2019 is woning aan de achterzijde flink uitgebouwd met 2 slaapkamers en een ruime berging. <br/>â\u0080¢ Gelegen aan de singel van Venray op korte afstand van het centrum. <br/>â\u0080¢ De woning is voorzien van vloerisolatie en dubbel glas.  <br/>â\u0080¢ De woonkamer en ouderslaapkamer zijn voorzien van comfortabele airconditioning. <br/>â\u0080¢ Deze informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins, dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief. Eventuele bijgesloten plattegrond-tekeningen zijn ter indicatie en kunnen afwijken van de werkelijke situatie.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/830/310_1440x960.jpg", "kind_of_house": "Bungalow, vrijstaande woning", "construction_year": "N/A", "energy_label": "F ", "type_of_roof": "Zadeldak", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Remeha (gas gestookt combiketel uit 2001, eigendom)", "location": "N/A", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "N/A", "zipcode": "5801 TW", "street": "Westsingel 4", "house_number": "4", "city": "venray", "province": "limburg", "lat": 51.51989, "lng": 5.970056, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "westmidden", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}