{"url": "https://www.funda.nl/koop/weurt/huis-42580337-kerkstraat-23/", "offer_type": "koop", "number_of_rooms": 8, "number_of_bathrooms": 2, "number_of_bedrooms": 7, "bathroom_facilities": "Ligbad, douche en 2 toiletten", "number_of_floors": 2, "outdoor_space": "N/A", "facilities": "Alarminstallatie, buitenzonwering, dakraam, glasvezelkabel, natuurlijke ventilatie, rookkanaal en TV kabel", "volume_in_cubic_meters": 1949, "living_area": 299, "plot_size": 10913, "external_storage_space": 24, "asking_price": 995000, "asking_price_per_square_meter": 3328, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nWilt u landelijk  wonen  in een  RIJKSMONUMENT op  5 autominuten van Nijmegen,  beschikken  over een gigantisch perceel van  maar  liefst 10.913 m2 en genieten van  een  heerlijke  omgeving met prachtige  vergezichten? Dan hebben wij de perfecte woning voor u!  <br/> <br/>Dit sfeervolle royale KARAKTERISTIEKE MONUMENTALE WOONHUIS (T-boerderij) beschikt over maar liefst 7 slaapkamers en een uitzonderlijk riante tuin. Deze boerderijwoning is gedeeltelijk met riet gedekt en voorzien van een grote inpandige schuur en een eigen oprit. De woning is gedurende de jaren in stijl gerenoveerd waardoor de charme behouden is gebleven. Door de ligging van het woonhuis is het hier bijzonder rustig wonen. Diverse voorzieningen als een supermarkt, een basisschool, sportverenigingen en het openbaar vervoer bevinden zich in de directe omgeving. Op loopafstand bevindt zich de Waaldijk met prachtige uiterwaarden en vergezichten. Het centrum van Nijmegen en Beuningen is bovendien op fietsafstand te bereiken. Onder andere via stadsbrug \"de Oversteek\" is er een zeer goede aansluiting naar diverse snelwegen. Op deze locatie kan men dus profiteren van het dorpse karakter en tegelijkertijd zijn de voorzieningen van de stad binnen handbereik! <br/> <br/>Algemeen <br/>- Bouwjaar: 1789 <br/>- Woonoppervlak: 299 m2 <br/>- Overige inpandige ruimte: 94 m2 <br/>- Externe bergruimte: 24 m2 <br/>- Inhoud: 1949 m3 <br/>- Perceeloppervlak: 10.913 m2 <br/> <br/>Indeling <br/> <br/>Kelder: de ruime kelder is vanuit de woonkamer bereikbaar en voorzien van elektra, water en een raam. <br/> <br/>Begane grond: ruime hal met leistenen tegelvloer, meterkast, trapkast en toiletruimte met vrij hangend toilet en fontein. De hal geeft toegang tot een ruime slaap-/studeerkamer aan de voorzijde van het woonhuis welke is voorzien van een sierkachel met schouw. De tweede slaapkamer beschikt over een luxe wastafel en een groot raam. De derde slaap- c.q. opkamer bevindt zich boven de kelder en is voorzien van een wastafel.  <br/>Vanuit de hal is de royale woonkamer toegankelijk met een elektrische haard met schouw en openslaande deuren met hordeur naar de achtertuin. De woonkamer en de slaapkamers op de begane grond, met uitzondering van de slaapkamer boven de kelder, zijn voorzien van een massieve eikenhoutenvloer. De grote open keuken van massief eiken is voorzien van een inductiekookplaat (2018), een afzuigkap (2017), een combi-oven (Siemens), een vaatwasser (2020), een koelkast en voldoende opbergruimte. Bovendien is er in de keuken ruimte voor een grote eettafel.  <br/>Vanuit de keuken is de ruime bijkeuken bereikbaar met keukenblok met spoelbak en opbergruimte, vloerverwarming en de witgoedaansluitingen. Bovendien bevindt zich op de begane grond een royale badkamer met een ligbad, een douche, een wastafel, een vrij hangend toilet, een bidet, een designradiator, een raam, een Velux dakraam en vloerverwarming. De badkamer is op diverse plaatsen voorzien van marmeren elementen en afwerking.  <br/>In het achterhuis, ook wel de staart van de boerderij, is een grote inpandige bergruimte aanwezig. Deze is voorzien van elektra, water, een grote dubbele deur, twee aparte loopdeuren en een vaste trap naar een ruime bergzolder.  <br/> <br/>Eerste verdieping: overloop en badkamer voorzien van een inloopdouche, een vrij hangend toilet en een wastafel. Op deze verdieping bevinden zich maar liefst vier slaapkamers met mooie hoge plafonds. In drie slaapkamers is een wastafel aanwezig. De vierde slaapkamer is uitzonderlijk ruim en deze zou eventueel nog kunnen worden opgesplitst. Deze kamer beschikt over een bergkast met de c.v.-ketel (Remeha Calenta, 2018, eigendom), aan de ene zijde bergruimte achter de schotten en aan de andere zijde bergruimte achter schuifdeuren. De gehele eerste verdieping, met uitzondering van de overloop, is voorzien van een laminaatvloer. <br/> <br/>Tuin <br/>De woning beschikt over een eigen oprit welke is afgesloten met een sierhekwerk met een elektrische poort. Voor het woonhuis bevinden zich vier leilinden. Bovendien is de woning voorzien van een zeer riante achtertuin met terras en achterom met afsluitbare tuinpoort. In de tuin bevinden zich diverse peren- en appelbomen, één hazelnotenboom, vier druiven, vijf leilinden en prachtige lavendel en hortensiaâ\u0080\u0099s. Ook is er in de tuin een vrijstaand houten tuinhuis met elektra en een kas aanwezig. Daarnaast bevinden zich aan de achtergevel van de woning een elektrisch zonnescherm en een buitenkraantje. In de tuin zijn twee waterpulsen aanwezig. Een bevindt zich in het weiland en de andere (met elektrische waterpomp) bevindt zich naast het tuinhuis. De fraaie tuin loopt aan de achterzijde over in een weiland met prachtige vergezichten.  <br/> <br/>Bijzonderheden <br/>- De gehele woning beschikt over hardhouten kozijnen; <br/>- De openslaande deuren in de woonkamer en het dakraam in de badkamer zijn voorzien van isolerende beglazing;  <br/>- De woning is van oorsprong niet in spouw gebouwd. In circa 1973 zijn er in de gehele woning voorzetwanden geplaatst. Circa 20 jaar geleden zijn de gevels van de bijkeuken, de badkamer en de grote inpandige bergruimte geïsoleerd. Het gehele dak is geïsoleerd met steenwol en afgeschroefd met gipsplaten, met uitzondering van de met riet gedekte gedeeltes van de entresol en de grote inpandige bergruimte. In de badkamer en de bijkeuken is vloerisolatie aanwezig.  <br/>- De zinken dakgoot aan de achterzijde is in 2003 vervangen; <br/>- Het voegwerk is in 2014 vernieuwd; <br/>- De woning beschikt over een houten kapconstructie met zichtbare gebinten;  <br/>- De binten van het gehele dak zijn in 2000 behandeld door Rentokil;  <br/>- Gedurende de afgelopen 3-10 jaar zijn verschillende delen van het rieten dak vernieuwd. Dit is gedaan door rietdekkersbedrijf Hendriks uit Wijchen; <br/>- Op de plaatsen waar pannen liggen zit asbest in het dak; <br/>- Glasvezel aanwezig (wel aangelegd, niet aangesloten); <br/>- Het gehele woonhuis is voorzien van een alarminstallatie. Bovendien zijn de rookmelders aangesloten op de alarminstallatie. <br/> <br/>Kortom, een heerlijk karakteristiek ruim woonhuis met een prachtige tuin. Deze woning is zeker de moeite waard om te komen bekijken. <br/> <br/>Wij nodigen u graag uit voor een bezichtiging! Wij bieden verschillende mogelijkheden aan: <br/>- Persoonlijke bezichtiging (volgens de RIVM richtlijnen); <br/>- Videobellen via Whatsapp of Facebook. Wij als makelaar zijn dan live aanwezig tijdens de bezichtiging en u kunt vanuit huis of elders de woning bezichtigen via live video.  <br/> <br/>Interesse in dit huis? Schakel direct uw eigen NVM-aankoopmakelaar in. Uw NVM-aankoopmakelaar komt op voor úw belang en bespaart u tijd, geld en zorgen. Adressen van collega NVM-aankoopmakelaars vindt u op Funda.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/150/899/711_1440x960.jpg", "kind_of_house": "Woonboerderij, vrijstaande woning", "construction_year": "N/A", "energy_label": "N/A", "type_of_roof": "Samengesteld dak bedekt met pannen en riet", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Remeha Calenta (gas gestookt combiketel uit 2018, eigendom)", "location": "N/A", "garden": "Tuin rondom en zonneterras", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "N/A", "garage": "N/A", "zipcode": "6551 ZX", "street": "Kerkstraat 23", "house_number": "23", "city": "weurt", "province": "gelderland", "lat": 51.8591, "lng": 5.815974, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "weurtnoord", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}