{"url": "https://www.funda.nl/koop/tytsjerk/huis-42691028-woelwijk-3/", "offer_type": "koop", "number_of_rooms": 10, "number_of_bathrooms": 2, "number_of_bedrooms": 8, "bathroom_facilities": "Ligbad, 2 douches en 2 toiletten", "number_of_floors": 2, "outdoor_space": 26, "facilities": "Alarminstallatie, dakraam, natuurlijke ventilatie en zonnepanelen", "volume_in_cubic_meters": 835, "living_area": 201, "plot_size": 1443, "external_storage_space": "N/A", "asking_price": 635000, "asking_price_per_square_meter": 3159, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nOp een bijzondere  en  rustige woonstand  in het  bosrijke Tytsjerk staat deze  vrijstaande  semibungalow met ruime oprit, aangebouwde  garage  en een parkachtige tuin rondom met veel privacy. Het geheel  is goed onderhouden en gelegen op maar liefst 1443 m2 eigen grond. Begin jaren '90 is de opbouw geplaatst en sindsdien beschikt de bungalow over maar liefst 8 slaapkamers en 2 badkamers.  <br/> <br/>Tytsjerk is een groen dorp aan de oostkant van Leeuwarden en ligt nabij de 18-holes golfbaan, natuurgebieden De Grote Wielen en de Groene Ster en Park Vijversburg (ook bekend als het Bos van Ypeij). Voor de natuur- en wandelliefhebber, is dit een prachtige unieke woonomgeving.  <br/> <br/>Leeuwarden is met 10 autominuten bereikbaar. Supermarkten en overige winkels zijn te vinden in het buurtdorp Gytsjerk en in Hurdegaryp.  <br/> <br/>Indeling:  <br/>Overdekte entree in de ruime hal met een garderobe-nis, een bergkast, het toilet en de trap naar de verdieping. Middels een vanuit de hal bereikbare gang heeft u toegang tot de 4 slaapkamers en het kantoor. De 4 slaapkamers liggen aan de voorzijde van de bungalow en het kantoor bevindt zich aan de rechterzijde. Centraal op de begane grond en tevens vanuit de gang bereikbaar, ligt de badkamer met ligbad, 2e toilet, dubbele wastafel en douche.  <br/> <br/>De royale living is naar de tuin gesitueerd en voorzien van een schuifpui naar de tuin en een openhaard. Vanuit de living is er prachtig zicht naar de tuin. De half open en ruime keuken bevindt zich aan de linkerzijde van de living.  <br/>Vanuit de keuken is er toegang tot de gang/ bijkeuken met een deur naar de achtertuin en een deur naar de garage.  <br/> <br/>De diepe garage heeft een overhead deur en geeft aan de achterkant toegang tot de tuin. De groene parkachtige tuin is rondom de bungalow gelegen en biedt veel privacy. Het terras is gelegen op het zonnige zuiden.  <br/> <br/>1e verdieping:  <br/>Centraal op de verdieping gelegen overloop met toegang tot de slaapkamers en de badkamer. De 1e en de 2e slaapkamer liggen aan de voorzijde, de 3e en de 4e aan de achterzijde. Alle slaapkamers zijn voorzien van een dakkapel. De tweede badkamer heeft een 3e toilet, wastafel en douchecabine.  <br/> <br/>Een unieke plek voor de liefhebber van rust en ruimte in een groene bosrijke omgeving. <br/> <br/>- energielabel C <br/>- 1443 m2 eigen grond  <br/>- maar liefst 8 slaapkamers\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/411/802_1440x960.jpg", "kind_of_house": "Bungalow, vrijstaande woning (semi-bungalow)", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Heteluchtverwarming en open haard", "hot_water": "Cv-ketel", "boiler": "N/A", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Aangebouwde stenen garage", "zipcode": "9255 KE", "street": "Woelwijk 3", "house_number": "3", "city": "tytsjerk", "province": "friesland", "lat": 53.21371, "lng": 5.90798, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "tytsjerk", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}