{"url": "https://www.funda.nl/koop/bemmel/appartement-42583756-markt-28/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 2, "bathroom_facilities": "Toilet", "number_of_floors": 1, "outdoor_space": 107, "facilities": "Airconditioning, glasvezelkabel, lift, mechanische ventilatie en TV kabel", "volume_in_cubic_meters": 714, "living_area": 219, "plot_size": "N/A", "external_storage_space": "N/A", "asking_price": 1050000, "asking_price_per_square_meter": 4795, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nDit luxueuze penthouse  (209  m²) met  riant dakterras  van 107 m² ademt  luxe,  stijl en passie! <br/>Een juweel  van  een appartement op de bovenste woonlaag  van  het vier etages tellende  complex in modern-klassieke herenhuisstijl. De zonlichtbeleving in het penthouse is oogstrelend, de ruimtelijkheid adembenemend en de afwerking uitmuntend. De inrichting onder architectuur resulteert in een verbluffende combinatie van luxe, design, huiselijkheid en wooncomfort. Een plaatje om te zien en een genot om in te wonen! <br/> <br/>Aan alles is gedacht! <br/>Het penthouse voorziet in álles! Van een meesterlijke master bedroom met walk-in closet, Frans balkon en openslaande deuren naar het dakterras tot een in de puntjes geperfectioneerde pantry â\u0080\u0093 met eveneens een dubbele deur naar het terras â\u0080\u0093 ingericht met een complete tweede keuken! Om nog maar te zwijgen van de royale living met hoogwaardige open keuken, een tweede Frans balkon, twee dakkapellen, vier lichtkoepels, een sfeervolle brede inbouwgashaard en een ruim vier meter breed keukeneiland met wijnklimaatkasten en zitbar. <br/> <br/>Strak, modern en een tikkeltje industrieelâ\u0080¦ <br/>De alom aanwezige, donkergrijze gietvloer en strak gestucte wanden geven het penthouse haar stijlvolle, moderne karakter. Een stijl die wordt versterkt door de minutieus geplaatste en in diverse vertrekken terugkerende industriële inbouwspots en de koof met indirecte verlichting in het plafond van de badkamer en langgerekte, L-vormige hal. Ook het verlaagde plafond boven het keukeneiland, waarin afzuiging, airconditioning, inbouwverlichting en een lichtkoepel zijn verenigd, is tot in perfectie uitgevoerd! <br/> <br/>Complex complex? Helemaal niet! <br/>Het overzichtelijke appartementsgebouw heeft op de begane grond haar entree naar de centrale hal. Hier kan de keuze worden gemaakt voor trap of lift om te stijgen naar de bovenste bouwlaag. In de benedenbouw bevindt zich een royale parkeergarage met extra brede privéparkeerplaats voor het penthouse pal naast de lift. Schuin daartegenover bevindt zich de collectieve, afsluitbare fietsenstalling.  <br/> <br/>Perfect gepositioneerd in het hart van Bemmel. <br/>Het uitzicht vanaf het dakterras â\u0080\u0093 op de Theaterkerk en het marktplein â\u0080\u0093 verraadt de centraalst denkbare ligging van het penthouse. Alle voorzieningen bevinden zich dan ook op loopafstand, waaronder: supermarkten, winkels en restaurants. In de directe omgeving zijn verder sport- &amp; fitnessfaciliteiten, scholen, kinderopvang, medische voorzieningen en de Waaldijk met haar uiterwaarden te vinden. De bushalte laat zich eveneens te voet bereiken en per bus, auto of fiets arriveren in het nabijgelegen Nijmegen is dan ook een kwestie van slechts tien tot twintig minuten. Bemmel beschikt over een eigen aansluiting op de A15 en met de A325, A50, A73 en A12 vlakbij is de bereikbaarheid zonder meer uitstekend! <br/> <br/>Jong, perfect geïsoleerd en voorzien van energielabel A. <br/>Het in 2010 gerealiseerde penthouse is in 2015 volledig onder architectuur ingericht. Vanzelfsprekend is het penthouse optimaal geïsoleerd met HR-beglazing en dak- &amp; spouwisolatie. Verwarming en warm tapwater worden geleverd door de Nefit Topline HR30 II cv-ketel (2015) met separate boiler (200 liter, van der Beyl) en 23 groepen tellende vloerverwarming. In de beide slaapvertrekken en de living is airconditioning aanwezig. Het penthouse beschikt over alle denkbare aansluitingen (ADSL, kabel en glasvezel) en er zijn meer dan voldoende elektragroepen voor de beide keukens en alle overige wenselijke elektrische apparatuur. In vrijwel alle vertrekken (zélfs in de badkamer) zijn netwerkaansluitingen aanwezig die kunnen worden gepatcht in de meterkast. <br/> <br/>Het appartementencomplex beschikt over een actieve en financieel gezonde Vereniging van Eigenaars (VvE), die onder andere de volgende zaken voor haar rekening neemt: schilderwerk complex, liftonderhoud, reservering reservefonds (o.a. onderhoud lange termijn), schoonmaak &amp; onderhoud parkeergarage, controles brandmeldinstallaties, elektriciteit hoofdsplitsing, vervangingen van bijv. tapijt in complex, onderhoud gemeenschappelijke ruimtes, hellingbaanverwarming parkeergarage, opstal- en glasverzekering, etc. <br/> <br/>Vraagprijs â\u0082¬ 1.050.000,- k.k. <br/>Aanvaarding in overleg\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/150/991/330_1440x960.jpg", "kind_of_house": "N/A", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Samengesteld dak bedekt met bitumineuze dakbedekking en pannen", "heating": "Cv-ketel, gashaard en gedeeltelijke vloerverwarming", "hot_water": "Cv-ketel en elektrische boiler", "boiler": "Nefit Topline HR30 II (gas gestookt combiketel uit 2015, eigendom)", "location": "N/A", "garden": "Zonneterras", "back_garden": "N/A", "garden_location": "Gelegen op het noordoosten", "balcony": "Dakterras aanwezig en frans balkon aanwezig", "type_of_parking": "Openbaar parkeren", "garage": "Parkeerkelder", "zipcode": "6681 AE", "street": "Markt 28", "house_number": "28", "city": "bemmel", "province": "gelderland", "lat": 51.89237, "lng": 5.898174, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "Penthouse", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "bemmel", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}