{"url": "https://www.funda.nl/koop/volendam/huis-42678685-gravelandstraat-48/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Douche en toilet", "number_of_floors": 3, "outdoor_space": "N/A", "facilities": "Buitenzonwering, dakraam, natuurlijke ventilatie, satellietschotel en TV kabel", "volume_in_cubic_meters": 392, "living_area": 87, "plot_size": 145, "external_storage_space": 19, "asking_price": 325000, "asking_price_per_square_meter": 3736, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nHou je van  vrij  uitzicht en  water? Dan  is deze woning misschien  wel  iets voor jou! <br/> <br/>Aan  de  voorzijde een heerlijke open ligging met  vrij  uitzicht over een waterpartij.  De natuur is hier letterlijk dichtbij. Fluitende vogeltjes, zwemmende eenden en zwanen zijn meer regel dan uitzondering! <br/> <br/>Deze goed onderhouden tussenwoning is gelegen in de wijk â\u0080\u0098Munnickenveldâ\u0080\u0099. Gelegen in een populaire woonwijk die al sterk aan het verjongen is. Ook een hele kindvriendelijke wijk met diverse speelveldjes met speeltoestellen waar kinderen lekker kunnen spelen. De woning is ook nog nabij de winkelstraat â\u0080\u009cBurgemeester van Baarstraatâ\u0080\u009d en het centrum van Volendam gelegen. <br/> <br/>Het betreft een ruime woning met een breedte van 5,7 mtr. met drie slaapkamers en een ruime 2e verdieping waar je zelfs nog meerdere slaapkamers zou kunnen maken. Daarnaast is er nog de beschikking over een extra bergzolder voor al de spullen die je nooit nodig hebt. Op het achtererf heb je de beschikking over een zeer ruime vrijstaande berging voorzien van elektra en water. <br/> <br/>INDELING <br/>Begane grond: Entree met trapopgang naar 1e verdieping, meterkast (4 groepen), half betegeld toilet, doorzon woonkamer, half open keuken in rechte opstelling voorzien van diverse inbouwapparatuur en deur naar het achtererf en inbouwkast. Op het achtererf staat een royale vrijstaande berging voorzien van wasmachine aansluiting. <br/> <br/>1e verdieping: Overloop met vaste trap naar 2e verdieping, voorslaapkamer, achterslaapkamer voorzien van schuifkastenwand, achterslaapkamer voorzien van inbouwkast en een betegelde badkamer voorzien van badmeubel, wandcloset en douchecabine.  <br/> <br/>2e verdieping: Bergzolder/slaapkamer voorzien van CV ketel (Intergas uit 2016), bergruimte in schuinte en bergkast. <br/> <br/>Vliering: Bergzolder bereikbaar vide op 2e verdieping. <br/> <br/>Ben je op zoek naar een ruime woning met een gunstige ligging in een kindvriendelijke woonwijk? Kom dan eens kijken naar deze woning aan de Gravelandstraat 48 in Volendam. We nemen je graag mee voor een rondleiding!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/586/491_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Intergas (gas gestookt combiketel uit 2016, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 66, "garden_location": "Gelegen op het zuidwesten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1131 JJ", "street": "Gravelandstraat 48", "house_number": "48", "city": "volendam", "province": "noordholland", "lat": 52.5052, "lng": 5.075157, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "volendamrozettenbuurt", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}