{"url": "https://www.funda.nl/koop/purmerend/huis-42680876-amazonelaan-90/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 2, "number_of_bedrooms": 3, "bathroom_facilities": "Ligbad, 2 douches en toilet", "number_of_floors": 3, "outdoor_space": 6, "facilities": "Mechanische ventilatie, natuurlijke ventilatie en TV kabel", "volume_in_cubic_meters": 456, "living_area": 137, "plot_size": 180, "external_storage_space": 19, "asking_price": 550000, "asking_price_per_square_meter": 4015, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nVergeet Delfts blauwâ\u0080¦  Purmerends  blauw voor  jou! <br/>Gewoon  is ook maar gewoon.  Kies  jij dus ook liever voor  net  even anders? Dan moet je zeker even komen  kijken op Amazonelaan  90. Hier een buitengevel in Purmerends blauw en rechte gevels tot de tweede verdieping.  Ruimte in overvloed dus in dit twee onder een kaphuis met garage. En dan woon je ook nog eens lekker dicht bij alle voorzieningen en is het huis super netjes afgewerkt.  <br/>Alle reden dus om hier even een kijkje te nemen. <br/> <br/>De woning is gelegen aan een straat die voor de normale auto's geen doorgaande weg is. De bus daarentegen kan via de bussluis wel doorrijden. Je pakt de bushalte hier echt op nog geen 2 minuten loopafstand. In ongeveer 30 minuten reis je hierna richting Amsterdam. De boodschappen doe je bij winkelcentrum Weidevenne. Dit is naast de auto ook heel goed bereikbaar met de fiets of je gaat lekker lopen. Dit kost je maximaal 10 minuten. De kinderen kunnen in de omgeving ook hun gang gaan. Er zijn namelijk verschillende speelplaatsen en basisscholen.  <br/> <br/>Globale indeling: <br/>De auto kun je vrij parkeren voor de woning.  <br/>Via de voordeur loop je via de entree, waar het toilet en de meterkast zijn gelegen, zo de woonkeuken in. Je ziet dat hier de wanden voorzien zijn van spachtelputz en op de vloer is een mooie laminaatvloer geplaatst. De L-vormige keuken beschikt over de nodige inbouwapparatuur en natuurlijk een hele mooie losstaande koelkast. Deze is eventueel ter overname. Lopen we verder we woonkamer in dan merk je dat het een hele ruime woonkamer is met een leuk detail; de uitkragende erker. Daarnaast brengen de grote ramen veel licht de kamer binnen. <br/> <br/>De vaste trap brengt je naar de overloop op de eerste verdieping. Hier is een ruimte gecreëerd die op het moment is ingedeeld als werkplek. Dit is een ideale plek om thuis te werken. Mocht je deze ruimte nu liever benutten als slaapkamer dan hoef je maar een wand te plaatsen en je bent 'good to go'. Op de verdieping tref je een apart toilet en een hele prettige badkamer met douche, ligbad en wastafel. De slaapkamer aan de achterzijde is voorzien van nette wanden voorzien van spachtelputz en een laminaatvloer. De kastenwand biedt ruimte voor meer dan voldoende kleding! <br/> <br/>Lopen we verder naar de tweede verdieping. Hier tref je nog twee ruime slaapkamers welke ook afwerkt zijn met een laminaatvloer en spachtelputz. Daarnaast heeft de slaapkamer aan de achterzijde een groot pluspunt; een heerlijk balkon van ruim 6m2 welke ligt op het noordwesten. De avondzon, een glaasje wijn... Zie jij jezelf al wegdromen? <br/> <br/>De tuin is strak afgewerkt en beschikt over een grote garage waar je prima jouw oldtimer kan stallen. Daarnaast kun je deze garage ook goed gebruiken voor het plaatsen van fietsen of een brommer natuurlijk!  <br/> <br/>Bulletpoints: <br/>- 2/1 kapwoning met garage; <br/>- 2 badkamers; <br/>- ruime slaapkamers door rechte wanden; <br/>- nabij alle denkbare openbare voorzieningen; <br/>- energielabel A <br/> <br/>Is blauw jouw favoriete kleur? Dat wordt het in ieder geval zeker als je een kijkje hebt genomen op Amazonelaan 90. Hoog tijd dus om een bezichtiging in te plannen en vergeet vooral ook niet om de video te bekijken die Laura hier heeft opgenomen. Daarin laat ze je trouwens ook zien dat je in dit gedeelte van Weidevenne niet alleen lekker centraal woont maar ook in een fijne groene omgeving.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/007/175_1440x960.jpg", "kind_of_house": "Eengezinswoning, 2-onder-1-kapwoning", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Plat dak bedekt met bitumineuze dakbedekking", "heating": "Stadsverwarming", "hot_water": "Centrale voorziening", "boiler": "N/A", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 60, "garden_location": "Gelegen op het noordwesten bereikbaar via achterom", "balcony": "Balkon aanwezig", "type_of_parking": "Openbaar parkeren", "garage": "Vrijstaande stenen garage", "zipcode": "1448 XM", "street": "Amazonelaan 90", "house_number": "90", "city": "purmerend", "province": "noordholland", "lat": 52.49695, "lng": 4.928755, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "amerika", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}