{"url": "https://www.funda.nl/koop/sirjansland/huis-88048329-zandweg-1/", "offer_type": "koop", "number_of_rooms": 9, "number_of_bathrooms": 4, "number_of_bedrooms": 7, "bathroom_facilities": "Ligbad, 4 douches en 3 toiletten", "number_of_floors": 4, "outdoor_space": 55, "facilities": "Dakraam, mechanische ventilatie, rookkanaal en TV kabel", "volume_in_cubic_meters": 680, "living_area": 291, "plot_size": 2015, "external_storage_space": 4, "asking_price": 1195000, "asking_price_per_square_meter": 4107, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nUNIEK WONEN IN  ALLE  RUST, VEEL  PRIVACY, RONDOM  GROEN, wie wilt dat  nu  niet?! Werkelijk een paradijsje. En  dat  óók nog eens op 5 minuten afstand van de noodzakelijke  voorzieningen in Bruinisse en Nieuwerkerk! Slechts enkele minuten verwijderd van de golfbaan Grevelingenhout. <br/> <br/>Permanent en/of 2e bewoning is TOEGESTAAN! <br/> <br/>DELTA Makelaardij mag u namens haar opdrachtgever deze ruime vrijstaande villa met groot vrijstaand gastenverblijf te koop aanbieden. Een parel van een woonhuis gelegen in het rustige Sirjansland nabij het uitgestrekte natuurgebied Dijkwater en op fietsafstand van de Grevelingen! De naam in de volksmond \"het verscholen huis\" doet zich eer aan, omgeven door groen, rust en privacy! Dit voelt echt als thuiskomen! <br/> <br/>Deze villa is in 2020/2021 een werkelijke metamorfose ondergaan, prachtig afgewerkt met veel luxe in en rondom het huis; gebruik van hoogwaardige kwaliteit materialen staan hier garant. Er is veel leefruimte in en rondom het woonhuis wat zorgt voor een hele aangename woonomgeving.  <br/> <br/>Woonoppervlakte woning 184m2; Woonoppervlakte gastenverblijf 107m2; Perceeloppervlakte 2.015m2. <br/> <br/>Welkom aan de Zandweg 1 te Sirjansland! <br/> <br/>Als u de oprit komt oprijden zult u direct de rust, sfeer en groene omgeving ervaren, heerlijk toch?! Op de oprit kunnen met gemak een 4 a 5-tal auto's geparkeerd worden, ruimte genoeg dus. <br/> <br/>Indeling begane grond <br/>Vanuit de entree van de woning kunt u diverse ruimtes betreden waaronder de kantoorkamer, badkamer op begane grond en de woonkeuken.  <br/> <br/>De badkamer op begane grond is netjes afgewerkt, goed onderhouden en is voorzien van een douche, toilet en wastafel. Als u doorloopt in de hal komt u in de woonkeuken, deze is vernieuwd in 2020 en is voorzien van divers luxe inbouwapparatuur waaronder een inductie kookplaat, afzuigkap, Quoocker, oven, magnetron, vaatwasser en koelkast. Achter de keuken is de bijkeuken gelegen welke voorzien is van witgoedaansluitingen, een 2-tal vaste kasten en het 2e toilet. <br/> <br/>Vanuit de keuken loopt u via de eetkamer naar de woonkamer. De woonkamer is ruim van opzet, praktisch in te delen en beschikt over een sfeervolle gashaard. Tevens zorgt de vloerverwarming op begane grond voor een aangename warmte in de koude wintermaanden.  <br/> <br/>Indeling 1e verdieping <br/>De trap in de woonkeuken brengt u naar de 1e verdieping waar toegang is tot een 4-tal kamers bestaande uit een 3-tal slaapkamers en een badkamer. Tevens is vanuit de overloop nog een 2e toilet bereikbaar. De masterbedroom is groot te noemen, krijgt veel natuurlijk lichtinval door de grote dakkapel en beschikt over een badkamer en suite. Deze badkamer is tevens ruim van opzet en v.v. een ligbad, douche en wastafel en is ook vanaf de overloop te bereiken. Er zijn nog een 2-tal ruime slaapkamers op deze verdieping waarvan 1 in gebruik is genomen als inloopkast.  <br/> <br/>Tuin <br/>De tuin rondom is geheel verzorgd, prachtig aangelegd en voorzien van diverse borders, terrasjes, fruit boomgaard, mooie rozenstruiken, dak platanen, vijgenbomen, een grote carport en last but not least een mega grote overkapping waar u heerlijk de avonduurtjes kunt doorbrengen onder het genot van een aperitiefje, wie wilt dat nou niet?! Het geheel is omheind en afgesloten middels een houten hekwerk. In de tuin aan de achterzijde is nog een ruime houten berging aanwezig, ideaal te gebruiken voor uw tuinspullen e.d.  <br/> <br/>Gastenverblijf <br/>Wat een plaatje! Een prachtig groot gastenverblijf welke de mogelijkheid biedt voor wel een 5-tal slaapplaatsen verdeelt over de begane grond en 1e verdieping.   <br/> <br/>Het appartement op begane grond is groot te noemen, is voorzien van een leuke zithoek/eethoek, openslaande tuindeuren en een badkamer v.v. toilet, wastafel en douche.  <br/> <br/>De badkamer op begane grond behoort bij het appartement op de 1e verdieping. De badkamer is v.v. een douche, toilet en wastafel. De 1e verdieping is ruim van opzet, beschikt over een separate slaapkamer, grote zithoek, eigen keuken v.v. inbouwapparatuur en is zeer licht door de vele dakramen en lichtkoepels.   <br/> <br/>Algemene informatie gastenverblijf <br/>Het gastenverblijf beschikt over een eigen cv-opstelling Remeha 2007 en meterkast; Begane grondvloer van beton, verdiepingsvloer van hout; Stalen constructie met houten gordingen en dakisolatieplaten; Geheel dubbel glas in houten kozijnen. <br/> <br/>Het dorp <br/>Sirjansland is een heel rustig en gemoedelijk dorp omgeven door landerijen en een prachtig natuurgebied. Het dorp kent ca. 350 inwoners en is gelegen op 5 minuten autorijden van Nieuwerkerk en Bruinisse waar vele noodzakelijke faciliteiten beschikbaar zijn. Het dorp is op ca. 15 minuten autorijden van Zierikzee, 30 minuten van Goes en 35 minuten van Rotterdam.   <br/> <br/>Algemeen <br/>De woning wordt verwarmd en warm water wordt aangestuurd door de gas cv-opstelling Nefit 2011; nieuwe luxe keuken geplaatst in 2020; gashaard nieuw geplaatst in 2020; vloerverwarming op gehele begane grond; de houten potdeksel elementen zijn vernieuwd in 2021 en geheel voorzien van isolatie; buitenzijde gevel en houten kozijnen in 2021 geschilderd; 12 stuks zonnepanelen; oplevering in onderling overleg.  <br/> <br/>Ziet u zich wonen in deze luxueuze villa? Neem dan snel contact op voor een afspraak op maat, de makelaar leidt u graag rond.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/155/372_1440x960.jpg", "kind_of_house": "Villa, vrijstaande woning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Lessenaardak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Nefit (gas gestookt combiketel uit 2011, eigendom)", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Carport", "zipcode": "4308 AC", "street": "Zandweg 1", "house_number": "1", "city": "sirjansland", "province": "zeeland", "lat": 51.67256, "lng": 4.033289, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "verspreidehuizensirjansland", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}