{"url": "https://www.funda.nl/koop/volendam/huis-41351942-boezelgracht-122/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Jacuzzi, douche en toilet", "number_of_floors": 3, "outdoor_space": 9, "facilities": "Jacuzzi, mechanische ventilatie, rolluiken en TV kabel", "volume_in_cubic_meters": 540, "living_area": 158, "plot_size": 135, "external_storage_space": "N/A", "asking_price": 425000, "asking_price_per_square_meter": 2690, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nPrachtig gelegen op  een  vrije hoeklocatie  in de  wijk Middengebied is dit  wel  zeer royale hoekwoonhuis in verkoop  gekomen.  <br/> <br/>Zoekt u een woning met veel ruimte, dan moet  u zeker komen kijken. De woonkamer is aan de achterzijde flink uitgebouwd waardoor een zee aan ruimte aanwezig is. Daarnaast beschikt de woning over een erker, aangebouwde keuken en berging. <br/>De woonoppervlakte meet maar liefst 158 m².  <br/> <br/>De indeling is als volgt: <br/>U betreedt de woning via de zij-entree met hal en luxe betegeld toilet met urinoir.  <br/>De L-woonkamer is enorm (ca. 54 m²) en biedt veel ruimte en comfort door de erker aan de voorzijde, uitbouw aan de achterzijde, tuindeuren, natuurstenen vloer met vloerverwarming, stucplafond, bergkast en veel prettige lichtinval. <br/>Vanuit de woonkamer de half open keuken met nette keukeninrichting met 5- pits gaskookplaat, rvs afzuigkap, combi-oven, Amerikaanse koelkast en vaatwasser.  <br/>Vervolgens de ruime geheel betegelde bijkeuken/berging met opstelplaats voor de wasmachine. <br/>De zonnige achtertuin is ommuurd en gelegen op het zuiden zodat u tot laat van de zon kunt genieten. <br/> <br/>1e Verdieping: overloop, royale ouderslaapkamer met toegang tot een dakterras, 2e slaapkamer aan de voorzijde en de grote nette badkamer met hoek-jacuzzi, zwevend toilet, wastafelmeubel en ruime douchecabine. <br/> <br/>2e Verdieping: overloop met inbouwkasten en zijraam, CV opstelling en de mooi afgewerkte grote 3e slaapkamer met inbouwkasten, dakkapel en laminaatvloer. <br/> <br/>Vanuit de woonkamer heeft u een mooi vrij uitzicht over een gracht, veel groen en een waterpartij. Voor de kinderen zijn speelveldjes en een basisschool op een steenworp afstand aanwezig. <br/>De woning is onder meer nog voorzien van elektrische rolluiken, overal gladde stucplafonds, hardhouten ramen en kozijnen met isolatieglas, extra kruipruimte isolatie, dak- en gevelisolatie. Bouwjaar 1997. <br/> <br/>Zoekt u een hoekwoning van riante afmeting op een mooie hoeklocatie, dan is dit zeker iets voor u!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/141/348/302_1440x960.jpg", "kind_of_house": "Eengezinswoning, hoekwoning", "construction_year": "N/A", "energy_label": "B ", "type_of_roof": "Dwarskap bedekt met pannen", "heating": "Cv-ketel en gedeeltelijke vloerverwarming", "hot_water": "Cv-ketel", "boiler": "Remeha Aquanta HR (gas gestookt combiketel, eigendom)", "location": "Buttondown Farm, Zionsville, Boone County, Indiana, United States", "garden": "Achtertuin en voortuin", "back_garden": 25, "garden_location": "Gelegen op het zuiden bereikbaar via achterom", "balcony": "Balkon aanwezig", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1132 PL", "street": "Boezelgracht 122", "house_number": "122", "city": "volendam", "province": "noordholland", "lat": 52.50543, "lng": 5.06539, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "volendammiddengebied", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}