{"url": "https://www.funda.nl/koop/venray/huis-88901751-nevadahof-7/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Douche en toilet", "number_of_floors": 2, "outdoor_space": "N/A", "facilities": "Buitenzonwering, natuurlijke ventilatie, rookkanaal en TV kabel", "volume_in_cubic_meters": 527, "living_area": 132, "plot_size": 645, "external_storage_space": "N/A", "asking_price": 525000, "asking_price_per_square_meter": 3977, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nIn de mooie  bosrijke  omgeving van  Venray, bieden  wij deze ruime vrijstaande  villa  aan. De woning is o.a.  voorzien  van een ruime woon-/eetkamer, aparte keuken met inbouwapparatuur, een badkamer,  3 slaapkamers, een garage met oprit en een royale tuin. <br/> <br/>Ligging: <br/>De woning is gelegen in een rustige straat aan de rand van het bos, ideaal voor buiten- en groenliefhebbers! In de nabije omgeving zijn o.a. diverse winkels en supermarkten, sportverenigingen, gezondheidszorg, (basis)scholen en een speeltuin te vinden. Het centrum van Venray ligt op fietsafstand en ook het openbaar vervoer vind je binnen handbereik.  <br/> <br/>Indeling <br/>Begane grond: <br/>Ruime entree/hal met meterkast, trapopgang naar de 1e verdieping, toilet met fonteintje en toegang tot de woon-/eetkamer en keuken. Ruime woon-/eetkamer met open haard en openslaande deuren naar de tuin. Keuken, enkel bereikbaar via de hal, met diverse inbouwapparatuur, zoals combi-oven, gaskookplaat en koel-/vrieskast. Tevens biedt de keuken toegang tot de tuin en de garage. <br/> <br/>1e verdieping: <br/>Overloop met toegang tot 3 slaapkamers en de badkamer. Badkamer met wastafelmeubel, 2e toilet en douche. 3 slaapkamers met opbergruimten, waarvan 1 slaapkamer met wasbak en toegang tot een bergruimte.  <br/> <br/>Garage: <br/>Inpandige garage met oprit, opstelling CV-ketel en wasmachine/droger aansluiting. Voorzien van water, verwarming en elektra. <br/> <br/>Tuin: <br/>Royale tuin rondom met veel groen, een vrijstaande houten berging en een achterom. <br/> <br/>Bijzonderheden: <br/>-\tBouwjaar: 1975; <br/>-\tPerceeloppervlakte: 645 m²; <br/>-\tInhoud: 527 m³; <br/>-\tWoonoppervlakte: 132 m² conform NEN2580 voorwaarden gemeten; <br/>-\tGeheel voorzien van hardhouten kozijnen met dubbel glas (met uitzondering van garage); <br/>-\tVerwarming middels CV-ketel en open haard; <br/>-\tWarm water middels CV-/combiketel (2016); <br/>-\tDeels voorzien van buitenzonwering; <br/>-\tParkeren op eigen terrein of openbaar parkeren; <br/>-\tAanvaarding/oplevering in overleg, maar is snel mogelijk. <br/> <br/>Deze informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins, dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/152/586/351_1440x960.jpg", "kind_of_house": "Villa, vrijstaande woning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel en open haard", "hot_water": "Cv-ketel", "boiler": "Gas gestookt combiketel uit 2016, eigendom", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Inpandig", "zipcode": "5801 PM", "street": "Nevadahof 7", "house_number": "7", "city": "venray", "province": "limburg", "lat": 51.51688, "lng": 5.956782, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "veltum2", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}