{"url": "https://www.funda.nl/koop/purmerend/huis-42601231-tuinstee-60/", "offer_type": "koop", "number_of_rooms": 6, "number_of_bathrooms": 2, "number_of_bedrooms": 5, "bathroom_facilities": "Ligbad, 2 douches en 2 toiletten", "number_of_floors": 2, "outdoor_space": 8, "facilities": "Alarminstallatie, buitenzonwering, mechanische ventilatie, schuifpui en TV kabel", "volume_in_cubic_meters": 590, "living_area": 171, "plot_size": 222, "external_storage_space": 6, "asking_price": 600000, "asking_price_per_square_meter": 3509, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nNet even wat  meerâ\u0080¦  <br/>Of eigenlijk  heel wat  meer, dat is wat  je  krijgt op Tuinstee 60 in  Purmerend.  Deze 2-onder-1 kapwoning biedt jou flink  wat  extra.  Wat te  denken van extra ruimte (zo is de woonkamer uitgebouwd en is de voormalige garage omgetoverd tot praktijkruimte/werkplek) extra comfort (niet één maar twee badkamers) en extra zon in de tuin (deze is gelegen op het westen en ligt ook nog eens aan het water) <br/> <br/>In 2021 is het huis flink verbouwd en zijn er kunststof kozijnen geplaatst met HR++glas. Je begrijpt, dat betekent een lage energierekening en de buitenboel schilderen is hier niet meer nodig. <br/>Heeft dit je allemaal nog niet over de streep getrokken? Dan doet het volgende het zeker; ook voor je auto is plek, je kunt deze op eigen terrein parkeren. Daarnaast is ook de achtertuin onder handen genomen waarbij gekozen is voor een stoere overkapping waar je ook op dagen dat het weer wat minder is toch lekker beschut buiten kunt zitten. <br/>Een huis dus voor wie behoefte heeft aan wat extraâ\u0080\u0099s. Spreekt jou dat wel aan? Lees dan snel verder <br/> <br/>Wil je er even op uit? Je woont hier aan de rand van de wijk Purmer Noord. De golfbaan aan de Westerweg is vlakbij. Na het werk nog even een balletje slaan is hier dus een eitje. Ook voor je dagelijkse boodschappen hoef je hier niet ver. Winkelcentrum het Gildeplein is maar een paar minuten fietsen. <br/>Zo woon je hier dus rustig en in een groene omgeving maar wel in de buurt van alle dagelijkse benodigdheden. <br/>Daarnaast woon je op steenworpafstand van de bushalte. De bus brengt je binnen een half uur naar Amsterdam.  <br/> <br/>Indeling: <br/>De auto parkeer je uiteraard op eigen erf. Vandaar uit loop je de voordeur binnen. Vanuit de entree heb je toegang tot het kantoor aan de voorzijde (ideaal als je veel moet thuiswerken!), de garage die is omgetoverd tot professionele tweede keuken (je zou hier ook een praktijkruimte kunnen maken) en het toilet. Via de gave stalen deuren kom je in de gigantische leefruimte. De aanbouw die hier geplaatst is over de gehele breedte van het huis zorgt ervoor dat je aan ruimte hier zeker geen gebrek gaat hebben. Hier vind je dan ook de Vtwonen woonkamer en luxe keuken die uiteraard voorzien is van alle gemakken. Wat dacht je namelijk van: een 4 pits inductie kookplaat, een koelvriescombinatie, een stoomoven, een oven, een Quooker, een magnetron en uiteraard niet te vergeten een vaatwasser.  <br/>De eerste verdieping is net als de begane grond erg ruim. Hier bevinden zich twee ruime slaapkamers waarvan de slaapkamer aan de achterzijde nog een heerlijke ruime inloopkast heeft. De wasmachine en droger kun je in het washok plaatsen, die vanaf de overloop te betreden is. De eerste badkamer is voorzien van een ligbad, douche, dubbele wastafel en toilet.  <br/> <br/>De tweede badkamer is gelegen op de tweede verdieping. Deze badkamer heeft een douchecabine, toilet en wastafel.  <br/>Ook op deze verdieping hebben we twee ruime slaapkamers. De slaapkamer aan de achterzijde is extra groot door de dakkapel die hier geplaatst is, maar de slaapkamer aan de voorzijde heeft ook wat extra's... namelijk een dakterras! <br/> <br/>Vanuit de woonkamer betreed je de ruime achtertuin. Deze is omstreeks 2019 helemaal aangepakt en het resultaat mag er zijn! Over de gehele breedte is er een waanzinnige overkapping gemaakt met bergruimte. Hier kun je het gehele jaar genieten. Oh ja! De tuin ligt ook nog eens aan het water, ideaal toch!? <br/> <br/>Bulletpoints: <br/>- Super veel ruimte (ca. 172m2 incl. praktijk/keukenruimte) <br/>- Twee badkamers <br/>- Bijna alle kozijnen vervangen voor HR ++  Kunststof  <br/>- Parkeren op eigen erf <br/>- Zonnige tuin met gave overkapping  <br/> <br/>Een extra groot huis, meer comfort en een fijne zonnige tuin, Tuinstee heeft het allemaal. Wil jij meer zien van dit huis? Bekijk dan snel de woningvideo die Mariska hier heeft opgenomen en vergeet niet daarna de telefoon te pakken om een afspraak in te plannen voor een bezichtiging. Tot snel.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/774/892_1440x960.jpg", "kind_of_house": "Eengezinswoning, geschakelde 2-onder-1-kapwoning", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Lessenaardak bedekt met pannen", "heating": "Stadsverwarming", "hot_water": "Stadsverwarming", "boiler": "N/A", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 80, "garden_location": "Gelegen op het westen", "balcony": "Dakterras aanwezig", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Aangebouwde stenen garage", "zipcode": "1446 HH", "street": "Tuinstee 60", "house_number": "60", "city": "purmerend", "province": "noordholland", "lat": 52.50995, "lng": 4.995296, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "degraeffwegenomgeving", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}