{"url": "https://www.funda.nl/koop/rosmalen/huis-42608895-amberstraat-12/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Ligbad en toilet", "number_of_floors": 2, "outdoor_space": 13, "facilities": "Airconditioning, buitenzonwering, mechanische ventilatie, natuurlijke ventilatie, rolluiken en TV kabel", "volume_in_cubic_meters": 416, "living_area": 103, "plot_size": 142, "external_storage_space": 10, "asking_price": 359000, "asking_price_per_square_meter": 3485, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nDeze fijne eengezinswoning,  gebouwd  in 2006,  is gelegen  in de waterrijke wijk  de  Groote Wielen. Kindvriendelijk, fris en  modern  zijn woorden die de woonwijk typeren. Het water,  speeltuintjes, de Groote  Wielenplas met het strand zijn op loopafstand van de woning bereikbaar. Net als de basisschool, het gezondheidscentrum, supermarkt en sportverenigingen. Rosmalen centrum is op fietsafstand en ook de snelweg A2/A59 bereik je in een paar autominuten. Kortom, wonen op een rustige en gunstig gelegen locatie! <br/> <br/>Begane grond <br/> <br/>Entree/hal <br/>Via de voordeur kom je in de entreehal. Hier bevinden zich het toilet wat is voorzien van een fonteintje, de meterkast met voldoende groepen en een riante bergkast. Op de vloer is een fraaie tegelvloer gelegen. Vanuit de hal kun je via de trap naar de eerste verdieping en naar de woonkamer.  <br/> <br/>Woonkamer <br/>Vanuit de entreehal kom je in de woonkamer die aan de achterzijde van de woning is gelegen. Op de vloer is dezelfde tegelvloer gelegen als op de rest van de begane grond. De volledige begane grond is voorzien van een vloerverwarming. De woonkamer is sfeervol ingericht met een ruime zithoek, sommige wanden zijn voorzien van een fraaie behangsoort. Vanuit de woonkamer loop je via een tussengedeelte naar de keuken. <br/> <br/>Keuken <br/>De keuken is gelegen aan de voorzijde van de woning en is 2021 volledig vernieuwd. Een fraaie moderne opstelling met aan een zijde het kookgedeelte waar ook de eettafel in is verwerkt. Aan de andere zijde is het spoelgedeelte. De keuken is voorzien van een heetwaterkraan, koelkast, aparte vriezer, vaatwasser, combimagnetron en een inductiekookplaat met geïntegreerd afzuigsysteem. Daarnaast zijn er diverse kasten en opberglades. In de keuken is wederom dezelfde vloertegel gelegen als in de overige ruimtes op de begane grond. <br/> <br/>Bergkast <br/>Tussen de woonkamer en keuken is toegang tot een riante bergkast, ideaal voor proviand. <br/> <br/>Eerste verdieping <br/> <br/>Overloop <br/>Op de eerste verdieping kom je boven op de overloop welke toegang geeft tot drie slaapkamers en de badkamer. Vanuit de overloop is tevens de extra hoge berging bereikbaar waar o.a. de aansluitpunten voor wasmachine en droger zijn geplaatst. Hier hangt ook de CV ketel die door de huidige bewoners wordt geleased (Remeha Tzera bouwjaar 2020). De slaapkamers zijn voorzien van een laminaatvloer, de badkamer en berging hebben een tegelvloer.  <br/> <br/>Slaapkamers <br/>Op de eerste verdieping zijn drie slaapkamers. De ouderslaapkamer is gelegen aan de voorzijde van de woning en is voorzien van airconditioning en een vaste inbouwkast. Aan de achterzijde zijn nog twee slaapkamers gelegen waarbij een slaapkamer is voorzien van een extra verdieping. Ideaal als werkhoek of speelkamer voor kinderen. Alle kamers zijn voorzien van rolluiken. <br/> <br/>Badkamer <br/>De badkamer is voorzien van een ligbad, een wastafel met spiegelkast en een toilet. Tevens is een design radiator geplaats. <br/>Vliering <br/>Vanuit de overloop is via een vlizotrap een ruime vliering te bereiken. Deze ruimte is voorzien van daglicht. <br/> <br/>Exterieur <br/> <br/>Achtertuin <br/>Vanuit de woonkamer is de achtertuin bereikbaar. Een heerlijke tuin welke is voorzien van een afsluitbare veranda (bouwjaar 2012). De veranda heeft een doorzichtig plafond en een elektrisch bedienbare screen aan de buitenzijde. De veranda is voorzien van spatwaterdichte elektrapunten. De tuin is op het noordwesten georiënteerd en biedt veel privacy. Achter in de tuin staat een houten berging welke is voorzien van elektra. Deze berging biedt voldoende bergruimte voor o.a. fietsen en andere spullen. <br/> <br/>Parkeren <br/>Aan de achterzijde van de woning liggen 2 privé parkeerplaatsen en is een toegang naar de poort die naar de achtertuin en berging leidt. <br/> <br/>Bijzonderheden <br/>* Gewilde locatie in de Groote Wielen <br/>* Sfeervolle gezinswoning met woonkamer, separate keuken en 3 slaapkamers waarvan 1 met extra verdieping <br/>* De woning is voorzien van rolluiken <br/>* Mooie tuin op het noordwesten georiënteerd <br/>* Op fietsafstand van centrum Rosmalen <br/>* Diverse winkels, scholen en supermarkt op loopafstand <br/>* Ideaal gelegen t.o.v. uitvalswegen A2 en A59\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/655/391_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Lessenaardak", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Remeha Tzera Ace 28C (gas gestookt combiketel uit 2020, lease)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 52, "garden_location": "Gelegen op het noordwesten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "N/A", "zipcode": "5247 KC", "street": "Amberstraat 12", "house_number": "12", "city": "rosmalen", "province": "noordbrabant", "lat": 51.73542, "lng": 5.367443, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "broekland", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}