{"url": "https://www.funda.nl/koop/volendam/huis-42546901-westwal-7/", "offer_type": "koop", "number_of_rooms": 6, "number_of_bathrooms": 2, "number_of_bedrooms": 4, "bathroom_facilities": "Ligbad en toilet", "number_of_floors": 3, "outdoor_space": "N/A", "facilities": "Airconditioning, buitenzonwering, rolluiken, rookkanaal en TV kabel", "volume_in_cubic_meters": 541, "living_area": 144, "plot_size": 192, "external_storage_space": "N/A", "asking_price": 435000, "asking_price_per_square_meter": 3021, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nGelegen op een  mooie  locatie in  Volendam mogen  wij u deze zeer  ruime  hoekwoning met vrij uitzicht, aanbouwen,  twee  dakkapellen en flinke achter- en voortuin  te  koop aanbieden. De woning  ligt in een ruim opgezette en door het vele groen zeer kindvriendelijke wijk. Er is ruim voldoende parkeergelegenheid in de straat en voorzieningen als winkelcentrum â\u0080\u009cde Stientâ\u0080\u009d, bushalte en scholen liggen op loopafstand. De woning is in goede staat van onderhoud en afwerking.  <br/> <br/>Indeling:  <br/>Begane grond: via de netjes aangelegde en ommuurde, met een mooi hekwerk afsluitbare, voorstraat betreedt u de woning. Entree, hal met toegang tot zowel de woonkamer als de aanbouw. De entree bevindt zich in de bijna 12 meter lange aanbouw en hier treft u de meterkast, voorraadkast, garderobe en het recent vernieuwde toilet met wandcloset en fonteintje. Aansluitend een separate wasruimte en vervolgens de ruime berging welke ook toegang geeft tot de voorstraat. <br/> <br/>Woonkamer: royale L- vormige woonkamer met een plavuizenvloer, prachtige open haard en open trap naar de eerste verdieping. Rechtsachter in de woonkamer bevindt zich de open keuken in hoekopstelling. De keuken beschikt over diverse inbouwapparatuur zoals een 6- pits gasstel, afzuigkap, vaatwasmachine, oven, magnetron, koelkast en vriezer.  <br/> <br/>Via de keuken is de fraai aangelegde en diepe achtertuin te bereiken.  <br/> <br/>Eerste verdieping: overloop, twee slaapkamers en twee badkamers. Grote slaapkamer aan de straatzijde met onder andere kunststof draai/ kiepramen met rolluiken. Tevens is aan de straatzijde een moderne en luxe betegelde badkamer gesitueerd voorzien van een inloopdouche, wastafelmeubel, designradiator en toilet met wandcloset. Ook deze badkamer is voorzien van een kunststofkozijn met draai/ kiepramen en rolluik. <br/>Aan de achterzijde van de woning bevindt zich de tweede ruime slaapkamer en de tweede volledig betegelde badkamer voorzien van ligbad, wastafelmeubel en solarium. De ramen van de achterslaapkamer en badkamer zijn voorzien van aluminium schuiframen met rolluiken.  <br/> <br/>Tweede verdieping: via vaste trap bereikbaar, voorzolder met bergruimte en een logeerkamer met kast voor de cv- opstelling. Via een vlizotrap is de ruime bergzolder te bereiken.  <br/>Vervolgens een vierde grote slaapkamer met airco en aan beide zijden een kunststofdakkapel met rolluiken. Tevens is er voldoende bergruimte. <br/> <br/>De woning beschikt over een fraai aangelegde voor- en achtertuin. <br/> <br/>Ben je op zoek naar een riant woonhuis met veel privacy, rust en ruimte? Dan is dit je kans!!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/152/538/908_1440x960.jpg", "kind_of_house": "Eengezinswoning, eindwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Dwarskap bedekt met pannen", "heating": "Cv-ketel en open haard", "hot_water": "Cv-ketel", "boiler": "Bosch (gas gestookt combiketel uit 2010, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 65, "garden_location": "Gelegen op het oosten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1132 AX", "street": "Westwal 7", "house_number": "7", "city": "volendam", "province": "noordholland", "lat": 52.49794, "lng": 5.049453, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "volendamblokgouw1en2", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}