{"url": "https://www.funda.nl/koop/de-rijp/huis-42691489-driekoningenhof-31/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Douche en toilet", "number_of_floors": 2, "outdoor_space": "N/A", "facilities": "TV kabel", "volume_in_cubic_meters": 420, "living_area": 131, "plot_size": 326, "external_storage_space": "N/A", "asking_price": 500000, "asking_price_per_square_meter": 3817, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nDirect online een  bezichtiging  inplannen? Ga  naar onze  website! <br/> <br/>Op een  prachtige  locatie midden in de polder,  op  korte afstand van steden als Amsterdam, Alkmaar en  Zaanstad staat deze  geschakelde eengezinswoning met garage en ruime oprit stilletjes te wachten op een nieuwe eigenaar. 's Avonds de zon onder zien gaan, boot- en schaatstochtjes maken, in alle rust van de fluitende vogeltjes genieten; dát is wonen aan de Driekoningenhof 31. <br/> <br/>Deze ruimtelijke en lichte eengezinswoning met prachtig vrij uitzicht biedt een royale tuingerichte woonkamer, landelijke leefkeuken, drietal uitstekende slaapkamers en een verzorgde badkamer. Om over de zeer fraai aangelegde tuin op het altijd zonnige zuiden nog maar te zwijgen... <br/> <br/>Wil jij genieten van landelijke rust, stedelijke activiteit en de vrijheidsbeleving van het water? Dan nodigen we je van harte uit om deze woning met eigen ogen te bekijken. <br/> <br/>Indeling <br/> <br/>Begane grond <br/>Eenmaal de auto('s) geparkeerd op eigen erf, kom je de woning binnen in de hal met meterkast, toilet en inpandige toegang tot garage voorzien van cv-opstelling en aansluiting voor de wasapparatuur. Vanuit de hal kom je de woonkamer binnen. <br/> <br/>De royale woonkamer verwelkomt je met open armen; wat een ruimte en wat een licht afwerking! Dankzij de open indeling met mooie grote raampartijen op het zuiden strijken de zonnestralen hier heerlijk neer. De directe toegang tot de tuin maakt dat de grens tussen binnen en buiten al gauw vervalt, terwijl de open haard zorg draagt voor lange knusse winteravonden. Het uitzicht over de tuin en het aangrenzende polderlandschap zet alle spreekwoordelijke puntjes op de 'i'. <br/> <br/>In de aparte keuken aan de voorzijde staat een landelijk vormgegeven keukenblok in royale U-opstelling; aan werk- en opbergruimte geen gebrek. De speelse tegelvloer past helemaal in het geheel. Daarnaast is de keuken luxe uitgevoerd met een hardstenen aanrechtblad, anderhalve spoelbak, 6 pits gasfornuis met dubbele oven, afzuigkap, vaatwasser en een koel-/vriescombinatie. <br/> <br/>Eerste verdieping <br/>De fraaie open trapopgang in de woonkamer brengt je naar de eerste verdieping. Hier bevinden zich drie slaapkamers en de badkamer. De slaapkamers zijn stuk voor stuk van goed tot royaal formaat, aangenaam licht en keurig afgewerkt met een doorlopende laminaatvloer. De slaapkamers aan de achterzijde kijken prachtig vrij uit over het polderlandschap. <br/> <br/>Zoals verwacht is ook de badkamer netjes en verzorgd te noemen. De ruimte is volledig betegeld in een neutrale kleurstelling en voorzien van een wastafelmeubel met opbergruimte en spiegel, zwevend toilet, handdoekenradiator en een douchecabine. <br/> <br/>Tuin <br/>Met deze fraaie aangelegde achtertuin op het zuiden zit de buitenmens hier helemaal op zijn plek. Het geheel is met liefde en aandacht aangelegd met een combinatie van terras en een grote diversiteit aan groen. De tuin grenst aan het water en het polderlandschap, dus indien gewenst is het mogelijk om een eigen bootje aan te leggen. En wanneer de winter zijn intrede doet, dan bind jij gewoon vanuit de tuin de schaatsen onder! <br/> <br/>Bijzonderheden <br/>- De woning beschikt over 10 zonnepanelen (eigendom). <br/> <br/>Locatie <br/>Deze ruime woning is gelegen op een rustige locatie in een kindvriendelijke wijk. Je hebt hier de mogelijkheid om in de nabijheid een bootje neer te leggen om lekker te varen in de mooie Eilandspolder. Basisscholen, het openbaar vervoer, een winkelcentrum en de oude gezellige dorpskern met restaurants bevinden zich allemaal op loop- en fietsafstand. Ook diverse steden als Amsterdam, Purmerend en Alkmaar zijn goed bereikbaar. <br/> <br/>Deze woning heeft een definitief energielabel, te weten D. Deze verloopt op 10-12-2030.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/392/515_1440x960.jpg", "kind_of_house": "Eengezinswoning, geschakelde woning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "Dwarskap bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Nefit Topline (2008)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 128, "garden_location": "Gelegen op het zuiden", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Aangebouwde stenen garage", "zipcode": "1483 XP", "street": "Driekoningenhof 31", "house_number": "31", "city": "derijp", "province": "noordholland", "lat": 52.55279, "lng": 4.839551, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "derijp", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}