{"url": "https://www.funda.nl/koop/venray/huis-42682685-mastbos-7/", "offer_type": "koop", "number_of_rooms": 7, "number_of_bathrooms": 2, "number_of_bedrooms": 5, "bathroom_facilities": "Ligbad en toilet", "number_of_floors": 2, "outdoor_space": 4, "facilities": "Rookkanaal en schuifpui", "volume_in_cubic_meters": 510, "living_area": 150, "plot_size": 369, "external_storage_space": 16, "asking_price": 330000, "asking_price_per_square_meter": 2200, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nOp een fraaie  locatie  in de  groene wijk  Veltum gelegen levensloopbestendige woning  met  in totaliteit 5 slaapkamers, 2  badkamers,  een ruime tuin en een garage.  <br/> <br/>BEGANE  GROND <br/>Middels de  entree aan de voorzijde van de woning bereikt u de hal. <br/>De hal is voorzien van een tegelvloer, gestucte wanden, een gestuct plafond en de meterkast.  <br/>Vanuit deze centrale hal is elke ruimte op de begane grond te bereiken waaronder de slaapkamer en de badkamer.  <br/>De ruime L-vormige woonkamer welke is opgedeeld in een zitgedeelte aan de voorzijde en een eetgedeelte aan de achterzijde. Het zitgedeelte is voorzien van een openhaard en kijkt fraai uit over het voetpad. Vanuit de eethoek heeft u middels een schuifpui toegang tot de achtertuin. De woonkamer is afgewerkt met een laminaatvloer, gestucte/behangen wanden en een spuitwerk plafond.  <br/>Aansluitend de dichte eetkeuken met fraai uitzicht over de achtertuin. De keuken is voorzien van een tegelvloer en een royale maar iets wat gedateerde keukeninrichting. De keukeninrichting is in een hoek geplaatst en is voorzien van een vaatwasser, een gaskookplaat, een oven en een afzuigkap. <br/>De slaapkamer en badkamer op de begane grond zijn in 2002 aangebouwd. De slaapkamer is heerlijk tuingericht en is afgewerkt met vloerbedekking en gestucte wanden en plafond. Middels een brede schuifdeur (vanuit de slaapkamer en de hal) is de badkamer te bereiken. Deze ruime en gedeeltelijk betegelde badkamer is voorzien van een inloopdouche, een wandcloset en een wastafel. Het daglicht komt door een lichtkoepel. <br/>De berging/bijkeuken is vanaf de voorzijde van de woning te bereiken. In deze berging/bijkeuken bevindt zich de cv-ketel (Nefit uit 2000) en de witgoedaansluitingen. Verder is deze ruimte uitermate geschikt voor het plaatsen van fietsen en dergelijke.  <br/> <br/>1e VERDIEPING <br/>Op de eerste verdieping bevinden zich maar liefst 4 slaapkamers, de badkamer en een separate toilet.  <br/>De slaapkamers hebben een oppervlakte van ca. 12, 9, 8 en 8 m2 en zijn afgewerkt met vloerbedekking, behangen wanden en een houten schroten plafond.  2 Slaapkamers zijn voorzien van een inbouwkast. Een kamer aan de voorzijde is nog voorzien van een deur naar het balkon. <br/>De kleurrijke badkamer is uitgerust met een bad en een vaste wastafel. Verder is op de overloop een separaat toilet aanwezig.  <br/> <br/>TUIN: <br/>De achtertuin is ruim en biedt volop privacy. De tuin is ingericht met een terras, volop vaste beplanting en bomen. Verder is de tuin voorzien van verlichting, stroompunten en een buitenkraan. Ziet u uzelf hier van de zomer al zitten ? <br/> <br/>GARAGE: <br/>De garage(box) bevindt zich op loopafstand van de woning. Deze garage is voorzien van een kanteldeur en is ideaal te gebruiken als stallingsruimte voor de auto.  <br/> <br/>â\u0080¢    De woning is voorzien van een energielabel C. <br/>â\u0080¢    De woning is grotendeels voorzien van houten kozijnen met grotendeels dubbele beglazing.  <br/>â\u0080¢    De woning is levensloopbestendig en telt maar liefst 5 slaapkamers.  <br/>â\u0080¢    Deze informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins, dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief. Eventuele bijgesloten plattegrond-tekeningen zijn ter indicatie en kunnen afwijken van de werkelijke situatie.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/080/661_1440x960.jpg", "kind_of_house": "Eengezinswoning, geschakelde 2-onder-1-kapwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Plat dak", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Nefit (gas gestookt combiketel, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "N/A", "garage": "Vrijstaande stenen garage", "zipcode": "5801 SW", "street": "Mastbos 7", "house_number": "7", "city": "venray", "province": "limburg", "lat": 51.51955, "lng": 5.962272, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "veltum1", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}