{"url": "https://www.funda.nl/koop/oss/huis-42421748-jasmijnlaan-4/", "offer_type": "koop", "number_of_rooms": 8, "number_of_bathrooms": 3, "number_of_bedrooms": 5, "bathroom_facilities": "Ligbad, 3 douches en toilet", "number_of_floors": 3, "outdoor_space": 31, "facilities": "Airconditioning", "volume_in_cubic_meters": 1049, "living_area": 270, "plot_size": 1599, "external_storage_space": 10, "asking_price": 1100000, "asking_price_per_square_meter": 4074, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nUnieke villa! Gelegen  op  een super  locatie! <br/> <br/>De vrijstaande villa torent  er  letterlijk en figuurlijk bovenuit. <br/> <br/>Tijdens  (1968) en nà de bouw was  deze  woning  al een  bezienswaardigheid, aangezien het gedurende een aantal jaren de hoogste woning in Oss is geweest.  <br/>Dat deze villa is gebouwd onder architektuur is nog goed te zien in onder andere de markante voorgevel.  <br/>Maar liefst 1000 m3 woongenot wordt hier geboden op een riant perceel van bijna 1600 m2 met een schitterend uitzicht over de beeldbepalende vijver in Villapark De Hazenakker. Door de perfecte positionering van de woning op het perceel van 40 x 40 meter, is uw privacy gegarandeerd. <br/>Gelegen aan de rand van Oss en toch op korte afstand van het stadscentrum en NS-station Oss-Centraal, alsmede directe toegang tot de uitvalswegen naar de A 50 en A 59 die zowel Den Bosch als Nijmegen en Eindhoven uitstekend bereikbaar maken. <br/> <br/>De indeling is als volgt: <br/> <br/>Begane grond: <br/>- Entree, ruime hal, leisteen vloer, toiletruimte, meterkast voorzien van nieuwe, uitgebreide groepenkast. <br/>- L-vormige woonkamer met karakteristieke open haard-partij, 2 paar openslaande tuindeuren geven toegang tot het zonnige, zuidelijk gericht terras. <br/>- Keuken voorzien van nette inrichting, voorzien van ingebouwde keramische kookplaat, vaatwasmachine, oven, afzuigkap en separaat wandelement. <br/>- Aangrenzende bijkeuken met de witgoedaansluitingen, inloopdouche en toegang tot de tuin. <br/>- In circa 2000 is een royale tuinkamer gebouwd die zowel vanuit de keuken als via de woonkamer bereikbaar is; deze multifunctionele ruimte is voorzien van vloerverwarming en airco en is geschikt voor gebruik als slaapkamer, studeerkamer, hobbyruimte, atelier etc. <br/>- De inpandige garage is bereikbaar vanuit de hal; aan de voorzijde geeft een elektrische bedienbare segmentdeur toegang tot de diepe oprit; aan de achterzijde is via een loopdeur de achtertuin bereikbaar. <br/>- In de kelderruimte is de hetelucht-verwarmingsketel opgesteld, alsmede de warmwaterboiler voor de keuken en de douche in de bijkeuken; vanuit deze kelder is de royale kruipruimte toegankelijk die onder een groot deel van de parterrevloer doorloopt. <br/> <br/>1e verdieping: <br/>- Overloop. <br/>- Slaapkamer 1 (gelegen aan de achterzijde) met toegangsdeur naar balkon. <br/>- Slaapkamer 2 (gelegen aan de voorzijde) met airco en toegangsdeur naar balkon, vaste wastafel aanwezig. <br/>- Slaapkamer 3 (gelegen aan de voorzijde) met een vaste wastafel. <br/>- Studeerkamer. <br/>- Separate toiletruimte voorzien van wandcloset. <br/>- Geheel betegelde badkamer uitgerust met ligbad, separate douchecabine, badmeubel met vaste wastafel. <br/> <br/>2e verdieping: <br/>- Via vaste trap naar de overloop. <br/>- Bergruimte met 2 warmwaterboilers. <br/>- Geheel betegelde badkamer (2) met douchecabine, wandcloset en badmeubel met vaste wastafel. <br/>- Slaapkamer 4 (gelegen aan de voorzijde). <br/>- Slaapkamer 5 met vaste wastafel. <br/> <br/>De riante tuin omringt de villa aan alle zijden en biedt optimale privacy. <br/> <br/>Kenmerken: <br/>- Vrijstaande villa met inpandige garage, mogelijkheid voor het plaatsen van 2 auto's. <br/>- Inhoud: ruim 1000 m3. <br/>- Perceeloppervlakte: 1599 m2. <br/>- Bouwjaar: 1968. <br/>- Heteluchtverwarmingssysteem. <br/> <br/>NIEUWSGIERIG GEWORDEN ? <br/> <br/>Wilt u meer informatie over deze woning of een afspraak maken voor een bezichtiging ? Bel of mail ons dan gerust. Wij zijn u graag van dienst ! <br/> <br/>Tot slot: <br/>Alle informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt er echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins, dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/148/219/732_1440x960.jpg", "kind_of_house": "Villa, vrijstaande woning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "N/A", "heating": "Gashaard, heteluchtverwarming en gedeeltelijke vloerverwarming", "hot_water": "Gasboiler", "boiler": "N/A", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "Balkon aanwezig", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Inpandig", "zipcode": "5342 HJ", "street": "Jasmijnlaan 4", "house_number": "4", "city": "oss", "province": "noordbrabant", "lat": 51.75175, "lng": 5.536422, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "willibrorduswegwest", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}