{"url": "https://www.funda.nl/koop/venray/huis-42666752-brennerlaan-2/", "offer_type": "koop", "number_of_rooms": 12, "number_of_bathrooms": 1, "number_of_bedrooms": 6, "bathroom_facilities": "Ligbad en douche", "number_of_floors": 3, "outdoor_space": 6, "facilities": "Natuurlijke ventilatie, rookkanaal en schuifpui", "volume_in_cubic_meters": 949, "living_area": 243, "plot_size": 535, "external_storage_space": "N/A", "asking_price": 515000, "asking_price_per_square_meter": 2119, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nEen prachtige kans  om  in deze  grote vrijstaande  woning te wonen in  de  groenrijke woonwijk Vlakwater met veel  privacy!  <br/> <br/>Ligging <br/> <br/>In de wijk  de  Veltum, op een hele  rustige locatie, in Venray ligt dit grote woonhuis. De omgeving wordt gekenmerkt door veel groen en kwaliteit. Het centrum van Venray ligt op fietsafstand van deze woning en de A73 is te bereiken binnen 5 minuten. Tevens ligt vliegveld Weeze op circa 30 minuten rijden van deze woning. <br/> <br/>De gehele woning is voorzien van hetelucht verwarming hierdoor is het overstappen naar gasloos wonen zeer gemakkelijk! <br/> <br/>Indeling <br/> <br/>Begane grond <br/> <br/>Ruime entree met garderobe en met een prachtige vide. Een toiletruimte en wenteltrap naar de eerste etage en souterrain. Vanuit hier loopt u de woonkamer binnen waarbij u door de grote puien meteen over de tuin heen kijkt. In het voorste gedeelte is ruimte voor een heerlijke zit, achterin is een zitkuil gelegen waarbij van de open haard kan worden genoten. De keuken is compact maar van alle apparatuur voorzien. Via de keuken is ook de bijkeuken bereikbaar met witgoed aansluitingen en een doorgang naar de tuin. Tevens is op de begane grond ook de inpandige garage gelegen. <br/> <br/>Souterrain <br/> <br/>Via de wenteltrap in de hal komt u in het souterrain. Hier zijn drie slaapkamers aanwezig, welke in te delen zijn naar eigen smaak. Denk aan een werkruimte, fitness ruimte of wellness ruimte. Tevens is er voldoende ruimte om een wijncollectie aan te leggen of voor verdere opslag. <br/> <br/>1e verdieping <br/> <br/>Vide met verloop waarbij het geheel tot de nok kan worden bekeken, dit geeft een zeer ruim gevoel geeft. Met toegang tot de drie slaapkamers,  badkamer en een apart toilet. Waarbij de mogelijkheid is om zeer gemakkelijk vier slaapkamers te creëren. Hierbij is de eerste verdieping heel speels ingedeeld middels een U- vormige hal. Hierdoor is er een U-vorm gang ontstaan waar alle kamers liggen en waarbij in de tussenruimte nog een extra kamer of hobbyruimte gecreëerd kan worden. <br/> <br/>Tuin <br/> <br/>Voortuin met diepe oprit, achterom naar de achtertuin. De mogelijkheid bestaat voor het parkeren van meerdere auto's. In de achtertuin staan veel volwassen bomen, waardoor optimale privacy is gewaarborgd.  <br/> <br/>Is uw interesse gewekt? <br/>Maak dan snel een afspraak met ons kantoor! <br/> <br/>Aansprakelijkheid  <br/>Alle verstrekte informatie moet beschouwd worden als een uitnodiging tot het doen van een bod of om in onderhandeling te treden. Er kunnen geen rechten worden ontleend aan deze woninginformatie.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/195/266_1440x960.jpg", "kind_of_house": "Eengezinswoning, vrijstaande woning", "construction_year": "N/A", "energy_label": "F ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Heteluchtverwarming", "hot_water": "Centrale voorziening", "boiler": "N/A", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Inpandig", "zipcode": "5801 KC", "street": "Brennerlaan 2", "house_number": "2", "city": "venray", "province": "limburg", "lat": 51.51489, "lng": 5.949786, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "veltum2", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}