{"url": "https://www.funda.nl/koop/goor/bouwgrond-88988196-deldensestraat/", "offer_type": "koop", "number_of_rooms": "N/A", "number_of_bathrooms": "N/A", "number_of_bedrooms": "N/A", "bathroom_facilities": "N/A", "number_of_floors": "N/A", "outdoor_space": "N/A", "facilities": "N/A", "volume_in_cubic_meters": "N/A", "living_area": "N/A", "plot_size": 1940, "external_storage_space": "N/A", "asking_price": 375000, "asking_price_per_square_meter": "N/A", "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nAltijd al gedroomd  van  wonen in  een glooiende  groene omgeving? Dan is  dit  de kans! <br/> <br/>Op een  onbebouwd  perceel van 1.557 m² aan de  Deldensestraat  aan  de rand  van Goor is er een unieke kans om een woning te bouwen. <br/> <br/>Het perceel is onderdeel van een woonerf waar totaal 4 woningen in een landelijke setting worden gebouwd. Tussen de woningen wordt een centrale ruimte gerealiseerd, waar tevens parkeervoorzieningen worden gemaakt. De woningen worden via een nieuwe toegangsweg via de Gondalaan ontsloten op de Deldensestraat. <br/> <br/>Erfinrichtingsplan <br/>De landelijke setting van de 4 woningen is door GroenAdviesbureau H.A. ten Have uit Schalkhaar uitgewerkt in een erfinrichtingsplan. Hierin is gezocht naar landschappelijke aanknopingspunten in het omringende landschap. Het plangebied ligt in het kampenlandschap. Dit landschapstype kenmerkt zich door zijn kleinschaligheid en onregelmatige patronen van singels, houtwallen, zandpaden en bosjes rond de omsloten kampen. <br/> <br/>Op en rond het erf worden een aantal bomen aangeplant. Ten west gaat het om 6 eiken. Verder wordt ten oosten van het plangebied een boomgaard gerealiseerd bestaande uit zeven hoogstam fruitbomen met eveneens een waterretentie-mogelijkheid. Ten noorden van de woningen wordt het perceel versterkt met een erfbosje. Tot slot wordt het erf omsloten met enkele eiken, lindes of walnootbomen waardoor de bebouwing landschappelijk wordt ingepast. <br/> <br/>Riant kavel <br/>Het kavel heeft de bestemming wonen waarbinnen een woning mag worden gebouwd met een inhoud van maximaal 1.000 m³ inclusief een inpandig bijgebouw van maximaal 150 m². <br/> <br/>De kavel is gelegen tegen het buitengebied van Goor. In de kern van Goor zijn tal van sociaal maatschappelijke voorzieningen aanwezig, evenals winkels voor dagelijkse boodschappen en horecavoorzieningen. De bereikbaarheid is goed, de autosnelweg A1 en autoweg N18 zijn binnen 10 minuten bereikbaar. <br/> <br/>Het kavel wordt aangeboden met 1.557 m². Een mandelig perceel van 388 m² (1/4 deel) is tevens onderdeel van het verkocht. Dit perceel betreft de toegangsweg een een aantal parkeerplaatsen ten behoeve van 4 woningen. <br/> <br/>De in deze publicatie getoonde impressies zijn ontworpen door Marten Jansen (martenontwerp.nl) uit Broekland en dienen ter indicatie voor het landelijke beeld dat voor dit initiatief wordt nagestreefd.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/152/100/248_1440x960.jpg", "kind_of_house": "N/A", "construction_year": "N/A", "energy_label": "N/A", "type_of_roof": "N/A", "heating": "N/A", "hot_water": "N/A", "boiler": "N/A", "location": "N/A", "garden": "N/A", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "N/A", "garage": "N/A", "zipcode": "7471 KZ", "street": "Deldensestraat", "house_number": "0", "city": "goor", "province": "overijssel", "lat": 52.23753, "lng": 6.607425, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "N/A", "business_space": "false", "neighborhood": "gijmink", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}