{"url": "https://www.funda.nl/koop/waalwijk/huis-88053737-kloosterweg-41/", "offer_type": "koop", "number_of_rooms": 10, "number_of_bathrooms": 1, "number_of_bedrooms": 7, "bathroom_facilities": "Ligbad, douche en toilet", "number_of_floors": 2, "outdoor_space": 3, "facilities": "Buitenzonwering, rolluiken en TV kabel", "volume_in_cubic_meters": 600, "living_area": 226, "plot_size": 400, "external_storage_space": 4, "asking_price": 495000, "asking_price_per_square_meter": 2190, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nZeer ruime woning  met  mogelijkheden !!  <br/> <br/>â\u0080¢  \tWilt u graag volledig  gelijkvloers  wonen? of <br/>â\u0080¢ \tHeeft u  gewoon  behoefte aan veel leefruimte? of <br/>â\u0080¢  \tBent  u  zelfstandig ondernemer en  wilt u kantoor, praktijkruimte of opslag aan huis?   <br/> <br/>Dan is deze woning, verstopt achter de bescheiden voorgevel van de Kloosterweg 41 in Waalwijk, écht iets voor u! <br/> <br/>Deze karaktervolle vrijstaande woning ligt aan één van de fraaiste lanen van Waalwijk, op een riant perceel van 400 m². De mogelijkheid voor parkeren op eigen terrein, een zonnig gelegen tuin en een uitzicht over het natuurgebied van Brabant water. Mede door de centrale ligging van deze straat ten opzichte van het centrum, de uitvalswegen, de scholen en ook de bossen van het natuurgebied â\u0080\u0098Loonse en Drunense Duinenâ\u0080\u0099 maken dit tot een prachtige plek om te wonen. <br/> <br/>In de huidige indeling heeft de woning een ruime woonkamer met aansluitend de keuken met daarin een vlizotrap, met als mogelijkheid om boven nog 2 slaapkamers en een badkamer te realiseren verder heeft de woning namelijk nog 5 slaapkamers en 2 badkamers op de begane grond.   <br/> <br/>Hal <br/>Via de tuinpoort en overdekte entree komen we in de hal. Deze is voorzien van een tegelvloer en geeft toegang tot de keuken, badkamer, toilet en een (slaap)kamer. <br/> <br/>Keuken <br/>De keuken behoeft modernisering of is verplaatsbaar naar een andere locatie in de woning, omdat het totale woonoppervlak volledig opnieuw is in te delen. <br/> <br/>Woonkamer <br/>Vanuit de woonkamer, voorzien van airconditioning, heeft u middels een schuifpui toegang tot de tuin.  <br/> <br/>De doorlopende hal geeft toegang tot de overige 5 kamers op de begane grond. <br/> <br/>Slaapkamers 1,2,3,4,5 <br/>De woning heeft 5 slaapkamers op de begane grond. De hardhouten kozijnen zijn voorzien van dubbel glas, horren en rolluiken <br/>Zie plattegrond voor indeling en maatvoering. <br/> <br/>Badkamer <br/>De badkamer is volledig betegeld en voorzien van een douche, wastafel en een hoekbad <br/>Een 2e en/of 3e badkamer zijn in deze woning eenvoudig te realiseren. <br/> <br/>1e verdieping <br/>Via een vlizotrap komen we op de 1e verdieping, welke nu niet wordt gebruikt. Er bevinden zich op deze verdieping 2 kamers en een mogelijke badruimte.  <br/> <br/>Tuin <br/>De tuin is heerlijk zonnig gelegen op het oosten met volop privacy. <br/> <br/>Algemeen <br/>â\u0080¢ Bouwjaar: omstreeks 1900 <br/>â\u0080¢ Perceeloppervlakte: 400 m². <br/>â\u0080¢ Woonoppervlakte: ca. 201 + 25 m². <br/>â\u0080¢ De woning is volledig voorzien van dubbel glas in hardhouten, kunststof en aluminium kozijnen. <br/>â\u0080¢ Verwarming en warm water via een gehuurde gasgestookte Intergas cv-combiketel uit 2014 en een warmtepomp <br/>â\u0080¢ 14 Zonnepanelen in een huur/koop overeenkomst <br/>â\u0080¢ Energielabel: C definitief <br/>â\u0080¢ Aanvaarding: in overleg. <br/> <br/>Aan deze informatie kunnen geen rechten worden ontleend.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/341/705_1440x960.jpg", "kind_of_house": "Eengezinswoning, vrijstaande woning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Samengesteld dak", "heating": "Cv-ketel en warmtepomp", "hot_water": "Cv-ketel", "boiler": "Intergas CW5 (2014)", "location": "N/A", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": 180, "garden_location": "Gelegen op het oosten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Op afgesloten terrein, op eigen terrein en openbaar parkeren", "garage": "Parkeerplaats", "zipcode": "5144 CA", "street": "Kloosterweg 41", "house_number": "41", "city": "waalwijk", "province": "noordbrabant", "lat": 51.67389, "lng": 5.069626, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "meerdijk", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}