{"url": "https://www.funda.nl/koop/waalwijk/huis-42667873-grotestraat-320/", "offer_type": "koop", "number_of_rooms": 10, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Ligbad, douche en toilet", "number_of_floors": 3, "outdoor_space": "N/A", "facilities": "Mechanische ventilatie", "volume_in_cubic_meters": 686, "living_area": 192, "plot_size": 444, "external_storage_space": 10, "asking_price": 695000, "asking_price_per_square_meter": 3620, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nStijlvol, karakteristiek en  op  een fantastische  locatie! Deze  vrijstaande woning uit de  jaren  â\u0080\u009950 met losstaande carport, tuinbar  met  overkapping (!), berging en fietsenhok nodigt  uit  tot  een bezichtiging!  Het 3 verdiepingen tellende royale herenhuis combineert in alle opzichten, de charme van het bouwjaar 1959 met de gemakken van een nieuwbouwwoning. Deze woning is namelijk met smaak en hulp van binnenhuis architect Francine Broos, geheel gerenoveerd en gemoderniseerd! <br/> <br/>Denk aan een geheel glazen achtergevel, een woonkamer met een knipoog naar de â\u0080\u009cen suiteâ\u0080\u009d van weleer, een grote woonkeuken, openslaande deuren naar het terras en de fijne achtertuin, glas-in-lood ramen, paneeldeuren, een prachtig eiken visgraat parket en een badkamer die in een 5 sterren hotel niet zou misstaan!  <br/> <br/>INDELING:  <br/>We komen de woning binnen via de hal. In deze hal is het visgraat parket ook doorgelegd waardoor de gehele begane grond eenheid ademt. Er bevindt zich de trap, de toilet, een zware kwaliteit stalen deur naar de keuken en een klassieke paneeldeur naar de woonkamer. Het raamwerk (driedubbel glas!) in deze woonkamer is voorzien van prachtige houten shutters die lichtinval brengen en er tegelijk voor zorgen dat er niet teveel inkijk mogelijk is. De woonkamer is tevens voorzien van een haard welke momenteel niet in gebruik is, maar wel heel makkelijk weer in gebruik te nemen is. De voor- en achterkamer worden van elkaar gescheiden door een moderne interpretatie van en suite deuren. <br/> <br/>De achterkamer, of ook wel leefruimte genoemd, is voorzien van een door Francine Broos ontworpen en handgemaakte inbouwkast. Een grote raampartij met driedubbelglas brengt licht aan de zijkant. Een door Francine Broos bepaald lichtplan brengt sfeerverlichting en een geheel glazen achtergevel met openslaande deuren naar het terras verbindt deze ruimte met de tuin. Dit maakt dat de achterkamer zeer licht en ruimtelijk is! <br/> <br/>Vanuit deze ruimte loop je de leefkeuken in, hier kan je om het fantastische kookeiland heen bewegen. De designkeuken kent 2 inbouwkasten met eiken fronten in tabakskleur. Een van de inbouwkasten is voorzien van een Siemens Studioline koel/vries combinatie en twee stijlvolle Siemens Studioline ovens met geïntegreerde magnetron, stoomshotfunctie en andere innovatie bakfuncties. <br/> <br/>Het kookeiland bestaat uit prachtige, stijlvolle matglas fronten in de kleur brons metallic. De glazen fronten zijn omlijst met RVS frames en gesatineerde glazen platen op de kopse kanten. Geen standaard MDF keuken dus! Het blad heeft een warme kleur met een marmer uitstraling, dit geheel maakt het een zeer moderne maar toch warme keuken. <br/>In dit kookeiland is een Miele vaatwasser en een BORA inductiekookplaat met afzuiging verwerkt. <br/> <br/>Vanuit de keuken kan worden doorgelopen naar de berging, door wederom een zware kwaliteit stalen deur. In deze berging is een door de architect Francine Broos getekende, handgemaakte garderobe kast gemonteerd. Hier kunt u al uw jassen en schoenen kwijt zodat niets in het zicht ligt. De kleur van deze inbouwkast is afgestemd op die van de keuken. In de berging ligt een mooie gietvloer afgewerkt met donkere plinten en smaakvol behang. <br/> <br/>Vanuit de berging kan de tuin worden bereikt, maar ook de extra kamer die kan fungeren als werkruimte, speelkamer of zelfs als gastenverblijf. Ook hiertussen zit een zware kwaliteit stalen deur en is dezelfde gietvloer voorzien. Deze kamer is afgewerkt met mooie hoge kozijnen voor lichtinval en sfeervolle verlichting. <br/> <br/>EERSTE VERDIEPING:  <br/>Ook de eerste verdieping is ruim. Via de trap is de overloop bereikbaar. Hier zijn drie zeer ruime slaapkamers aanwezig en een badkamer. Er is vanuit twee slaapkamers toegang naar het dak waar eventueel een terras kan worden aangelegd. <br/> <br/>De badkamer is voorzien van een prachtig vrijstaand ligbad met handdouche, een toilet, een design wastafel en een inloopdouche. De inrichting is gedaan met hoogwaardige materialen, gevoel voor smaak en is gewoonweg tijdloos. Voor het comfort gevoel is afzuiging en vloerverwarming aanwezig.  <br/> <br/>Een vaste trap geeft toegang tot de zeer ruime zolderverdieping. Aan de voorzijde is een wasruimte gerealiseerd. Hier is ook de CV van het merk Nefit type Topline (2012) opgesteld en zeer veel kastruimte in de kruipruimte weggewerkt. <br/>Wanneer je na de wasruimte een deur doorgaat betreedt je nog een slaapkamer. Deze doet zeer ruimtelijk aan en de kruipruimtes geven mogelijkheid tot inbouw van kledingkasten. De dakkapel zorgt voor lichtinval en het geheel met de dakbalken in het zicht en de vloerbedekking geeft een fijn warm gevoel. <br/> <br/>Via de oprit is de garage met carport, fietsenhok en tuinbar te bereiken. In de overkapping kan heerlijk worden gezeten, tot in de late uurtjes. Het gehele douglas bouwwerk is voorzien isolatie en in pas 2021 gebouwd met hoogwaardige materialen. Dit is duidelijk af te zien aan het hang en sluitwerk, dakafwerking met zinken kraal, de verlichting (sensor gestuurd) en de aanwezigheid van een aparte groep voor een bubbelbad of laadpaal van een elektrische auto. <br/> <br/>De tuin is in 2021 opnieuw ingericht met gras en een wit getegeld terras. In de tuin is ook een douglas afwerking voor de vuilcontainers voorzien. Op deze manier staan deze nooit in het zicht. De tuin is gericht op het zuiden en is mooi ruim van formaat. Het terras zelf is ook van een degelijk formaat en biedt ruimte om een grote tuintafel te plaatsen.  <br/> <br/>De woning is gelegen op loopafstand van het centrum. Te voet sta je zelfs binnen enkele minuten op de markt, met zijn gezellige terrassen en restaurants. Voor je dagelijkse boodschappen is de Jumbo op steenworp afstand, evenals diverse sportscholen, kappers en een bakker voor warme croissantjes. Daarnaast is de woning zeer goed te bereiken met de auto en is er altijd voldoende parkeerplek recht voor de deur (naast de eigen carport). <br/> <br/>BIJZONDERHEDEN:  <br/>- Algemeen Bouwjaar 1959 <br/>- Geheel gerenoveerd van 2016 tot en met 2021 <br/>- Gebruiksoppervlakte wonen: ca. 192 m² Perceeloppervlakte: ca. 452 m² Isolatie: gehele woning is voorzien van isolatie, vloer, muur, plafonds van plat dak en het dak van de woning zelf. <br/>- Kozijnen: overal dubbelglas HR++, straatzijde driedubbelglas en de glas in loodramen zijn ook voorzien van dubbelglas HR++. <br/>- Verwarming: gehele begane grond is voorzien van vloerverwarming op nieuwe geïsoleerde betonvloer, 1e en 2e verdieping voorzien van radiatoren. Badkamer heeft beiden. <br/>- Buren zijn zeer vriendelijk en behulpzaam. <br/>Aanvaarding in overleg.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/228/292_1440x960.jpg", "kind_of_house": "Eengezinswoning, vrijstaande woning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Nefit Topline (gas gestookt combiketel uit 2012, eigendom)", "location": "N/A", "garden": "Achtertuin", "back_garden": 150, "garden_location": "Gelegen op het zuiden bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Carport", "zipcode": "5142 CD", "street": "Grotestraat 320", "house_number": "320", "city": "waalwijk", "province": "noordbrabant", "lat": 51.69112, "lng": 5.074205, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "centrum", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}