{"url": "https://www.funda.nl/koop/zeist/appartement-42673662-wilhelminaparkflat-4/", "offer_type": "koop", "number_of_rooms": 3, "number_of_bathrooms": 1, "number_of_bedrooms": "N/A", "bathroom_facilities": "Douche en toilet", "number_of_floors": 3, "outdoor_space": 6, "facilities": "Elektra", "volume_in_cubic_meters": 270, "living_area": 81, "plot_size": "N/A", "external_storage_space": 6, "asking_price": 359000, "asking_price_per_square_meter": 4432, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nRuim en licht  3-kamerappartement  op de  1e etage  gelegen in het kleine  complex  van zes appartementen, op de  hoek  van de Prins Hendriklaan en het  Wilhelminapark  in Zeist. <br/> <br/>LIGGING  <br/>Het appartementencomplex ligt aan één van de allerfraaiste monumentale lanen (beschermd dorpsgezicht) van Zeist in het hart van de oude Zeister kern. Het appartement ligt uiterst rustig maar toch op steenworp afstand van het gezellige Zeister winkelcentrum en het Zeisterbos. De gehele wijk is gebouwd in de periode 1885 tot 1925 en heeft heel veel monumentale fraaie woonhuizen, kortom een historierijke woonwijk. <br/> <br/>INDELING <br/>Begane grond: <br/>Gemeenschappelijk afgesloten toegangsdeur met intercom-installatie, centrale hal met brievenbussen en trappenhuis. <br/> <br/>Appartement/eerste verdieping: <br/>Entree, hal met meterkast (met aansluiting voor wasmachine) en toegang tot de ruime en lichte woonkamer met zitgedeelte aan de achterzijde, vaste opbergkast en glazen schuifdeur/wand naar het eetgedeelte aan de voorzijde van het appartement, eveneens met vaste opbergkast en vloer voorzien van een fraai visgraatparket. Dichte keuken met deur naar het balkon aan de voorzijde. Lichte slaapkamer aan de achterzijde voorzien van een vaste kast. Vanuit deze slaapkamer is er toegang naar het ruime balkon aan de achterzijde (zuidoosten) met vrij uitzicht en bijna de gehele dag zon. Moderne badkamer voorzien van een douche, toilet en wastafelmeubel. <br/> <br/>BERGING <br/>Onder in het complex bevindt zich een berging met ruimte voor opslag van persoonlijke spullen. De externe berging bevindt zich op het achtergelegen parkeerterrein (van Wilhelminaparkflat 1,2 en 3) en biedt ruimte aan meerdere fietsen en opbergkasten. <br/> <br/>PARKEREN <br/>Parkeren kan gratis en vrij op de gehele Prins Hendriklaan en aan de voorzijde van het appartement. <br/> <br/>KENMERKEN/BIJZONDERHEDEN <br/>- Bouwjaar complex omstreeks 1951; <br/>- Het woonoppervlakte bedraagt 81 m²; <br/>- De servicekosten bedragen â\u0082¬ 257,- per maand; <br/>- Het voorschot voor de stookkosten bedraagt â\u0082¬ 40,- per maand; <br/>- Het betreft een kleinschalige vereniging van eigenaren met een gezonde financiële positie; <br/>- Vrij en gratis parkeren op de gehele Prins Hendriklaan; <br/>- Aanvaarding in overleg.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/766/515_1440x960.jpg", "kind_of_house": "N/A", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "N/A", "heating": "Blokverwarming", "hot_water": "N/A", "boiler": "N/A", "location": "N/A", "garden": "N/A", "back_garden": "N/A", "garden_location": "N/A", "balcony": "Balkon aanwezig", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "3701 BM", "street": "Wilhelminaparkflat 4", "house_number": "4", "city": "zeist", "province": "utrecht", "lat": 52.0864, "lng": 5.248612, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "Portiekflat (appartement)", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "centrumschilzuid", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}