{"url": "https://www.funda.nl/koop/rozendaal/huis-42664643-kraijesteijnlaan-7/", "offer_type": "koop", "number_of_rooms": 6, "number_of_bathrooms": 2, "number_of_bedrooms": 5, "bathroom_facilities": "2 ligbaden en 2 toiletten", "number_of_floors": 1, "outdoor_space": 2, "facilities": "TV kabel", "volume_in_cubic_meters": 1014, "living_area": 202, "plot_size": 978, "external_storage_space": "N/A", "asking_price": 1200000, "asking_price_per_square_meter": 5941, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nDEZE FRAAIE VILLA  WORDT  U AANGEBODEN  MET EEN  AANTREKKELIJKE VANAFPRIJS <br/> <br/>Aan  de  rand van Rozendaal, in de  volledig  onder architectuur gebouwde wijk Kapellenbergh, ligt op één  van de mooiere  plekjes van Nederland deze hedendaagse villa met dubbele garage, gelegen op een kavel van 978 m2, met voor een vrij uitzicht op de bosrand en een achtertuin op het zuiden. <br/> <br/>De villa ligt aan de rand van de Veluwe, terwijl alle noodzakelijke voorzieningen toch binnen handbereik liggen. Zo is de snelweg A12 binnen 4 minuten bereikbaar en staat u binnen 6 minuten in het centrum van Arnhem. Scholen, winkels en sportaccommodaties zijn tevens in de nabijheid gesitueerd. <br/> <br/>De villa heeft alle eigenschappen die u mag verwachten, waaronder 5 ruime kamers, 2 badkamers, en een riante garage die ruimte biedt aan twee autoâ\u0080\u0099s. De afwerking is luxueus en van goede kwaliteit. De villa is goed geïsoleerd, beveiligd en keurig onderhouden. <br/> <br/>Indeling <br/> <br/>Begane grond: Hal met Italiaans marmeren vloer. De hal biedt toegang tot het toilet, de bijkeuken, beiden afgewerkt met Spaans keramische tegels, de werkkamer, de achtertuin en de keuken/woonkamer, en aansluitend de gang naar de slaapvleugel. De ruime keuken is half open en voorzien van alle inbouwapparatuur die u in een keuken mag verwachten. Vanuit de keuken heeft u toegang tot het terras achter de woning en de zeer ruime woonkamer met een plafondhoogte van meer dan vier meter. De woonkamer heeft een goede lichtinval door de vele ramen en is voorzien van tuindeuren die uitkomen op één van de terrassen. <br/> <br/>De gang, die tevens is voorzien van Italiaans marmer, biedt toegang tot drie slaapkamers en een separate badkamer, voorzien van een bad, douche, toilet en inbouw tv. De badkamer is afgewerkt met Spaans keramische tegels en is voorzien van vloerverwarming. De ruime master bedroom is voorzien van een inloopkast en de tweede badkamer welke momenteel wordt voorzien van een bad/douche combinatie, toilet en wastafels en wordt eveneens afgewerkt met Spaans keramische tegels. <br/> <br/>Souterrain: Vanuit de gang loopt een trap naar het souterrain met toegang tot de 5e zeer ruime kamer van bijna 28m2. Deze kamer is eveneens uitermate geschikt als werkkamer. <br/> <br/>Aan de andere zijde van de trap bevindt zich de ruime garage die ruimte biedt aan 2 autoâ\u0080\u0099s. De garage heeft een elektrisch bedienbare deur van 5 meter. In de garage bevinden zich tevens de CV-ketel en het beregeningsysteem. Vanuit de garage heeft u toegang tot de wijnkelder. <br/> <br/>Het souterrain is in 2021 volledig voorzien van nieuwe (thermische- en watervaste) wandisolatie, met een totale garantietermijn van 5 jaar. <br/> <br/>Tuin: Nette verzorgde zeer ruime tuin rondom de villa met twee terrassen op het zuiden. De tuin biedt u veel privacy. <br/> <br/>Bijzonderheden <br/> <br/>-Toplocatie direct tegenover de Veluwe <br/>-Woonkamer en keuken voorzien van Italiaans marmer met vloerverwarming <br/>-Uitstekend beveiligd, onder andere met inbraak werend glas en een volledig alarmsysteem inclusief brandmelders <br/>-Beregeningsysteem in voortuin <br/>-Uitstekend geïsoleerd <br/>-Cv ketel 2013 <br/>-Biedingen vanaf het niveau van de vanafprijs worden in overweging genomen <br/> <br/>Uitgebreide info van deze woning kunt u vinden op de unieke, eigen website! Download de brochure op Funda voor de link naar de website waar u alle gegevens en stukken van de woning kunt terugvinden, zoals de lijst van zaken en de vragenlijst.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/445/038_1440x960.jpg", "kind_of_house": "Villa, vrijstaande woning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Samengesteld dak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Nefit (gas gestookt combiketel uit 2013, eigendom)", "location": "N/A", "garden": "Achtertuin, tuin rondom, voortuin en zijtuin", "back_garden": 329, "garden_location": "Gelegen op het zuidoosten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Inpandig", "zipcode": "6891 EA", "street": "Kraijesteijnlaan 7", "house_number": "7", "city": "rozendaal", "province": "gelderland", "lat": 52.00519, "lng": 5.955895, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "rozendaal", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}