{"url": "https://www.funda.nl/koop/raalte/huis-42609055-hofstedelaan-2/", "offer_type": "koop", "number_of_rooms": 13, "number_of_bathrooms": 2, "number_of_bedrooms": 8, "bathroom_facilities": "Toilet", "number_of_floors": 2, "outdoor_space": "N/A", "facilities": "Dakraam, glasvezelkabel, natuurlijke ventilatie, rookkanaal en TV kabel", "volume_in_cubic_meters": 1700, "living_area": 424, "plot_size": 2176, "external_storage_space": 152, "asking_price": 1150000, "asking_price_per_square_meter": 2712, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nOp een unieke  locatie  nabij het  centrum bieden  wij te koop aan  deze  karakteristieke en stijlvolle WOONBOERDERIJ op  een  riant perceel van 2.176 m². Het  betreft  hier een zeer royale  woonboerderij met een inhoud van ca. 1.700 m³ en een woonoppervlakte van maar liefst 424 m²!  <br/> <br/>Deze woonboerderij kenmerkt zich door authentieke elementen zoals robuuste gebinten, paneeldeuren, en lange gang. In het originele gevelaanzicht. Hierin zijn raampartijen met roedeverdeling aanwezig en luiken welke in oorspronkelijke kleuren bewaard zijn gebleven. Het huis heeft mooie leefruimtes en maar liefst 8 slaapkamers!  <br/> <br/>Naast de woning ligt een authentieke schuur welke gedeeltelijk met riet is gedekt en deels met pannen. De afmeting van deze schuur is ca. 10 x 8 meter. Tevens is er een grote schuur annex garage op het perceel aanwezig met een afmeting van ca. 12 bij 6 meter.  <br/> <br/>De ligging in de bebouwde kom is ideaal. Voorzieningen en activiteiten zijn op fiets- en loopafstand aanwezig. De tuin rondom is fraai aangelegd en het perceel is omgeven door groen. Dit geeft een heerlijk gevoel van vrij wonen! <br/> <br/>De indeling van de boerderij is als volgt: <br/> <br/>Begane grond:  <br/>Entree/hal met originele tegelvloer, ouderslaapkamer met kleedkamer en toegang tot de badkamer v.v. een royale douche, twee wastafels, bidet en toilet. Studeerkamer. Zij-entree/hal met toilet, trapopgang naar 1e verdieping en toegang tot de kelder, studeerkamer, 2e toilet. Aan de andere zijde een werkkamer, een dubbele slaapkamer en een 3e toilet met wastafel. Zeer royale woonkamer met een grote houtkachel en openslaande tuindeuren. De woonkamer heeft een prachtige vide en een trapopgang naar de open verdieping alwaar een mooie werkruimte is gerealiseerd. Halfopen keuken met een fraaie design keuken met inbouwapparatuur o.a. een dubbele oven, inductiekookplaat, vaatwasser en koelkast.  <br/> <br/>Verdieping: <br/>De eerste verdieping is voorzien van maar liefst zes ruime slaapkamers, een technische ruimte met opstelling van de c.v.-ketel, een toilet, een wasruimte met twee wastafels en een separate doucheruimte.  Vanaf de overloop is er een vlizotrap naar de zeer royale bergzolder.  <br/> <br/>Bijzonderheden:  <br/>- Gebouwd omstreeks 1905; <br/>- Verbouwd in 2007 waarbij de 1e verdieping is vergroot en er extra slaapkamers zijn gerealiseerd; <br/>- Riet gedekt, geheel vervangen in 2007; <br/>- Traditioneel opgetrokken in steensmuren, ter plaatse van het achterhuis voorzien van binnenwanden. <br/>- Voorgevel is beschermd middels een kettingbeding; <br/>- Riante kavel, doch meer grond in gebruik (rondom); <br/>- Verwarming geschiedt door middel van een nieuwe HR C.V.-ketel, bouwjaar 2021; <br/>- De houtkachel in de woonkamer is aangesloten op het c.v.-circuit waardoor gasverbruik zeer laag is. Vloerverwarming in woonkamer aanwezig.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/697/661_1440x960.jpg", "kind_of_house": "Woonboerderij, vrijstaande woning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "Zadeldak bedekt met riet", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Nefit 9000i HRW45, CW6 (gas gestookt combiketel uit 2021, eigendom)", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Vrijstaande houten garage", "zipcode": "8101 AH", "street": "Hofstedelaan 2", "house_number": "2", "city": "raalte", "province": "overijssel", "lat": 52.39042, "lng": 6.267978, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "drostenkamp", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}