{"url": "https://www.funda.nl/koop/almere/huis-88061603-enschedepad-83/", "offer_type": "koop", "number_of_rooms": 6, "number_of_bathrooms": 3, "number_of_bedrooms": 4, "bathroom_facilities": "N/A", "number_of_floors": 3, "outdoor_space": 1, "facilities": "Glasvezelkabel, mechanische ventilatie en TV kabel", "volume_in_cubic_meters": 413, "living_area": 126, "plot_size": 116, "external_storage_space": "N/A", "asking_price": 399000, "asking_price_per_square_meter": 3167, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\n*For English see  below*  <br/> <br/>Wij  bieden u  deze compleet gerenoveerde eengezinswoning  met  twee badkamers en 4 slaapkamers  (eenvoudig  een goede 5e slaapkamer te creëren op de tweede etage)  aan middels een bieden vanaf prijs!  <br/> <br/>De woning is gelegen op loopafstand van het stadshart van Almere Stad aan een autovrij pad in een kindvriendelijke omgeving. Op deze locatie woont u rustig terwijl u toch alle stadse voorzieningen binnen handbereik heeft. In de nabije omgeving treft u diverse openbare voorzieningen zoals scholen, winkels, kinderopvang, openbaar vervoer en sport- en recreatiefaciliteiten. Tevens zijn binnen enkele auto-minuten de diverse uitvalswegen richting Amsterdam, Lelystad en Utrecht bereikbaar. In deze woning vindt u naast een luxe keuken(splinternieuw en nooit gebruikt), fraaie houten vloeren, gestuukte wanden en plafonds en twee complete badkamers. Alle binnendeuren met deurposten zijn vernieuwd en ook de tuin is aangepakt. Er is gebruik gemaakt van kwaliteitsproducten in een moderne stijl. <br/> <br/>Indeling:  <br/>Via de voortuin bereikt u de entree van het woonhuis. Binnenkomst in de hal met toegang tot de meterkast, het vernieuwde toilet (zwevend en met fonteintje), trapopgang naar de eerste etage en de toegangsdeur naar de woonkamer. De ruime woonkamer is voorzien van een eiken vloer gelegd in visgraatmotief. Er bevindt zich een trapkast voor de nodige opbergruimte. De luxe en ruime keuken vindt u aan de voorzijde van de woning. Deze keuken is voorzien van veel kastruimte en diverse Siemens apparatuur, te weten: een koelkast, vriezer, inductie kookplaat, vaatwasser, afzuigkap en combimagnetron. <br/> <br/>Eerste etage: <br/>De overloop van de eerste etage bereikt u middels de nieuw gestoffeerde trap. Op deze etage bevinden er zich drie slaapkamers en de badkamer. Twee slaapkamers bevinden zich aan de achterzijde van de woning en de grootste slaapkamer vindt u aan de voorzijde. Vanuit deze slaapkamer is er toegang tot een klein dakterras. De badkamer op deze etage is voorzien van een ruime inloopdouche, zwevend toilet, breed wasmeubel met twee kranen, een verlaagd plafond met inbouwspots en een spiegel met verlichting ingebouwd. Ook op deze etage zijn alle wanden en plafonds strak gestuukt en wit gespoten. De vloer is voorzien van licht eikenhout.  <br/> <br/>Tweede etage: <br/>Op deze etage vindt u een zeer ruime zolderkamer aan de voorzijde van de woning, een tweede badkamer en een grote voorzolder. Van deze voorzolder kan eenvoudig een vijfde slaapkamer gemaakt worden. De badkamer op deze etage is voorzien van een wastafel met meubel, zwevend toilet, inloopdouche, verlaagd plafond met inbouwspots en de aansluiting voor de wasmachine.  <br/> <br/>Al met al een luxe afgewerkte woning welke u direct kan betrekken.  <br/> <br/>Bieden vanaf 399.000 euro k.k. <br/>Aanvaarding: direct <br/> <br/>We offer you this completely renovated family house with two bathrooms and 4 bedrooms (easy to create a good 5th bedroom on the second floor) through a starting price! <br/> <br/>The house is located within walking distance of the city center of Almere Stad on a car-free path in a child-friendly environment. In this location you live quietly while you still have all city amenities within reach. In the vicinity you will find various public facilities such as schools, shops, childcare, public transport and sports and recreation facilities. The various roads to Amsterdam, Lelystad and Utrecht can also be reached within a few minutes by car. In this house you will find a luxury kitchen (brand new and never used), beautiful wooden floors, plastered walls and ceilings and two complete bathrooms. All interior doors with doorposts have been renewed and the garden has also been updated. Quality products in a modern style have been used. <br/> <br/>Layout: <br/>You reach the entrance of the house through the front garden. Entry into the hall with access to the meter cupboard, the renovated toilet, stairs to the first floor and the entrance door to the living room. The spacious living room has an oak floor laid in a herringbone pattern. There is a stair cupboard for the necessary storage space. The luxurious and spacious kitchen is located at the front of the house. This kitchen is equipped with plenty of cupboard space and various Siemens appliances, namely: a refrigerator, freezer, induction hob, dishwasher, extractor hood and combination microwave. <br/> <br/>First floor: <br/>The landing of the first floor can be reached via the newly upholstered staircase. On this floor there are three bedrooms and the bathroom. Two bedrooms are located at the rear of the house and the largest bedroom is located at the front. From this bedroom there is access to a small roof terrace. The bathroom on this floor has a spacious walk-in shower, toilet, wide washbasin with two taps, a suspended ceiling with recessed spotlights and a mirror with built-in lighting. Also on this floor all walls and ceilings are plastered tightly and sprayed white. The floor is made of light oak. <br/> <br/>Second floor: <br/>On this floor you will find a very spacious attic room at the front of the house, a second bathroom and a large attic. A fifth bedroom can easily be made from this attic. The bathroom on this floor has a sink with furniture, toilet, walk-in shower, suspended ceiling with recessed spotlights and the connection for the washing machine. <br/> <br/>A luxuriously finished house which you can move into immediately. <br/> <br/>Offer from 399,000 euros k.k. <br/>Acceptance: direct\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/662/965_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Samengesteld dak bedekt met bitumineuze dakbedekking en pannen", "heating": "Stadsverwarming", "hot_water": "Stadsverwarming", "boiler": "N/A", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 55, "garden_location": "Gelegen op het noordwesten", "balcony": "Dakterras aanwezig", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1324 GD", "street": "Enschedepad 83", "house_number": "83", "city": "almere", "province": "flevoland", "lat": 52.36607, "lng": 5.210595, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "stedenwijk", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}