{"url": "https://www.funda.nl/koop/venray/huis-42543569-pinksterbloem-29/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Douche en toilet", "number_of_floors": 2, "outdoor_space": 18, "facilities": "N/A", "volume_in_cubic_meters": 430, "living_area": 111, "plot_size": 201, "external_storage_space": 7, "asking_price": 269000, "asking_price_per_square_meter": 2423, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nRuime, uitgebouwde 2-onder-1  kapwoning  met tuinkamer,  3 slaapkamers,  een bijkeuken en een  berging.  De woning is gelegen aan  een  vriendelijk straatje in de wijk Landweert  op een perceel van 201  m2 groot.  <br/> <br/>BEGANE GROND <br/>Middels de oprit met carport bereikt u de woning. De hal is voorzien van een laminaatvloer, gestucte wanden en een spuitwerk plafond. Verder bevindt zich hier de toiletruimte, de meterkast en de trapopgang naar de 1e verdieping. De toiletruimte is geheel betegeld en uitgevoerd met een wandcloset en een fonteintje.  <br/>Voorts de woonkamer. <br/>De woonkamer is verdeeld in een zithoek aan de voorzijde welke uitkijkt over de straat en een eethoek met open verbinding naar de keuken aan de achterzijde. De woonkamer is voorzien van een laminaatvloer met vloerverwarming, stucwerk wanden en een provisiekast met de unit van vloerverwarming onder de trap.  <br/>De keuken is verdekt opgesteld en voorzien van een kleurrijke L-vormige keukeninrichting met granieten aanrechtblad. De meeste inbouwapparatuur functioneert helaas niet meer.  <br/>De woning is aan de achterzijde flink uitgebouwd met een fraaie tuinkamer van ca. 19 m2 met o.a. een lichtkoepel en 2 tuindeuren. De tuinkamer is afgewerkt met een houten vloer met vloerverwarming. Vanuit de tuinkamer is de bijkeuken te bereiken. In deze ruimte bevinden zich de witgoedaansluitingen en een deur naar de berging en de tuin. De berging heeft een oppervlakte van ca. 10 m2 en heeft een loopdeur naar de oprit. <br/> <br/>1e VERDIEPING <br/>De overloop is afgewerkt met een laminaatvloer, getexte  wanden en een spuitwerk plafond en biedt toegang tot 3 slaapkamers en de badkamer. De ouderslaapkamer is aan de voorzijde gelegen en is eveneens afgewerkt met een laminaatvloer en structuurverf wanden. Verder is deze kamer voorzien van een rolluik. De kinderkamers zijn op gelijke wijze afgewerkt. Ook deze kamers zijn voorzien van rolluiken.  <br/>De geheel betegelde badkamer dient enig aandacht. Zo is o.a. de douche en het badmeubel aan vervanging toe. Doordat er in het verleden hier een dakkapel is geplaatst heeft deze badkamer comfortabele afmetingen.  <br/>Een vlizotrap biedt toegang tot de zolder. <br/> <br/>ZOLDER <br/>Bergzolder met opstelling van de cv-ketel (Nefit van ca. 15 jaar oud). <br/> <br/>TUIN <br/>De achtertuin is gelegen op het noordoosten, is geheel verhard en voorzien van een ruim tuinhuis en een buitenkraantje. Het geheel is omheind met een gemetselde schutting. <br/> <br/>â\u0080¢    De woning is grotendeels voorzien van houten buitenkozijnen met deels dubbele beglazing. De voorzijde van de woonkamer en de 1e verdieping zijn voorzien van rolluiken. <br/>â\u0080¢    De woning is voorzien van rolluiken op de begane grond aan de voorzijde en op de gehele 1e verdieping.  <br/>â\u0080¢    De woonkamer, keuken, tuinkamer en bijkeuken zijn voorzien van comfortabele vloerverwarming.  <br/>â\u0080¢    Kopers dienen rekening te houden met moderniseringskosten. <br/>â\u0080¢    Deze informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins, dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief. Eventuele bijgesloten plattegrond-tekeningen zijn ter indicatie en kunnen afwijken van de werkelijke situatie.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/152/772/865_1440x960.jpg", "kind_of_house": "Eengezinswoning, geschakelde 2-onder-1-kapwoning", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Samengesteld dak", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Nefit (gas gestookt combiketel, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "N/A", "zipcode": "5803 KL", "street": "Pinksterbloem 29", "house_number": "29", "city": "venray", "province": "limburg", "lat": 51.53399, "lng": 5.990676, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "landweert3", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}