{"url": "https://www.funda.nl/koop/wijchen/huis-88059382-elsland-1142/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Ligbad en toilet", "number_of_floors": 3, "outdoor_space": "N/A", "facilities": "Buitenzonwering, dakraam, mechanische ventilatie, natuurlijke ventilatie en TV kabel", "volume_in_cubic_meters": 336, "living_area": 97, "plot_size": 133, "external_storage_space": "N/A", "asking_price": 298500, "asking_price_per_square_meter": 3077, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nOp een prachtige  locatie  in Wijchen  is gelegen  deze mooie tussenwoning, voorzien  van  drie slaapkamers, een complete en  fraai  aangelegde, onderhoudsarme tuin met veranda in  een  rustige  woonwijk. <br/> <br/>Elsland  ligt vlakbij het Wijchens Meer, waar het prachtig wandelen en fietsen is. Ook is winkelcentrum Zuiderpoort op enkele minuten loopafstand. Op 2km afstand ligt het centrum van Wijchen met tal van voorzieningen zoals vele winkels, bioscoop, zwembad, theater, en restaurants. <br/>Uitvalswegen zijn binnen enkele minuten te bereiken zo ook het station. De bushalte is op loopafstand. <br/> <br/>Indeling <br/>Via de entree kom je in de hal met trapopgang naar de eerste verdieping, een toilet met fontein, meterkast, trapkast en toegangsdeur naar de woonkamer. <br/>De woning heeft een ruime en zeer lichte woonkamer met openslaande deuren naar de achtertuin en is voorzien van een PVC vloer. De open keuken is gelegen aan de voorzijde van de woning. De complete keuken is voorzien van een gasfornuis met afzuigkap, vaatwasser, koelkast en combi-oven. <br/> <br/>Eerste verdieping <br/>Vervolgens kom je via de trapopgang op de eerste verdieping met een overloop en twee ruim bemeten slaapkamers, waarvan de grootste slaapkamer is voorzien een vaste kast en beide voorzien van een laminaat vloer. Op deze verdieping is tevens de badkamer. De badkamer is voorzien van een ligbad, wastafel en toilet. <br/> <br/>Tweede verdieping <br/>Via een vaste trap ga je naar de tweede verdieping met een zeer ruime voorzolder met dakraam, wasmachine aansluiting en bergruimte achter de knieschoten. Verder is er op de zolder een derde slaapkamer. De gehele zolder is voorzien van laminaat. <br/> <br/>Tuin <br/>Aan de voorzijde van de woning is een ruime voortuin met parkeergelegenheid op eigen terrein. De achtertuin is te bereiken via op de openslaande deuren in de woonkamer als ook via een achterom. Het is een onderhoudsvrije tuin met sfeervolle veranda voorzien van electra.  <br/> <br/>Bijzonderheden <br/>- 3 ruime slaapkamers <br/>- Moderne complete keuken <br/>- Voldoende bergruimte <br/>- Onderhoudsarme tuin met veranda <br/>- Zonwering aan achterzijde <br/>- Parkeergelegenheid op eigen terrein.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/779/083_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Vaillant (gas gestookt combiketel uit 2000, eigendom)", "location": "Buttondown Farm, Zionsville, Boone County, Indiana, United States", "garden": "Achtertuin en voortuin", "back_garden": 39, "garden_location": "Gelegen op het zuidwesten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "N/A", "zipcode": "6605 KG", "street": "Elsland 1142", "house_number": "1142", "city": "wijchen", "province": "gelderland", "lat": 51.7977, "lng": 5.724887, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "elsland", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}