{"url": "https://www.funda.nl/koop/wildervank/huis-42608124-postkade-8/", "offer_type": "koop", "number_of_rooms": 6, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Toilet", "number_of_floors": 3, "outdoor_space": 4, "facilities": "Vliering en elektra", "volume_in_cubic_meters": 549, "living_area": 138, "plot_size": 357, "external_storage_space": 24, "asking_price": 375000, "asking_price_per_square_meter": 2717, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nWonen onder de  rook  van de  stad Groningen  in een karakteristiek, sfeervol,  vrijstaand  herenhuis bij het lommerrijke en  historische  Oosterdiep? Dan is dit een unieke kans! Deze woning beschikt  onder andere over maar liefst 4 (!) ruime slaapkamers, parkeergelegenheid op eigen terrein en is ideaal gelegen ten opzichte van diverse voorzieningen, zoals scholen, wijkwinkelcentrum en sportaccommodaties.  <br/> <br/>Het gemak van de stadse voorzieningen in de nabije omgeving wordt uitstekend gecombineerd met natuurlijk en gemoedelijk dorps woongenot. Alle benodigde voorzieningen en uitvalswegen richting omringende plaatsen zijn uitstekend en snel te bereiken! Binnen enkele (auto)minuten is de op- en afrit van de rijksweg N33 snel en eenvoudig bereikbaar en aansluitend de autosnelweg A7 richting onder andere de stad Groningen, Winschoten, de Eemshaven, Assen én de Duitse grens. Te midden van de levendigheid en diversiteit van het centrum van Veendam en de nabijgelegen stad Groningen, zult u hier rust ervaren! <br/> <br/>Vanuit de sfeervolle woonkamer aan de voorzijde van woning, heeft u een fraai uitzicht over het historische vis- en vaarwater (Oosterdiep) én de prachtige houtsingel. Aan de achterzijde van de woning heeft u vanuit de eetkamer uitzicht op de fraaie en privacyvolle achtertuin. In 1934 is deze woning gebouwd met de bij deze periode behorende stijlkenmerken, zoals een karakteristieke erker, dakoverstekken, hoge plafonds, inpandige kasten, kamer en-suite met bijbehorende en-suitedeuren, een royale hal met vestibule en terrazzo vloer, details in het markante (sier)metselwerk, glas in lood, paneeldeuren met bijbehorend hang-en sluitwerk én een kelder. Deze bijzondere en authentieke kenmerken maken tezamen dit charmante herenhuis en bieden deze woning grandeur en stijl! <br/> <br/>De indeling is als volgt: <br/> <br/>Begane grond: middels de authentieke gemetselde trap, luifel en kenmerkende jaren '30 voordeur is de hal te betreden. Vanuit de overkapte entree bereikt u de vestibule/tochtportaal. De entree in de vestibule/tochtportaal biedt onmiddellijk een prettige ambiance. De vestibule biedt toegang tot de hal voorzien van een prachtige terrazzo vloer, toiletruimte met toilet en fonteintje, garderobe, bordestrap naar de eerste verdieping, toegang tot de woonkamer, eetkamer én de dichte (woon)keuken. De lichte en sfeervolle woonkamer is voorzien van een prachtige en degelijke houten parketvloer, hoge raampartijen en zijramen, welke een heerlijk uitzicht over historisch en lommerrijk doorgaand vis- en vaarwater (Oosterdiep) én de fraaie houtsingel bieden. Vanuit de lichte en uiterst sfeervolle woonkamer is de eetkamer met en-suitedeuren en openslaande tuindeuren te bereiken, welke toegang bieden tot de keurig verzorgde, aangelegde en volledig af te sluiten achtertuin. De eetkamer met openslaande tuindeuren zorgen voor een fijne verbinding tussen de woon-/eetkamer, keuken en achtertuin! De dichte (woon)keuken is voorzien van een 5-pits gasfornuis met een elektrische oven en een koel-vriescombinatie. Tevens is vanuit de keuken de droge provisiekelder (stahoogte), alsmede de riante bijkeuken voorzien van witgoedaansluitingen, opstelplaats ten behoeve van de cv-ketel (HR combiketel), een uitstortgootsteen én een toegangsdeur richting de besloten en privacyvolle achtertuin te bereiken. Een prachtig detail is de voormalige en originele dienstingang welke nog zichtbaar is en wederom in gebruik te nemen is als toegangsdeur richting de bijkeuken. Het is mogelijk om in deze ruimte een slaap-, bad-, werk-/studeerkamer te realiseren. De begane grond kenmerkt zich door de vele authentieke jaren '30 details welke allen gedurende de bewoning bewaard zijn gebleven, zoals de sfeervolle kamer en-suite. Gelet op het feit dat de voormalige en originele dienstingang in goede staat bewaard is gebleven, leent deze ruimte zich ook uitstekend als praktijk-/kantoorruimte! Het verwarmen van het woonhuis en het tapwater geschiedt door middel van de hierboven vermelde centrale verwarmingsketel (HR combiketel). <br/> <br/>Eerste verdieping: via de bordestrap met prachtig en kenmerkend glas in lood is de ruime overloop te bereiken. De overloop biedt toegang tot de drie royale en lichte slaapkamers, de badkamer, alsmede een praktische en vaste (inloop)kast. De slaapkamers beschikken over ruime inbouwkasten en een wastafel. De keurige en gemoderniseerde badkamer is uitgevoerd in een lichte/neutrale kleurstelling en is voorzien van een inloopdouche, wastafel én een tweede toilet (wandcloset).  <br/> <br/>Tweede verdieping: middels de vaste trap is de tweede verdieping te bereiken, alwaar zich een riante vierde (!) slaapkamer bevindt! Deze slaapkamer is met recht royaal te noemen, aangezien deze volledige (zolder)verdieping in gebruik is genomen als slaapkamer. Tevens is er een wastafelmeubel met spiegelkast gerealiseerd, waardoor het geheel een luxueuze uitstraling heeft gekregen. Wederom beschikt deze verdieping over separate opbergruimte én een ruime inloopkast! Voor deze woonlaag geldt wederom; de sfeer uit de jaren '30 is meteen waar te nemen dankzij het hoge plafond (tot nokhoogte) en de zichtbare houten balken (spantbeen, trekplaten en makelaar) t.b.v. de dakconstructie. Deze verdieping ontvangt dankzij het dakkapel aan de zijkant van de woning en het dakraam aan de achterzijde van de woning, bijzonder veel daglicht en mede daarom ook zeer geschikt als werk-/studeerkamer! <br/> <br/>Tuin: de verzorgde en groene voor- en achtertuin is voorzien van fraaie bestrating en beplanting. De achtertuin is gelegen op het oosten, is reeds voorzien van een degelijk houten vlonder terras én diverse overige (zonne)terrassen. Aan de privacy en veiligheid is ook gedacht, want de achtertuin kan worden afgesloten door middel van een tuinpoort. Tevens is er een riante vrijstaande houten hobbyschuur met zolder gerealiseerd in de achtertuin. Het woonhuis is gerealiseerd op een perceel grond van maar liefst ca. 357m2! <br/> <br/>Bent u op zoek bent naar een woning die aanvoelt als een warme jas? De kans is erg groot dat u dat gevoel bij deze woning zult ervaren! Dit vrijstaande herenhuis, tuin en verdere toebehoren vormen tezamen een zeer goed onderhouden geheel, waarbij de authentieke en karakteristieke details zijn behouden. <br/> <br/>Woonoppervlakte: ca. 138m2; <br/>Externe bergruimte: ca. 24m2; <br/>Overige inpandige ruimte: ca. 16m2; <br/>Gebouw gebonden buitenruimte: ca. 4m2; <br/>Inhoud: ca. 549m3; <br/>Perceeloppervlakte: ca. 357m2; <br/>Bouwjaar: ca. 1934. <br/> <br/>Kenmerken en specificaties: <br/>- Aan een rustige weg en nabij het historische Oosterdiep gelegen (het Oosterdiep is doorgaand vis- en vaarwater!); <br/>- Uitstekend onderhouden vrijstaand en karaktervol herenhuis met behoud van originele en kenmerkende jaren '30 detaillering (zoals kamer en-suite, glas in lood, terrazzo vloer en een dienstingang); <br/>- Door hoogtes en de vier ruime (slaap)kamers geschikt voor gezinnen, maar ook thuiswerken zal in dit woonhuis heel inspirerend zijn; <br/>- Moderne stijl, maar met authentieke charme en eigentijdse vloer- en wandafwerking; <br/>- Grotendeels voorzien van dubbele beglazing (m.u.v glas in lood); <br/>- Ruimschoots parkeergelegenheid op eigen terrein, alsmede openbare parkeergelegenheid; <br/>- Lichte woonkamer voorzien van en-suitedeuren en in de eetkamer openslaande tuindeuren; <br/>- De keuken is voorzien van degelijk inbouwapparatuur, zoals een 5-pits gasfornuis, elektrische oven en koel-vriescombinatie; <br/>- Een riante bijkeuken voorzien van witgoedaansluitingen, opstelplaats t.b.v. de cv-ketel en toegangsdeur richting de achtertuin; <br/>- Ruime en droge kelderruimte (stahoogte); <br/>- Op de 1e verdieping bevinden zich drie ruime en lichte slaapkamers waarvan twee slaapkamers voorzien zijn van een wastafel; <br/>- Een gemoderniseerde badkamer in neutrale kleurstelling voorzien van een inloopdouche, wastafel en een tweede toilet (wandcloset);  <br/>- De vaste trap biedt toegang tot de royale slaapzolder met wastafelmeubel, inloopkast en aanvullende bergruimte; <br/>- Het woonhuis (inclusief tapwater) wordt verwarmd middels een uitstekend onderhouden cv-ketel (merk: HR combiketel van Remeha Calenta uit 2014 en in eigendom); <br/>- De groene achtertuin (gelegen op het oosten) is recentelijk voorzien van een degelijk houten vlonder terras, beschikt over een diversiteit aan (zonne)terrassen, een tuinpoort en een riante vrijstaande houten hobbyschuur voorzien van een zolderruimte; <br/>- Het herenhuis is voorzien van onderhoudsarme kunststof kozijnen voorzien van isolerende beglazing. Tevens beschikt de woning over dakisolatie;  <br/>- Sublieme ligging ten opzichte van diverse voorzieningen, zoals sportaccommodaties, horecavoorzieningen, dorpswinkelcentrum en scholen; <br/>- De stad Groningen, Winschoten en Assen zijn snel en eenvoudig te bereiken via de rijksweg N33, maar ook via het trein- en busstation Veendam.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/665/731_1440x960.jpg", "kind_of_house": "Herenhuis, vrijstaande woning", "construction_year": "N/A", "energy_label": "G ", "type_of_roof": "Samengesteld dak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Remeha Calenta (gas gestookt combiketel uit 2014, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 132, "garden_location": "Gelegen op het oosten", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "N/A", "zipcode": "9648 JR", "street": "Postkade 8", "house_number": "8", "city": "wildervank", "province": "groningen", "lat": 53.08406, "lng": 6.866527, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "wildervank", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}