{"url": "https://www.funda.nl/koop/venray/huis-42688678-gentiaan-42/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 2, "bathroom_facilities": "Ligbad en toilet", "number_of_floors": 3, "outdoor_space": 1, "facilities": "Mechanische ventilatie en TV kabel", "volume_in_cubic_meters": 375, "living_area": 83, "plot_size": 112, "external_storage_space": "N/A", "asking_price": 205000, "asking_price_per_square_meter": 2470, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nIn een kindvriendelijke  woonwijk  gelegen tussenwoning  met een  tuin op het zuiden.  <br/> <br/>De woonkamer is ruim van  opzet  en heeft veel natuurlijke lichtinval door  de  twee  grote raampartijen aan  de voor- en achterzijde van de woning. Vanuit de woonkamer is de zonnige tuin te bereiken. De half open keuken geeft toegang tot de berging. <br/> <br/>Op de eerste verdieping zijn twee slaapkamers. Van twee slaapkamers is één grote slaapkamer gemaakt in het verleden. Verder is een badkamer met ligbad, wastafel en toilet. Middels de vaste trap is de tweede verdieping te bereiken. Deze is nu in gebruik als opslagruimte, maar hier is de mogelijkheid om een derde slaapkamer te creëren.  <br/> <br/>De tuin is geheel omheind en gelegen op het zonnige zuiden. <br/> <br/>Ligging <br/> <br/>Deze tussenwoning is gelegen in de gewilde buurt Landweert. Voor de woning ligt een hofje, waardoor er vrij uitzicht is. Op loop- en fietsafstand van de woning is er een supermarkt, een bakker, cafetaria, wijkcentrum en een sporthal. Tevens zijn er diverse basisscholen op loopafstand. Het gezellige centrum van Venray is op fietsafstand (circa 7 min.). Tevens zijn de uitvalswegen richting Venlo, Duitsland en Nijmegen dichtbij en gemakkelijk te bereiken. <br/> <br/>Indeling <br/> <br/>Begane grond <br/> <br/>Hal/entree aan de voorzijde met de meterkast (6 groepen), toiletruimte en een luik naar de kruipruimte. De toiletruimte is gedeeltelijk betegeld en voorzien van een staand toilet met een fonteintje. De woonkamer beschikt over twee grote raampartijen aan de voor- en achterzijde en biedt toegang tot de hal, de keuken en de tuin. De half open keuken is aan de achterzijde gelegen en voorzien van een eenvoudige keukenopstand met spoelunit, gasfornuis en afzuigkap.   <br/> <br/>Eerste verdieping <br/> <br/>Via de hal is middels de trapopgang de eerste verdieping te bereiken. De overloop biedt toegang tot de twee slaapkamers (ca. 20 en 10 m²) en de badkamer. De badkamer is ingericht met bad-/douchecombinatie, wastafel, staand toilet. <br/> <br/>Tweede verdieping <br/> <br/>Momenteel ingericht als opslagruimte en te bereiken middels een vaste trap. De mogelijkheid bestaat om hier een 3e slaapkamer te realiseren. Hier is tevens de Remeha CV-ketel (2018) gesitueerd. <br/> <br/>Tuin <br/> <br/>De onderhoudsvriendelijke tuin is op het zuiden gelegen en is voorzien van bestrating, plantenborders en een vrije achterom. <br/> <br/>Is uw interesse gewekt? Maak dan snel een afspraak met ons kantoor!  <br/> <br/>Aansprakelijkheid <br/>Alle verstrekte informatie moet beschouwd worden als een uitnodiging tot het doen van een bod of om in onderhandeling te treden. Er kunnen geen rechten worden ontleend aan deze woninginformatie.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/927/015_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "B ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Remeha (gas gestookt combiketel uit 2018, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 54, "garden_location": "Gelegen op het zuiden bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "5803 CT", "street": "Gentiaan 42", "house_number": "42", "city": "venray", "province": "limburg", "lat": 51.53346, "lng": 5.987824, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "landweert1", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}