{"url": "https://www.funda.nl/koop/waalwijk/huis-42692724-lotharingenstraat-6/", "offer_type": "koop", "number_of_rooms": 6, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Ligbad en douche", "number_of_floors": 3, "outdoor_space": 86, "facilities": "Rolluiken en TV kabel", "volume_in_cubic_meters": 607, "living_area": 179, "plot_size": 220, "external_storage_space": "N/A", "asking_price": 495000, "asking_price_per_square_meter": 2765, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nDeze moderne geschakelde  woning  bevindt zich  op een  fantastische locatie. Dit huis  telt  maar liefst vier verdiepingen en  is  écht een ideale gezinswoning. Mocht je  overwegen  om  een kantoor aan  huis te hebben, dan is ook dat hier heel goed te realiseren. Maak je woonwensen hier waar! <br/> <br/>Met de juiste aandacht en inspiratie creëer je hier in een mum van tijd je droomhuis.  <br/>De entree van de woning is in de bestrate voortuin, via een trap te bereiken. De lichte hal waarin je de woning binnenkomt is voorzien van een lichte tegelvloer die doorloopt in de leefruimte en keuken. Dat is nog eens comfortabel. <br/> <br/>De inrichting van de woonkamer met een ruime leefruimte en een eetgedeelte nodigt uit om lekker te ontspannen. Een schuifpui geeft hier toegang tot het brede terras. Door de houten shutters en de grote ramen ontstaat er een prettige lichtinval. De gashaard in de hoek van de woonkamer biedt in de winter een extra knusse en warme dimensie.   <br/> <br/>Via een open doorgang kom je in de landelijke keuken die geplaatst is in een hoekopstelling met een losstaand eiland. De keuken is voorzien van veel opbergruimte en alle benodigde apparatuur; een vaatwasser, een zes-pits kookplaat met wokbrander, een afzuigkap, koelkast, vriezer en een oven. Daarnaast is er in de keuken en woonkamer vloerverwarming. Vanuit de keuken heb je een lekker ruim uitzicht op de omgeving, heb je al zin om hier een heerlijke maaltijd te bereiden? Met de berging naast de keuken heb je nog een praktische ruimte om extra spullen op te bergen. <br/> <br/>In de hal voor in de woning is de trap naar de eerste verdieping. De overloop geeft toegang tot twee slaapkamers, de badkamer, een separaat toilet en de ruimte waar zich de ketel uit 2021, de was aansluitingen en het centrale afzuigsysteem zich bevinden. De slaapkamers zijn praktisch en voorzien van fijne grote ramen. Één van de slaapkamers is bovendien voorzien van een praktische inbouwkast. De badkamer is voorzien van een ligbad, douche, dubbele wastafel en een designradiator. Hier kun je  aan het begin en aan het einde van de dag helemaal je draai vinden. <br/> <br/>En dan zijn we er nog niet! Met een trap kom je op de tweede verdieping, daar zijn nog twee slaapkamers en een riant dakterras. De kleinere slaapkamer heeft een wastafel met warm en koud water en via de grote slaapkamer kun je het dakterras betreden. Wat een heerlijk uitzicht heb je hier. De twee deuren naar het dakterras zijn afsluitbaar door middel van een elektrisch bedienbaar rolluik.  <br/> <br/>Via een extra berging een zgn. â\u0080\u0098achterportaalâ\u0080\u0099 met inbouwkast kun je aan de achterkant van de woning ook het doorlopende en achterliggende terras op. Dit terras is nu een onderhoudsvrije rondom de woning gelegen bestraat terras. Hier kun je met een beetje groene vingers een heerlijk buiten creëren, de zon komt hier ook graag! In deze berging bevindt zich trouwens ook de vaste trap waarmee je naar de onder de woning gelegen ruimte kunt. Hier kun je allerlei inrichting aan geven, fijn dat deze ruimte van het souterrain ook via de voorzijde van de woning is te bereiken.  <br/> <br/>De ruimte kun je voor veel doeleinden gebruiken, wordt het een speelkamer, een mooie hobbyruimte, misschien toch een extra slaapkamer, of kantoor aan huis?  Met een kleine aanpassing kun je er ook weer een garage van maken.  <br/> <br/>Deze heerlijke woning ligt op een prachtige locatie, op gunstige afstand van het centrum van Waalwijk. Alle dagelijkse voorzieningen, boodschappen, sport en scholen zijn gemakkelijk te bereiken. Maar ook de natuur is nabijgelegen. Even helemaal tot rust komen in de Loonse en Drunense Duinen, die zijn lekker dichtbij. En mocht je elders moeten zijn, je bent hier ook zo op de diverse uitvalswegen naar â\u0080\u0099s-Hertogenbosch (A59) en naar Tilburg (N261). <br/>Misschien is dit wel jouw nieuwe woonplek? Kom maar eens kijken op Lotharingenstraat 6 in Waalwijk.  <br/> <br/>Bijzonderheden: <br/>-\tStrak geschakelde woning; <br/>-\tvier verdiepingen; <br/>-\tvier slaapkamers; <br/>-\tterras rondom en bestrate voortuin; <br/>-       achterzijde voorzien van rolluiken <br/>-\textra dakterras; <br/>-\telektrische bedienbare zonneluifel; <br/>-\tkantoor aan huis mogelijk; <br/>-\tnabij Loonse en Drunense duinen; <br/>-\taanvaarding in overleg. <br/> <br/>Deze informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins, dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/437/198_1440x960.jpg", "kind_of_house": "Eengezinswoning, geschakelde woning", "construction_year": "N/A", "energy_label": "B ", "type_of_roof": "Plat dak bedekt met bitumineuze dakbedekking", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Kompakt HRE 36/30A (gas gestookt combiketel uit 2021, eigendom)", "location": "Buttondown Farm, Zionsville, Boone County, Indiana, United States", "garden": "Voortuin en zonneterras", "back_garden": "N/A", "garden_location": "Gelegen op het westen", "balcony": "Dakterras aanwezig", "type_of_parking": "Op eigen terrein", "garage": "N/A", "zipcode": "5144 EW", "street": "Lotharingenstraat 6", "house_number": "6", "city": "waalwijk", "province": "noordbrabant", "lat": 51.67835, "lng": 5.076549, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "meerdijk", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}