{"url": "https://www.funda.nl/koop/venray/huis-42688186-andantestraat-7/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Douche en toilet", "number_of_floors": 2, "outdoor_space": 15, "facilities": "Dakraam, rolluiken en schuifpui", "volume_in_cubic_meters": 480, "living_area": 136, "plot_size": 256, "external_storage_space": 5, "asking_price": 269000, "asking_price_per_square_meter": 1978, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nRuime 2-onder-1 kapwoning  met  uitgebouwde woonkamer  en keuken,  bijkeuken, berging, carport en  een  zonnige tuin op het zuidwesten. De  woning  is gelegen aan een rustige straat op loopafstand van het  buurtwinkelcentrum in de wijk Brukske. <br/> <br/>Begane grond <br/>De overdekte entree is gelegen aan de voorzijde van de woning. In de hal bevindt zich het toilet, de trapkast en de meterkast.  <br/>Het toilet is gedeeltelijk betegeld en voorzien van een wandcloset en een fonteintje. <br/>Voorts de woonkamer. De ruime woonkamer is aan de achterzijde uitgebouwd. Aan de voorzijde bevindt zich de zithoek en aan de achterzijde de eethoek met aansluitend de keuken. De zithoek is afgewerkt met tapijt en gestucte wanden. <br/>De eethoek en keuken bevinden zich in de uitbouw en zijn afgewerkt met een kurkvloer en gestucte wanden. <br/>Een schuifpui naar de tuin en een lichtstraat zorgen hier voor volop lichtinval. De L-vormige keukeninrichting is van alle gemakken voorzien zoals een koelkast, een vaatwasser, een combi-magnetron, een gaskookplaat en een afzuigkap. <br/>Vanuit de eethoek is de praktische bijkeuken te bereiken. De bijkeuken is voorzien van de witgoedaansluitingen, <br/>een uitstortgootsteen en een vaste schuifkast. Aansluitend de berging met houten pui en dubbele beglazing. <br/>Vanuit de berging is middels een loopdeur de oprit met carport te bereiken.  <br/> <br/>1e Verdieping: <br/>Op de eerste verdieping bevinden zich 3 slaapkamers en de luxe badkamer. Alle slaapkamers zijn voorzien van tapijt en behangen wanden.  <br/>Alle kamers, incl. de badkamer zijn voorzien van kunststof kozijnen met dubbele beglazing en rolluiken.  <br/>De luxe badkamer is in 2016 vernieuwd en voorzien van een inloopdouche, een wandcloset en een badmeubel.  <br/> <br/>Zolder: <br/>Middels een vaste trap is de zolder te bereiken. De zolder bestaat uit een voorzolder en een extra kamer.  <br/>Op de voorzolder bevindt zich de opstelling van de cv-ketel (Atag uit 2022 met 2 jaar fabrieksgarantie). <br/>De zolderkamer is aan de achterzijde voorzien van een dakkapel met hardhouten kozijn en rolluik. Verder is deze <br/>kamer voorzien van voldoende  bergruimte onder de dakschuinte.  <br/> <br/>Tuin:  <br/>De voortuin is ingericht als siertuin met daarnaast een beklinkerde oprit met carport. <br/>De achtertuin is op het zuidwesten gelegen waardoor u verzekerd bent van voldoende zon. De tuin is voorzien van een terras, volop vaste beplanting, een tuinhuis en een eigen achterom. Aan de uitbouw bevindt zich een <br/>zonneluifel. <br/> <br/>â\u0080¢ De woning is grotendeels voorzien van kunststof kozijnen met dubbele beglazing. Aluminium kozijnen bevinden zich op de begane grond aan de <br/>achterzijde. <br/>â\u0080¢ De 1e verdieping en de dakkapel op zolder zijn voorzien van rolluiken. <br/>â\u0080¢ De woning is aan de achterzijde uitgebouwd, hierdoor is er veel leefruimte op de begane grond ontstaan. <br/>â\u0080¢ Op loopafstand van het buurtwinkelcentrum van 't Brukske gelegen. <br/>â\u0080¢ Deze informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins, dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief. Eventuele bijgesloten plattegrond-tekeningen zijn ter indicatie en kunnen afwijken van de werkelijke situatie.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/946/718_1440x960.jpg", "kind_of_house": "Eengezinswoning, geschakelde 2-onder-1-kapwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "N/A", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Atag (gas gestookt combiketel uit 2022, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Carport", "zipcode": "5802 GD", "street": "Andantestraat 7", "house_number": "7", "city": "venray", "province": "limburg", "lat": 51.52209, "lng": 5.986824, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "brukske1", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}