{"url": "https://www.funda.nl/koop/venray/huis-42684532-kruidenlaan-86/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Toilet", "number_of_floors": 3, "outdoor_space": "N/A", "facilities": "N/A", "volume_in_cubic_meters": 331, "living_area": 96, "plot_size": 138, "external_storage_space": 5, "asking_price": 269000, "asking_price_per_square_meter": 2802, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nZoekt u een  instapklare  en modern  afgewerkte woning  dan is dit wellicht  iets  voor u. Deze tussenwoning met  vrije  achterom, nieuwe keukeninrichting, moderne badkamer en  vaste  trap  naar de zolderverdieping  is gelegen in de wijk Landweert en is direct te betrekken.  <br/> <br/>BEGANE GROND <br/>U betreedt de woning via de entree aan de voorzijde. De entree is voorzien van een meterkast en een moderne toiletruimte met wandcloset en fonteintje.  <br/>Voorts de woonkamer. Deze tuingerichte woonkamer is afgewerkt met een laminaatvloer, gestucte wanden en een gestuct plafond. De woonkamer is verder voorzien van een praktische trapkast en een loopdeur naar de tuin.  <br/>Aan de voorzijde van de woning bevindt zich de keuken. De keuken is voorzien van een nieuwe, strakke hoekinrichting (eind 2020) voorzien van een composiet werkblad, een inductiekookplaat, een afzuigkap, een koelkast, een combi-magnetron en een vaatwasser. <br/> <br/>1e VERDIEPING <br/>De overloop biedt toegang tot 3 slaapkamers en de badkamer. De ouderslaapkamer is aan de voorzijde gelegen en is voorzien van een siergrindvloer, getexte wanden en een spuitwerk plafond. Verder is deze slaapkamer nog voorzien van een rolluik. <br/>De 2 kinderkamers zijn aan de achterzijde gelegen en zijn eveneens afgewerkt met een siergrindvloer, getexte wanden en een spuitwerk plafond.  <br/>De moderne badkamer is gedeeltelijk betegeld en voorzien van een inloopdouche, een wandcloset en een wastafel. Ventilatie geschiedt hier zowel op mechanische als op natuurlijke wijze door middel van een raampje.  <br/> <br/>2e VERDIEPING <br/>Deze verdieping is bereikbaar via een vaste trapopgang. Op de voorzolder bevindt zich de opstelling van de cv-ketel (Vaillant, uit 2000) en opstelplaats voor het witgoed. <br/>De zolderkamer heeft extra bergruimte achter de knieschotten. Een Velux dakraam zorgt voor daglichttoetreding. De vloer is netjes afgewerkt met een vinylvloer (2020). <br/> <br/>TUIN <br/>De voortuin is nagenoeg geheel verhard. <br/>De achtertuin is vanaf 2019 opnieuw ingericht met onder andere een nieuw, ruim terras, nieuwe borders met beplanting, een gazon van kunstgras en rondom een nieuwe schutting met aan de achterzijde een poort.  Deze poort ontsluit aan een leuk speelveldje. In 2021 is er nog een fraaie overkapping geplaatst. <br/>Achter de overkapping bevindt zich de gemetselde berging.  <br/>Ziet u zichzelf hier al zitten van de zomer? <br/> <br/>â\u0080¢     Het betreft een prachtige, instapklare woning. De woning is in 2020 nog voorzien van: <br/>       - een nieuwe keukeninrichting. <br/>       - nieuwe HR ++ beglazing op de gehele begane grond en op de badkamer. <br/>       - nieuwe voor- en achterdeur met driepuntssluiting <br/>       - nieuwe binnendeuren op begane grond.  <br/>       - nieuw laminaatvloer op de begane grond. <br/>       - nieuwe houten overkapping in de achtertuin. <br/>       - nieuwe vinylvloer op de zolder.  <br/>â\u0080¢    Aan de achterzijde aan een speelveldje gelegen.  <br/>â\u0080¢    Deze informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins, dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief. Eventuele bijgesloten plattegrond-tekeningen zijn ter indicatie en kunnen afwijken van de werkelijke situatie.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/149/806_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Zadeldak", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Vaillant (gas gestookt combiketel uit 2000, eigendom)", "location": "Buttondown Farm, Zionsville, Boone County, Indiana, United States", "garden": "Achtertuin en voortuin", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "5803 BC", "street": "Kruidenlaan 86", "house_number": "86", "city": "venray", "province": "limburg", "lat": 51.53161, "lng": 5.988328, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "landweert1", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}