{"url": "https://www.funda.nl/koop/zuidlaren/appartement-42654036-stationsweg-213/", "offer_type": "koop", "number_of_rooms": 3, "number_of_bathrooms": 2, "number_of_bedrooms": 2, "bathroom_facilities": "Douche en toilet", "number_of_floors": 1, "outdoor_space": 57, "facilities": "Buitenzonwering, mechanische ventilatie, natuurlijke ventilatie en TV kabel", "volume_in_cubic_meters": 464, "living_area": 145, "plot_size": "N/A", "external_storage_space": "N/A", "asking_price": 695000, "asking_price_per_square_meter": 4793, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nAPPARTEMENT P01A |  KIJK  VOOR MEER  INFORMATIE OP  DE WEBSITE VAN HET  BLAUWE  PAVILJOEN <br/> <br/>Wonen in één  van  de meest markante monumentale gebouwen van  Noord-Nederland:  dat is wonen in  Het Blauwe Paviljoen in Zuidlaren. Het Noorder Sanatorium, in de volksmond het â\u0080\u0098Blauwe Paviljoenâ\u0080\u0099 genoemd, is zowel in bouwhistorische als in architectonische zin uniek in Nederland. En u krijgt de kans om als eerste op deze buitengewoon bijzondere locatie te mogen wonen. <br/> <br/>Bijna een eeuw nadat het oorspronkelijke ontwerp van architect Egbert Reitsma van de tekentafel kwam, zal het Blauwe Paviljoen een metamorfose ondergaan en wordt het omgetoverd tot een â\u0080\u0098state of the artâ\u0080\u0099 woongebouw. In dit Rijksmonument ontwikkelt LPB Vastgoed 27 luxe appartementen op een landgoed van ruim zes hectare. Van de imponerende contouren van het gebouw tot de kleinste details in de afwerking: uw nieuwe woonplek is een unicum in Nederland. Een kans die u niet kunt laten lopen. <br/> <br/>LOCATIE <br/>Zuidlaren noemt zich met recht het groenste dorp van Europa. Wandelen, fietsen en watersport: Zuidlaren is van alle markten thuis. <br/>Trek een lijn tussen Groningen en Assen en exact in het midden ligt Zuidlaren. Via de N34 of de A28 bent u in nog geen tien minuten in één van beide steden. De ontsluiting van Zuidlaren is daarmee uitstekend te noemen. <br/>Een drankje op één van de vele terrassen. een wandeling over de Zuidlaarder markt of een mooie fietstocht door de nabijgelegen natuur: Zuidlaren heeft verrassend veel in huis. Het gezellige centrum van het pittoreske dorp vindt u op slechts enkele minuten van uw voordeur. <br/>Ook voor uw dagelijkse boodschappen kunt u in uw eigen dorp uitgebreid terecht. Datzelfde geldt voor de invulling van uw vrije tijd. Zuidlaren beschikt over een zwembad en een rijk verenigingsleven. <br/> <br/>APPARTEMENTEN <br/>In de bosrijke omgeving is het heerlijk wandelen en fietsen. Hier vindt u volop prachtige fietsroutes. Vandaar dat we hebben gekozen voor optimaal gemak om uw fiets veilig onderdak te zetten. <br/> <br/>Als bewoner van een patiowoning stalt u uw fiets in uw eigen berging of in de berging naast uw parkeerplaats, die tegen de muur van de binnentuin is gepositioneerd. Dat geldt ook wanneer u de trotse bewoner bent van appartement 002, 003, 006, 007, 101 of 105. Als eigenaar van één van de overige appartementen kunt u gebruik maken van de ruime fietsenstalling in het souterrain. <br/> <br/>BIJZONDERHEDEN PATIOWONING <br/>- Twee slaapkamers met ieder een eigen badkamer <br/>- Royale en lichte living <br/>- Gelegen aan een binnentuin\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/142/376_1440x960.jpg", "kind_of_house": "N/A", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Plat dak", "heating": "Gehele vloerverwarming, warmte terugwininstallatie en warmtepomp", "hot_water": "N/A", "boiler": "N/A", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Parkeerplaats", "zipcode": "9471 GP", "street": "Stationsweg 213", "house_number": "213", "city": "zuidlaren", "province": "drenthe", "lat": 53.09072, "lng": 6.66565, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "Benedenwoning (appartement)", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "verspreidehuizenwestlaren", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}