{"url": "https://www.funda.nl/koop/de-rijp/huis-42687222-julianalaan-169/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Douche en toilet", "number_of_floors": 3, "outdoor_space": "N/A", "facilities": "Alarminstallatie, buitenzonwering, schuifpui en TV kabel", "volume_in_cubic_meters": 565, "living_area": 146, "plot_size": 425, "external_storage_space": "N/A", "asking_price": 525000, "asking_price_per_square_meter": 3596, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nAan het randje  van  het fraaie  dorp De  Rijp gelegen vrijstaande woning  met  inpandig bereikbare garage. Met aan  het  randje bedoelen wij niet afgelegen. De  woning  is zeer centraal gelegen  met alle voorzieningen op korte loop- of fietsafstand. De brede school en sportclubs op slechts enkele minuten lopen, het gezellige centrum en winkelcentrum slechts op 5 minuten fietsafstand. De woning onderscheidt zich door de zeer riante uitgebouwde woonkamer, 3 maar de mogelijkheid tot 5/6 slaapkamers en een zeer riante kavel van 425 m2 met een wel 17 meter diepe achtertuin waar u altijd een zon en schaduwplekje heeft. De woning is ideaal voor het grote gezin of voor degene die gewoon weg van ruimte houdt. Nieuwsgierig naar het totale plaatje? Bel Ons!     <br/> <br/>INDELING:  <br/>Begane grond: Entree/hal, meterkast, toiletruimte, uitgebouwde woonkamer, half open keuken, bijkeuken en een inpandig bereikbare garage.  <br/> <br/>1e verdieping: Overloop, 2 (oorspronkelijk 3) slaapkamers en badkamer voorzien van douche, wastafelmeubel en toilet. De voor- en achter slaapkamer zijn bij elkaar getrokken en voorzien van wastafelmeubel. <br/> <br/>2e verdieping: Riante voorzolder met opstelling cv-ketel en een ruime slaapkamer met dakkapel aan de voorzijde. <br/>De zolder biedt de mogelijkheid om 2 slaapkamers te realiseren. De tweede slaapkamer kan dan ook nog vergroot worden met een dakkapel aan de achterzijde. <br/> <br/>BIJZONDERHEDEN: <br/>- Elektra, 5 groepen; <br/>- Verwarming en warmwatervoorziening d.m.v. CV-ketel, Nefit, bouwjaar circa 2006; <br/>- Gehele woning voorzien van dubbele beglazing en dakisolatie; <br/>- Woning zowel aan de achter- als voorzijde voorzien van elektrische zonnescherm; <br/>- De kas in de achtertuin kan elektrisch verwarmd worden; <br/>- Alle kozijnen zijn uitgevoerd in hardhout, met uitzonding van slaapkamers op het noorden deze zijn uitgevoerd in grenen met hardhouten draairamen; <br/>- Dakgoot voorzijde in circa 2015 vernieuwd; <br/>- Parkeergelegenheid op eigen erf en voor de deur; <br/>- Gelegen aan voor autoverkeer doodlopende straat; <br/>- Gelegen nabij doorgaand vaarwater van beschermd natuurgebied â\u0080\u009cde Eilandspolderâ\u0080\u009d; <br/>- De Rijp is een gezellig historische dorp voorzien van twee basisscholen, vijf restaurants, winkels, winkelcentrum,  <br/>  apotheek, huisartsen, gezondheidscentrum en openbaar vervoer; <br/>- De Rijp is gelegen tussen Purmerend, Alkmaar en Zaanstad allen op circa 15 minuten rijafstand. Er zijn goede  <br/>  busverbindingen met Alkmaar, Purmerend en Amsterdam.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/915/063_1440x960.jpg", "kind_of_house": "Eengezinswoning, vrijstaande woning", "construction_year": "N/A", "energy_label": "E ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel en elektrische boiler", "boiler": "Nefit Smartline (gas gestookt combiketel uit 2006, eigendom)", "location": "N/A", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": 204, "garden_location": "Gelegen op het noorden bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "Inpandig", "zipcode": "1483 VK", "street": "Julianalaan 169", "house_number": "169", "city": "derijp", "province": "noordholland", "lat": 52.55252, "lng": 4.845805, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "derijp", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}