{"url": "https://www.funda.nl/koop/overloon/huis-88052379-trantert-25/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Ligbad en toilet", "number_of_floors": 2, "outdoor_space": 19, "facilities": "TV kabel", "volume_in_cubic_meters": 601, "living_area": 145, "plot_size": 667, "external_storage_space": 47, "asking_price": 525000, "asking_price_per_square_meter": 3621, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nHeb jij altijd  al  vrijstaand willen  wonen midden  in het dorp? Dan  is  de Trantert 25 in Overloon  de  ideale woning voor jou! Met een  woonoppervlakte van 145m² op een  perceel van 667m² zit jij niet mis. Je kinderen groeien hier op in een fijne omgeving. Daarnaast is het mogelijk om hier oud te worden door de mogelijkheid tot gelijkvloers wonen &amp; slapen. <br/> <br/>Kom binnenâ\u0080¦ <br/>Zet je eerste stappen door de voordeur en kom uit in de ruime hal. Hier vind je van links naar rechts de garderobe, de trap die je naar de eerste verdieping brengt, de deur naar de woonkamer en de meterkast. <br/> <br/>Vervolg je weg naar de woonkamerâ\u0080¦ <br/>Vanuit de hal kom je binnen in de woonkamer. Deze is gesitueerd aan de voorzijde van de woning. Aan de achterzijde vind je de eetkamer. Deze ruimtes hebben een fijne lichtinval door de vele raampartijen. Daarnaast heb je door middel van openslaande tuindeuren toegang tot het overdekte terras. <br/> <br/>Creëer een open keukenâ\u0080¦ <br/>Via de deur in de eetkamer kom je uit in de gesloten keuken. Deze is voordien van diverse inbouw apparatuur, waaronder een vierpits gasfornuis, vaatwasser en oven. Door de wanden van de keuken open te breken creëer je een open keuken die centraal staat op de benden verdieping. Zo kun je tijdens het koken met zowel de woon- als de eetkamer in contact blijven. <br/> <br/>Gelijkvloers wonen &amp; slapenâ\u0080¦ <br/>Vanuit de keuken kun je de bijkeuken betreden. Ook hier heb je toegang tot het overdekte terras. Daarnaast vind je hier het toilet en een doucheruimte. Gevolgd door een kamer die kan dienen als speelkamer, maar ook als slaapkamer. Zo kun je gelijkvloers wonen en slapen. Tevens heb je vanaf deze kamer toegang tot de bergzolder door middel van een vliering. <br/> <br/>Grenzend aan de speel/slaapkamer bevindt zich een ruimte dat momenteel als kantoor wordt gebruikt. Zo kun jij in alle rust thuiswerken. Daarnaast zit er een deur naar de oprit. <br/> <br/>Vervolg je weg naar bovenâ\u0080¦ <br/>Via de vaste trap in de hal kom je uit op de eerste verdieping. Hier bevinden zich 3 slaapkamers, een hobbykamer/kantoor en de badkamer. Deze is voorzien van een ligbad, toilet en wastafel. Vanuit deze verdieping heb je toegang tot de zolder door middel van een vaste trap. Hier bevindt zich de Cv-ketel. <br/> <br/>Geniet van de tuinâ\u0080¦ <br/>Met de tuin op het noordwesten geniet je vanaf de middag tot aan de avond van de zon. Nodig je familie en vrienden uit voor een hapje en een drankje op het overdekte terras. Daarnaast heb je hier niet één maar twee overkappingen. De tweede grenst aan de zeer ruime, dubbele garage mét kap.  <br/> <br/>Zie jij jezelf hier wonen? Aarzel dan niet een plan snel je bezichtiging in!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/295/769_1440x960.jpg", "kind_of_house": "Eengezinswoning, vrijstaande woning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Samengesteld dak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Atag (gas gestookt combiketel, eigendom)", "location": "Buttondown Farm, Zionsville, Boone County, Indiana, United States", "garden": "Achtertuin en voortuin", "back_garden": 435, "garden_location": "Gelegen op het noordwesten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Vrijstaande stenen garage", "zipcode": "5825 JS", "street": "Trantert 25", "house_number": "25", "city": "overloon", "province": "noordbrabant", "lat": 51.57295, "lng": 5.941347, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "overlooncentrum", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}