{"url": "https://www.funda.nl/koop/elst-ut/huis-42696124-houweg-20/", "offer_type": "koop", "number_of_rooms": 7, "number_of_bathrooms": 2, "number_of_bedrooms": 5, "bathroom_facilities": "2 ligbaden, douche en 2 toiletten", "number_of_floors": 2, "outdoor_space": 22, "facilities": "Airconditioning, alarminstallatie, dakraam, natuurlijke ventilatie, rookkanaal en zwembad", "volume_in_cubic_meters": 1000, "living_area": 253, "plot_size": 1470, "external_storage_space": 123, "asking_price": 1395000, "asking_price_per_square_meter": 5514, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nRoyaal rietgedekt VRIJSTAAND  WOONHUIS  met verwarmde  garage, dubbele  carport en fraaie aangelegde  tuin  met verwarmd zwembad centraal gelegen  op  de Utrechtse Heuvelrug. <br/> <br/>Dit sfeervolle  en uiterst comfortabele vrijstaande woonhuis  beschikt o.a. over een royale living, smaakvolle woonkeuken, 5 (slaap)kamers, luxe sanitair en een kantoorruimte. Door de aanwezigheid van een slaap- en badkamer op de begane grond ook geschikt voor minder validen bewoners. Dit fraaie object is gelegen op een perceel van 1.470m², waarbij ruimte, comfort en privacy de sleutelwoorden zijn. De vrijstaande garage en aangebouwde carport bieden royaal ruimte aan meerdere voertuigen. In het naastgelegen bijgebouw bevindt zich een fijne ontspanningsruimte. Centraal in de fraai aangelegde achtertuin ligt het verwarmde zwembad, omgeven door terrassen, borders met gevarieerde beplanting en hagen en schuttingen die de privacy in de tuin waarborgen. Gelegen aan een geliefde straat in het dorp Elst waarbij alle dagelijkse voorzieningen, de uitgestrekte bossen en de mooie uiterwaarden vrijwel letterlijk â\u0080\u009com de hoekâ\u0080\u009d te vinden zijn.  <br/> <br/>Een uiterst verzorgde, comfortabele en goed geïsoleerde woning met een unieke sfeer en gebruiksgemak. <br/> <br/>Indeling:  <br/>Begane grond: centrale hal/entree met toiletruimte, trapopgang naar de verdieping en toegang tot kantoorruimte met kastenwand. De royale en sfeervolle living is voorzien van een haardpartij met gashaard, strak gestuukte wanden, balkenplafonds en een eiken plankenvloer. De woonkeuken biedt ruimte aan grote eethoek en beschikt over een landelijkmoderne keukenopstelling bestaande uit een kookeiland met inductie kookplaat, afzuigschouw, wandopstelling met spoelbak en vaatwasser en apparatenwand met combi-oven en koelkast. De keuken is voorzien van veel kastruimte in de functionele lades en kasten en veel werkruimte op het composiet werkblad. In de aangrenzende bijkeuken/berging bevinden zich de cv-combiketel en de aansluitpunten voor wassen en drogen. Via een 2e hal aan de achterzijde is er toegang tot de slaapkamer (met kastenwand) en badkamer op de begane grond en de 2e slaapkamer op de bovengelegen verdieping (met airconditioning). Vanuit deze hal is er tevens toegang tot het overdekte terras en de tuin. <br/> <br/>1e verdieping: centrale overloop met toegang tot 3 ruime slaapkamers en de badkamer. De ouderslaapkamer is gelegen aan de tuinzijde en voorzien een inloopgarderobe, Frans balkon en airconditioning. De royale slaapkamer aan de voorzijde is afgewerkt met maatwerkkasten, een bedstee en airconditioning. De 3e slaapkamer op deze verdieping beschikt over een dakkapel. De licht afgewerkte badkamer is uitgevoerd met een dakkapel, ligbad, douchecabine, smaakvol badkamermeubel en designradiator.  <br/> <br/>2e verdieping: via luik en vlizotrap bereikbare praktische bergvliering. <br/> <br/>Buiten: via elektrisch bedienbare toegangspoort en brede oprit is er toegang tot de royale parkeerruimte voor meerdere autoâ\u0080\u0099s, vrijstaande bering, carport en de luxe afgewerkte garage voorzien van elektrische sectionaaldeur en toiletruimte. Vanuit de garage is de naastgelegen ontspanningsruimte bereikbaar, welke voorzien is van openslaande deuren naar de tuin. Deze ruimte kan ook worden gebruikt als poolhouse, atelier of tuinkamer. De achtertuin is fraai aangelegd rondom het verwarmde zwembad met royale terrassen en speels aangelegde borders voorzien van gevarieerde beplanting. Een kleine berging naast de woning biedt ruimte voor het opbergen van tuingereedschap. Achterin de tuin bevindt zich een klein dierenverblijf (kippen, konijnen, etc. ) met uitloopren. De gehele tuin is omzoomd door verzorgde schuttingen en hagen. Vanonder de overkapping of terrassen kan heerlijk worden genoten van het buitenleven en de aanwezige privacy. <br/> <br/>Bijzonderheden: <br/>- Woonoppervlak 253 m², inhoud 1.000 m³, perceeloppervlak 1.470m².  <br/>- Royaal en sfeervol object met diverse mogelijkheden voor werken aan huis. <br/>- Extra slaapkamer en badkamer op de begane grond. <br/>- Goed geïsoleerd. <br/>- O.a. voorzien van intercominstallatie, beveiligingssysteem (cameraâ\u0080\u0099s) en airconditioning. <br/>- Aanvaarding in overleg.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/234/497_1440x960.jpg", "kind_of_house": "Villa, vrijstaande woning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Zadeldak bedekt met riet", "heating": "Cv-ketel en gashaard", "hot_water": "Cv-ketel", "boiler": "Gas gestookt combiketel, eigendom", "location": "N/A", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": 1056, "garden_location": "Gelegen op het zuidoosten bereikbaar via achterom", "balcony": "Frans balkon aanwezig", "type_of_parking": "Op afgesloten terrein, op eigen terrein en openbaar parkeren", "garage": "Garage met carport", "zipcode": "3921 DB", "street": "Houweg 20", "house_number": "20", "city": "elstut", "province": "utrecht", "lat": 51.98811, "lng": 5.492386, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "hetbosje", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}