{"url": "https://www.funda.nl/koop/blauwestad/huis-88050155-anholt-49/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 2, "number_of_bedrooms": 3, "bathroom_facilities": "Stoomcabine, 2 douches en 2 toiletten", "number_of_floors": 1, "outdoor_space": 14, "facilities": "Airconditioning, mechanische ventilatie, rookkanaal, schuifpui, TV kabel en zonnepanelen", "volume_in_cubic_meters": 647, "living_area": 151, "plot_size": 1063, "external_storage_space": "N/A", "asking_price": 675000, "asking_price_per_square_meter": 4470, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nWilt u deze  woning  bezichtigen? Dan  verzoeken wij  u via Funda of  per  e-mail een afspraak te maken.  Aanvragen  worden op volgorde van binnenkomst afgehandeld.  <br/> <br/>Deze schitterende gelijkvloerse woning  uit 2019 is tot in de puntjes afgewerkt en van alle gemakken voorzien. De woning is mooi gelegen met de tuin aan het water van het Oldambtmeer en beschikt over een eigen aanlegsteiger / vlonder, carport en garage. Daarnaast is de woning uitgerust met vloerverwarming, zonnepanelen, airconditioning, drie slaapkamers en twee badkamers. <br/>Op 5 kilometer is de gezellige winkelstad Winschoten gelegen en u bent in een half uur met de auto in de stad Groningen. Via de langste fiets- en voetgangersbrug van Europa bent u binnen een kwartier met de fiets in Winschoten. In de directe omgeving bevinden zich diverse voorzieningen zoals een basisschool, sportfaciliteiten, apotheek, huisarts en zwembad. Deze prachtige bungalow is zeker een bezichtiging waard. <br/> <br/>Klik op de 3d-tour om de woning alvast van binnen te bekijken! <br/> <br/>Indeling: <br/>U komt binnen in de hal. Hier bevindt zich de meterkast en een berging met cv-opstelling. Vanuit de hal heeft u inpandige toegang tot de garage en toegang tot de slaapkamers, badkamers en woonkamer.  <br/>De royale en lichte woonkamer (ca. 51m²) is net als de rest van de woning voorzien van een natuurstenen vloer met vloerverwarming. Daarnaast beschikt de woonkamer over airconditioning, driedubbel glas, schuifpuien naar de tuin en een elektrische designhaard. <br/>De moderne open keuken is uitgerust met hoogwaardige apparatuur en bestaat uit een kookeiland, inductiekookplaat met downdraft plasma afzuigsysteem, combi/stoomoven, koel-vriescombinatie, vaatwasser en Quooker-kraan. <br/>Vanuit de keuken heeft u toegang tot een ruime bijkeuken met veel bergruimte, gootsteen, witgoedaansluitingen, aparte mechanische afzuiging en deur naar het terras. <br/>De eerste slaapkamer is ca. 13m² groot en beschikt over een kastenwand (ter overname).  <br/>De tweede slaapkamer (nu in gebruik als kantoor) is ca. 9m² groot. <br/>De master-bedroom (ca. 13m²) beschikt over een ruime walk-in closet en en-suite badkamer met toilet, bidet, dubbele wastafel en luxe douche-/stoomcabine en airconditioning. Een schuifpui biedt toegang tot de tuin. <br/>De tweede badkamer op de gang is voorzien van een douche met sunshower, dubbel wastafelmeubel en toilet.  <br/>De garage is ca. 19m² groot en beschikt over een elektrisch bedienbare deur, vloerverwarming, twee loopdeuren en volledige isolatie. <br/> <br/>Tuin: <br/>Rondom de woning is een verzorgde tuin gelegen met gazon, looppaden en zowel aan de voor- als de zijkant een terras. Daarnaast beschikt de gehele tuin over drainage. Aan het water ligt een eigen houten aanlegsteiger en vlonder met fraai uitzicht over het Oldambtmeer. <br/> <br/>Bijzonderheden: <br/>* Moderne en luxe gelijvloerse woning aan de oevers van het Oldambtmeer; <br/>* Volledig voorzien van vloerverwarming; <br/>* Zonnepanelen en volledig geïsoleerd; <br/>* 3 slaapkamers, 2 badkamers; <br/>* Garage en carport; <br/>* Waterontharder; <br/>* Definitief energielabel A+++!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/274/205_1440x960.jpg", "kind_of_house": "Bungalow, vrijstaande woning", "construction_year": "N/A", "energy_label": "A+++ ", "type_of_roof": "Plat dak bedekt met bitumineuze dakbedekking", "heating": "Elektrische verwarming en gehele vloerverwarming", "hot_water": "Cv-ketel", "boiler": "N/A", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Aangebouwde stenen garage en carport", "zipcode": "9685 HC", "street": "Anholt 49", "house_number": "49", "city": "blauwestad", "province": "groningen", "lat": 53.18034, "lng": 7.066157, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "verspreidehuizenfinsterwolde", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}