{"url": "https://www.funda.nl/koop/venray/huis-87778068-herderstasje-5/", "offer_type": "koop", "number_of_rooms": 8, "number_of_bathrooms": "N/A", "number_of_bedrooms": "N/A", "bathroom_facilities": "N/A", "number_of_floors": "N/A", "outdoor_space": "N/A", "facilities": "N/A", "volume_in_cubic_meters": 445, "living_area": "N/A", "plot_size": "N/A", "external_storage_space": "N/A", "asking_price": 239000, "asking_price_per_square_meter": 2276, "rental_price": "N/A", "deposit": "CWat betekent dit?", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nIdeale starterswoning met  4  slaapkamers en  inpandige garage  gelegen in woonwijk â\u0080\u0099â\u0080\u0099Landweertâ\u0080\u0099â\u0080\u0099  te  Venray. Deze 2-onder-1 kapwoning is  volledig  geïsoleerd en onder andere voorzien van een doorzonwoonkamer met deels  open keuken, inpandige garage en royale serre. De woning ligt op loopafstand van het centrum van Venray met vele voorzieningen, de uitvlasweg A73 is op enkele autominuten te bereiken. <br/> <br/>Indeling: <br/> <br/>Begane grond: <br/>Zowel de overdekte entree als de serre en garage zijn vanuit de royale oprit te betreden. De ontvangsthal met garderobe geeft toegang tot de meterkast, woonkamer, toiletruimte en trapopgang naar de 1e verdieping. De geheel betegeld toiletruimte is voorzien van een zwevend closet, fonteintje en mechanische afzuiging. Een deur met glasinzet geeft toegang tot de woonkamer. De woonkamer is in een U-vorm ingericht en voorzien van strak stucwerk(2017) en een fraai op maat gemaakte tv-meubel. Vanuit de woonkamer is de deels open keuken te betreden. De keuken is in een L-vorm opgesteld en ingericht met een 4-pits inductiekookplaat, afzuigkap, spoelbak, vaatwasser, koelkast, combi-oven magnetron, eikenhouten kastjes, glazen spatwand, granieten werkblad en een loopdeur naar de serre. De woonkamer, keuken en ontvangsthal zijn voorzien van een parketvloer. <br/>De serre is ca. 15m2, voorzien van een tegelvloer, loopdeur naar de inpandige garage en een schuifpui welke toegang biedt tot de tuin. De inpandige garage is ca. 17,5m2 en voorzien van de witgoedaansluitingen, een spoelbak, elektra aansluitingen en een kantelpoort.  <br/> <br/>1e verdieping: <br/>De overloop geeft toegang tot 3 slaapkamers, de badkamer en vaste trapopgang. De overloop is voorzien van vloerbedekking. De slaapkamers zijn ca. 6,5m2, ca. 7m2 en ca. 14,5m2. De slaapkamers zijn voorzien van een pvc-vloer. De geheel betegelde badkamer is ingericht met een douchecabine, zwevend closet, wastafel, badkamermeubel, designradiator, mechanische afzuiging en raam. <br/> <br/>2e verdieping: <br/>De vaste trapopgang leidt meteen de 4e slaapkamer in. De slaapkamer is ca. 15m2 en voorzien van vloerbedekking, royaal dakraam en hoog plafond. Vanuit de 4e slaapkamer is tevens de CV-opstelling te bereiken. <br/> <br/>Tuin: <br/>De voortuin is voorzien van een royale beklinkerde oprit welke plek biedt aan 2 tot 3 autoâ\u0080\u0099s. Tevens is de oprit ook voorzien van een carport met lichtkoepel. <br/>De achtertuin is deels beklinkerd en deels voorzien van een groenstrook. De privacy rijke achtertuin ontvangt op elk moment van de dag zonlicht en schaduw. <br/> <br/>Algemeen: <br/>Bouwjaar 1987, woonoppervlakte ca. 105m2, inhoud ca. 445m3, perceeloppervlakte 182m2. De CV-opstelling is van het merk Intergas en het bouwjaar 2015. De woning is volledig geïsoleerd en voorzien van grotendeels dubbele beglazing. De woning is voorzien van een doorzonwoonkamer, serre, inpandige garage en 4 slaapkamers. De woning ligt op loopafstand van het centrum van Venray met vele voorzieningen, de uitvlasweg A73 is op enkele autominuten te bereiken. <br/> <br/>Vraagprijs â\u0082¬ 239.000,- k.k.\r\n    </div>", "image": "N/A", "kind_of_house": "Eengezinswoning, 2-onder-1-kapwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "N/A", "heating": "N/A", "hot_water": "N/A", "boiler": "N/A", "location": "N/A", "garden": "N/A", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "N/A", "garage": "N/A", "zipcode": "5803 DG", "street": "Herderstasje 5", "house_number": "5", "city": "venray", "province": "limburg", "lat": 51.53478, "lng": 5.985853, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "landweert1", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}