{"url": "https://www.funda.nl/koop/winterswijk/huis-42699927-wilhelminastraat-27/", "offer_type": "koop", "number_of_rooms": 11, "number_of_bathrooms": 2, "number_of_bedrooms": 7, "bathroom_facilities": "Ligbad, 2 douches en 2 toiletten", "number_of_floors": 3, "outdoor_space": 16, "facilities": "Alarminstallatie, dakraam, glasvezelkabel, natuurlijke ventilatie en rookkanaal", "volume_in_cubic_meters": 1167, "living_area": 307, "plot_size": 915, "external_storage_space": 39, "asking_price": 945000, "asking_price_per_square_meter": 3078, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nBent u op  zoek  naar een  sfeervolle en  statige villa met een  royale  tuin in een karakteristieke en  gewilde  straat nabij het centrum van Winterswijk?  Dan moet u zeker eens  een kijkje komen nemen bij deze monumentale villa met onder meer twee woonkamers, een luxe keuken, een fijne serre, twee fraaie badkamers en maar liefst zeven slaapkamers. Met veel authentieke elementen, gewelfde plafonds met sierornamenten en meerdere haardpartijen ademt deze villa een karakteristieke sfeer. Wacht dus niet langer en maak snel een afspraak voor een bezichtiging. <br/> <br/>Locatie <br/>De villa is gesitueerd in één van de mooiste straten van Winterswijk nabij het centrum met zijn gezellige marktplein waar onder meer diverse horecagelegenheden, terrassen en winkels te vinden zijn. Ook het Vrijheidspark, een basisschool, een school voor middelbaar onderwijs en de schouwburg zijn in de nabijheid gelegen. Met de auto bent u ook zo op weg, want de uitvalswegen zijn eveneens vlot bereikbaar. <br/> <br/>Begane grond: u betreedt de villa via de entree waarna de rechterzijde toegang verleent tot de fijne werkkamer met een haardpartij en aan de linkerzijde de eerste woonkamer. Deze ruimte is licht en karakteristiek met een mooie schouw en een sfeervolle erker. Kijkt u ook even omhoog naar het prachtige gewelfde plafond met sierornamenten? Middels de statige schuifdeuren stappen we de tweede woonkamer binnen die eveneens ruim van opzet is en beschikt over een hoog, gewelfd plafond, een gezellige open haard en schuifdeuren met glas naar de achtergelegen serre met glas-in-lood elementen. Via de hal met de trapopgang en de toiletruimte met een hangend toilet stapt u de lichte eetkamer binnen die beschikt over openslaande deuren naar de tuin en toegang verleent tot de grote bijkeuken met onder meer de aansluiting voor de wasmachine. De aangrenzende, open keuken is uitgerust met diverse inbouwapparatuur waaronder een groot gasfornuis met een oven, een moderne afzuigkap en een vaatwasser. U heeft ook nog de beschikking over een praktische (wijn-)kelder. <br/> <br/>Eerste verdieping: aan de overloop bevinden zich vier comfortabele slaapkamers en een luxe badkamer met een hangend toilet, een instapdouche en een fraai wastafelmeubel . De kleinere slaapkamer aan de voorzijde van de woning beschikt over een klein balkon en vanuit de grotere slaapkamer aan de achterkant verkrijgt u toegang tot een ruimer balkon. In deze slaapkamer beschikt u bovendien over een eigen badkamer met een hangend toilet, twee wastafels, een instapdouche en een fijn ligbad. <br/> <br/>Tweede verdieping: middels een vaste trap te bereiken zolderverdieping met een grote overloop en nog eens drie comfortabele slaapkamers. <br/> <br/>Buiten: de geheel rondom gelegen tuin is verzorgd aangelegd met aan de voorkant van de villa een oprit en een gazon, heggetjes en diverse vaste beplanting. Aan de achterzijde van de villa vinden we de stijlvolle achtertuin die omsloten wordt door een heg en is ingericht met diverse gazons, terrassen en vaste planten en bomen. Achterin deze veel privacy biedende tuin is de fijne garage met een berging gesitueerd met daarbij het multifunctionele tuinhuis. Met deze faciliteiten en alle rust en ruimte is het ook op deze plek zeker goed toeven. <br/> <br/>Bijzonderheden van de woning <br/>-\tBouwjaar: 1890  <br/>-\tGebruiksoppervlakte: 308 m² <br/>-\tPerceeloppervlakte: 915 m² <br/>-\tInhoud: 1.167 m³ <br/>-\tCentrale locatie <br/>-\tGemeentelijk monument <br/>-\tTwee ruime woonkamers <br/>-\tWerkkamer <br/>-\tLuxe keuken <br/>-\tSerre <br/>-\tTwee fraaie badkamers <br/>-\tZeven slaapkamers <br/>-\tPrivacy biedende tuin <br/>-\tGarage met berging\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/334/734_1440x960.jpg", "kind_of_house": "Villa, vrijstaande woning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "Zadeldak bedekt met bitumineuze dakbedekking en pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Remeha (gas gestookt combiketel uit 2017, eigendom)", "location": "N/A", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": 429, "garden_location": "Gelegen op het zuiden bereikbaar via achterom", "balcony": "Balkon aanwezig", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Parkeerplaats en vrijstaande stenen garage", "zipcode": "7101 CN", "street": "Wilhelminastraat 27", "house_number": "27", "city": "winterswijk", "province": "gelderland", "lat": 51.97401, "lng": 6.716793, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "centraledeel", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}