{"url": "https://www.funda.nl/koop/volendam/huis-42602559-nieuwedieplaan-16/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Ligbad en douche", "number_of_floors": 3, "outdoor_space": 4, "facilities": "N/A", "volume_in_cubic_meters": 580, "living_area": 158, "plot_size": 177, "external_storage_space": "N/A", "asking_price": 600000, "asking_price_per_square_meter": 3797, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nDeze op-en-top luxe  twee-onder-één-kapwoning  kenmerkt zich  door het  hoge wooncomfort, de grote  leefruimte  door de uitbouw, en de  rustige  ligging aan de rand van de  wijk. Door de breedte van  wel 8,50 meter heeft de woning een statige uitstraling. De woning is slechts een paar jaar oud, en is tot in de puntjes luxe uitgevoerd.  <br/> <br/>Omgeving: <br/>Vernoemd naar het kanaal door Den Helder: De Nieuwedieplaan, Gelegen in Breewijd. De wijk is recent gebouwd aan de noordkant van Volendam, en kenmerkt zich door een ruime opzet, riante woningen in jaren-30 stijl en de voorzieningen in de buurt. Zo is er een supermarkt en zijn er twee basisscholen in de wijk. Aan de overkant van de woning loop je zo het Broeckgouwpark in. Binnen enkele fietsminuten is de haven bereikbaar.  <br/> <br/>Hal: <br/>De entree is aan de voorzijde, de hal biedt ruimte aan de meterkast, de trapopgang en het toilet. Onder de trap is een praktische apothekerslade geplaatst. De trapopgang is uitgevoerd met luxe inbouwspots. De toiletruimte is modern afgewerkt met strak tegel- en stucwerk. Het is mogelijk om hier nog een fonteintje te plaatsen.  <br/> <br/>Woonkamer: <br/>Over de gehele achterzijde van de woning bevindt zich de woonkamer. De woonkamer heeft een heerlijk warme uitstraling. De wanden en het plafond zijn strak gestuukt en afgewerkt met een sierlijst. Er zijn grote plavuizen gelegd v.v. vloerverwarming. Er is een sierlijke elektrische haard met tv-meubel, alsmede twee schuifpuien naar de tuin. Naast een ruime zithoek is er ook ruimte voor een grote eettafel. Door de open uitvoering is het hier heerlijk dineren met familie of vrienden. Aan de achterzijde is nog een praktische bijkeuken, met ruimte voor de wasopstelling en bijvoorbeeld een extra koelkast.  <br/> <br/>Keuken: <br/>De open keuken is aan de voorzijde gesitueerd. Deze is uitgevoerd met een hoge kastenwand en een kookeiland. Door de grote raampartij aan de voorzijde, en de glazen tussendeur is de keuken heerlijk licht. Het kookeiland heeft een strak composiet werkblad, en is uitgevoerd met een uitgebreid scala aan inbouwapparatuur. Zo heeft de keuken een inductiekookplaat, oven, separate stoomoven, Quooker-kraan, vaatwasser, koelkast en vriezer.  <br/> <br/>Tuin: <br/>De tuin is onderhoudsarm aangelegd. De tuin is zowel vanuit huis, als buitenom bereikbaar. <br/> <br/>1e verdieping: <br/>Op de verdieping bevinden zich momenteel twee slaapkamers en de badkamer. Er is tevens een separate toiletruimte. De grote slaapkamer is extra luxe uitgevoerd met een vaste kaptafel, tv-wand en een grote inloopkast. Het is eventueel mogelijk om de tv-wand te verwijderen en een extra grote slaapkamer te realiseren. De tweede slaapkamer is eventueel goed te gebruiken als kantoor- of hobbyruimte.  <br/> <br/>Badkamer: <br/>De badkamer heeft een strakke afwerking. In de badkamer is er een inloopdouche met regenfunctie en handdouche, ligbad en een dubbele wastafel met grote spiegelkast. Het plafond is strak afgewerkt met inbouwspots. De badkamer is v.v. vloerverwarming.  <br/> <br/>2e verdieping: <br/>Op de tweede verdieping bevindt zich een bergkast met de CV-ketel. Daarnaast is hier een grote slaapkamer. Momenteel is dit ingericht als sportkamer, maar ook hier zijn meerdere doeleinden mogelijk. Zowel achter de knieschotten als op de vliering is nog extra opbergmogelijkheid.  <br/> <br/>Pluspunten: <br/>-\tInstapklare, luxe gezinswoning; <br/>-\tPrachtige, moderne uitstraling; <br/>-\tRuime woonkeuken met kookeiland; <br/>-\tRustige, kindvriendelijke wijk; <br/>-\tMarkermeer en wandelpark op loopafstand.  <br/> <br/>Interesse in dit huis? Schakel direct uw eigen NVM- aankoopmakelaar in. Uw NVM-aankoopmakelaar komt op voor uw belang en bespaart u tijd, geld en zorgen. Adressen van collega NVM-aankoopmakelaars vindt u op Funda.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/787/715_1440x960.jpg", "kind_of_house": "Eengezinswoning, 2-onder-1-kapwoning", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Intergas HR (gas gestookt combiketel uit 2016, eigendom)", "location": "Buttondown Farm, Zionsville, Boone County, Indiana, United States", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": 38, "garden_location": "Gelegen op het oosten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1132 LG", "street": "Nieuwedieplaan 16", "house_number": "16", "city": "volendam", "province": "noordholland", "lat": 52.51376, "lng": 5.070682, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "broeckgouw", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}