{"url": "https://www.funda.nl/koop/de-rijp/huis-42698004-julianalaan-43/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Douche en toilet", "number_of_floors": 2, "outdoor_space": "N/A", "facilities": "Rookkanaal en TV kabel", "volume_in_cubic_meters": 395, "living_area": 113, "plot_size": 214, "external_storage_space": 17, "asking_price": 385000, "asking_price_per_square_meter": 3407, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nNaast twee-onder-één kap  bestaat  er ook  drie-onder-één kap!  <br/>Wij bieden u er  één  aan! En nog wel met  een  garage. <br/>Een echt vintage huis, nog  de  oorspronkelijke  maatvoeringen en  grotendeels ook nog dezelfde binnen uitvoering.  <br/>Uw kans op een huis met mogelijkheden: uitbouwen, dakkapel(len), carport en/of  interne aanpassingen.  <br/>Veel concessies hoeft u niet te doen want de woning is klus waardig.  <br/>Maar liefst 214 m2 eigen grond, waarop ook nog een flinke garage en ruimte voor zeker twee auto's op eigen erf. Dan blijft er zelfs nog een beschutte achtertuin over. \"Mogelijkheden\" is hier \"the keyword\" ! <br/> <br/>Loopt u maar eens mee door de woning. <br/>Beneden een lange gang met toilet, meterkast en trapopgang naar de verdiepingen. Via de gang komt u de woonkamer met halfopen keuken binnen. Vanuit de keuken houdt u lekker zicht op alles wat in de Julianalaan voorbij komt en vanuit de kamer kijkt u uw beschutte achtertuin in.  <br/>Op de verdieping is vanuit de overloop de enorme slaapkamer bereikbaar (van voor naar achter, van twee naar één). Verder treft u hier nog een wat kleinere kamer aan en de bad ruimte.  <br/>Een vaste trap brengt u naar de zolder met voorzolder (bergruimte en stookopstelling) en nog een slaapkamer v.v. een dakkapel.  <br/> <br/>De indeling van de woning kunt u uitgebreid bekijken op de zorgvuldig samengestelde 2D én 3D plattegronden. <br/>Door middel van de 360 graden foto's kunt u op uw gemak rondkijken in de woning. <br/> <br/>Overigens is het ook nog eens dé ideale locatie voor een gezin, waarom? Dat heeft alles te maken met het sociale karakter van het dorp De Rijp en de directe omgeving;  <br/>om de hoek van de woning treft u namelijk twee basisscholen, kinderopvang, sportfaciliteiten (voetbalvelden, tennispark en sporthal), een natuurspeeltuin, pumptrack, bibliotheek, huisartsenpraktijk met apotheek en een winkelcentrum met bakkerij, slagerij, drogisterij, supermarkt, kledingzaak, kapsalon en bloemist. <br/> <br/>In het centrum van het dorp zijn meerdere goed aangeschreven horecagelegenheden en er is een lunchroom, koffiebar, broodjeszaak en pizzeria.  <br/> <br/>Het historisch rijke centrum van De Rijp is eveneens op loopafstand gelegen van de woning. Gezelliger en sfeervoller wonen bestaat haast niet. De dorpskern wordt ook wel een gratis openlucht museum genoemd, gezien de 118 rijksmonumenten en 133 gemeentelijke monumenten grotendeels gelegen in een beschermd stads/dorpsgezicht. <br/> <br/>De Rijp ligt centraal tussen de polders Beemster en Schermer en grenst aan natuurgebied De Eilandspolder (natura 2000), waar u heerlijk kunt varen. Op korte afstand van Alkmaar en Purmerend. Amsterdam ligt op slechts iets meer dan 25 km afstand. En is er een prima busverbinding met genoemde steden. Bovendien bent u binnen een half uur op het strand.  <br/> <br/>Wetenswaardigheden;  <br/>- 113 m2 woonoppervlak  <br/>- 214 m2 perceeloppervlak  <br/>- bouwjaar 1968  <br/>- Verwarming middels CV (merk Remeha avanta bouwjaar 2010 ) en open haard.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/305/126_1440x960.jpg", "kind_of_house": "Eengezinswoning, hoekwoning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Remeha Avanta (gas gestookt combiketel uit 2010, eigendom)", "location": "Buttondown Farm, Zionsville, Boone County, Indiana, United States", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": 85, "garden_location": "Gelegen op het zuidoosten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Vrijstaande stenen garage", "zipcode": "1483 VG", "street": "Julianalaan 43", "house_number": "43", "city": "derijp", "province": "noordholland", "lat": 52.5548, "lng": 4.846008, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "derijp", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}