{"url": "https://www.funda.nl/nieuwbouw/venray/project-41956411-annapark/", "offer_type": "nieuwbouw", "number_of_rooms": "N/A", "number_of_bathrooms": "N/A", "number_of_bedrooms": "N/A", "bathroom_facilities": "N/A", "number_of_floors": "N/A", "outdoor_space": "N/A", "facilities": "N/A", "volume_in_cubic_meters": "N/A", "living_area": "N/A", "plot_size": "N/A", "external_storage_space": "N/A", "asking_price": "N/A", "asking_price_per_square_meter": "N/A", "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nUNIEK WONEN IN  HET  ANNAPARK, INSCHRIJVEN  MOGELIJK VANAF  01 NOVEMBER <br/>Binnenkort meer  informatie  via de te lanceren website!  <br/> <br/>In de komende jaren wordt het  Annapark  getransformeerd tot een prachtige  woon- en werkplek, waarbij het groen en het historische karakter behouden blijven. Door restauratie van de monumenten, de karakteristieke paviljoenen en het in ere herstellen van het monumentale park, ontstaat een bijzonder aantrekkelijke vestigingsplek voor een groot scala aan functies, hetgeen nu al zichtbaar is.  <br/> <br/>Start Verkoop Appartementen PIETER nabij <br/> <br/>Wij hebben in de zomer niet stilgezeten. Er is hard gewerkt aan de verkoopstukken van paviljoen PIETER en ik kan u vertellen dat de verkoop binnenkort van start gaat. Binnen het bijzondere paviljoen PIETER komen 8 ruime appartementen beschikbaar met een woonoppervlak variërend in grootte van ca. 108 tot 153 m2. Appartementen die beschikken over een royale woonkamer en keuken en 2 slaapkamers. Daarnaast hebben alle appartementen een hoog afwerkingsniveau, een buitenruimte en een parkeerplaats voor de auto. Bent u geïnteresseerd om hier straks te komen wonen en staat u nog niet ingeschreven als geïnteresseerde? Geef dan uw gegevens door via de website van Annapark. <br/> <br/>Huurappartementen JOZEF <br/> <br/>Wilt u niet kopen, maar wel komen wonen op het Annapark? Dan zijn de huurappartementen gelegen in paviljoen JOZEF wellicht iets voor u. De verwachting is dat deze appartementen tegelijk met de verkoop van PIETER, in verhuur gaan. Binnenkort dus! Het karakteristieke paviljoen JOZEF biedt plaats aan 8 ruime huurappartementen verdeeld over een woonkamer, keuken en 2 slaapkamers. Zogenaamde 3-kamerappartementen met een woonoppervlak variërend in grootte van ca. 98 tot 110 m2. Houd de nieuwsbrief of website in de gaten, zodat u op de hoogte blijft. <br/> <br/>Houd de nieuwsbrief of website in de gaten, zodat u op de hoogte blijft van het moment dat u zich kunt inschrijven!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/142/353/194_1440x960.jpg", "kind_of_house": "N/A", "construction_year": "N/A", "energy_label": "N/A", "type_of_roof": "N/A", "heating": "N/A", "hot_water": "N/A", "boiler": "N/A", "location": "N/A", "garden": "N/A", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "N/A", "garage": "N/A", "zipcode": "N/A", "street": "N/A", "house_number": "N/A", "city": "venray", "province": "limburg", "lat": 51.53485, "lng": 5.976493, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "N/A", "business_space": "false", "neighborhood": "smakterheide", "in_the_neighborhood": "N/A"}