{"url": "https://www.funda.nl/koop/volendam/huis-42699146-apolloplantsoen-18/", "offer_type": "koop", "number_of_rooms": 7, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Douche en toilet", "number_of_floors": 3, "outdoor_space": 12, "facilities": "Buitenzonwering, natuurlijke ventilatie, rookkanaal en TV kabel", "volume_in_cubic_meters": 439, "living_area": 128, "plot_size": 146, "external_storage_space": 11, "asking_price": 325000, "asking_price_per_square_meter": 2539, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nSpeciaal voor de  liefhebbers  van de  â\u0080\u0098Planetenbuurtâ\u0080\u0099 kunnen  we deze heerlijke eengezinswoning  te  koop aanbieden! <br/> <br/>Gelegen aan  een  uiterst kindvriendelijk hofje met een speelveldje voorzien van diverse speeltoestellen  voor de deur. Een autoluw hofje waar kinderen heerlijk voor de deur kunnen spelen zonder voorbij razend verkeer. Een prachtige plek voor opgroeiende kinderen! <br/> <br/>Een heerlijke woning met aanbouw en een mooie open ligging. Met vier slaapkamers geschikt voor gezinnen en de mogelijkheid om de woning naar wens aan te passen. Door de hoge nok zijn er tal van mogelijkheden op de zolder met één of zelfs twee slaapkamers. Een goed onderhouden woning met een waar je jezelf direct thuis zult voelen! <br/> <br/>Heel gunstig gelegen op korte afstand van diverse voorzieningen zoals bijvoorbeeld de winkelstraat â\u0080\u0098Plutostraatâ\u0080\u0099 met een bakker, slager en snackbar. Diverse andere voorzieningen zijn dichtbij gelegen zoals scholen, opstapplaats openbaar vervoer (bus) en het gezellige centrum met de haven en de dijk! <br/> <br/>INDELING <br/>Begane grond: Entree met trapkast en gesloten trapopgang naar 1e verdieping, meterkast (5 groepen), half betegelde toilet met fonteintje, doorzon woonkamer voorzien van houtkachel, gesloten keuken in rechte opstelling voorzien van diverse inbouwapparatuur, aangebouwde bijkeuken voorzien van wasmachine aansluiting, daklicht en deur naar het achtererf. Op het achtererf een vrijstaande uitgebouwde berging voorzien van uitstortgootsteen en Elektra en een overkapping tussen de aanbouw en de berging. <br/> <br/>1e verdieping: Overloop met vaste trap naar 2e verdieping, betegelde badkamer voorzien van wastafel, wandcloset en douche, voorslaapkamer voorzien van kastenwand, achterslaapkamer voorzien van kastenwand en een achterslaapkamer. <br/> <br/>2e verdieping: Overloop met CV ketel (Bosch uit 2010), voorzolder voorzien van inbouwkasten en toegang tot de vliering en een slaapkamer voorzien van dakkapel. <br/> <br/>Zoek je ruimte, mogelijkheden en de gezelligheid van een kindvriendelijk hofje? Maak dan snel een afspraak voor een bezichtiging en we nemen je graag mee voor een rondleiding door deze heerlijke woning!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/343/454_1440x960.jpg", "kind_of_house": "Eengezinswoning, tussenwoning", "construction_year": "N/A", "energy_label": "C ", "type_of_roof": "Zadeldak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Bosch (gas gestookt combiketel uit 2010, eigendom)", "location": "N/A", "garden": "Achtertuin en voortuin", "back_garden": 25, "garden_location": "Gelegen op het noordwesten bereikbaar via achterom", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "1131 WN", "street": "Apolloplantsoen 18", "house_number": "18", "city": "volendam", "province": "noordholland", "lat": 52.49992, "lng": 5.06225, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "volendamkathamplanetenbuurt", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}