{"url": "https://www.funda.nl/koop/heerde/huis-42690771-berkenlaan-4/", "offer_type": "koop", "number_of_rooms": 6, "number_of_bathrooms": 2, "number_of_bedrooms": 4, "bathroom_facilities": "2 ligbaden, douche en 2 toiletten", "number_of_floors": 2, "outdoor_space": 27, "facilities": "Alarminstallatie en buitenzonwering", "volume_in_cubic_meters": 1500, "living_area": 328, "plot_size": 6790, "external_storage_space": 65, "asking_price": 1495000, "asking_price_per_square_meter": 4558, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nâ\u0080\u009cStijlvol wonen in  Heerde,  een perfecte  ligging voor  rust, natuur en voorzieningenâ\u0080\u009d  <br/> <br/>De villa is onder architectuur  gebouwd  en gelegen op een prachtig perceel  van  6.790 m² in het  Bakhuis Bos, één van de mooiste locaties van Heerde. Het perceel kenmerkt zich door een fraai terrein gelegen in een prachtige bosrijke omgeving. Een woonomgeving waar groen, rust, ruimte en privacy centraal staan. Anderzijds op korte afstand gelegen van alle denkbare voorzieningen op het gebied van winkelen, scholen, sport, recreatie en openbaar vervoer. <br/> <br/>Via de oprijlaan, met toegangshek, komt u bij de woning. De entree van de woning is aan de voorzijde gelegen. Bij binnenkomst in de riante hal ziet u een prachtige trapopgang die leidt naar de vide op de eerste verdieping. Tezamen met het hoge plafond een indrukwekkend geheel. De hal biedt toegang tot vrijwel alle vertrekken op de begane grond. Denk hierbij aan de slaapkamer, logeerkamer, kantoor en de zit-eetkamer.  <br/> <br/>De ruime woonkamer is aan de rechterzijde van de woning gelegen en heeft vanuit hier prachtig uitzicht over het perceel. De vele ramen geven bijzonder veel licht en verbinding met de omliggende tuin. De woonkamer heeft een open verbinding met de eetkamer. Hier is ruimte voor een grote eettafel voor het hele gezin. De naastgelegen keuken afgewerkt met een houten aanrechtblad en witte kastfronten met goudkleurige handgrepen, en voorzien van een keramisch kookplaat, vaatwasser, oven, combi-oven, dubbele spoelbak, koelkast en een vriezer.  <br/>Via de hal betreden we de andere zijde van de woning met bijkeuken, kelder, logeerkamer en masterbedroom. Laatstgenoemde is gelegen aan de voorzijde van de woning, de ruime badkamer is uitgerust met een bubbelbad, wastafelmeubel, inloopdouche en een toilet.  <br/> <br/>De eerste verdieping omvat een ruime overloop met vide waar zich een tweetal ruim bemeten slaapkamers bevinden. De achterste slaapkamer heeft prachtig uitzicht over de achtertuin en heeft toegang tot de naastgelegen badkamer. De badkamer is voorzien van een ligbad met douche, wastafelmeubel en een toilet. De badkamer is tevens toegankelijk vanaf de overloop. Ook bevindt zich op deze verdieping de technische ruimte met cv-ketel en boiler. Deze zeer royale ruimte dient ook perfect als opbergruimte.  <br/> <br/>De vrijstaande stenen garage is naast de woning gelegen. In de garage is ruim plaats voor twee autoâ\u0080\u0099s en is er toegang tot de orangerie. Een prachtige lichte plaats voor een liefhebber van planten en tuinieren.   <br/> <br/>De buitenruimte van deze woning is fenomenaal. Afwisselend aangelegd met terrassen, beplanting en met recht â\u0080\u0098bebossingâ\u0080\u0099. De natuur in uw eigen achtertuin waar u gerust een wandeling kunt maken. Het ruime perceel biedt veel mogelijkheden en privacy, de aangelegde paden laten u telkens een nieuwe plek op het perceel zien. Zowel in de zomer als in de winter is het hier genieten van het buitenleven. De grootte van dit perceel heeft u mogelijk nog meer te bieden. Het bestemmingsplan geeft namelijk de mogelijkheid tot het bouwen van een extra woning! Voor bijvoorbeeld een familielid, mantelzorg of een gastenverblijf. Aan mogelijkheden geen gebrek!\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/363/701_1440x960.jpg", "kind_of_house": "Villa, vrijstaande woning", "construction_year": "N/A", "energy_label": "B ", "type_of_roof": "Samengesteld dak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Toplint HR30 (gas gestookt combiketel uit 2000, eigendom)", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein en openbaar parkeren", "garage": "Vrijstaande stenen garage", "zipcode": "8181 NP", "street": "Berkenlaan 4", "house_number": "4", "city": "heerde", "province": "gelderland", "lat": 52.39058, "lng": 6.006678, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "verspreidehuizenheerdenoordenhoorn", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}