{"url": "https://www.funda.nl/koop/oud-beijerland/huis-42694229-julianastraat-80/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": 1, "number_of_bedrooms": 4, "bathroom_facilities": "Ligbad en douche", "number_of_floors": 2, "outdoor_space": "N/A", "facilities": "Buitenzonwering, dakraam, rookkanaal en TV kabel", "volume_in_cubic_meters": 376, "living_area": 94, "plot_size": 156, "external_storage_space": "N/A", "asking_price": 419000, "asking_price_per_square_meter": 4457, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nEen parel in  het  centrum van  Oud-Beijerland! Vrijstaand  wonen in een unieke  karakteristieke  woning? Welkom thuis bij de  Julianastraat  80! De woning is door de jaren heen goed onderhouden  en aan de achterzijde uitgebouwd. De keuken is aan de achterzijde gelegen en hierdoor is een fijne ruimte ontstaan om ook hier een eetgedeelte te creëren. De eerste verdieping is voorzien van vier slaapkamers, waskamer en een ruime, nette badkamer. Voor extra opbergruimte is de vliering een ideale plek! De tuin is van prima formaat en gelegen op het zuiden waardoor de tuin heerlijk zonnig is! U loopt vanaf de woning binnen 5 minuten het bruisende centrum van Oud-Beijerland in waar diverse winkels, horeca en de gezellige haven zich bevindt. Kortom; altijd al gedroomd van een sfeervolle, unieke woning in het centrum van Oud-Beijerland mét zonnige tuin?! Dan denken wij dat u uw droomwoning gevonden heeft! <br/> <br/>Indeling <br/>De woning beschikt over een ruime voortuin. Beide buren hebben een oprit in de voortuin gecreëerd. Vraag de makelaar naar de mogelijkheden voor een eigen oprit! U kunt langs de zijkant van de woning lopen om direct naar de tuin te gaan. De voorgevel geeft al direct veel sfeer aan de woning. Middels een ontvangsthal betreedt u direct de woonkamer. De woonkamer is voorzien van een prachtige houten vloer (frans eiken), houtkachel en balkenplafond. De afwerking is modern en met zorg gedaan. Verder is de woning volledig voorzien van dubbel glas, behoudens de voordeur en het toilet.  <br/> <br/>In de woonkamer is een ruimte gecreëerd met plek voor jassen en schoenen en het toilet. De keuken is gelegen aan de achterzijde en is modern en ruim. De keuken beschikt over een hoekopstelling en is van alle gemakken voorzien zoals vaatwasser, combimagnetron, koelkast met vriezer, afzuiging en inductiekookplaat. Vanuit de keuken heeft u fijn uitzicht op de privé en zonnig gelegen tuin.  <br/> <br/>Eerste verdieping <br/>Vanuit de keuken bereikt u de eerste verdieping. De eerste verdieping is voorzien van vier slaapkamers. Ook is er een praktische extra kamer op deze verdieping voorzien van toilet, wasmachine aansluiting en cv-installatie (Atag 2012). De badkamer (2016) is ruim, netjes en voorzien van een ligbad, douche en een dubbele wastafel. Vanuit de badkamer bereikt u ook het balkon. Tevens voorzien van kunststof kozijn.  <br/> <br/>Vliering <br/>De vliering is ideaal voor het opbergen van spullen. Deze is te bereiken middels een vlizotrap.  <br/> <br/>De tuin <br/>De tuin is netjes aangelegd. Verder biedt de tuin veel privacy omdat deze besloten ligt. Tevens kunt u hier heerlijk genieten van de zon omdat de ligging zeer gunstig ligt; op het zuiden.  <br/> <br/>Bijzonderheden/extra's; <br/>- schilderwerk binnen in 2019 gedaan; <br/>- voorlopig energielabel D; <br/>- schilderwerk buiten in 2018 gedaan; <br/>- akte wordt voorzien van een 'niet zelf bewoningsclausule'; <br/>- voorzien van geïsoleerde wanden; <br/>- nieuwe voegen + gevel geïmpregneerd. <br/> <br/>ENTHOUSIAST GEWORDEN? Dat kunnen wij ons voorstellen. Maak dan snel een afspraak voor een oriënterende bezichtiging van deze woning. Uw eigen woning nog niet verkocht? Wij komen graag bij u langs! Bel voor een vrijblijvend verkoopgesprek. DE MOOISTE HUIZEN KOOP JE BIJ OOMS VELDHOEN &amp; ROMEIJN MAKELAARS. DIT HUIS BEWIJST HET.  <br/> <br/>HOEKSCHE WAARD <br/>De Hoeksche Waard is een eiland ten zuiden van Rotterdam met een oppervlakte van 27.420 hectare en telt zoâ\u0080\u0099n 80.000 inwoners verspreid over 5 gemeenten. Door de status van â\u0080\u009cNationaal Landschapâ\u0080\u009d is haar open en landelijk karakter op de lange termijn verzekerd en door de versterking van natuurwaarden zal het er altijd goed wonen blijven. <br/> <br/>Deze informatie is door ons met de nodige zorgvuldigheid samengesteld. Onzerzijds wordt echter geen enkele aansprakelijkheid aanvaard voor enige onvolledigheid, onjuistheid of anderszins dan wel de gevolgen daarvan. Alle opgegeven maten en oppervlakten zijn indicatief. Van toepassing zijn de NVM voorwaarden. <br/> <br/>Ooms Veldhoen &amp; Romeijn behartigt de belangen van de verkopende partij. Neem uw eigen NVM-aankoopmakelaar mee.\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/154/534/080_1440x960.jpg", "kind_of_house": "Eengezinswoning, vrijstaande woning", "construction_year": "N/A", "energy_label": "D ", "type_of_roof": "Mansarde dak bedekt met pannen", "heating": "Cv-ketel", "hot_water": "Cv-ketel", "boiler": "Atag (gas gestookt combiketel uit 2012, eigendom)", "location": "N/A", "garden": "Achtertuin, voortuin en zijtuin", "back_garden": 49, "garden_location": "Gelegen op het zuiden", "balcony": "N/A", "type_of_parking": "Openbaar parkeren", "garage": "N/A", "zipcode": "3262 SJ", "street": "Julianastraat 80", "house_number": "80", "city": "oudbeijerland", "province": "zuidholland", "lat": 51.82317, "lng": 4.416304, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "oudbeijerlandcentrum", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}