{"url": "https://www.funda.nl/koop/kwadendamme/huis-88025347-zwaaksedijk-2/", "offer_type": "koop", "number_of_rooms": 4, "number_of_bathrooms": 1, "number_of_bedrooms": 3, "bathroom_facilities": "Douche", "number_of_floors": 2, "outdoor_space": "N/A", "facilities": "Natuurlijke ventilatie en rookkanaal", "volume_in_cubic_meters": 824, "living_area": 187, "plot_size": 3170, "external_storage_space": 65, "asking_price": 950000, "asking_price_per_square_meter": 5080, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nGelegen op één  van  de mooiste  plekken van  Zeeland, in natuurgebied De  Zwaakse  Weel, bieden wij u de  geheel  gerestaureerde monumentale sfeervolle boerderij â\u0080\u009cDe Roode Hoeveâ\u0080\u009d aan. Bestaande uit  een woonboerderij, aangebouwde boerenschuur, zomer c.q. bakhuis, wagenschuur, tuin en moestuin. De woning is gelegen in een cultuurhistorisch en landschappelijk waardevolle omgeving. <br/> <br/>PERCEELGROOTTE: ca. 3170 M2 (ERFPACHT) <br/> <br/>DOWNLOAD DE BROCHURE VOOR DE MEEST UITGEBREIDDE INFORMATIE OVER DIT UNIEKE OBJECT OF NEEM CONTACT OP MET ONS KANTOOR. <br/> <br/>ALGEMEEN <br/>Natuurgebied de Zwaakse Weel dankt zijn naam aan de Zwake: het restant van een oude kreek in de polders van Kwadendamme. De Zwake was tot aan de 15e eeuw de verbinding tussen Middelburg en Antwerpen. Deze uitloper van de Schelde scheidde het eiland Zuid-Beveland van het eiland Borssele. <br/>Grote schepen voeren er naar Antwerpen en terug. Toen in de 15e eeuw het belang van de Honte (de tegenwoordige Westerschelde) toenam, is deze rivier afgedamd ter hoogte van 's-Gravenpolder. Daarna is het gebied geleidelijk ingepolderd, waarna er alleen een smalle kreek overbleef en de kreek zijn functie als vaarverbinding verloor.  <br/> <br/>De Zwaakse Weel verwijst naar de weel die ontstond nadat in de zestiende eeuw de dijken van de Zwake doorbraken tijdens hevige stormen. Bewijzen van deze geschiedenis zijn nog steeds terug te vinden in het natuurgebied. <br/> <br/>De Zwaakse Weel is een van de grootste natuurgebieden in de â\u0080\u0098Zak van Zuid-Bevelandâ\u0080\u0099. Het gebied, waarin ca. 100 ha in bezit is van Natuurmonumenten, heeft een rijke flora en het gebied is zeer belangrijk voor vele soorten watervogels. <br/>Een prachtig stuk Zeeuwse natuur met ouderwetse akkers die nog op ouderwetse manier worden bewerkt met Zeeuwse trekpaarden, boomgaarden waar je in het najaar fruit kunt plukken, de oude getijdenkreek â\u0080\u0098de Zwakeâ\u0080\u0099 en het vlinderbelevingspad voor vlinders en andere insecten.  <br/> <br/>De Zwaakse Weel is een paradijs voor vogels. Meerdere paren kiekendieven broeden hier elk jaar in de brede rietkragen langs het water. Niet alleen steenuilen, torenvalken, kerkuilen, spechten, vele soorten eenden en ganzen hebben hier hun leefgebied, maar ook de opvallend blauwe ijsvogel of de blauwborst kun je spotten tussen de rietstengels. De koekoek roept vanuit een hoge boomtop en putters doen zich te goed aan de zaden van uitgebloeide distels. In het najaar zie je vogels zoals de koperwiek en kramsvogel, die genieten van de vele bessen van de Zeeuwse heggen. Kortom, als vogelliefhebber kom je in de Zwaakse Weel uitstekend aan je trekken. <br/> <br/>In het hoogseizoen rijdt de stoomtrein Goes-Borsele meerdere keren per dag dwars door het gebied.  <br/> <br/>Indeling <br/>Woning: <br/>De indeling van de begane grond is als volgt: <br/>- kelder; <br/>- entree met hal en gang; <br/>- woonkamer; <br/>- keuken; <br/>- opkamer boven kelder; <br/>- wc; <br/>- badkamer met douche en wastafel; <br/>- trapopgang naar verdieping. <br/>De indeling van de verdieping is als volgt: <br/>- overloop met trapopgang naar zolder; <br/>- vrij in te delen verdieping met bergruimte achter knieschot; <br/>- vrij in te delen tweede verdieping/zolder. <br/>De wanden van de keuken en woonkamer zijn voorzien een grote hoeveelheid 19e eeuwse mangaan en blauw beschilderde tegels. Een gedeelte van deze tegels was oorspronkelijk â\u0080\u0093 dat wil zeggen ten tijde van de uitgifte in erfpacht - aanwezig en een gedeelte van deze tegels is door de erfpachter aangebracht.  <br/> <br/>Zomerhuisje <br/>De indeling is als volgt: <br/>- verblijfsruimte; <br/>- kippenhok/berging; <br/>- zolder. <br/> <br/>Wagenschuur <br/>De indeling van de schuur is als volgt: <br/>- berging; <br/>- zolder. <br/> <br/>Tuin <br/>Het perceel is grotendeels omgeven door een haag. Het terrein rond de woning en voor de schuur is voorzien van circa 700 m2 grindverharding met een strook gebakken klinkers en hardstenen opsluitbanden. Aan de zuidoostzijde van het perceel is een sier- en moestuin gesitueerd. Het terrein achter de schuur is in gebruik als uitloopruimte voor kippen.  <br/> <br/>Bijzonderheden <br/>De Roode Hoeve <br/>De Roode Hoeve is één van de mooiste en meest bijzondere boerderijen in Zeeland (en ver daarbuiten). Het is in zijn geheel gerestaureerd, nadat het als een ruïne was achtergelaten. Toen men begon om de gepotdekselde houten wanden van de schuur te vervangen, ontdekte men dat de oorspronkelijke kleur rood geweest was, Meekrap rood. Meekrap is een rode kleurstof, die gemaakt wordt van de wortels van de Meekrapplant en werd in de 19de eeuw overal in Zeeland verbouwd vanwege die kleurstof. De Roode Hoeve, zoals hij ook in oude stukken heette, heeft nu dus weer zijn oorspronkelijke kleur teruggekregen en is daardoor tot één van de meest opmerkelijke boerderijen van de regio geworden.  <br/> <br/>Algemene omschrijving boerderijcomplex: <br/>De boerderij â\u0080\u009cDe Roode Hoeveâ\u0080\u009d omvat een ensemble van woning met aangebouwde schuur, zomer c.q. bakhuis, wagenschuur en terreininrichting, staande en gelegen aan Zwaaksedijk 2 te Kwadendamme.  <br/> <br/>Bereikbaarheid <br/>Boerderijcomplex De Roode Hoeve ligt in het buitengebied. Op een van de mooiste plekken van Zeeland, op loopafstand van de Zwaakse Weel met wandel-, fiets- en ruiterpaden en op fietsafstand van Kwadendamme en â\u0080\u0099s-Gravenpolder met winkels, scholen, openbaar vervoer en voorzieningen. De boerderij ligt centraal ten opzichte van de gezellige winkelsteden als Goes en Middelburg. Via de Westerscheldetunnel is ook Zeeuws-Vlaanderen snel te bereiken. Het is ongeveer 10 min. naar de oprit van de snelweg A58, 25 minuten naar Middelburg en 45 minuten van Antwerpen. <br/> <br/>Woning <br/>De woning stamt vermoedelijk uit de tweede helft van de 18e eeuw en is daarna diverse malen verbouwd. De huidige verschijningsvorm stamt waarschijnlijk uit 1846. De woning is in 2008 geheel gerestaureerd. De woning heeft een rechthoekige plattegrond van circa 9,5 x 10,5 m.  <br/>De woonoppervlakte bedraagt circa 187 m2 en de bruto-inhoud bedraagt circa 824 m3. <br/>De woning is traditioneel gebouwd, uitgevoerd in metselbaksteen (ijsselsteentjes). Het dak is afgedekt met gebakken pannen op een geïsoleerd dakbeschot. De begane grondvloer betreft een geïsoleerde betonvloer met vloerverwarming, grotendeels voorzien van houten vloerdelen. De eerste en tweede verdiepingsvloer zijn van hout. De ramen en kozijnen zijn van hardhout en voorzien van enkele beglazing. De vloeren op de begane grond zijn afgewerkt met grenen- en eikenhouten delen, granito en plavuizen. Enkele ramen zijn voorzien van markiezen. <br/>De woning is opgetrokken uit baksteen, deels stenen en deels houten begane grondvloer, houten verdiepingsvloer, houten kozijnen met monumentenglas en een pannengedekt zadeldak. De afwerking van de woning is sober . De algehele onderhoudstoestand van de woning is goed. <br/> <br/>Schuur <br/>De schuur stamt vermoedelijk uit de eerste helft van de 19e eeuw. De schuur is in 2008 geheel gerestaureerd. De schuur heeft een rechthoekige plattegrond van circa 40,5 x 13 m. De bruto-oppervlakte van de schuur bedraagt circa 525 m2 en de bruto-inhoud circa 3.190 m3. <br/>De schuur betreft een nieuw gebouwde authentieke Zeeuwse boerenschuur. De schuur is opgetrokken uit een eiken en douglas spantconstructie. De vloer betreft een betonvloer en is afgewerkt met gebakken klinkers op gestabiliseerd zand. Ter plaatse van de drie dubbele inrijdeuren is de vloer voorzien van houten dorsvloeren. De voorgevel is afgewerkt met gepotdekselde houten delen en gedeeltelijk opgetrokken uit metselbaksteen. Het dak is afgedekt met een rieten kap met opgewipte gedeelten ter plaatse van de inrijdeuren. <br/>De algehele onderhoudstoestand van de schuur is goed. <br/> <br/>Zomerhuisje <br/>Het zomerhuisje stamt vermoedelijk uit de eerste helft van de 19e eeuw. Het zomerhuisje is in 2009 geheel gerestaureerd. Het zomerhuisje heeft een rechthoekige plattegrond van circa 9 x 4,5 m. De bruto-inhoud van het zomerhuisje bedraagt circa 220 m3 incl. aanbouw. <br/>Het zomerhuisje is uitgevoerd in metselbaksteen (ijsselsteentjes) en gepotdekselde delen. De begane grondvloer is gedeeltelijk verhard met plavuizen/gebakken steentjes in gestabiliseerd zand. Een gedeelte van de vloer is verhard met beton en is voorzien van vloerverwarming. De verdiepingsvloer is van hout. Het dak is afgedekt met gebakken pannen op een houten dakbeschot.  <br/>De ramen en kozijnen zijn van hardhout en voorzien van enkele beglazing en luiken. <br/>De algehele onderhoudstoestand van het casco van het zomerhuisje is goed. Het interieur dient nog ingedeeld en afgewerkt te worden. <br/> <br/>Wagenschuur <br/>De wagenschuur stamt vermoedelijk uit de tweede helft van de 19e eeuw. De wagenschuur is in 2011 geheel opnieuw opgebouwd. De wagenschuur heeft een rechthoekige plattegrond van circa 8,5 x 5 m. De bruto-oppervlak bedraagt circa 43 m2 en de bruto-inhoud circa 180 m3.  <br/>De wagenschuur is opgetrokken uit een houten spantconstructie. De gevels zijn afgewerkt met gepotdekselde houten delen. De vloer is verhard met klinkertjes. Het dak is afgedekt met gebakken pannen en met riet onderschoten. <br/>De algehele onderhoudstoestand van de wagenschuur is goed. <br/> <br/>Erfdienstbaarheden en kwalitatieve verplichtingen <br/>In de akte van vestiging recht van erfpacht en recht van opstal d.d. 27 augustus 2008 is voorzien in de <br/>vestiging van een erfdienstbaarheid van weg om te komen en te gaan van het object naar de <br/>openbare weg Zwaaksedijk. Deze erfdienstbaarheid mag te voet, met de auto, met een tweewieler of <br/>met een ander niet-motorisch vervoermiddel worden uitgeoefend. Voor de uitoefening van de <br/>erfdienstbaarheid is hiervoor geen vergoeding of bijdrage verschuldigd. <br/> <br/>Publiekrechtelijke beperkingen <br/>Volgens de gemeentelijke beperkingenregistratie en de kadastrale registratie is sprake van de <br/>volgende publiekrechtelijke beperkingen: <br/>- besluit van de Staat (Onderwijs, Cultuur en Wetenschappen) ingevolge de Monumentenwet <br/>1988, ingeschreven in het register hypotheken 4 deel 1578 nummer 93 reeks Middelburg. <br/> <br/>ENERGIEPRESTATIECERTIFICAAT <br/>Aan de woning is een voorlopig energielabel G gegeven. <br/>Deskundigen wijzen erop dat monumentale woonobjecten niet labelplichtig zijn. Dit betekent dat <br/>eigenaren van rijksmonumenten en gemeentelijke monumenten een als zodanig aangewezen object <br/>kunnen verkopen of verhuren zonder energielabel <br/> <br/>MONUMENTSTATUS <br/>Het ensemble van woning, schuur, bakhuis en wagenschuur is aangewezen als rijksmonument. Voor <br/>een nadere omschrijving van de monumentale waarden wordt verwezen naar het uittreksel uit het monumentenregister.  <br/> <br/>BESTEMMING <br/>Ter plaatse van het object geldt het bestemmingsplan â\u0080\u009cBuitengebied Borsele, 2018â\u0080\u009d met planidentificatienummer NL.IMRO.0654.OPBGB2017-0003. Dit bestemmingsplan betreft een bestemmingsplan met verbrede reikwijdte ex artikel 7c Besluit uitvoering Crisis- en Herstelwet. Het bestemmingsplan is op 1 maart 2018 vastgesteld door de raad van gemeente Borsele. De terinzagelegging van het bestemmingsplan is gepubliceerd in de Staatscourant van 11 april 2018 met <br/>nummer 19943. Het bestemmingsplan is na ommekomst van de beroepstermijn in werking getreden. <br/> <br/>Blijkens de verbeelding van voornoemd bestemmingsplan is aan het object de bestemming â\u0080\u009cKleinschalige poldersâ\u0080\u009d met de functieaanduiding â\u0080\u009cwonenâ\u0080\u009d en de specifieke bouwaanduiding â\u0080\u009crijksmonumentâ\u0080\u009d gegeven. Aan het object is tevens de dubbelbestemming â\u0080\u009cWaarde â\u0080\u0093 Archeologie 2â\u0080\u009d met de specifieke vorm van waarde â\u0080\u009crijksmonumentâ\u0080\u009d gegeven.  <br/> <br/>Het gebruik als woning is in overeenstemming met de vigerende bestemming. <br/> <br/>Verwachtingen ten aanzien van het ruimtelijke beleid <br/>Gelet op de monumentale status van het object en de ligging in een cultuurhistorisch en <br/>landschappelijk waardevol gebied ligt het niet voor de hand dat de bestemming van het object en/of de objecten in de directe omgeving zal wijzigen. <br/> <br/>VERKOOP OP BASIS VAN ERFPACHT <br/>De grond, die in eigendom is van Natuurmonumenten, wordt in erfpacht uitgegeven voor een periode van 30 jaar, conform een overeenkomst van een recht van erfpacht en de vestiging van een afhankelijk recht van opstal. De overeenkomst, het uitgiftekader, de algemene voorwaarden met betrekking tot het recht van erfpacht en het afhankelijk recht van opstal zijn van toepassing.  <br/>De erfpachtcanon bedraagt â\u0082¬ 7.875,00 per jaar. <br/> <br/>BRONVERMELDING:  <br/>Voor de informatie in deze aanbieding is gebruik gemaakt van diverse bronnen: <br/>-\tTaxatierapport uitgevoerd door deskundigen de heer ing. A.D. Rijk RT (Rijk taxateurs | adviseurs | rentmeesters B.V.) en de heer ing. A. van Gellicum MRE  <br/>        MRICS RT (Steenhuijs Grondzaken B.V.) . <br/>-\tVereniging Natuurmonumenten  <br/>-\tWikipedia <br/>-\tSLIKOPDEWEG- BlOGSPOT\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/153/350/677_1440x960.jpg", "kind_of_house": "Woonboerderij, vrijstaande woning", "construction_year": "N/A", "energy_label": "N/A", "type_of_roof": "Zadeldak bedekt met pannen en riet", "heating": "Cv-ketel, open haard en gedeeltelijke vloerverwarming", "hot_water": "Cv-ketel", "boiler": "Gas gestookt uit 2008, eigendom", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Inpandig", "zipcode": "4434 RD", "street": "Zwaaksedijk 2", "house_number": "2", "city": "kwadendamme", "province": "zeeland", "lat": 51.44135, "lng": 3.882767, "offered_since": "N/A", "status": "beschikbaar", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "buitengebiedkwadendamme", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}