{"url": "https://www.funda.nl/koop/goedereede/huis-88983556-beresteyn-21/", "offer_type": "koop", "number_of_rooms": 5, "number_of_bathrooms": "N/A", "number_of_bedrooms": 4, "bathroom_facilities": "N/A", "number_of_floors": 2, "outdoor_space": 24, "facilities": "Zonnepanelen", "volume_in_cubic_meters": 703, "living_area": 166, "plot_size": 507, "external_storage_space": 15, "asking_price": 650000, "asking_price_per_square_meter": 3916, "rental_price": "N/A", "deposit": "N/A", "rental_agreement": "N/A", "language": "nl", "description": "<div class=\"object-description-body\" data-object-description-body=\"\" data-object-description-strip-markup=\"\">\r\nDegelijk gebouwde en  zeer  goed onderhouden  royale vrijstaande  woning op een gunstige  locatie  in de woonwijk. <br/> <br/>De  woning  aan de Beresteyn 21 is in  het jaar 2000 traditioneel gebouwd  en op een hoog niveau geïsoleerd, daarnaast is de woning vorig jaar voorzien van 18 zonnepanelen waarmee de energielasten tot een laag niveau gedaald zijn. De woning heeft een ideale indeling waarmee er naast een plezierige leefruimte onder andere ook een ruime slaapkamer met badkamer op de begane grond gesitueerd zijn. De tuin rondom de woning is verzorgd en op de diverse terrassen is al snel een beschutte en zonnige plek te vinden, daarnaast is er voldoende parkeergelegenheid op eigen terrein.  <br/> <br/>Indeling <br/>Entree, ruime hal met garderobe, het toilet, trapopgang, de inpandige toegang tot de garage en vervolgens de entree naar de woonkamer.  <br/> <br/>De woonkamer is door de grote raampartijen zeer licht, middels de dubbele tuindeuren is er direct toegang tot de achtertuin, in de hoek van de woonkamer is een werk/hobbykamer met eigen toegangsdeur gesitueerd, aan de andere zijde van de woonkamer komt u via de taatsdeuren in de ruime leefkeuken.  <br/> <br/>De keuken is in een hoekopstelling geplaatst en voorzien van diverse luxe apparatuur, de leefkeuken vormt het middelpunt van de woning met de toegang tot de bijkeuken en de doorgang richting de ruime op de begane grond gesitueerde hoofdslaapkamer. De aangrenzende badkamer is voorzien van een ligbad, toilet, ruime douchehoek en een wastafelmeubel. In de eerdergenoemde bijkeuken zijn de witgoedaansluitingen aanwezig, via de bijkeuken komt u direct in de garage en er is een achterdeur aanwezig.  <br/> <br/>In de bouw zijn rookgaskanalen voorbereid, u heeft daarmee de gelegenheid tot het plaatsen van een (gas)haard. <br/> <br/>Eerste verdieping <br/>De verdieping biedt ruimte aan drie ruime volwaardige slaapkamers, er is een tweede badkamer welke is voorzien van een douche, wastafel en toilet. Op de verdieping zijn diverse vaste kasten aanwezig. In de technische ruimte bevindt zich de cv-ketel en de ventilatie unit. De grootste slaapkamer op de verdieping is voorzien van een airco unit.  <br/> <br/>Tuin <br/>De woning staat op een perceel van 507 vierkante meter, bij de inrichting van de tuin is rekening gehouden met voldoende parkeergelegenheid op eigen terrein, daarnaast is er rondom bestrating uitgevoerd. Achter de woning is in een later stadium een stenen schuur/bergruimte geplaatst, deze schuur is geïsoleerd en biedt u veel extra ruimte.  <br/> <br/>Bijzonderheden <br/>- Recent gebouwde woning <br/>- Vooral houten kozijnen met dubbele beglazing (recent geschilderd) <br/>- Overstekken en goten uitgevoerd in onderhoudsarm Trespa <br/>- Oplevering in overleg\r\n    </div>", "image": "https://cloud.funda.nl/valentina_media/152/541/390_1440x960.jpg", "kind_of_house": "Villa, vrijstaande woning", "construction_year": "N/A", "energy_label": "A ", "type_of_roof": "Schilddak", "heating": "Cv-ketel en gedeeltelijke vloerverwarming", "hot_water": "Cv-ketel", "boiler": "Gas gestookt uit 2000, eigendom", "location": "N/A", "garden": "Tuin rondom", "back_garden": "N/A", "garden_location": "N/A", "balcony": "N/A", "type_of_parking": "Op eigen terrein", "garage": "Inpandig", "zipcode": "3252 CL", "street": "Beresteyn 21", "house_number": "21", "city": "goedereede", "province": "zuidholland", "lat": 51.82011, "lng": 3.987104, "offered_since": "N/A", "status": "inonderhandeling", "object_type": "N/A", "type_of_apartment": "N/A", "type_of_construction": "Bestaande bouw", "business_space": "false", "neighborhood": "goedereedewoonkern", "in_the_neighborhood": "Basisschool Supermarkt Bushalte"}